{
  "id": "tanstack-table__table_latest_docs_guide_columns",
  "source_id": "tanstack-table",
  "source_name": "TanStack Table",
  "category": "tables_datagrids",
  "url": "https://tanstack.com/table/latest/docs/guide/columns",
  "title": "Columns Guide",
  "content": "API\nColumn API\nColumns Guide\nNote: This guide is about the actual\ncolumn\nobjects that are generated within the table instance and NOT about setting up the\ncolumn definitions\nfor your table.\nThis quick guide will discuss the different ways you can retrieve and interact with\ncolumn\nobjects in TanStack Table.\nWhere to Get Columns From\nYou can find the\ncolumn\nobjects in many places. They are often attached\nHeader and Cell Objects\nBefore you reach for one of the\ntable\ninstance APIs, consider if you actually need to retrieve either\nheaders\nor\ncells\ninstead of\ncolumns\n. If you are rending out the markup for your table, you will most likely want to reach for the APIs that return headers or cells instead of columns. The column objects themselves are not really meant to render out the headers or cells, but the\nheader\nand\ncell\nobjects will contain references to these\ncolumn\nobjects from which they can derive the necessary information to render their UI.\njs\nconst column = cell.column; // get column from cell\nconst column = header.column; // get column from header\nColumn Table Instance APIs\nThere are dozens of\ntable\ninstance APIs you can use to retrieve columns from the table instance. Which APIs you will use will depend entirely on which features you are using in your table and your use-case.\nGet Column\nIf you need to just get a single column by its ID, you can use the\ntable.getColumn\nAPI.\njs\nconst column = table.getColumn('firstName');\nGet Columns\nThe simplest column API is\ntable.getAllColumns\n, which will return a list of all columns in the table. There are dozens of other column APIs that are affected by other features and the state of the table that come alongside this API though.\ntable.getAllFlatColumns\n,\ntable.getAllLeafColumns\n,\ngetCenterLeafColumns\n,\ntable.getLeftVisibleLeafColumns\nare just some examples of other column APIs that you might use in tandem with the column visibility or column pinning features.\nColumn Objects\nColumn objects are not actually meant to be used to render out the table UI directly, so they are not associated 1-to-1 with any\n<th>\nor\n<td>\nelements in your table, but they contain a lot of useful properties and methods that you can use to interact with the table state.\nColumn IDs\nEvery column must have a unique\nid\ndefined in their associated\nColumn Definition\n. Usually, you define this\nid\nyourself, or it is derived from the\naccessorKey\nor\nheader\nproperties in the column definition.\nColumnDef\nA reference to the original\ncolumnDef\nobject that was used to created the column is always available on the column object.\nNested Grouped Columns Properties\nThere are a few properties on\ncolumn\nobjects that are only useful if the column is part of a nested or grouped column structure. These properties include:\ncolumns\n: An array of child columns that belong to a group column.\ndepth\n: The header group \"row index\" that the column group belongs to.\nparent\n: The parent column of the column. If the column is a top-level column, this will be\nundefined\n.\nMore Column APIs\nThere are dozens of Column APIs that you can use to interact with the table state and extract cell values from the table based on the state of the table. See each features column API documentation for more information.\nColumn Rendering\nDon't necessarily use\ncolumn\nobjects to render\nheaders\nor\ncells\ndirectly. Instead, use the\nheader\nand\ncell\nobjects, as discussed above.\nBut if you are just rendering a list of columns somewhere else in your UI for something like a column visibility menu or something similar, you can just map over a columns array and render out the UI as you normally would.",
  "content_markdown": "[## API](#api)\n\n[Column API](/table/latest/docs/api/core/column)\n\n[## Columns Guide](#columns-guide)\n> Note: This guide is about the actual column objects that are generated within the table instance and NOT about setting up the [column definitions](/table/latest/docs/guide/column-defs) for your table.\n\nThis quick guide will discuss the different ways you can retrieve and interact with column objects in TanStack Table.\n\n[### Where to Get Columns From](#where-to-get-columns-from)\n\nYou can find the column objects in many places. They are often attached\n\n[#### Header and Cell Objects](#header-and-cell-objects)\n\nBefore you reach for one of the table instance APIs, consider if you actually need to retrieve either [headers](/table/latest/docs/guide/headers) or [cells](/table/latest/docs/guide/cells) instead of columns. If you are rending out the markup for your table, you will most likely want to reach for the APIs that return headers or cells instead of columns. The column objects themselves are not really meant to render out the headers or cells, but the header and cell objects will contain references to these column objects from which they can derive the necessary information to render their UI.\n\njs\n\n```\nconst column = cell.column; // get column from cell\nconst column = header.column; // get column from header\n```\n\n[#### Column Table Instance APIs](#column-table-instance-apis)\n\nThere are dozens of table instance APIs you can use to retrieve columns from the table instance. Which APIs you will use will depend entirely on which features you are using in your table and your use-case.\n\n[##### Get Column](#get-column)\n\nIf you need to just get a single column by its ID, you can use the table.getColumn API.\n\njs\n\n```\nconst column = table.getColumn('firstName');\n```\n\n[##### Get Columns](#get-columns)\n\nThe simplest column API is table.getAllColumns, which will return a list of all columns in the table. There are dozens of other column APIs that are affected by other features and the state of the table that come alongside this API though. table.getAllFlatColumns, table.getAllLeafColumns, getCenterLeafColumns, table.getLeftVisibleLeafColumns are just some examples of other column APIs that you might use in tandem with the column visibility or column pinning features.\n\n[### Column Objects](#column-objects)\n\nColumn objects are not actually meant to be used to render out the table UI directly, so they are not associated 1-to-1 with any <th> or <td> elements in your table, but they contain a lot of useful properties and methods that you can use to interact with the table state.\n\n[#### Column IDs](#column-ids)\n\nEvery column must have a unique id defined in their associated [Column Definition](/table/latest/docs/guide/column-defs). Usually, you define this id yourself, or it is derived from the accessorKey or header properties in the column definition.\n\n[#### ColumnDef](#columndef)\n\nA reference to the original columnDef object that was used to created the column is always available on the column object.\n\n[#### Nested Grouped Columns Properties](#nested-grouped-columns-properties)\n\nThere are a few properties on column objects that are only useful if the column is part of a nested or grouped column structure. These properties include:\n\n- columns: An array of child columns that belong to a group column.\n- depth: The header group \"row index\" that the column group belongs to.\n- parent: The parent column of the column. If the column is a top-level column, this will be undefined.\n\n[### More Column APIs](#more-column-apis)\n\nThere are dozens of Column APIs that you can use to interact with the table state and extract cell values from the table based on the state of the table. See each features column API documentation for more information.\n\n[### Column Rendering](#column-rendering)\n\nDon't necessarily use column objects to render headers or cells directly. Instead, use the [header](/table/latest/docs/guide/headers) and [cell](/table/latest/docs/guide/cells) objects, as discussed above.\n\nBut if you are just rendering a list of columns somewhere else in your UI for something like a column visibility menu or something similar, you can just map over a columns array and render out the UI as you normally would.",
  "tags": [
    "tanstack",
    "table",
    "headless",
    "react"
  ],
  "extracted_at": "2026-02-03T12:51:07.641709+00:00",
  "content_length": 3617,
  "content_hash": "bf087c53ec8c3cf3"
}