{
  "id": "tanstack-table__table_latest_docs_guide_headers",
  "source_id": "tanstack-table",
  "source_name": "TanStack Table",
  "category": "tables_datagrids",
  "url": "https://tanstack.com/table/latest/docs/guide/headers",
  "title": "Headers Guide",
  "content": "API\nHeader API\nHeaders Guide\nThis quick guide will discuss the different ways you can retrieve and interact with\nheader\nobjects in TanStack Table.\nHeaders are the equivalent of cells, but meant for the\n<thead>\nsection of the table instead of the\n<tbody>\nsection.\nWhere to Get Headers From\nHeaders come from\nHeader Groups\n, which are the equivalent of rows, but meant for the\n<thead>\nsection of the table instead of the\n<tbody>\nsection.\nHeaderGroup Headers\nIf you are in a header group, the headers are stored as an array in the\nheaderGroup.headers\nproperty. Usually you will just map over this array to render your headers.\njsx\n<thead>\n  {table.getHeaderGroups().map(headerGroup => {\n    return (\n      <tr key={headerGroup.id}>\n        {headerGroup.headers.map(header => ( // map over the headerGroup headers array\n          <th key={header.id} colSpan={header.colSpan}>\n            {/* */}\n          </th>\n        ))}\n      </tr>\n    )\n  })}\n</thead>\nHeader Table Instance APIs\nThere are multiple\ntable\ninstance APIs that you can use to retrieve a list of headers depending on the features that you are using. The most common API you might use is\ntable.getFlatHeaders\n, which will return a flat list of all headers in the table, but there are at least a dozen other headers that are useful in tandem with the column visibility and column pinning features. APIs like\ntable.getLeftLeafHeaders\nor\ntable.getRightFlatHeaders\ncould be useful depending on your use case.\nHeader Objects\nHeader objects are similar to\nCell\nobjects, but meant for the\n<thead>\nsection of the table instead of the\n<tbody>\nsection. Every header object can be associated with a\n<th>\nor similar cell element in your UI. There are a few properties and methods on\nheader\nobjects that you can use to interact with the table state and extract cell values from the table based on the state of the table.\nHeader IDs\nEvery header object has an\nid\nproperty that makes it unique within the table instance. Usually you only need this\nid\nas a unique identifier for React keys or if you are following the\nperformant column resizing example\n.\nFor simple headers with no advanced nested or grouped headers logic, the\nheader.id\nwill be the same as it's parent\ncolumn.id\n. However, if the header is part group column or a placeholder cell, it will have a more complicated id that is constructed from the header family, depth/header row index, column id, and header group id.\nNested Grouped Headers Properties\nThere are a few properties on\nheader\nobjects that are only useful if the header is part of a nested or grouped header structure. These properties include:\ncolspan\n: The number of columns that the header should span. This is useful for rendering the\ncolSpan\nattribute on the\n<th>\nelement.\nrowSpan\n: The number of rows that the header should span. This is useful for rendering the\nrowSpan\nattribute on the\n<th>\nelement. (Currently not implemented in default TanStack Table)\ndepth\n: The header group \"row index\" that the header group belongs to.\nisPlaceholder\n: A boolean flag that is true if the header is a placeholder header. Placeholder headers are used to fill in the gaps when a column is hidden or when a column is part of a group column.\nplaceholderId\n: The unique identifier for the placeholder header.\nsubHeaders\n: The array of sub/child headers that belong to this header. Will be empty if the header is a leaf header.\nNote:\nheader.index\nrefers to its index within the header group (row of headers), i.e. its position from left to right. It is not the same as\nheader.depth\n, which refers to the header group \"row index\".\nHeader Parent Objects\nEvery header stores a reference to its parent\ncolumn\nobject and its parent\nheader group\nobject.\nMore Header APIs\nHeaders have a few more useful APIs attached to them that are useful for interacting with the table state. Most of them relate to the Column sizing and resizing features. See the\nColumn Sizing Guide\nfor more information.\nHeader Rendering\nSince the\nheader\ncolumn option you defined can be either a string, jsx, or a function returning either of those, the best way to render the headers is to use the\nflexRender\nutility from your adapter, which will handle all of those cases for you.\njsx\n{headerGroup.headers.map(header => (\n  <th key={header.id} colSpan={header.colSpan}>\n    {/* Handles all possible header column def scenarios for `header` */}\n    {flexRender(header.column.columnDef.header, header.getContext())}\n  </th>\n))}",
  "content_markdown": "[## API](#api)\n\n[Header API](/table/latest/docs/api/core/header)\n\n[## Headers Guide](#headers-guide)\n\nThis quick guide will discuss the different ways you can retrieve and interact with header objects in TanStack Table.\n\nHeaders are the equivalent of cells, but meant for the <thead> section of the table instead of the <tbody> section.\n\n[### Where to Get Headers From](#where-to-get-headers-from)\n\nHeaders come from [Header Groups](/table/latest/docs/guide/header-groups), which are the equivalent of rows, but meant for the <thead> section of the table instead of the <tbody> section.\n\n[#### HeaderGroup Headers](#headergroup-headers)\n\nIf you are in a header group, the headers are stored as an array in the headerGroup.headers property. Usually you will just map over this array to render your headers.\n\njsx\n\n```\n<thead>\n  {table.getHeaderGroups().map(headerGroup => {\n    return (\n      <tr key={headerGroup.id}>\n        {headerGroup.headers.map(header => ( // map over the headerGroup headers array\n          <th key={header.id} colSpan={header.colSpan}>\n            {/* */}\n          </th>\n        ))}\n      </tr>\n    )\n  })}\n</thead>\n```\n\n[#### Header Table Instance APIs](#header-table-instance-apis)\n\nThere are multiple table instance APIs that you can use to retrieve a list of headers depending on the features that you are using. The most common API you might use is table.getFlatHeaders, which will return a flat list of all headers in the table, but there are at least a dozen other headers that are useful in tandem with the column visibility and column pinning features. APIs like table.getLeftLeafHeaders or table.getRightFlatHeaders could be useful depending on your use case.\n\n[### Header Objects](#header-objects)\n\nHeader objects are similar to [Cell](/table/latest/docs/guide/cells) objects, but meant for the <thead> section of the table instead of the <tbody> section. Every header object can be associated with a <th> or similar cell element in your UI. There are a few properties and methods on header objects that you can use to interact with the table state and extract cell values from the table based on the state of the table.\n\n[#### Header IDs](#header-ids)\n\nEvery header object has an id property that makes it unique within the table instance. Usually you only need this id as a unique identifier for React keys or if you are following the [performant column resizing example](/table/latest/docs/framework/react/examples/column-resizing-performant).\n\nFor simple headers with no advanced nested or grouped headers logic, the header.id will be the same as it's parent column.id. However, if the header is part group column or a placeholder cell, it will have a more complicated id that is constructed from the header family, depth/header row index, column id, and header group id.\n\n[#### Nested Grouped Headers Properties](#nested-grouped-headers-properties)\n\nThere are a few properties on header objects that are only useful if the header is part of a nested or grouped header structure. These properties include:\n\n- colspan: The number of columns that the header should span. This is useful for rendering the colSpan attribute on the <th> element.\n- rowSpan: The number of rows that the header should span. This is useful for rendering the rowSpan attribute on the <th> element. (Currently not implemented in default TanStack Table)\n- depth: The header group \"row index\" that the header group belongs to.\n- isPlaceholder: A boolean flag that is true if the header is a placeholder header. Placeholder headers are used to fill in the gaps when a column is hidden or when a column is part of a group column.\n- placeholderId: The unique identifier for the placeholder header.\n- subHeaders: The array of sub/child headers that belong to this header. Will be empty if the header is a leaf header.\n\n> Note: header.index refers to its index within the header group (row of headers), i.e. its position from left to right. It is not the same as header.depth, which refers to the header group \"row index\".\n\n[#### Header Parent Objects](#header-parent-objects)\n\nEvery header stores a reference to its parent [column](/table/latest/docs/guide/columns) object and its parent [header group](/table/latest/docs/guide/header-groups) object.\n\n[### More Header APIs](#more-header-apis)\n\nHeaders have a few more useful APIs attached to them that are useful for interacting with the table state. Most of them relate to the Column sizing and resizing features. See the [Column Sizing Guide](/table/latest/docs/guide/column-sizing) for more information.\n\n[### Header Rendering](#header-rendering)\n\nSince the header column option you defined can be either a string, jsx, or a function returning either of those, the best way to render the headers is to use the flexRender utility from your adapter, which will handle all of those cases for you.\n\njsx\n\n```\n{headerGroup.headers.map(header => (\n  <th key={header.id} colSpan={header.colSpan}>\n    {/* Handles all possible header column def scenarios for `header` */}\n    {flexRender(header.column.columnDef.header, header.getContext())}\n  </th>\n))}\n```",
  "tags": [
    "tanstack",
    "table",
    "headless",
    "react"
  ],
  "extracted_at": "2026-02-03T12:51:16.103318+00:00",
  "content_length": 4455,
  "content_hash": "e404f91aa3bdeb28"
}