{
  "id": "gh-dnd-kit_readme",
  "source_id": "gh-dnd-kit",
  "source_name": "dnd-kit",
  "category": "github_repos",
  "url": "https://github.com/clauderic/dnd-kit",
  "title": "dnd-kit",
  "content": "<p align=\"center\">\n  <a href=\"https://dndkit.com\">\n    <img alt=\"@dnd-kit – the modern drag & drop toolkit for React\" src=\".github/assets/dnd-kit-hero-banner.svg\">\n  </a>\n</p>\n\n<p align=\"left\">\n  <a href=\"https://www.npmjs.com/package/@dnd-kit/core\"><img src=\"https://img.shields.io/npm/v/@dnd-kit/core.svg\" alt=\"Stable Release\" /></a>\n  <a href=\"https://github.com/clauderic/dnd-kit/actions\"><img src=\"https://badgen.net/github/checks/clauderic/dnd-kit\" alt=\"Build status\" /></a>\n  <a href=\"https://bundlephobia.com/result?p=@dnd-kit/core\"><img alt=\"gzip size\" src=\"https://badgen.net/bundlephobia/minzip/@dnd-kit/core?label=gzip%20size&color=green\"/></a>\n  <a href=\"./LICENSE\"><img allt=\"MIT License\" src=\"https://badgen.now.sh/badge/license/MIT\"/></a>\n  <a href=\"https://join.slack.com/t/dnd-kit/shared_invite/zt-25zm6qn4k-Sx_NNVb3JQaPz9HnsWfjEQ\"><img src=\"https://img.shields.io/badge/slack-%40dnd--kit-brightgreen.svg?logo=slack\"></a>\n  <a href=\"https://twitter.com/intent/follow?screen_name=dndkit\"><img alt=\"Follow us on Twitter\" src=\"https://img.shields.io/twitter/follow/dndkit?style=social\"></a>\n</p>\n\n- Feature packed: customizable collision detection algorithms, multiple activators, draggable overlay, drag handles, auto-scrolling, constraints, and so much more.\n- Built for React: exposes hooks such as useDraggablehttps://docs.dndkit.com/api-documentation/draggable and useDroppablehttps://docs.dndkit.com/api-documentation/droppable. and won't force you to re-architect your app or create additional wrapper DOM nodes.\n- Supports a wide range of use cases: lists, grids, multiple containers, nested contexts, variable sized items, virtualized lists, 2D Games, and more.\n- Zero dependencies and modular: the core of the library weighs around 10kb minified and has no external dependencies. It's built around built-in React state management and context, which keeps the library lean.\n- Built-in support for multiple input methods: Pointer, mouse, touch and keyboard sensors.\n- Fully customizable & extensible: Customize every detail: animations, transitions, behaviours, styles. Build your own sensors, collision detection algorithms, customize key bindings and so much more.\n- Accessibility: Keyboard support, sensible default aria attributes, customizable screen reader instructions and live regions built-in.\n- Performance: It was built with performance in mind in order to support silky smooth animations.\n- Presets: Need to build a sortable interface? Check out @dnd-kit/sortable, which is a thin layer built on top of @dnd-kit/core. More presets coming in the future.\n\n Documentation\n\nTo learn how to get started with dnd kit, visit the official documentation website. You'll find in-depth API documentation, tips and guides to help you build drag and drop interfaces.\n\n<p>\n<a href=\"https://docs.dndkit.com\">\n<img alt=\"Visit @dnd-kit documentation\" src=\".github/assets/documentation.svg\" width=\"200\" />\n</a>\n</p>\n\n Key concepts\n\nThe core library of dnd kit exposes two main concepts:\n\n- Draggable elementshttps://docs.dndkit.com/api-documentation/draggable\n- Droppable areashttps://docs.dndkit.com/api-documentation/droppable\n\nAugment your existing components using the useDraggable and useDroppable hooks, or combine both to create components that can both be dragged and dropped over.\n\nHandle events and customize the behaviour of your draggable elements and droppable areas using the <DndContext> provider. Configure sensors to handle different input methods.\n\nUse the <DragOverlay> component to render a draggable overlay that is removed from the normal document flow and is positioned relative to the viewport.\n\nCheck out our quick start guidehttps://docs.dndkit.com/introduction/getting-started to learn how get started.\n\n Extensibility\n\nExtensibility is at the core of dnd kit. It is built to be lean and extensible. It ships with the features we believe most people will want most of the time, and provides extension points to build the rest on top of @dnd-kit/core.\n\nA prime example of the level of extensibility of dnd kit is the Sortable presethttps://docs.dndkit.com/presets/sortable, which is built using the extension points that are exposed by @dnd-kit/core.\n\nThe primary extension points of dnd kit are:\n\n- Sensors\n- Modifiers\n- Constraints\n- Custom collision detection algorithms\n\n Accessibility\n\nBuilding accessible drag and drop interfaces is hard; dnd kit has a number of sensible defaults and starting points to help you make your drag and drop interface accessible:\n\n- Customizable screen reader instructions for how to interact with draggable items\n- Customizable live region updates to provide screen reader announcements in real-time of what is currently happening with draggable and droppable elements.\n- Sensible defaults for aria attributes that should be passed to draggable items\n\nCheck out our Accessibility guidehttps://docs.dndkit.com/guides/accessibility to learn more about how you can help provide a better experience for screen readers.\n\n Architecture\n\nUnlike most drag and drop libraries, dnd kit intentionally is not built on top of the HTML5 Drag and drop APIhttps://developer.mozilla.org/en-US/docs/Web/API/HTML_Drag_and_Drop_API. This was a deliberate architectural decision, that does come with tradeoffs that you should be aware of before deciding to use it, but for most applications, we believe the benefits outweigh the tradeoffs.\n\nThe HTML5 Drag and drop API has some severe limitations. It does not support touch devices or using the keyboard to drag items, which means that the libraries that are built on top of it need to expose an entirely different implementation to support those input methods. It also doesn't support common use-cases such as locking dragging to a specific axis or to the bounds of a container, custom collision detection strategies, or even customizing the preview of the dragged item.\n\nWhile there are workarounds to some of these issues, those workarounds typically increase the complexity of the codebase and the overall bundle size of the library, and lead to inconsistencies between the mouse, touch and keyboard layers because they're powered by entirely different implementations.\n\nThe main tradeoff with not using the HTML5 Drag and drop API is that you won't be able to drag from the desktop or between windows. If the drag and drop use-case you have in mind involves this kind of functionality, you'll definitely want to use a library that's built on top of the HTML 5 Drag and drop API. We highly recommend you check out react-dndhttps://github.com/react-dnd/react-dnd/ for a React library that's has a native HTML 5 Drag and drop backend.\n\n Performance\n\n Minimizing DOM mutations\n\ndnd kit lets you build drag and drop interfaces without having to mutate the DOM every time an item needs to shift position.\n\nThis is possible because dnd kit lazily calculates and stores the initial positions and layout of your droppable containers when a drag operation is initiated. These positions are passed down to your components that use useDraggable and useDroppable so that you can compute the new positions of your items while a drag operation is underway, and move them to their new positions using performant CSS properties that do not trigger a repaint such as translate3d and scale. For an example of how this can be achieved, check out the implementation of the sorting strategies that are exposed by the @dnd-kit/sortablepackages/sortable/README.md library.\n\nThis isn't to say that you can't shift the position of the items in the DOM while dragging, this is something that is supported and sometimes inevitable. In some cases, it won't be possible to know in advance what the new position and layout of the item until you move it in the DOM. Just know that these kind of mutations to the DOM while dragging are much more expensive and will cause a repaint, so if possible, prefer computing the new positions using translate3d and scale.\n\n Synthetic events\n\ndnd kit also uses SyntheticEvent listenershttps://reactjs.org/docs/events.html for the activator events of all sensors, which leads to improved performance over manually adding event listeners to each individual draggable node.\n\n<p align=\"center\">\n<img alt=\"Playful illustration of draggable and droppable concepts. A robot picks up a draggable card and moves it over a droppable container.\" src=\".github/assets/concepts-illustration.svg\" width=\"75%\" />\n</p>\n\n Working in the @dnd-kit repository\n\n Packages contained within this repository\n\n- @dnd-kit/core\n- @dnd-kit/accessibility\n- @dnd-kit/sortable\n- @dnd-kit/modifiers\n- @dnd-kit/utilities\n\n Installing dependencies\n\nYou'll need to install all the dependencies in the root directory. Since the @dnd-kit is a monorepo that uses Lerna and Yarn Workspaces, npm CLI is not supported only yarn.\n\nsh\nyarn install\n\nThis will install all dependencies in each project, build them, and symlink them via Lerna\n\n Development workflow\n\nIn one terminal, run yarn start in parallel:\n\nsh\nyarn start\n\nThis builds each package to <packages>/<package>/dist and runs the project in watch mode so any edits you save inside <packages>/<package>/src cause a rebuild to <packages>/<package>/dist. The results will stream to to the terminal.\n\n Running storybook\n\nsh\nyarn start:storybook\n\nRuns the storybook\nOpen http://localhost:6006http://localhost:6006 to view it in the browser.\n\n!Screenshot of Storybook running locally.github/assets/storybook-screenshot.png\n\n Working with the playground\n\nYou can play with local packages in the Parcel-powered playground.\n\nsh\nyarn start:playground\n\nThis will start the playground on localhost:1234. If you have lerna running watch in parallel mode in one terminal, and then you run parcel, your playground will hot reload when you make changes to any imported module whose source is inside of packages//src/. Note that to accomplish this, each package's start command passes TDSX the --noClean flag. This prevents Parcel from exploding between rebuilds because of File Not Found errors.\n\nImportant Safety Tip: When adding/altering packages in the playground, use alias object in package.json. This will tell Parcel to resolve them to the filesystem instead of trying to install the package from NPM. It also fixes duplicate React errors you may run into.\n\n Running Cypress\n\nIn a third terminal you can run Cypress and it will run the integration tests against storybook.\n",
  "content_markdown": "<p align=\"center\">\n  <a href=\"https://dndkit.com\">\n    <img alt=\"@dnd-kit – the modern drag & drop toolkit for React\" src=\".github/assets/dnd-kit-hero-banner.svg\">\n  </a>\n</p>\n\n<p align=\"left\">\n  <a href=\"https://www.npmjs.com/package/@dnd-kit/core\"><img src=\"https://img.shields.io/npm/v/@dnd-kit/core.svg\" alt=\"Stable Release\" /></a>\n  <a href=\"https://github.com/clauderic/dnd-kit/actions\"><img src=\"https://badgen.net/github/checks/clauderic/dnd-kit\" alt=\"Build status\" /></a>\n  <a href=\"https://bundlephobia.com/result?p=@dnd-kit/core\"><img alt=\"gzip size\" src=\"https://badgen.net/bundlephobia/minzip/@dnd-kit/core?label=gzip%20size&color=green\"/></a>\n  <a href=\"./LICENSE\"><img allt=\"MIT License\" src=\"https://badgen.now.sh/badge/license/MIT\"/></a>\n  <a href=\"https://join.slack.com/t/dnd-kit/shared_invite/zt-25zm6qn4k-Sx_NNVb3JQaPz9HnsWfjEQ\"><img src=\"https://img.shields.io/badge/slack-%40dnd--kit-brightgreen.svg?logo=slack\"></a>\n  <a href=\"https://twitter.com/intent/follow?screen_name=dndkit\"><img alt=\"Follow us on Twitter\" src=\"https://img.shields.io/twitter/follow/dndkit?style=social\"></a>\n</p>\n\n- **Feature packed:** customizable collision detection algorithms, multiple activators, draggable overlay, drag handles, auto-scrolling, constraints, and so much more.\n- **Built for React:** exposes hooks such as [`useDraggable`](https://docs.dndkit.com/api-documentation/draggable) and [`useDroppable`](https://docs.dndkit.com/api-documentation/droppable). and won't force you to re-architect your app or create additional wrapper DOM nodes.\n- **Supports a wide range of use cases:** lists, grids, multiple containers, nested contexts, variable sized items, virtualized lists, 2D Games, and more.\n- **Zero dependencies and modular:** the core of the library weighs around 10kb minified and has no external dependencies. It's built around built-in React state management and context, which keeps the library lean.\n- **Built-in support for multiple input methods:** Pointer, mouse, touch and keyboard sensors.\n- **Fully customizable & extensible:** Customize every detail: animations, transitions, behaviours, styles. Build your own sensors, collision detection algorithms, customize key bindings and so much more.\n- **Accessibility:** Keyboard support, sensible default aria attributes, customizable screen reader instructions and live regions built-in.\n- **Performance:** It was built with performance in mind in order to support silky smooth animations.\n- **Presets:** Need to build a sortable interface? Check out `@dnd-kit/sortable`, which is a thin layer built on top of `@dnd-kit/core`. More presets coming in the future.\n\n## Documentation\n\nTo learn how to get started with **dnd kit**, visit the official documentation website. You'll find in-depth API documentation, tips and guides to help you build drag and drop interfaces.\n\n<p>\n<a href=\"https://docs.dndkit.com\">\n<img alt=\"Visit @dnd-kit documentation\" src=\".github/assets/documentation.svg\" width=\"200\" />\n</a>\n</p>\n\n## Key concepts\n\nThe core library of **dnd kit** exposes two main concepts:\n\n- [Draggable elements](https://docs.dndkit.com/api-documentation/draggable)\n- [Droppable areas](https://docs.dndkit.com/api-documentation/droppable)\n\nAugment your existing components using the `useDraggable` and `useDroppable` hooks, or combine both to create components that can both be dragged and dropped over.\n\nHandle events and customize the behaviour of your draggable elements and droppable areas using the `<DndContext>` provider. Configure sensors to handle different input methods.\n\nUse the `<DragOverlay>` component to render a draggable overlay that is removed from the normal document flow and is positioned relative to the viewport.\n\nCheck out our [quick start guide](https://docs.dndkit.com/introduction/getting-started) to learn how get started.\n\n### Extensibility\n\nExtensibility is at the core of **dnd kit**. It is built to be lean and extensible. It ships with the features we believe most people will want most of the time, and provides extension points to build the rest on top of `@dnd-kit/core`.\n\nA prime example of the level of extensibility of **dnd kit** is the [Sortable preset](https://docs.dndkit.com/presets/sortable), which is built using the extension points that are exposed by `@dnd-kit/core`.\n\nThe primary extension points of **dnd kit** are:\n\n- Sensors\n- Modifiers\n- Constraints\n- Custom collision detection algorithms\n\n### Accessibility\n\nBuilding accessible drag and drop interfaces is hard; **dnd kit** has a number of sensible defaults and starting points to help you make your drag and drop interface accessible:\n\n- Customizable **screen reader instructions** for how to interact with draggable items\n- Customizable **live region updates** to provide screen reader announcements in real-time of what is currently happening with draggable and droppable elements.\n- Sensible defaults for **`aria` attributes** that should be passed to draggable items\n\nCheck out our [Accessibility guide](https://docs.dndkit.com/guides/accessibility) to learn more about how you can help provide a better experience for screen readers.\n\n### Architecture\n\nUnlike most drag and drop libraries, **dnd kit** intentionally is **not** built on top of the [HTML5 Drag and drop API](https://developer.mozilla.org/en-US/docs/Web/API/HTML_Drag_and_Drop_API). This was a deliberate architectural decision, that does come with tradeoffs that you should be aware of before deciding to use it, but for most applications, we believe the benefits outweigh the tradeoffs.\n\nThe HTML5 Drag and drop API has some severe **limitations**. It does not support touch devices or using the keyboard to drag items, which means that the libraries that are built on top of it need to expose an entirely different implementation to support those input methods. It also doesn't support common use-cases such as locking dragging to a specific axis or to the bounds of a container, custom collision detection strategies, or even customizing the preview of the dragged item.\n\nWhile there are workarounds to some of these issues, those workarounds typically increase the complexity of the codebase and the overall bundle size of the library, and lead to inconsistencies between the mouse, touch and keyboard layers because they're powered by entirely different implementations.\n\nThe main **tradeoff** with not using the HTML5 Drag and drop API is that you won't be able to drag from the desktop or between windows. If the drag and drop use-case you have in mind involves this kind of functionality, you'll definitely want to use a library that's built on top of the HTML 5 Drag and drop API. We highly recommend you check out [react-dnd](https://github.com/react-dnd/react-dnd/) for a React library that's has a native HTML 5 Drag and drop backend.\n\n### Performance\n\n#### **Minimizing DOM mutations**\n\n**dnd kit** lets you build drag and drop interfaces without having to mutate the DOM every time an item needs to shift position.\n\nThis is possible because **dnd kit** lazily calculates and stores the initial positions and layout of your droppable containers when a drag operation is initiated. These positions are passed down to your components that use `useDraggable` and `useDroppable` so that you can compute the new positions of your items while a drag operation is underway, and move them to their new positions using performant CSS properties that do not trigger a repaint such as `translate3d` and `scale`. For an example of how this can be achieved, check out the implementation of the sorting strategies that are exposed by the [`@dnd-kit/sortable`](packages/sortable/README.md) library.\n\nThis isn't to say that you can't shift the position of the items in the DOM while dragging, this is something that **is supported** and sometimes inevitable. In some cases, it won't be possible to know in advance what the new position and layout of the item until you move it in the DOM. Just know that these kind of mutations to the DOM while dragging are much more expensive and will cause a repaint, so if possible, prefer computing the new positions using `translate3d` and `scale`.\n\n#### Synthetic events\n\n**dnd kit** also uses [SyntheticEvent listeners](https://reactjs.org/docs/events.html) for the activator events of all sensors, which leads to improved performance over manually adding event listeners to each individual draggable node.\n\n<p align=\"center\">\n<img alt=\"Playful illustration of draggable and droppable concepts. A robot picks up a draggable card and moves it over a droppable container.\" src=\".github/assets/concepts-illustration.svg\" width=\"75%\" />\n</p>\n\n## Working in the `@dnd-kit` repository\n\n### Packages contained within this repository\n\n- `@dnd-kit/core`\n- `@dnd-kit/accessibility`\n- `@dnd-kit/sortable`\n- `@dnd-kit/modifiers`\n- `@dnd-kit/utilities`\n\n### Installing dependencies\n\nYou'll need to install all the dependencies in the root directory. Since the `@dnd-kit` is a monorepo that uses Lerna and Yarn Workspaces, npm CLI is not supported (only yarn).\n\n```sh\nyarn install\n```\n\nThis will install all dependencies in each project, build them, and symlink them via Lerna\n\n### Development workflow\n\nIn one terminal, run `yarn start` in parallel:\n\n```sh\nyarn start\n```\n\nThis builds each package to `<packages>/<package>/dist` and runs the project in watch mode so any edits you save inside `<packages>/<package>/src` cause a rebuild to `<packages>/<package>/dist`. The results will stream to to the terminal.\n\n### Running storybook\n\n```sh\nyarn start:storybook\n```\n\nRuns the storybook\nOpen [http://localhost:6006](http://localhost:6006) to view it in the browser.\n\n![Screenshot of Storybook running locally](.github/assets/storybook-screenshot.png)\n\n### Working with the playground\n\nYou can play with local packages in the Parcel-powered playground.\n\n```sh\nyarn start:playground\n```\n\nThis will start the playground on `localhost:1234`. If you have lerna running watch in parallel mode in one terminal, and then you run parcel, your playground will hot reload when you make changes to any imported module whose source is inside of `packages/*/src/*`. Note that to accomplish this, each package's `start` command passes TDSX the `--noClean` flag. This prevents Parcel from exploding between rebuilds because of File Not Found errors.\n\nImportant Safety Tip: When adding/altering packages in the playground, use `alias` object in package.json. This will tell Parcel to resolve them to the filesystem instead of trying to install the package from NPM. It also fixes duplicate React errors you may run into.\n\n### Running Cypress\n\n(In a third terminal) you can run Cypress and it will run the integration tests against storybook.\n",
  "tags": [
    "drag-drop",
    "github",
    "readme"
  ],
  "extracted_at": "2026-02-03T12:57:14.591271+00:00",
  "content_length": 10401,
  "content_hash": "c0a7b577f5de6dd9"
}