{
  "id": "mdn-css__en-US_docs_Web_CSS_CSS_flexible_box_layout_Contro",
  "source_id": "mdn-css",
  "source_name": "MDN CSS Reference",
  "category": "css_styling",
  "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_flexible_box_layout/Controlling_ratios_of_flex_items_along_the_main_axis",
  "title": "Controlling ratios of flex items along the main axis",
  "content": "Controlling ratios of flex items along the main axis\nIn this guide, we explore the three properties that control the size and flexibility of flex items along the main axis:\nflex-grow\n,\nflex-shrink\n, and\nflex-basis\n. Fully understanding how these properties work with growing and shrinking items is the key to mastering\nCSS flexible box layout\n.\nA first look\nOur three properties control the following aspects of a flex item's flexibility:\nflex-grow\n: How much of the positive free space does this item get?\nflex-shrink\n: How much negative free space can be removed from this item?\nflex-basis\n: What is the size of the item before growing and shrinking happens?\nThe properties are usually expressed using the shorthand\nflex\nproperty. The following code would set the\nflex-grow\nproperty to\n2\n,\nflex-shrink\nto\n1\nand\nflex-basis\nto\nauto\n.\ncss\n.item {\n  flex: 2 1 auto;\n}\nImportant concepts when working on the main axis\nTo understand the\nflex\nproperties, it is helpful to know the\nnatural size\nof flex items before any growing or shrinking takes place. Additionally, it is important to understand the concept of\nfree space\n, which is the difference between the combined natural size of all the flex items along the main axis and the size of the main axis itself.\nFlex item sizing\nTo determine how much space is available to lay out flex items, the browser needs to know how big the item is to start with. How is this calculated for items that don't have a width or a height applied using an absolute length unit?\nIn CSS, the\nmin-content\nand\nmax-content\nkeywords can be used in place of a\n<length>\nunit. Generally,\nmin-content\nis the smallest size an element can be while still fitting the longest word, and\nmax-content\nis the size the element would need to be to fit all the content without wrapping.\nThe example below contains two paragraph elements with different strings of text. The first paragraph has a width of\nmin-content\n. Notice that the text has used all of the soft wrapping opportunities available to it, becoming as small as possible without overflowing. This is the\nmin-content\nsize of that string. Essentially, the longest word in the string is dictating the size.\nThe second paragraph, with a value of\nmax-content\n, does the opposite. It grows as large as it needs to be to fit the content without taking soft-wrapping opportunities. It will overflow the box it is in if that container is too narrow.\nhtml\n<p class=\"min-content\">\n  I am sized with min-content and so I will take all of the soft-wrapping\n  opportunities.\n</p>\n<p class=\"max-content\">\n  I am sized with max-content and so I will take none of the soft-wrapping\n  opportunities.\n</p>\ncss\n.min-content {\n  width: min-content;\n  border: 2px dotted rgb(96 139 168);\n}\n.max-content {\n  width: max-content;\n  border: 2px dotted rgb(96 139 168);\n}\nRemember this behavior and what effects\nmin-content\nand\nmax-content\nhave as we explore\nflex-grow\nand\nflex-shrink\nlater in this article.\nPositive and negative free space\nWe also need to understand the concept of\npositive and negative free space\n. When a flex container has\npositive free space\n, it has more space than required to display the flex items inside the container. For example, a\n500px\n-wide container, with\nflex-direction\nset to\nrow\nand containing three\n100px\n-wide flex items has\n200px\nof positive free space. This positive free space can be distributed between the items if filling the container is desired.\nA flex container has\nnegative free space\nwhen the combined value of the natural sizes of the flex items is larger than the available space in the flex container. If the three flex items in the\n500px\n-wide container example above are each\n200px\nwide instead of\n100px\n, their combined natural width is\n600px\n, resulting in\n100px\nof negative free space. This space can be removed from the items to make them fit the container, or the items will overflow.\nWe need to understand this distribution of positive free space and removal of negative free space to learn about the property components of the\nflex\nshorthand.\nIn the following examples, the\nflex-direction\nis set to\nrow\n, so the size of items will be determined by their width. We will be calculating the positive and negative free space by comparing the total width of all the items with the container's width. You could also try out each example with\nflex-direction: column\n. The main axis would then be the column, and you would then compare the height of the items and their container to calculate the positive and negative free space.\nThe\nflex-basis\nproperty\nThe\nflex-basis\nproperty specifies the initial size of a flex item before any distribution of the positive or negative free space happens. The initial value for this property is\nauto\n. This property accepts the same values as the\nwidth\nand\nheight\nproperties, and it also accepts the\ncontent\nkeyword.\nIf\nflex-basis\nis set to\nauto\n, the initial size of the item is the\n<length-percentage>\nsize of the main size, if any was set. For example, if the item has\nwidth: 200px\nset, then\n200px\nwould be the\nflex-basis\nfor this item. Percentage values are relative to the flex container's inner main size. If\nwidth: 50%\nwere set, the\nflex-basis\nfor this item would be half of the container's content-box width. If no such size is set, meaning the item is auto-sized, then\nauto\nresolves to the size of its content (see the\nmin-\nand\nmax-content\nsizing\ndiscussion above), meaning the\nflex-basis\nis the item's\nmax-content\nsize.\nThis example contains three inflexible flex items, with both\nflex-grow\nand\nflex-shrink\nset to\n0\n. The first item, which has an explicit width of\n150px\n, takes a\nflex-basis\nof\n150px\n, whereas the other two items have no width set and so are sized according to their content width or\nmax-content\n.\nhtml\n<div class=\"box\">\n  <div>One</div>\n  <div>Two</div>\n  <div>Three</div>\n</div>\ncss\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  flex: 0 0 auto;\n}\n\n.box {\n  width: 500px;\n  border: 2px dotted rgb(96 139 168);\n  display: flex;\n}\n\n.box :first-child {\n  width: 150px;\n}\nIn addition to the\nauto\nkeyword and any other valid\nwidth\nvalue, you can use the\ncontent\nkeyword as the\nflex-basis\n. This results in the\nflex-basis\nbeing based on the content size, even if there is a\nwidth\nset on the item. This creates the same effect as removing any width set and using\nauto\nas the\nflex-basis\n. While similar to setting\nmax-content\n, the\ncontent\nvalue enables any\naspect-ratio\nto be calculated based on the cross-axis size.\nTo completely ignore the size of the flex item during space distribution, set\nflex-basis\nto\n0\nand set a non-zero\nflex-grow\nvalue. Let's learn\nflex-grow\nbefore looking at this value in action.\nThe\nflex-grow\nproperty\nThe\nflex-grow\nproperty specifies the\nflex grow factor\n, which determines how much a flex item will grow relative to the other flex items in the flex container when positive free space is distributed.\nIf all items have the same\nflex-grow\nfactor, the positive free space will be distributed evenly among them. For this scenario, common practice is to set\nflex-grow: 1\n, but you could give them any value, such as\n88\n,\n100\n, or\n1.2\n; it is a ratio. If the factor is the same for all the flex items in the container and there is positive free space, that space will be distributed equally.\nCombining\nflex-grow\nand\nflex-basis\nThings can get confusing in terms of how\nflex-grow\nand\nflex-basis\ninteract. Let's consider the case of three flex items of differing content lengths and the following\nflex\nrules applied to them:\ncss\n.class {\n  flex: 1 1 auto;\n}\nIn this case, the\nflex-basis\nvalue is\nauto\nand the items don't have a width set, so they are auto-sized. This means the\nflex-basis\nused is the\nmax-content\nsize of each item. After laying out the items, there is some positive free space in the flex container, which is shown in the image below as the hatched area; the hatched area is the positive free space that will be distributed between the three items based on their\nflex-grow\nfactors:\nWe are working with a\nflex-basis\nequal to the content size. This means the available space to distribute is subtracted from the total available space (the width of the flex container), and the remaining space is then shared equally between the three items. The biggest item remains the largest because it started from a bigger size, even though it has the same amount of spare space as the others:\nTo create three equally-sized items, even if the original elements have different sizes, set the\nflex-basis\ncomponent to\n0\n:\ncss\n.class {\n  flex: 1 1 0;\n}\nHere, for the purpose of space distribution calculation, we are setting the size of each item to\n0\n. This means all the space is available for distribution. Since all the items have the same\nflex-grow\nfactor, they each get an equal amount of space. This results in three equal-width flex items.\nTry changing the\nflex-grow\nfactor from 1 to 0 in this live example to see the different behavior:\nhtml\n<div class=\"box\">\n  <div>One</div>\n  <div>Two</div>\n  <div>Three has more content</div>\n</div>\ncss\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  flex: 1 1 0;\n}\n\n.box {\n  width: 400px;\n  border: 2px dotted rgb(96 139 168);\n  display: flex;\n}\nGiving items different flex-grow factors\nUsing\nflex-grow\nand\nflex-basis\ntogether enables us to control individual item sizes by setting different\nflex-grow\nfactors. If we keep the\nflex-basis\nat\n0\nso that all the space can be distributed, we can create differently sized flex items by assigning each item a different\nflex-grow\nfactor.\nIn the example below, we use\n1\nas the\nflex-grow\nfactor for the first two items and double it to\n2\nfor the third item. With\nflex-basis: 0\nset on all the items, the available space is distributed as follows:\nThe\nflex-grow\nfactor values of all the sibling flex items are added together (the total is 4 in this case).\nThe positive free space in the flex container is divided by this total value.\nThe free space is distributed according to the individual values. In this case, the first item gets one part, the second one part, and the third two parts. This means that the third item is twice the size of the first and second items.\nhtml\n<div class=\"box\">\n  <div class=\"one\">One</div>\n  <div class=\"two\">Two</div>\n  <div class=\"three\">Three</div>\n</div>\ncss\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  flex: 1 1 0;\n}\n\n.box {\n  border: 2px dotted rgb(96 139 168);\n  display: flex;\n}\n\n.one {\n  flex: 1 1 0;\n}\n\n.two {\n  flex: 1 1 0;\n}\n\n.three {\n  flex: 2 1 0;\n}\nRemember that you can use any positive value here. It is the ratio between the items that matters. You can use large numbers or decimals; it's up to you. To test this, change the\nflex-grow\nvalues in the above example to\n.25\n,\n.25\n, and\n.50\n. You should see the same result.\nThe\nflex-shrink\nproperty\nThe\nflex-shrink\nproperty specifies the\nflex shrink factor\n, which determines how much the flex item will shrink relative to the rest of the flex items in the flex container when negative free space is distributed.\nThis property deals with situations where the combined\nflex-basis\nvalue of the flex items is too large to fit in the flex container and would otherwise overflow. As long as an item's\nflex-shrink\nis a positive value, the item will shrink to not overflow the container.\nWhile\nflex-grow\nis used to add available space to items that can grow,\nflex-shrink\nis used to remove space to ensure items fit in their container without overflowing.\nIn this example, there are three\n200px\n-wide flex items in a\n500px\n-wide container. With\nflex-shrink\nset to\n0\n, the items are not allowed to shrink, causing them to overflow the container.\nhtml\n<div class=\"box\">\n  <div>One</div>\n  <div>Two</div>\n  <div>Three has more content</div>\n</div>\ncss\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  flex: 0 0 auto;\n  width: 200px;\n}\n\n.box {\n  width: 500px;\n  border: 2px dotted rgb(96 139 168);\n  display: flex;\n}\nChange the\nflex-shrink\nvalue to\n1\n; each item will shrink by the same amount, fitting all the items into the container. The negative free space has been proportionally removed from each item, making each flex item smaller than its initial width.\nCombining\nflex-shrink\nand\nflex-basis\nIt may appear that\nflex-shrink\nworks in the same way as\nflex-grow\n, by shrinking rather than growing elements. However, there are some important differences to note.\nThe concept of\nflex base size\naffects how negative space is distributed across flex items. The flex shrink factor is multiplied by the flex base size when distributing negative space. This distributes negative space in proportion to how much the item is able to shrink. So, for example, a small item won't shrink to zero before a larger item has been noticeably reduced.\nSmall items will not shrink to less than their\nmin-content\nsize, which is the smallest size the element can be if it used all the available soft wrapping opportunities.\nThis example demonstrates\nmin-content\nflooring, with the\nflex-basis\nresolving to the size of the content. If you change the width on the flex container, such as increasing it to\n700px\n, and then reduce the flex item width, you can see that the first two items will wrap. However, they will never become smaller than their\nmin-content\nsize. When the container gets small, the space is only removed from the third item when shrunken further.\nhtml\n<div class=\"box\">\n  <div>Item One</div>\n  <div>Item Two</div>\n  <div>Item Three has more content and so has a larger size</div>\n</div>\ncss\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  flex: 1 1 auto;\n}\n\n.box {\n  border: 2px dotted rgb(96 139 168);\n  width: 500px;\n  display: flex;\n}\nIn practice, this shrinking behavior provides reasonable results. It prevents content from disappearing completely and from becoming smaller than its minimum content size. The above rules are sensible for content that needs to shrink to fit its container.\nGiving items different\nflex-shrink\nfactors\nIn the same way as\nflex-grow\n, you can give flex items different\nflex-shrink\nfactors. This can help change the default behavior if, for example, you want an item to shrink more or less rapidly than its siblings or to not shrink at all.\nIn this example, the first item has a\nflex-shrink\nfactor of\n1\n, the second item\n0\n(so it won't shrink at all), and the third item\n4\n, making a total of\n5\nshrink factors. The third item, therefore, shrinks approximately four times more rapidly than the first, but neither will shrink below their\nmin-content\nwidth. Play around with the different values: as with\nflex-grow\n, you can use decimals or larger numbers here as well.\nhtml\n<div class=\"box\">\n  <div class=\"one\">One</div>\n  <div class=\"two\">Two</div>\n  <div class=\"three\">Three</div>\n</div>\ncss\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  width: 200px;\n}\n\n.box {\n  display: flex;\n  width: 500px;\n  border: 2px dotted rgb(96 139 168);\n}\n\n.one {\n  flex: 1 1 auto;\n}\n\n.two {\n  flex: 1 0 auto;\n}\n\n.three {\n  flex: 2 4 auto;\n}\nMastering sizing of flex items\nTo understand how flex item sizing works, you need to consider the factors below, which we've discussed in these guides:\nWhat determines the base size of an item?\nIs\nflex-basis\nset to\nauto\n, and does the item have a width set? If so, the size will be based on that width.\nIs\nflex-basis\nset to\nauto\n, but the item doesn't have a width set? If so, the size will be based on the item's content size.\nIs\nflex-basis\na length or a percentage, but not zero? If so, this will be the size of the item (floored at\nmin-content\n).\nIs\nflex-basis\nset to\n0\n? If so, the item's size will not be taken into consideration for the space-sharing calculation.\nIs there available space?\nItems can grow only if there is positive free space, and they won't shrink unless there is negative free space.\nIf we add up the widths of all the items (or heights if working in a column), is that total\nless\nthan the total width (or height) of the container? If so, there will be positive free space, and\nflex-grow\nwill come into play.\nIf we add up the widths of all the items (or heights if working in a column), is that total\nmore\nthan the total width (or height) of the container? If so, there will be negative free space, and\nflex-shrink\nwill come into play.\nWhat are the other ways to distribute space?\nIf you do not want space added to the items, remember that you can manage free space between or around items using the alignment properties described in the guide for aligning items in a flex container. The\njustify-content\nproperty will enable the distribution of free space between or around items. You can also use auto margins on flex items to absorb space and create gaps between items.\nWith all these flex properties available to you, you will find that most layout tasks are possible, although it might take a little bit of experimentation at first.\nHelp improve MDN\nLearn how to contribute\nThis page was last modified on\nNov 7, 2025\nby\nMDN contributors\n.\nView this page on GitHub\nâ\u0080¢\nReport a problem with this content",
  "content_markdown": "# Controlling ratios of flex items along the main axis\n\nIn this guide, we explore the three properties that control the size and flexibility of flex items along the main axis: [`flex-grow`](/en-US/docs/Web/CSS/Reference/Properties/flex-grow), [`flex-shrink`](/en-US/docs/Web/CSS/Reference/Properties/flex-shrink), and [`flex-basis`](/en-US/docs/Web/CSS/Reference/Properties/flex-basis). Fully understanding how these properties work with growing and shrinking items is the key to mastering [CSS flexible box layout](/en-US/docs/Web/CSS/Guides/Flexible_box_layout).\n\n## [A first look](#a_first_look)\n\nOur three properties control the following aspects of a flex item's flexibility:\n\n- `flex-grow`: How much of the positive free space does this item get?\n- `flex-shrink`: How much negative free space can be removed from this item?\n- `flex-basis`: What is the size of the item before growing and shrinking happens?\n\nThe properties are usually expressed using the shorthand [`flex`](/en-US/docs/Web/CSS/Reference/Properties/flex) property. The following code would set the `flex-grow` property to `2`, `flex-shrink` to `1` and `flex-basis` to `auto`.\n\ncss\n\n```\n.item {\n  flex: 2 1 auto;\n}\n```\n\n## [Important concepts when working on the main axis](#important_concepts_when_working_on_the_main_axis)\n\nTo understand the `flex` properties, it is helpful to know the *natural size* of flex items before any growing or shrinking takes place. Additionally, it is important to understand the concept of *free space*, which is the difference between the combined natural size of all the flex items along the main axis and the size of the main axis itself.\n\n### [Flex item sizing](#flex_item_sizing)\n\nTo determine how much space is available to lay out flex items, the browser needs to know how big the item is to start with. How is this calculated for items that don't have a width or a height applied using an absolute length unit?\n\nIn CSS, the [`min-content`](/en-US/docs/Web/CSS/Reference/Values/min-content) and [`max-content`](/en-US/docs/Web/CSS/Reference/Values/max-content) keywords can be used in place of a [`<length>`](/en-US/docs/Web/CSS/Reference/Values/length) unit. Generally, `min-content` is the smallest size an element can be while still fitting the longest word, and `max-content` is the size the element would need to be to fit all the content without wrapping.\n\nThe example below contains two paragraph elements with different strings of text. The first paragraph has a width of `min-content`. Notice that the text has used all of the soft wrapping opportunities available to it, becoming as small as possible without overflowing. This is the `min-content` size of that string. Essentially, the longest word in the string is dictating the size.\n\nThe second paragraph, with a value of `max-content`, does the opposite. It grows as large as it needs to be to fit the content without taking soft-wrapping opportunities. It will overflow the box it is in if that container is too narrow.\n\nhtml\n\n```\n<p class=\"min-content\">\n  I am sized with min-content and so I will take all of the soft-wrapping\n  opportunities.\n</p>\n<p class=\"max-content\">\n  I am sized with max-content and so I will take none of the soft-wrapping\n  opportunities.\n</p>\n```\n\ncss\n\n```\n.min-content {\n  width: min-content;\n  border: 2px dotted rgb(96 139 168);\n}\n.max-content {\n  width: max-content;\n  border: 2px dotted rgb(96 139 168);\n}\n```\n\nRemember this behavior and what effects `min-content` and `max-content` have as we explore `flex-grow` and `flex-shrink` later in this article.\n\n### [Positive and negative free space](#positive_and_negative_free_space)\n\nWe also need to understand the concept of **positive and negative free space**. When a flex container has *positive free space*, it has more space than required to display the flex items inside the container. For example, a `500px`-wide container, with [`flex-direction`](/en-US/docs/Web/CSS/Reference/Properties/flex-direction) set to `row` and containing three `100px`-wide flex items has `200px` of positive free space. This positive free space can be distributed between the items if filling the container is desired.\n\n![Image showing space left over after items have been displayed.](/en-US/docs/Web/CSS/Guides/Flexible_box_layout/Controlling_flex_item_ratios/basics7.png)\n\nA flex container has *negative free space* when the combined value of the natural sizes of the flex items is larger than the available space in the flex container. If the three flex items in the `500px`-wide container example above are each `200px` wide instead of `100px`, their combined natural width is `600px`, resulting in `100px` of negative free space. This space can be removed from the items to make them fit the container, or the items will overflow.\n\n![The items overflow the container](/en-US/docs/Web/CSS/Guides/Flexible_box_layout/Controlling_flex_item_ratios/ratios1.png)\n\nWe need to understand this distribution of positive free space and removal of negative free space to learn about the property components of the `flex` shorthand.\n\nIn the following examples, the [`flex-direction`](/en-US/docs/Web/CSS/Reference/Properties/flex-direction) is set to `row`, so the size of items will be determined by their width. We will be calculating the positive and negative free space by comparing the total width of all the items with the container's width. You could also try out each example with `flex-direction: column`. The main axis would then be the column, and you would then compare the height of the items and their container to calculate the positive and negative free space.\n\n## [The `flex-basis` property](#the_flex-basis_property)\n\nThe [`flex-basis`](/en-US/docs/Web/CSS/Reference/Properties/flex-basis) property specifies the initial size of a flex item before any distribution of the positive or negative free space happens. The initial value for this property is `auto`. This property accepts the same values as the [`width`](/en-US/docs/Web/CSS/Reference/Properties/width) and [`height`](/en-US/docs/Web/CSS/Reference/Properties/height) properties, and it also accepts the `content` keyword.\n\nIf `flex-basis` is set to `auto`, the initial size of the item is the [`<length-percentage>`](/en-US/docs/Web/CSS/Reference/Values/length-percentage) size of the main size, if any was set. For example, if the item has `width: 200px` set, then `200px` would be the `flex-basis` for this item. Percentage values are relative to the flex container's inner main size. If `width: 50%` were set, the `flex-basis` for this item would be half of the container's content-box width. If no such size is set, meaning the item is auto-sized, then `auto` resolves to the size of its content (see the [`min-` and `max-content` sizing](#flex_item_sizing) discussion above), meaning the `flex-basis` is the item's `max-content` size.\n\nThis example contains three inflexible flex items, with both `flex-grow` and `flex-shrink` set to `0`. The first item, which has an explicit width of `150px`, takes a `flex-basis` of `150px`, whereas the other two items have no width set and so are sized according to their content width or `max-content`.\n\nhtml\n\n```\n<div class=\"box\">\n  <div>One</div>\n  <div>Two</div>\n  <div>Three</div>\n</div>\n```\n\ncss\n\n```\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  flex: 0 0 auto;\n}\n\n.box {\n  width: 500px;\n  border: 2px dotted rgb(96 139 168);\n  display: flex;\n}\n\n.box :first-child {\n  width: 150px;\n}\n```\n\nIn addition to the `auto` keyword and any other valid [`width`](/en-US/docs/Web/CSS/Reference/Properties/width) value, you can use the `content` keyword as the `flex-basis`. This results in the `flex-basis` being based on the content size, even if there is a `width` set on the item. This creates the same effect as removing any width set and using `auto` as the `flex-basis`. While similar to setting `max-content`, the `content` value enables any [`aspect-ratio`](/en-US/docs/Web/CSS/Reference/Properties/aspect-ratio) to be calculated based on the cross-axis size.\n\nTo completely ignore the size of the flex item during space distribution, set `flex-basis` to `0` and set a non-zero `flex-grow` value. Let's learn `flex-grow` before looking at this value in action.\n\n## [The `flex-grow` property](#the_flex-grow_property)\n\nThe [`flex-grow`](/en-US/docs/Web/CSS/Reference/Properties/flex-grow) property specifies the **flex grow factor**, which determines how much a flex item will grow relative to the other flex items in the flex container when positive free space is distributed.\n\nIf all items have the same `flex-grow` factor, the positive free space will be distributed evenly among them. For this scenario, common practice is to set `flex-grow: 1`, but you could give them any value, such as `88`, `100`, or `1.2`; it is a ratio. If the factor is the same for all the flex items in the container and there is positive free space, that space will be distributed equally.\n\n### [Combining `flex-grow` and `flex-basis`](#combining_flex-grow_and_flex-basis)\n\nThings can get confusing in terms of how `flex-grow` and `flex-basis` interact. Let's consider the case of three flex items of differing content lengths and the following `flex` rules applied to them:\n\ncss\n\n```\n.class {\n  flex: 1 1 auto;\n}\n```\n\nIn this case, the `flex-basis` value is `auto` and the items don't have a width set, so they are auto-sized. This means the `flex-basis` used is the `max-content` size of each item. After laying out the items, there is some positive free space in the flex container, which is shown in the image below as the hatched area; the hatched area is the positive free space that will be distributed between the three items based on their `flex-grow` factors:\n\n![Three items taking a bit more than half the width, with the rest of the width being hatched](/en-US/docs/Web/CSS/Guides/Flexible_box_layout/Controlling_flex_item_ratios/ratios2.png)\n\nWe are working with a `flex-basis` equal to the content size. This means the available space to distribute is subtracted from the total available space (the width of the flex container), and the remaining space is then shared equally between the three items. The biggest item remains the largest because it started from a bigger size, even though it has the same amount of spare space as the others:\n\n![The hatched area was divided into thirds, with each item getting a single portion appended.](/en-US/docs/Web/CSS/Guides/Flexible_box_layout/Controlling_flex_item_ratios/ratios3.png)\n\nTo create three equally-sized items, even if the original elements have different sizes, set the `flex-basis` component to `0`:\n\ncss\n\n```\n.class {\n  flex: 1 1 0;\n}\n```\n\nHere, for the purpose of space distribution calculation, we are setting the size of each item to `0`. This means all the space is available for distribution. Since all the items have the same `flex-grow` factor, they each get an equal amount of space. This results in three equal-width flex items.\n\nTry changing the `flex-grow` factor from 1 to 0 in this live example to see the different behavior:\n\nhtml\n\n```\n<div class=\"box\">\n  <div>One</div>\n  <div>Two</div>\n  <div>Three has more content</div>\n</div>\n```\n\ncss\n\n```\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  flex: 1 1 0;\n}\n\n.box {\n  width: 400px;\n  border: 2px dotted rgb(96 139 168);\n  display: flex;\n}\n```\n\n### [Giving items different flex-grow factors](#giving_items_different_flex-grow_factors)\n\nUsing `flex-grow` and `flex-basis` together enables us to control individual item sizes by setting different `flex-grow` factors. If we keep the `flex-basis` at `0` so that all the space can be distributed, we can create differently sized flex items by assigning each item a different `flex-grow` factor.\n\nIn the example below, we use `1` as the `flex-grow` factor for the first two items and double it to `2` for the third item. With `flex-basis: 0` set on all the items, the available space is distributed as follows:\n\n1. The `flex-grow` factor values of all the sibling flex items are added together (the total is 4 in this case).\n2. The positive free space in the flex container is divided by this total value.\n3. The free space is distributed according to the individual values. In this case, the first item gets one part, the second one part, and the third two parts. This means that the third item is twice the size of the first and second items.\n\nhtml\n\n```\n<div class=\"box\">\n  <div class=\"one\">One</div>\n  <div class=\"two\">Two</div>\n  <div class=\"three\">Three</div>\n</div>\n```\n\ncss\n\n```\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  flex: 1 1 0;\n}\n\n.box {\n  border: 2px dotted rgb(96 139 168);\n  display: flex;\n}\n\n.one {\n  flex: 1 1 0;\n}\n\n.two {\n  flex: 1 1 0;\n}\n\n.three {\n  flex: 2 1 0;\n}\n```\n\nRemember that you can use any positive value here. It is the ratio between the items that matters. You can use large numbers or decimals; it's up to you. To test this, change the `flex-grow` values in the above example to `.25`, `.25`, and `.50`. You should see the same result.\n\n## [The `flex-shrink` property](#the_flex-shrink_property)\n\nThe [`flex-shrink`](/en-US/docs/Web/CSS/Reference/Properties/flex-shrink) property specifies the **flex shrink factor**, which determines how much the flex item will shrink relative to the rest of the flex items in the flex container when negative free space is distributed.\n\nThis property deals with situations where the combined `flex-basis` value of the flex items is too large to fit in the flex container and would otherwise overflow. As long as an item's `flex-shrink` is a positive value, the item will shrink to not overflow the container.\n\nWhile `flex-grow` is used to add available space to items that can grow, `flex-shrink` is used to remove space to ensure items fit in their container without overflowing.\n\nIn this example, there are three `200px`-wide flex items in a `500px`-wide container. With `flex-shrink` set to `0`, the items are not allowed to shrink, causing them to overflow the container.\n\nhtml\n\n```\n<div class=\"box\">\n  <div>One</div>\n  <div>Two</div>\n  <div>Three has more content</div>\n</div>\n```\n\ncss\n\n```\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  flex: 0 0 auto;\n  width: 200px;\n}\n\n.box {\n  width: 500px;\n  border: 2px dotted rgb(96 139 168);\n  display: flex;\n}\n```\n\nChange the `flex-shrink` value to `1`; each item will shrink by the same amount, fitting all the items into the container. The negative free space has been proportionally removed from each item, making each flex item smaller than its initial width.\n\n### [Combining `flex-shrink` and `flex-basis`](#combining_flex-shrink_and_flex-basis)\n\nIt may appear that `flex-shrink` works in the same way as `flex-grow`, by shrinking rather than growing elements. However, there are some important differences to note.\n\nThe concept of [flex base size](#what_determines_the_base_size_of_an_item) affects how negative space is distributed across flex items. The flex shrink factor is multiplied by the flex base size when distributing negative space. This distributes negative space in proportion to how much the item is able to shrink. So, for example, a small item won't shrink to zero before a larger item has been noticeably reduced.\n\nSmall items will not shrink to less than their `min-content` size, which is the smallest size the element can be if it used all the available soft wrapping opportunities.\n\nThis example demonstrates `min-content` flooring, with the `flex-basis` resolving to the size of the content. If you change the width on the flex container, such as increasing it to `700px`, and then reduce the flex item width, you can see that the first two items will wrap. However, they will never become smaller than their `min-content` size. When the container gets small, the space is only removed from the third item when shrunken further.\n\nhtml\n\n```\n<div class=\"box\">\n  <div>Item One</div>\n  <div>Item Two</div>\n  <div>Item Three has more content and so has a larger size</div>\n</div>\n```\n\ncss\n\n```\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  flex: 1 1 auto;\n}\n\n.box {\n  border: 2px dotted rgb(96 139 168);\n  width: 500px;\n  display: flex;\n}\n```\n\nIn practice, this shrinking behavior provides reasonable results. It prevents content from disappearing completely and from becoming smaller than its minimum content size. The above rules are sensible for content that needs to shrink to fit its container.\n\n### [Giving items different `flex-shrink` factors](#giving_items_different_flex-shrink_factors)\n\nIn the same way as `flex-grow`, you can give flex items different `flex-shrink` factors. This can help change the default behavior if, for example, you want an item to shrink more or less rapidly than its siblings or to not shrink at all.\n\nIn this example, the first item has a `flex-shrink` factor of `1`, the second item `0` (so it won't shrink at all), and the third item `4`, making a total of `5` shrink factors. The third item, therefore, shrinks approximately four times more rapidly than the first, but neither will shrink below their `min-content` width. Play around with the different values: as with `flex-grow`, you can use decimals or larger numbers here as well.\n\nhtml\n\n```\n<div class=\"box\">\n  <div class=\"one\">One</div>\n  <div class=\"two\">Two</div>\n  <div class=\"three\">Three</div>\n</div>\n```\n\ncss\n\n```\n.box > * {\n  border: 2px solid rgb(96 139 168);\n  border-radius: 5px;\n  background-color: rgb(96 139 168 / 0.2);\n  width: 200px;\n}\n\n.box {\n  display: flex;\n  width: 500px;\n  border: 2px dotted rgb(96 139 168);\n}\n\n.one {\n  flex: 1 1 auto;\n}\n\n.two {\n  flex: 1 0 auto;\n}\n\n.three {\n  flex: 2 4 auto;\n}\n```\n\n## [Mastering sizing of flex items](#mastering_sizing_of_flex_items)\n\nTo understand how flex item sizing works, you need to consider the factors below, which we've discussed in these guides:\n\n### [What determines the base size of an item?](#what_determines_the_base_size_of_an_item)\n\n- Is `flex-basis` set to `auto`, and does the item have a width set? If so, the size will be based on that width.\n- Is `flex-basis` set to `auto`, but the item doesn't have a width set? If so, the size will be based on the item's content size.\n- Is `flex-basis` a length or a percentage, but not zero? If so, this will be the size of the item (floored at `min-content`).\n- Is `flex-basis` set to `0`? If so, the item's size will not be taken into consideration for the space-sharing calculation.\n\n### [Is there available space?](#is_there_available_space)\n\nItems can grow only if there is positive free space, and they won't shrink unless there is negative free space.\n\n- If we add up the widths of all the items (or heights if working in a column), is that total **less** than the total width (or height) of the container? If so, there will be positive free space, and `flex-grow` will come into play.\n- If we add up the widths of all the items (or heights if working in a column), is that total **more** than the total width (or height) of the container? If so, there will be negative free space, and `flex-shrink` will come into play.\n\n### [What are the other ways to distribute space?](#what_are_the_other_ways_to_distribute_space)\n\nIf you do not want space added to the items, remember that you can manage free space between or around items using the alignment properties described in the guide for aligning items in a flex container. The [`justify-content`](/en-US/docs/Web/CSS/Reference/Properties/justify-content) property will enable the distribution of free space between or around items. You can also use auto margins on flex items to absorb space and create gaps between items.\n\nWith all these flex properties available to you, you will find that most layout tasks are possible, although it might take a little bit of experimentation at first.\n\n## Help improve MDN\n\nWas this page helpful to you?\n\nYes\n\nNo\n\n[Learn how to contribute](/en-US/docs/MDN/Community/Getting_started)\n\nThis page was last modified on Nov 7, 2025 by [MDN contributors](/en-US/docs/Web/CSS/Guides/Flexible_box_layout/Controlling_flex_item_ratios/contributors.txt).\n\n[View this page on GitHub](https://github.com/mdn/content/blob/main/files/en-us/web/css/guides/flexible_box_layout/controlling_flex_item_ratios/index.md?plain=1 \"Folder: en-us/web/css/guides/flexible_box_layout/controlling_flex_item_ratios (Opens in a new tab)\") â\u0080¢ [Report a problem with this content](https://github.com/mdn/content/issues/new?template=page-report.yml&mdn-url=https%3A%2F%2Fdeveloper.mozilla.org%2Fen-US%2Fdocs%2FWeb%2FCSS%2FGuides%2FFlexible_box_layout%2FControlling_flex_item_ratios&metadata=%3C%21--+Do+not+make+changes+below+this+line+--%3E%0A%3Cdetails%3E%0A%3Csummary%3EPage+report+details%3C%2Fsummary%3E%0A%0A*+Folder%3A+%60en-us%2Fweb%2Fcss%2Fguides%2Fflexible_box_layout%2Fcontrolling_flex_item_ratios%60%0A*+MDN+URL%3A+https%3A%2F%2Fdeveloper.mozilla.org%2Fen-US%2Fdocs%2FWeb%2FCSS%2FGuides%2FFlexible_box_layout%2FControlling_flex_item_ratios%0A*+GitHub+URL%3A+https%3A%2F%2Fgithub.com%2Fmdn%2Fcontent%2Fblob%2Fmain%2Ffiles%2Fen-us%2Fweb%2Fcss%2Fguides%2Fflexible_box_layout%2Fcontrolling_flex_item_ratios%2Findex.md%0A*+Last+commit%3A+https%3A%2F%2Fgithub.com%2Fmdn%2Fcontent%2Fcommit%2F85fccefc8066bd49af4ddafc12c77f35265c7e2d%0A*+Document+last+modified%3A+2025-11-07T15%3A58%3A06.000Z%0A%0A%3C%2Fdetails%3E \"This will take you to GitHub to file a new issue.\")",
  "tags": [
    "mdn",
    "css",
    "reference",
    "layout"
  ],
  "extracted_at": "2026-02-03T12:45:12.396389+00:00",
  "content_length": 17340,
  "content_hash": "2424e7ad253caecf"
}