{
  "id": "mdn-css__en-US_docs_Web_CSS_CSS_colors_Relative_colors",
  "source_id": "mdn-css",
  "source_name": "MDN CSS Reference",
  "category": "css_styling",
  "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_colors/Relative_colors",
  "title": "Using relative colors",
  "content": "Using relative colors\nThe\nCSS colors module\ndefines\nrelative color syntax\n, which allows a CSS\n<color>\nvalue to be defined relative to another color. This is a powerful feature that enables the programmatic creation of complements to existing colors â\u0080\u0094 such as lighter, darker, saturated, semi-transparent, or inverted variants â\u0080\u0094 enabling more effective color palette creation.\nThis article explains relative color syntax, shows what the different options are, and looks at some illustrative examples.\nGeneral syntax\nA relative CSS color value has the following general syntax structure:\ncss\ncolor-function(from origin-color channel1 channel2 channel3)\ncolor-function(from origin-color channel1 channel2 channel3 / alpha)\n\n/* color space included in the case of color() functions */\ncolor(from origin-color colorspace channel1 channel2 channel3)\ncolor(from origin-color colorspace channel1 channel2 channel3 / alpha)\nRelative colors are created using the same\ncolor functions\nas absolute colors, but with different parameters:\nInclude a basic color function (represented by\ncolor-function()\nabove) such as\nrgb()\n,\nhsl()\n, etc. Which one you pick depends on the color model you want to use for the relative color you are creating (the\noutput color\n).\nPass in the\norigin color\n(represented above by\norigin-color\n) your relative color will be based on, preceded by the\nfrom\nkeyword. This can be any valid\n<color>\nvalue using any available color model including a color value contained in a\nCSS custom property\n, system colors,\ncurrentColor\n, or even another relative color.\nIn the case of the\ncolor()\nfunction, include the\ncolorspace\nof the output color.\nProvide an output value for each individual channel. The output color is defined after the origin color â\u0080\u0094 represented above by the\nchannel1\n,\nchannel2\n, and\nchannel3\nplaceholders. The channels defined here depend on the\ncolor function\nyou are using for your relative color. For example, if you are using\nhsl()\n, you would need to define the values for hue, saturation, and lightness. Each channel value can be a new value, the same as the original value, or a value relative to the channel value of the origin color.\nOptionally, an\nalpha\nchannel value of type\n<alpha-value>\nfor the output color can be defined, preceded by a slash (\n/\n). If the\nalpha\nchannel value is not explicitly specified, it defaults to the alpha channel value of the\norigin-color\n(not 100%, which is the case for absolute color values).\nThe browser converts the origin color to a syntax compatible with the color function then destructures it into component color channels (plus the\nalpha\nchannel if the origin color has one). These are made available as appropriately-named values inside the color function â\u0080\u0094\nr\n,\ng\n,\nb\n, and\nalpha\nin the case of the\nrgb()\nfunction,\nl\n,\na\n,\nb\n, and\nalpha\nin the case of the\nlab()\nfunction,\nh\n,\nw\n,\nb\n, and\nalpha\nin the case of\nhwb()\n, etc. â\u0080\u0094 that can be used to calculate new output channel values.\nLet's look at relative color syntax in action. The below CSS is used to style two\n<div>\nelements, one with an absolute background color â\u0080\u0094\nred\nâ\u0080\u0094 and one with a relative background color created with the\nrgb()\nfunction, based on the same\nred\ncolor value:\n<div id=\"container\">\n  <div class=\"item\" id=\"one\"></div>\n  <div class=\"item\" id=\"two\"></div>\n</div>\n#container {\n  display: flex;\n  width: 100vw;\n  height: 100vh;\n  box-sizing: border-box;\n}\n\n.item {\n  flex: 1;\n  margin: 20px;\n}\ncss\n#one {\n  background-color: red;\n}\n\n#two {\n  background-color: rgb(from red 200 g b / alpha);\n}\nThe output is as follows:\nThe relative color uses the\nrgb()\nfunction, which takes\nred\nas the origin color, converts it to an equivalent\nrgb()\ncolor (\nrgb(255 0 0)\n) and then defines the new color as having a red channel of value\n200\nand green, blue and alpha channels with a value the same as the origin color (it uses the\ng\nand\nb\nvalues made available inside the function by the browser, which are both equal to\n0\n, and the\nalpha\nis\n100%\n).\nThis results in an output of\nrgb(200 0 0)\nâ\u0080\u0094 a slightly darker red. If we had specified a red channel value of\n255\n(or just the\nr\nvalue), the resulting output color would be exactly the same as the input value. The browser's final output color (the computed value) is an sRGB\ncolor()\nvalue equivalent to\nrgb(200 0 0)\nâ\u0080\u0094\ncolor(srgb 0.784314 0 0)\n.\nNote:\nAs mentioned above, when calculating a relative color the first thing the browser does is to convert the provided origin color (\nred\nin the above example) into a value compatible with the color function being used (in this case,\nrgb()\n). This is done so that the browser is able to calculate the output color from the origin color. While the calculations are performed relative to the color function used, the actual output color value depends on the color's color space:\nOlder sRGB color functions cannot express the full spectrum of visible colors. The output colors of (\nhsl()\n,\nhwb()\n, and\nrgb()\n) are serialized to\ncolor(srgb)\nto avoid these limitations. That means that querying the output color value via the\nHTMLElement.style\nproperty or the\nCSSStyleDeclaration.getPropertyValue()\nmethod returns the output color as a\ncolor(srgb ...)\nvalue.\nFor more recent color functions (\nlab()\n,\noklab()\n,\nlch()\n, and\noklch()\n), relative color output values are expressed in the same syntax as the color function used. For example, if a\nlab()\ncolor function is being used, the output color will be a\nlab()\nvalue.\nAll the following lines produce an equivalent output color:\ncss\nred\nrgb(255 0 0)\nrgb(from red 255 0 0)\nrgb(from red 255 0 0 / 1)\nrgb(from red 255 0 0 / 100%)\n\nrgb(from red 255 g b)\nrgb(from red r 0 0)\nrgb(from red r g b / 1)\nrgb(from red r g b / 100%)\n\nrgb(from red r g b)\nrgb(from red r g b / alpha)\n\n/* With `red`, the g and b are the same, making them interchangeable */\nrgb(from red r g g)\nrgb(from red r b b)\nrgb(from red 255 g g)\nrgb(from red 255 b b)\nSyntax flexibility\nThere is an important distinction to be made between the destructured origin color channel values made available in the function, and the channel values of the output color set by the developer.\nTo reiterate, when a relative color is defined, the channel values of the origin color are made available in the function to use when defining the output color channel values. The following example defines a relative color using an\nrgb()\nfunction and uses the origin color channel values (made available as\nr\n,\ng\n, and\nb\n) for the output channel values, meaning that the output color is the same as the origin color:\ncss\nrgb(from red r g b)\nHowever, when specifying the output values, you don't need to use the origin color channel values at all. You need to provide the output channel values in the right order (e.g., red, then green, then blue in the case of\nrgb()\n), but they can be any values you wish provided they are valid values for those channels. This gives relative CSS colors a high degree of flexibility.\nFor example, if you wanted to, you could specify absolute values like those shown below, transforming\nred\ninto\nblue\n:\ncss\nrgb(from red 0 0 255)\n/* output color is equivalent to rgb(0 0 255), full blue */\nNote:\nIf you are using relative color syntax but outputting the same color as the origin color or a color not based on the origin color at all, you are not really creating a relative color. You'd be unlikely to ever do this in a real codebase, and would probably just use an absolute color value instead. But, we felt it useful to explain that you\ncan\ndo this with relative color syntax, as a starting point for learning about it.\nYou can even mix up or repeat the provided values. The following takes a slightly darker red as an input and outputs a light gray color â\u0080\u0094 the output color's\nr\n,\ng\n, and\nb\nchannels are all set to the origin color's\nr\nchannel value:\ncss\nrgb(from rgb(200 0 0) r r r)\n/* output color is equivalent to rgb(200 200 200), light gray */\nThe following uses the origin color's channel values for the output color's\nr\n,\ng\n, and\nb\nchannel values, but in reverse order:\ncss\nrgb(from rgb(200 170 0) b g r)\n/* output color is equivalent to rgb(0 170 200) */\nColor functions that support relative colors\nIn the section above we only saw relative colors defined via the\nrgb()\nfunction. However, relative colors can be defined using any modern CSS color function â\u0080\u0094\ncolor()\n,\nhsl()\n,\nhwb()\n,\nlab()\n,\nlch()\n,\noklab()\n,\noklch()\n, or\nrgb()\n. The general syntax structure is the same in each case, although the origin color values have different names appropriate for the function being used.\nBelow you can find relative color syntax examples for each color function. Each case is the simplest possible, with the output color channel values exactly matching the origin color channel values:\ncss\n/* color() with and without alpha channel */\ncolor(from red a98-rgb r g b)\ncolor(from red a98-rgb r g b / alpha)\n\ncolor(from red xyz-d50 x y z)\ncolor(from red xyz-d50 x y z / alpha)\n\n/* hsl() with and without alpha channel */\nhsl(from red h s l)\nhsl(from red h s l / alpha)\n\n/* hwb() with and without alpha channel */\nhwb(from red h w b)\nhwb(from red h w b / alpha)\n\n/* lab() with and without alpha channel */\nlab(from red l a b)\nlab(from red l a b / alpha)\n\n/* lch() with and without alpha channel */\nlch(from red l c h)\nlch(from red l c h / alpha)\n\n/* oklab() with and without alpha channel */\noklab(from red l a b)\noklab(from red l a b / alpha)\n\n/* oklch() with and without alpha channel */\noklch(from red l c h)\noklch(from red l c h / alpha)\n\n/* rgb() with and without alpha channel */\nrgb(from red r g b)\nrgb(from red r g b / alpha)\nIt is worth mentioning again that the color system of the origin color doesn't need to match the color system being used to create the output color. Again, this provides a lot of flexibility. Generally you won't be interested in and might not even know the system the origin color is defined in (you might just have a\ncustom property value\nto manipulate). You'll just want to input a color and, for example, create a lighter variant of it by putting it into an\nhsl()\nfunction and varying the lightness value.\nUsing custom properties\nWhen creating a relative color, you can use values defined in\nCSS custom properties\nboth for the origin color and within the output color channel value definitions. Let's look at an example.\nIn the below CSS we define two custom properties:\n--base-color\ncontains our base brand color â\u0080\u0094\npurple\n. Here we are using a named color keyword, but relative colors can accept any color syntax for the origin color.\n--standard-opacity\ncontains the standard brand opacity value that we want to apply to semi-transparent boxes â\u0080\u0094\n0.75\n.\nWe then give two\n<div>\nelements a background color. One is given an absolute color â\u0080\u0094 our\n--base-color\nbrand purple. The other one is given a relative color equal to our brand purple, transformed to add an alpha channel equal to our standard opacity value.\n<div id=\"container\">\n  <div class=\"item\" id=\"one\"></div>\n  <div class=\"item\" id=\"two\"></div>\n</div>\n#container {\n  display: flex;\n  width: 100vw;\n  height: 100vh;\n  box-sizing: border-box;\n  background-image: repeating-linear-gradient(\n    45deg,\n    white,\n    white 24px,\n    black 25px,\n    black 50px\n  );\n}\n\n.item {\n  flex: 1;\n  margin: 20px;\n}\ncss\n:root {\n  --base-color: purple;\n  --standard-opacity: 0.75;\n}\n\n#one {\n  background-color: var(--base-color);\n}\n\n#two {\n  background-color: hwb(from var(--base-color) h w b / var(--standard-opacity));\n}\nThe output is as follows:\nUsing math functions\nYou can use CSS\nmath functions\nsuch as\ncalc()\nto calculate values for the output color channels. Let's look at an example.\nThe below CSS is used to style three\n<div>\nelements with different background colors. The middle one is given an unmodified\n--base-color\n, while the left and right ones are given lightened and darkened variants of that\n--base-color\n. These variants are defined using relative colors â\u0080\u0094 the\n--base-color\nis passed into an\nlch()\nfunction, and the output color has its lightness channel modified to achieve the desired effect via a\ncalc()\nfunction. The lightened color has 20% added to the lightness channel, and the darkened color has 20% subtracted from it.\n<div id=\"container\">\n  <div class=\"item\" id=\"one\"></div>\n  <div class=\"item\" id=\"two\"></div>\n  <div class=\"item\" id=\"three\"></div>\n</div>\n#container {\n  display: flex;\n  width: 100vw;\n  height: 100vh;\n  box-sizing: border-box;\n}\n\n.item {\n  flex: 1;\n  margin: 20px;\n}\ncss\n:root {\n  --base-color: orange;\n}\n\n#one {\n  background-color: lch(from var(--base-color) calc(l + 20) c h);\n}\n\n#two {\n  background-color: var(--base-color);\n}\n\n#three {\n  background-color: lch(from var(--base-color) calc(l - 20) c h);\n}\nThe output is as follows:\nManipulating the alpha channel\nThis example demonstrates changing the alpha channel of a named color. Here, we have an item wrapped in a container that both have a\nteal\nbackground. To distinguish between the backgrounds, we vary the alpha channel value using the relative color feature, the\ncalc()\nfunction\n, and a\ncustom property\n.\nhtml\n<div class=\"container\">\n  <div class=\"item\"></div>\n</div>\n.container {\n  padding: 60px;\n}\n\n.item {\n  height: 60px;\n}\ncss\ndiv {\n  background-color: rgb(\n    from teal r g b / calc(alpha * var(--alpha-multiplier))\n  );\n}\n\n.container {\n  --alpha-multiplier: 0.3;\n}\n\n.item {\n  --alpha-multiplier: 1;\n}\nThe alpha channel is referenced using the\nalpha\nkeyword. In this case, the\ncalc(alpha * var(--alpha-multiplier))\nexpression modifies the alpha channel value by multiplying\nalpha\nwith the\n--alpha-multiplier\ncustom property value. The container gets a semitransparent background because of the multiplier of\n0.3\nis less than\n1.0\n.\nThe output is as follows:\nChannel values resolve to\n<number>\nvalues\nTo make channel value calculations work in relative colors, all origin color channel values resolve to appropriate\n<number>\nvalues. For example, in the\nlch()\nexamples above, we are calculating new lightness values by adding or subtracting numbers from the origin color's\nl\nchannel value. If we tried to do\ncalc(l + 20%)\n, that would result in an invalid color â\u0080\u0094\nl\nis a\n<number>\nand cannot have a\n<percentage>\nadded to it.\nChannel values originally specified as a\n<percentage>\nresolve to a\n<number>\nappropriate for the output color function.\nChannel values originally specified as a\n<hue>\nangle resolve to a number of degrees in a range of\n0\nto\n360\n, inclusive.\nCheck the different\ncolor function pages\nfor the specifics of what their origin channel values resolve to.\nChecking for browser support\nYou can check that a browser supports relative color syntax by running it through a\n@supports\nat-rule.\nFor example:\ncss\n@supports (color: hsl(from white h s l)) {\n  /* safe to use hsl() relative color syntax */\n}\nExamples\nNote:\nYou can find additional examples demonstrating the use of relative color syntax in the different functional notation types on their dedicated pages:\ncolor()\n,\nhsl()\n,\nhwb()\n,\nlab()\n,\nlch()\n,\noklab()\n,\noklch()\n,\nrgb()\n.\nColor palette generator\nThis example allows you to choose a base color and a color palette type. The browser will then show an appropriate palette of colors based on the chosen base color. The color palette choices are as follows:\nComplementary\n: Includes two colors that are at opposite sides of a color wheel, or to put it another way,\nopposite hues\n(see the\n<hue>\ndata type for more information on hues and color wheels). The two colors are defined as a base color, and the base color with hue channel +180 degrees.\nTriadic\n: Includes three colors equal distances apart around the color wheel. The three colors are defined as a base color, base color with hue channel -120 degrees, and base color with hue channel +120 degrees.\nTetradic\n: Includes four colors equal distances apart around the color wheel. The four colors are defined as a base color, and base color with hue channel +90, +180, and +270 degrees.\nMonochrome\n: Includes multiple colors with the same hue but varying lightness values. In our example we've defined five colors in a monochrome palette â\u0080\u0094 base color, and base color with lightness channel -20, -10, +10, and +20.\nHTML\nThe full HTML is included below for reference. The most interesting parts are as follows:\nThe\n--base-color\ncustom property is stored as an inline\nstyle\non the\n<div>\nelement with the ID of\ncontainer\n. We've placed it there so we can update the value using JavaScript. We've provided an initial value of\n#ff0000\n(\nred\n) to show a color palette based on that value when the example loads. Note that normally we'd probably set this on the\n<html>\nelement, but the MDN live sample was removing it when rendering.\nThe base color picker is created using an\n<input type=\"color\">\ncontrol. When a new value is set in this control, the\n--base-color\ncustom property is set to this value using JavaScript, which in turn generates a new color palette. All the displayed colors are relative colors based on\n--base-color\n.\nThe set of\n<input type=\"radio\">\ncontrols enables choosing a color palette type to generate. When a new value is chosen here, JavaScript is used to set a new class on the\ncontainer\n<div>\nto represent the chosen palette. In the CSS, descendant selectors are used to target the child\n<div>\ns (e.g.,\n.comp :nth-child(1)\n) so they can have the correct colors applied to them and hide the unused\n<div>\nnodes.\nThe\ncontainer\n<div>\ncontaining the child\n<div>\ns that display the colors of the generated palette. Note that an initial class of\ncomp\nis set on it, so that the page will display a complementary color scheme when first loaded.\nhtml\n<div>\n  <h1>Color palette generator</h1>\n  <form>\n    <div id=\"color-picker\">\n      <label for=\"color\">Select a base color:</label>\n      <input type=\"color\" id=\"color\" name=\"color\" value=\"#ff0000\" />\n    </div>\n    <div>\n      <fieldset>\n        <legend>Select a color palette type:</legend>\n\n        <div>\n          <input\n            type=\"radio\"\n            id=\"comp\"\n            name=\"palette-type\"\n            value=\"comp\"\n            checked />\n          <label for=\"comp\">Complementary</label>\n        </div>\n\n        <div>\n          <input\n            type=\"radio\"\n            id=\"triadic\"\n            name=\"palette-type\"\n            value=\"triadic\" />\n          <label for=\"triadic\">Triadic</label>\n        </div>\n\n        <div>\n          <input\n            type=\"radio\"\n            id=\"tetradic\"\n            name=\"palette-type\"\n            value=\"tetradic\" />\n          <label for=\"tetradic\">Tetradic</label>\n        </div>\n\n        <div>\n          <input\n            type=\"radio\"\n            id=\"monochrome\"\n            name=\"palette-type\"\n            value=\"monochrome\" />\n          <label for=\"monochrome\">Monochrome</label>\n        </div>\n      </fieldset>\n    </div>\n  </form>\n  <div id=\"container\" class=\"comp\">\n    <div></div>\n    <div></div>\n    <div></div>\n    <div></div>\n    <div></div>\n  </div>\n</div>\nCSS\nBelow we are only showing the CSS that sets the palette colors. Note how, in each case, descendant selectors are used to apply the correct\nbackground-color\nto each child\n<div>\nfor the chosen palette. We care more about the position of the\n<div>\ns in the source order than the type of element, so we have used\n:nth-child\nto target them.\nIn the last rule we've used the\ngeneral sibling selector (\n~\n)\nto target the unused\n<div>\nelements in each palette type, setting\ndisplay: none\nto stop them being rendered.\nThe colors themselves include the\n--base-color\n, plus relative colors derived from that\n--base-color\n. The relative colors use the\nlch()\nfunction â\u0080\u0094 passing in the origin\n--base-color\nand defining an output color with an adjusted lightness or hue channel as appropriate.\nhtml {\n  font-family: sans-serif;\n}\n\nbody {\n  margin: 0;\n}\n\nh1 {\n  margin-left: 16px;\n}\n\n/* Basic form styling */\n\n#color-picker {\n  margin-left: 16px;\n  margin-bottom: 20px;\n}\n\n#color-picker label,\nlegend {\n  display: block;\n  font-size: 0.8rem;\n  margin-bottom: 10px;\n}\n\ninput[type=\"color\"] {\n  width: 200px;\n  display: block;\n}\n\nfieldset {\n  display: flex;\n  gap: 20px;\n  border: 0;\n}\n\n/* Palette container styling */\n\n#container {\n  /* Default value */\n  --base-color: red;\n\n  display: flex;\n  width: 100vw;\n  height: 250px;\n  box-sizing: border-box;\n}\n\n#container div {\n  flex: 1;\n}\ncss\n/* Complementary colors */\n/* Base color, and base color with hue channel +180 degrees */\n\n.comp :nth-child(1) {\n  background-color: var(--base-color);\n}\n\n.comp :nth-child(2) {\n  background-color: lch(from var(--base-color) l c calc(h + 180));\n}\n\n/* Use @supports to add in support old syntax that requires deg units\n   to be specified in hue calculations. This is required for Safari 16.4+. */\n@supports (color: lch(from red l c calc(h + 180deg))) {\n  .comp :nth-child(2) {\n    background-color: lch(from var(--base-color) l c calc(h + 180deg));\n  }\n}\n\n/* Triadic colors */\n/* Base color, base color with hue channel -120 degrees, and base color */\n/* with hue channel +120 degrees */\n\n.triadic :nth-child(1) {\n  background-color: var(--base-color);\n}\n\n.triadic :nth-child(2) {\n  background-color: lch(from var(--base-color) l c calc(h - 120));\n}\n\n.triadic :nth-child(3) {\n  background-color: lch(from var(--base-color) l c calc(h + 120));\n}\n\n/* Use @supports to add in support old syntax that requires deg units\n   to be specified in hue calculations. This is required for Safari 16.4+. */\n@supports (color: lch(from red l c calc(h + 120deg))) {\n  .triadic :nth-child(2) {\n    background-color: lch(from var(--base-color) l c calc(h - 120deg));\n  }\n\n  .triadic :nth-child(3) {\n    background-color: lch(from var(--base-color) l c calc(h + 120deg));\n  }\n}\n\n/* Tetradic colors */\n/* Base color, and base color with hue channel +90, +180, and +270 degrees */\n\n.tetradic :nth-child(1) {\n  background-color: var(--base-color);\n}\n\n.tetradic :nth-child(2) {\n  background-color: lch(from var(--base-color) l c calc(h + 90));\n}\n\n.tetradic :nth-child(3) {\n  background-color: lch(from var(--base-color) l c calc(h + 180));\n}\n\n.tetradic :nth-child(4) {\n  background-color: lch(from var(--base-color) l c calc(h + 270));\n}\n\n/* Use @supports to add in support old syntax that requires deg units\n   to be specified in hue calculations. This is required for Safari 16.4+. */\n@supports (color: lch(from red l c calc(h + 90deg))) {\n  .tetradic :nth-child(2) {\n    background-color: lch(from var(--base-color) l c calc(h + 90deg));\n  }\n\n  .tetradic :nth-child(3) {\n    background-color: lch(from var(--base-color) l c calc(h + 180deg));\n  }\n\n  .tetradic :nth-child(4) {\n    background-color: lch(from var(--base-color) l c calc(h + 270deg));\n  }\n}\n\n/* Monochrome colors */\n/* Base color, and base color with lightness channel -20, -10, +10, and +20 */\n\n.monochrome :nth-child(1) {\n  background-color: lch(from var(--base-color) calc(l - 20) c h);\n}\n\n.monochrome :nth-child(2) {\n  background-color: lch(from var(--base-color) calc(l - 10) c h);\n}\n\n.monochrome :nth-child(3) {\n  background-color: var(--base-color);\n}\n\n.monochrome :nth-child(4) {\n  background-color: lch(from var(--base-color) calc(l + 10) c h);\n}\n\n.monochrome :nth-child(5) {\n  background-color: lch(from var(--base-color) calc(l + 20) c h);\n}\n\n/* Hide unused swatches for each palette type */\n.comp :nth-child(2) ~ div,\n.triadic :nth-child(3) ~ div,\n.tetradic :nth-child(4) ~ div {\n  display: none;\n}\nAn aside on\n@supports\ntesting\nIn the example CSS you'll notice\n@supports\nblocks being used to provide different\nbackground-color\nvalues to browsers that support a previous draft specification of the relative color syntax. These are required because Safari's initial implementation was based on an older version of the spec in which origin color channel values resolved to\n<number>\ns or other unit types depending on the context. This meant that values sometimes required units when performing additions and subtractions, which created confusion. In newer implementations, origin color channel values always resolve to an equivalent\n<number>\nvalue, which means calculations are always done with unitless values.\nNote how the support test in each case is done using any color declaration â\u0080\u0094\ncolor: lch(from red l c calc(h + 90deg))\nfor example â\u0080\u0094 not necessarily the actual value that we need to vary for other browsers. When testing complex values like these, you should use the simplest possible declaration that still contains the syntactic difference you want to test for.\nIncluding a custom property in the\n@supports\ntest doesn't work â\u0080\u0094 the test always comes back as positive regardless of what value the custom property is given. This is because a custom property value only becomes invalid when assigned to be an invalid value (or part of an invalid value) of a regular CSS property. To work around this, in each test we have replaced\nvar(--base-color)\nwith the\nred\nkeyword.\nJavaScript\nIn the JavaScript, we:\nAdd a\nchange\nevent listener to the radio buttons so that when one is selected, the\nsetContainer()\nfunction runs. This function updates the\nclass\nvalue of the\n<div>\nwith\nid=\"container\"\nwith the value of the selected radio button so that the correct background colors will be applied to the child\n<div>\ns for the chosen palette type.\nAdd an\ninput\nevent listener to the color picker control so that when a new color is selected, the\nsetBaseColor()\nfunction runs. This function sets the\n--base-color\ncustom property's value to the new color.\njs\nconst form = document.forms[0];\nconst radios = form.elements[\"palette-type\"];\nconst colorPicker = form.elements[\"color\"];\nconst containerElem = document.getElementById(\"container\");\n\nfor (const radio of radios) {\n  radio.addEventListener(\"change\", setContainer);\n}\n\ncolorPicker.addEventListener(\"input\", setBaseColor);\n\nfunction setContainer(e) {\n  const palType = e.target.value;\n  console.log(\"radio changed\");\n  containerElem.setAttribute(\"class\", palType);\n}\n\nfunction setBaseColor(e) {\n  console.log(\"color changed\");\n  containerElem.style.setProperty(\"--base-color\", e.target.value);\n}\nResults\nThe output is as follows. This starts to show the power of relative CSS colors â\u0080\u0094 we are defining multiple colors and generating palettes that are updated live by adjusting a single custom property.\nLive UI color scheme updater\nThis example shows a card containing a heading and text, but with a twist â\u0080\u0094 below the card is a slider (\n<input type=\"range\">\n) control. When its value is changed, JavaScript is used to set a\n--hue\ncustom property value to the new slider value.\nThis in turn adjusts the color scheme for the entire UI:\nThe\n--base-color\nvalue is a relative color with its hue channel set to the value of\n--hue\n.\nThe other colors used in the design are relative colors based on\n--base-color\n. As a result, they change when the\n--base-color\nchanges.\nHTML\nThe HTML for the example is shown below.\nThe\n<main>\nelement acts as an outer wrapper to contain the rest of the content, allowing the card and form to be centered vertically and horizontally inside\n<main>\nas one unit.\nThe\n<section>\nelement contains the\n<h1>\nand\n<p>\nelements that define the card's content.\nThe\n<form>\nelement contains the (\n<input type=\"range\">\n) control and its\n<label>\n.\nhtml\n<main>\n  <section>\n    <h1>A love of colors</h1>\n    <p>\n      Colors, the vibrant essence of our surroundings, are truly awe-inspiring.\n      From the fiery warmth of reds to the calming coolness of blues, they bring\n      unparalleled richness to our world. Colors stir emotions, ignite\n      creativity, and shape perceptions, acting as a universal language of\n      expression. In their brilliance, colors create a visually enchanting\n      tapestry that invites admiration and sparks joy.\n    </p>\n  </section>\n  <form>\n    <label for=\"hue-adjust\">Adjust the hue:</label>\n    <input\n      type=\"range\"\n      name=\"hue-adjust\"\n      id=\"hue-adjust\"\n      value=\"240\"\n      min=\"0\"\n      max=\"360\" />\n  </form>\n</main>\nCSS\nIn the CSS the\n:root\nhas a default\n--hue\nvalue set on it, relative\nlch()\ncolors to define the color scheme, plus a radial gradient that fills the whole body.\nThe relative colors are as follows:\n--base-color\n: The base color takes an origin color of\nred\n(although any full color would do) and adjusts its hue value to the value set in the\n--hue\ncustom property.\n--bg-color\n: A much lighter variant of\n--base-color\n, intended to be used as a background. This is created by taking an origin color of\n--base-color\nand adding 40 to its lightness value.\n--complementary-color\n: A complementary color 180 degrees around the color wheel from\n--base-color\n. This is created by taking an origin color of\n--base-color\nand adding 180 to its hue value.\nNow have a look at the rest of the CSS and take note of all the places where these colors are used. This includes\nbackgrounds\n,\nborders\n,\ntext-shadow\n, and even the\naccent-color\nof the slider.\nNote:\nFor brevity, only the parts of the CSS relevant to relative color usage are shown.\nhtml {\n  font-family: sans-serif;\n}\n\nmain {\n  width: 80vw;\n  margin: 2rem auto;\n}\n\nh1 {\n  text-align: center;\n  margin: 0;\n  color: black;\n  border-radius: 16px 16px 0 0;\n  font-size: 3rem;\n  letter-spacing: -1px;\n}\n\np {\n  line-height: 1.5;\n  margin: 0;\n  padding: 1.2rem;\n}\n\nform {\n  width: fit-content;\n  display: flex;\n  margin: 2rem auto;\n  padding: 0.4rem;\n}\ncss\n:root {\n  /* Default hue value */\n  --hue: 240;\n\n  /* Relative color definitions */\n  --base-color: lch(from red l c var(--hue));\n  --bg-color: lch(from var(--base-color) calc(l + 40) c h);\n  --complementary-color: lch(from var(--base-color) l c calc(h + 180));\n\n  background: radial-gradient(ellipse at center, white 20%, var(--base-color));\n}\n\n/* Use @supports to add in support for --complementary-color with old\n   syntax that requires deg units to be specified in hue calculations.\n   This is required for in Safari 16.4+. */\n@supports (color: lch(from red l c calc(h + 180deg))) {\n  body {\n    --complementary-color: lch(from var(--base-color) l c calc(h + 180deg));\n  }\n}\n\n/* Box styling */\n\nsection {\n  background-color: var(--bg-color);\n  border: 3px solid var(--base-color);\n  border-radius: 20px;\n  box-shadow: 10px 10px 30px rgb(0 0 0 / 0.5);\n}\n\nh1 {\n  background-color: var(--base-color);\n  text-shadow:\n    1px 1px 1px var(--complementary-color),\n    -1px -1px 1px var(--complementary-color),\n    0 0 3px var(--complementary-color);\n}\n\n/* Range slider styling */\n\nform {\n  background-color: var(--bg-color);\n  border: 3px solid var(--base-color);\n}\n\ninput {\n  accent-color: var(--complementary-color);\n}\nJavaScript\nThe JavaScript adds an\ninput\nevent listener to the slider control so that when a new value is set, the\nsetHue()\nfunction runs. This function sets a new inline\n--hue\ncustom property value on the\n:root\n(the\n<html>\nelement) that overrides the original default value we set in our CSS.\njs\nconst rootElem = document.querySelector(\":root\");\nconst slider = document.getElementById(\"hue-adjust\");\n\nslider.addEventListener(\"input\", setHue);\n\nfunction setHue(e) {\n  rootElem.style.setProperty(\"--hue\", e.target.value);\n}\nResults\nThe output is shown below. Relative CSS colors are being used here to control the color scheme of an entire UI, which can be adjusted live as a single value is modified.\nSee also\nThe\n<color>\ndata type\nCSS colors\nmodule\nsRGB\non Wikipedia\nCIELAB\non Wikipedia\nCSS relative color syntax\non developer.chrome.com (2023)\nHelp improve MDN\nLearn how to contribute\nThis page was last modified on\nDec 16, 2025\nby\nMDN contributors\n.\nView this page on GitHub\nâ\u0080¢\nReport a problem with this content",
  "content_markdown": "# Using relative colors\n\nThe [CSS colors module](/en-US/docs/Web/CSS/Guides/Colors) defines **relative color syntax**, which allows a CSS [`<color>`](/en-US/docs/Web/CSS/Reference/Values/color_value) value to be defined relative to another color. This is a powerful feature that enables the programmatic creation of complements to existing colors â\u0080\u0094 such as lighter, darker, saturated, semi-transparent, or inverted variants â\u0080\u0094 enabling more effective color palette creation.\n\nThis article explains relative color syntax, shows what the different options are, and looks at some illustrative examples.\n\n## [General syntax](#general_syntax)\n\nA relative CSS color value has the following general syntax structure:\n\ncss\n\n```\ncolor-function(from origin-color channel1 channel2 channel3)\ncolor-function(from origin-color channel1 channel2 channel3 / alpha)\n\n/* color space included in the case of color() functions */\ncolor(from origin-color colorspace channel1 channel2 channel3)\ncolor(from origin-color colorspace channel1 channel2 channel3 / alpha)\n```\n\nRelative colors are created using the same [color functions](/en-US/docs/Web/CSS/Guides/Colors#functions) as absolute colors, but with different parameters:\n\n1. Include a basic color function (represented by *`color-function()`* above) such as [`rgb()`](/en-US/docs/Web/CSS/Reference/Values/color_value/rgb), [`hsl()`](/en-US/docs/Web/CSS/Reference/Values/color_value/hsl), etc. Which one you pick depends on the color model you want to use for the relative color you are creating (the **output color**).\n2. Pass in the **origin color** (represented above by *`origin-color`*) your relative color will be based on, preceded by the `from` keyword. This can be any valid [`<color>`](/en-US/docs/Web/CSS/Reference/Values/color_value) value using any available color model including a color value contained in a [CSS custom property](/en-US/docs/Web/CSS/Guides/Cascading_variables/Using_custom_properties), system colors, `currentColor`, or even another relative color.\n3. In the case of the [`color()`](/en-US/docs/Web/CSS/Reference/Values/color_value/color) function, include the *[`colorspace`](/en-US/docs/Web/CSS/Reference/Values/color_value/color#colorspace)* of the output color.\n4. Provide an output value for each individual channel. The output color is defined after the origin color â\u0080\u0094 represented above by the *`channel1`*, *`channel2`*, and *`channel3`* placeholders. The channels defined here depend on the [color function](/en-US/docs/Web/CSS/Guides/Colors#functions) you are using for your relative color. For example, if you are using [`hsl()`](/en-US/docs/Web/CSS/Reference/Values/color_value/hsl), you would need to define the values for hue, saturation, and lightness. Each channel value can be a new value, the same as the original value, or a value relative to the channel value of the origin color.\n5. Optionally, an `alpha` channel value of type [`<alpha-value>`](/en-US/docs/Web/CSS/Reference/Values/alpha-value) for the output color can be defined, preceded by a slash (`/`). If the `alpha` channel value is not explicitly specified, it defaults to the alpha channel value of the *`origin-color`* (not 100%, which is the case for absolute color values).\n\nThe browser converts the origin color to a syntax compatible with the color function then destructures it into component color channels (plus the `alpha` channel if the origin color has one). These are made available as appropriately-named values inside the color function â\u0080\u0094 `r`, `g`, `b`, and `alpha` in the case of the `rgb()` function, `l`, `a`, `b`, and `alpha` in the case of the `lab()` function, `h`, `w`, `b`, and `alpha` in the case of `hwb()`, etc. â\u0080\u0094 that can be used to calculate new output channel values.\n\nLet's look at relative color syntax in action. The below CSS is used to style two [`<div>`](/en-US/docs/Web/HTML/Reference/Elements/div) elements, one with an absolute background color â\u0080\u0094 `red` â\u0080\u0094 and one with a relative background color created with the `rgb()` function, based on the same `red` color value:\n\n```\n<div id=\"container\">\n  <div class=\"item\" id=\"one\"></div>\n  <div class=\"item\" id=\"two\"></div>\n</div>\n```\n\n```\n#container {\n  display: flex;\n  width: 100vw;\n  height: 100vh;\n  box-sizing: border-box;\n}\n\n.item {\n  flex: 1;\n  margin: 20px;\n}\n```\n\ncss\n\n```\n#one {\n  background-color: red;\n}\n\n#two {\n  background-color: rgb(from red 200 g b / alpha);\n}\n```\n\nThe output is as follows:\n\nThe relative color uses the [`rgb()`](/en-US/docs/Web/CSS/Reference/Values/color_value/rgb) function, which takes `red` as the origin color, converts it to an equivalent `rgb()` color (`rgb(255 0 0)`) and then defines the new color as having a red channel of value `200` and green, blue and alpha channels with a value the same as the origin color (it uses the `g` and `b` values made available inside the function by the browser, which are both equal to `0`, and the `alpha` is `100%`).\n\nThis results in an output of `rgb(200 0 0)` â\u0080\u0094 a slightly darker red. If we had specified a red channel value of `255` (or just the `r` value), the resulting output color would be exactly the same as the input value. The browser's final output color (the computed value) is an sRGB `color()` value equivalent to `rgb(200 0 0)` â\u0080\u0094 `color(srgb 0.784314 0 0)`.\n\n**Note:**\nAs mentioned above, when calculating a relative color the first thing the browser does is to convert the provided origin color (`red` in the above example) into a value compatible with the color function being used (in this case, `rgb()`). This is done so that the browser is able to calculate the output color from the origin color. While the calculations are performed relative to the color function used, the actual output color value depends on the color's color space:\n\n- Older sRGB color functions cannot express the full spectrum of visible colors. The output colors of ([`hsl()`](/en-US/docs/Web/CSS/Reference/Values/color_value/hsl), [`hwb()`](/en-US/docs/Web/CSS/Reference/Values/color_value/hwb), and [`rgb()`](/en-US/docs/Web/CSS/Reference/Values/color_value/rgb)) are serialized to `color(srgb)` to avoid these limitations. That means that querying the output color value via the [`HTMLElement.style`](/en-US/docs/Web/API/HTMLElement/style) property or the [`CSSStyleDeclaration.getPropertyValue()`](/en-US/docs/Web/API/CSSStyleDeclaration/getPropertyValue) method returns the output color as a [`color(srgb ...)`](/en-US/docs/Web/CSS/Reference/Values/color_value/color) value.\n- For more recent color functions (`lab()`, `oklab()`, `lch()`, and `oklch()`), relative color output values are expressed in the same syntax as the color function used. For example, if a [`lab()`](/en-US/docs/Web/CSS/Reference/Values/color_value/lab) color function is being used, the output color will be a `lab()` value.\n\nAll the following lines produce an equivalent output color:\n\ncss\n\n```\nred\nrgb(255 0 0)\nrgb(from red 255 0 0)\nrgb(from red 255 0 0 / 1)\nrgb(from red 255 0 0 / 100%)\n\nrgb(from red 255 g b)\nrgb(from red r 0 0)\nrgb(from red r g b / 1)\nrgb(from red r g b / 100%)\n\nrgb(from red r g b)\nrgb(from red r g b / alpha)\n\n/* With `red`, the g and b are the same, making them interchangeable */\nrgb(from red r g g)\nrgb(from red r b b)\nrgb(from red 255 g g)\nrgb(from red 255 b b)\n```\n\n## [Syntax flexibility](#syntax_flexibility)\n\nThere is an important distinction to be made between the destructured origin color channel values made available in the function, and the channel values of the output color set by the developer.\n\nTo reiterate, when a relative color is defined, the channel values of the origin color are made available in the function to use when defining the output color channel values. The following example defines a relative color using an `rgb()` function and uses the origin color channel values (made available as `r`, `g`, and `b`) for the output channel values, meaning that the output color is the same as the origin color:\n\ncss\n\n```\nrgb(from red r g b)\n```\n\nHowever, when specifying the output values, you don't need to use the origin color channel values at all. You need to provide the output channel values in the right order (e.g., red, then green, then blue in the case of `rgb()`), but they can be any values you wish provided they are valid values for those channels. This gives relative CSS colors a high degree of flexibility.\n\nFor example, if you wanted to, you could specify absolute values like those shown below, transforming `red` into `blue`:\n\ncss\n\n```\nrgb(from red 0 0 255)\n/* output color is equivalent to rgb(0 0 255), full blue */\n```\n\n**Note:**\nIf you are using relative color syntax but outputting the same color as the origin color or a color not based on the origin color at all, you are not really creating a relative color. You'd be unlikely to ever do this in a real codebase, and would probably just use an absolute color value instead. But, we felt it useful to explain that you *can* do this with relative color syntax, as a starting point for learning about it.\n\nYou can even mix up or repeat the provided values. The following takes a slightly darker red as an input and outputs a light gray color â\u0080\u0094 the output color's `r`, `g`, and `b` channels are all set to the origin color's `r` channel value:\n\ncss\n\n```\nrgb(from rgb(200 0 0) r r r)\n/* output color is equivalent to rgb(200 200 200), light gray */\n```\n\nThe following uses the origin color's channel values for the output color's `r`, `g`, and `b` channel values, but in reverse order:\n\ncss\n\n```\nrgb(from rgb(200 170 0) b g r)\n/* output color is equivalent to rgb(0 170 200) */\n```\n\n## [Color functions that support relative colors](#color_functions_that_support_relative_colors)\n\nIn the section above we only saw relative colors defined via the [`rgb()`](/en-US/docs/Web/CSS/Reference/Values/color_value/rgb) function. However, relative colors can be defined using any modern CSS color function â\u0080\u0094 [`color()`](/en-US/docs/Web/CSS/Reference/Values/color_value/color), [`hsl()`](/en-US/docs/Web/CSS/Reference/Values/color_value/hsl), [`hwb()`](/en-US/docs/Web/CSS/Reference/Values/color_value/hwb), [`lab()`](/en-US/docs/Web/CSS/Reference/Values/color_value/lab), [`lch()`](/en-US/docs/Web/CSS/Reference/Values/color_value/lch), [`oklab()`](/en-US/docs/Web/CSS/Reference/Values/color_value/oklab), [`oklch()`](/en-US/docs/Web/CSS/Reference/Values/color_value/oklch), or [`rgb()`](/en-US/docs/Web/CSS/Reference/Values/color_value/rgb). The general syntax structure is the same in each case, although the origin color values have different names appropriate for the function being used.\n\nBelow you can find relative color syntax examples for each color function. Each case is the simplest possible, with the output color channel values exactly matching the origin color channel values:\n\ncss\n\n```\n/* color() with and without alpha channel */\ncolor(from red a98-rgb r g b)\ncolor(from red a98-rgb r g b / alpha)\n\ncolor(from red xyz-d50 x y z)\ncolor(from red xyz-d50 x y z / alpha)\n\n/* hsl() with and without alpha channel */\nhsl(from red h s l)\nhsl(from red h s l / alpha)\n\n/* hwb() with and without alpha channel */\nhwb(from red h w b)\nhwb(from red h w b / alpha)\n\n/* lab() with and without alpha channel */\nlab(from red l a b)\nlab(from red l a b / alpha)\n\n/* lch() with and without alpha channel */\nlch(from red l c h)\nlch(from red l c h / alpha)\n\n/* oklab() with and without alpha channel */\noklab(from red l a b)\noklab(from red l a b / alpha)\n\n/* oklch() with and without alpha channel */\noklch(from red l c h)\noklch(from red l c h / alpha)\n\n/* rgb() with and without alpha channel */\nrgb(from red r g b)\nrgb(from red r g b / alpha)\n```\n\nIt is worth mentioning again that the color system of the origin color doesn't need to match the color system being used to create the output color. Again, this provides a lot of flexibility. Generally you won't be interested in and might not even know the system the origin color is defined in (you might just have a [custom property value](#using_custom_properties) to manipulate). You'll just want to input a color and, for example, create a lighter variant of it by putting it into an `hsl()` function and varying the lightness value.\n\n## [Using custom properties](#using_custom_properties)\n\nWhen creating a relative color, you can use values defined in [CSS custom properties](/en-US/docs/Web/CSS/Guides/Cascading_variables/Using_custom_properties) both for the origin color and within the output color channel value definitions. Let's look at an example.\n\nIn the below CSS we define two custom properties:\n\n- `--base-color` contains our base brand color â\u0080\u0094 `purple`. Here we are using a named color keyword, but relative colors can accept any color syntax for the origin color.\n- `--standard-opacity` contains the standard brand opacity value that we want to apply to semi-transparent boxes â\u0080\u0094 `0.75`.\n\nWe then give two [`<div>`](/en-US/docs/Web/HTML/Reference/Elements/div) elements a background color. One is given an absolute color â\u0080\u0094 our `--base-color` brand purple. The other one is given a relative color equal to our brand purple, transformed to add an alpha channel equal to our standard opacity value.\n\n```\n<div id=\"container\">\n  <div class=\"item\" id=\"one\"></div>\n  <div class=\"item\" id=\"two\"></div>\n</div>\n```\n\n```\n#container {\n  display: flex;\n  width: 100vw;\n  height: 100vh;\n  box-sizing: border-box;\n  background-image: repeating-linear-gradient(\n    45deg,\n    white,\n    white 24px,\n    black 25px,\n    black 50px\n  );\n}\n\n.item {\n  flex: 1;\n  margin: 20px;\n}\n```\n\ncss\n\n```\n:root {\n  --base-color: purple;\n  --standard-opacity: 0.75;\n}\n\n#one {\n  background-color: var(--base-color);\n}\n\n#two {\n  background-color: hwb(from var(--base-color) h w b / var(--standard-opacity));\n}\n```\n\nThe output is as follows:\n\n## [Using math functions](#using_math_functions)\n\nYou can use CSS [math functions](/en-US/docs/Web/CSS/Reference/Values/Functions#math_functions) such as [`calc()`](/en-US/docs/Web/CSS/Reference/Values/calc) to calculate values for the output color channels. Let's look at an example.\n\nThe below CSS is used to style three [`<div>`](/en-US/docs/Web/HTML/Reference/Elements/div) elements with different background colors. The middle one is given an unmodified `--base-color`, while the left and right ones are given lightened and darkened variants of that `--base-color`. These variants are defined using relative colors â\u0080\u0094 the `--base-color` is passed into an `lch()` function, and the output color has its lightness channel modified to achieve the desired effect via a `calc()` function. The lightened color has 20% added to the lightness channel, and the darkened color has 20% subtracted from it.\n\n```\n<div id=\"container\">\n  <div class=\"item\" id=\"one\"></div>\n  <div class=\"item\" id=\"two\"></div>\n  <div class=\"item\" id=\"three\"></div>\n</div>\n```\n\n```\n#container {\n  display: flex;\n  width: 100vw;\n  height: 100vh;\n  box-sizing: border-box;\n}\n\n.item {\n  flex: 1;\n  margin: 20px;\n}\n```\n\ncss\n\n```\n:root {\n  --base-color: orange;\n}\n\n#one {\n  background-color: lch(from var(--base-color) calc(l + 20) c h);\n}\n\n#two {\n  background-color: var(--base-color);\n}\n\n#three {\n  background-color: lch(from var(--base-color) calc(l - 20) c h);\n}\n```\n\nThe output is as follows:\n\n## [Manipulating the alpha channel](#manipulating_the_alpha_channel)\n\nThis example demonstrates changing the alpha channel of a named color. Here, we have an item wrapped in a container that both have a `teal` background. To distinguish between the backgrounds, we vary the alpha channel value using the relative color feature, the [`calc()` function](/en-US/docs/Web/CSS/Reference/Values/calc), and a [custom property](/en-US/docs/Web/CSS/Reference/Properties/--*).\n\nhtml\n\n```\n<div class=\"container\">\n  <div class=\"item\"></div>\n</div>\n```\n\n```\n.container {\n  padding: 60px;\n}\n\n.item {\n  height: 60px;\n}\n```\n\ncss\n\n```\ndiv {\n  background-color: rgb(\n    from teal r g b / calc(alpha * var(--alpha-multiplier))\n  );\n}\n\n.container {\n  --alpha-multiplier: 0.3;\n}\n\n.item {\n  --alpha-multiplier: 1;\n}\n```\n\nThe alpha channel is referenced using the `alpha` keyword. In this case, the `calc(alpha * var(--alpha-multiplier))` expression modifies the alpha channel value by multiplying `alpha` with the `--alpha-multiplier` custom property value. The container gets a semitransparent background because of the multiplier of `0.3` is less than `1.0`.\n\nThe output is as follows:\n\n## [Channel values resolve to `<number>` values](#channel_values_resolve_to_number_values)\n\nTo make channel value calculations work in relative colors, all origin color channel values resolve to appropriate [`<number>`](/en-US/docs/Web/CSS/Reference/Values/number) values. For example, in the `lch()` examples above, we are calculating new lightness values by adding or subtracting numbers from the origin color's `l` channel value. If we tried to do `calc(l + 20%)`, that would result in an invalid color â\u0080\u0094 `l` is a `<number>` and cannot have a [`<percentage>`](/en-US/docs/Web/CSS/Reference/Values/percentage) added to it.\n\n- Channel values originally specified as a `<percentage>` resolve to a `<number>` appropriate for the output color function.\n- Channel values originally specified as a [`<hue>`](/en-US/docs/Web/CSS/Reference/Values/hue) angle resolve to a number of degrees in a range of `0` to `360`, inclusive.\n\nCheck the different [color function pages](/en-US/docs/Web/CSS/Guides/Colors#functions) for the specifics of what their origin channel values resolve to.\n\n## [Checking for browser support](#checking_for_browser_support)\n\nYou can check that a browser supports relative color syntax by running it through a [`@supports`](/en-US/docs/Web/CSS/Reference/At-rules/@supports) at-rule.\n\nFor example:\n\ncss\n\n```\n@supports (color: hsl(from white h s l)) {\n  /* safe to use hsl() relative color syntax */\n}\n```\n\n## [Examples](#examples)\n\n**Note:**\nYou can find additional examples demonstrating the use of relative color syntax in the different functional notation types on their dedicated pages: [`color()`](/en-US/docs/Web/CSS/Reference/Values/color_value/color#using_relative_colors_with_color), [`hsl()`](/en-US/docs/Web/CSS/Reference/Values/color_value/hsl#using_relative_colors_with_hsl), [`hwb()`](/en-US/docs/Web/CSS/Reference/Values/color_value/hwb#using_relative_colors_with_hwb), [`lab()`](/en-US/docs/Web/CSS/Reference/Values/color_value/lab#using_relative_colors_with_lab), [`lch()`](/en-US/docs/Web/CSS/Reference/Values/color_value/lch#using_relative_colors_with_lch), [`oklab()`](/en-US/docs/Web/CSS/Reference/Values/color_value/oklab#using_relative_colors_with_oklab), [`oklch()`](/en-US/docs/Web/CSS/Reference/Values/color_value/oklch#using_relative_colors_with_oklch), [`rgb()`](/en-US/docs/Web/CSS/Reference/Values/color_value/rgb#using_relative_colors_with_rgb).\n\n### [Color palette generator](#color_palette_generator)\n\nThis example allows you to choose a base color and a color palette type. The browser will then show an appropriate palette of colors based on the chosen base color. The color palette choices are as follows:\n\n- **Complementary**: Includes two colors that are at opposite sides of a color wheel, or to put it another way, *opposite hues* (see the [`<hue>`](/en-US/docs/Web/CSS/Reference/Values/hue) data type for more information on hues and color wheels). The two colors are defined as a base color, and the base color with hue channel +180 degrees.\n- **Triadic**: Includes three colors equal distances apart around the color wheel. The three colors are defined as a base color, base color with hue channel -120 degrees, and base color with hue channel +120 degrees.\n- **Tetradic**: Includes four colors equal distances apart around the color wheel. The four colors are defined as a base color, and base color with hue channel +90, +180, and +270 degrees.\n- **Monochrome**: Includes multiple colors with the same hue but varying lightness values. In our example we've defined five colors in a monochrome palette â\u0080\u0094 base color, and base color with lightness channel -20, -10, +10, and +20.\n\n#### HTML\n\nThe full HTML is included below for reference. The most interesting parts are as follows:\n\n- The `--base-color` custom property is stored as an inline [`style`](/en-US/docs/Web/HTML/Reference/Global_attributes/style) on the [`<div>`](/en-US/docs/Web/HTML/Reference/Elements/div) element with the ID of `container`. We've placed it there so we can update the value using JavaScript. We've provided an initial value of `#ff0000` (`red`) to show a color palette based on that value when the example loads. Note that normally we'd probably set this on the [`<html>`](/en-US/docs/Web/HTML/Reference/Elements/html) element, but the MDN live sample was removing it when rendering.\n- The base color picker is created using an [`<input type=\"color\">`](/en-US/docs/Web/HTML/Reference/Elements/input/color) control. When a new value is set in this control, the `--base-color` custom property is set to this value using JavaScript, which in turn generates a new color palette. All the displayed colors are relative colors based on `--base-color`.\n- The set of [`<input type=\"radio\">`](/en-US/docs/Web/HTML/Reference/Elements/input/radio) controls enables choosing a color palette type to generate. When a new value is chosen here, JavaScript is used to set a new class on the `container` `<div>` to represent the chosen palette. In the CSS, descendant selectors are used to target the child `<div>`s (e.g., `.comp :nth-child(1)`) so they can have the correct colors applied to them and hide the unused `<div>` nodes.\n- The `container` `<div>` containing the child `<div>`s that display the colors of the generated palette. Note that an initial class of `comp` is set on it, so that the page will display a complementary color scheme when first loaded.\n\nhtml\n\n```\n<div>\n  <h1>Color palette generator</h1>\n  <form>\n    <div id=\"color-picker\">\n      <label for=\"color\">Select a base color:</label>\n      <input type=\"color\" id=\"color\" name=\"color\" value=\"#ff0000\" />\n    </div>\n    <div>\n      <fieldset>\n        <legend>Select a color palette type:</legend>\n\n        <div>\n          <input\n            type=\"radio\"\n            id=\"comp\"\n            name=\"palette-type\"\n            value=\"comp\"\n            checked />\n          <label for=\"comp\">Complementary</label>\n        </div>\n\n        <div>\n          <input\n            type=\"radio\"\n            id=\"triadic\"\n            name=\"palette-type\"\n            value=\"triadic\" />\n          <label for=\"triadic\">Triadic</label>\n        </div>\n\n        <div>\n          <input\n            type=\"radio\"\n            id=\"tetradic\"\n            name=\"palette-type\"\n            value=\"tetradic\" />\n          <label for=\"tetradic\">Tetradic</label>\n        </div>\n\n        <div>\n          <input\n            type=\"radio\"\n            id=\"monochrome\"\n            name=\"palette-type\"\n            value=\"monochrome\" />\n          <label for=\"monochrome\">Monochrome</label>\n        </div>\n      </fieldset>\n    </div>\n  </form>\n  <div id=\"container\" class=\"comp\">\n    <div></div>\n    <div></div>\n    <div></div>\n    <div></div>\n    <div></div>\n  </div>\n</div>\n```\n\n#### CSS\n\nBelow we are only showing the CSS that sets the palette colors. Note how, in each case, descendant selectors are used to apply the correct [`background-color`](/en-US/docs/Web/CSS/Reference/Properties/background-color) to each child `<div>` for the chosen palette. We care more about the position of the `<div>`s in the source order than the type of element, so we have used [`:nth-child`](/en-US/docs/Web/CSS/Reference/Selectors/:nth-child) to target them.\n\nIn the last rule we've used the [general sibling selector (`~`)](/en-US/docs/Web/CSS/Reference/Selectors/Subsequent-sibling_combinator) to target the unused `<div>` elements in each palette type, setting [`display: none`](/en-US/docs/Web/CSS/Reference/Selectors/Subsequent-sibling_combinator) to stop them being rendered.\n\nThe colors themselves include the `--base-color`, plus relative colors derived from that `--base-color`. The relative colors use the [`lch()`](/en-US/docs/Web/CSS/Reference/Values/color_value/lch) function â\u0080\u0094 passing in the origin `--base-color` and defining an output color with an adjusted lightness or hue channel as appropriate.\n\n```\nhtml {\n  font-family: sans-serif;\n}\n\nbody {\n  margin: 0;\n}\n\nh1 {\n  margin-left: 16px;\n}\n\n/* Basic form styling */\n\n#color-picker {\n  margin-left: 16px;\n  margin-bottom: 20px;\n}\n\n#color-picker label,\nlegend {\n  display: block;\n  font-size: 0.8rem;\n  margin-bottom: 10px;\n}\n\ninput[type=\"color\"] {\n  width: 200px;\n  display: block;\n}\n\nfieldset {\n  display: flex;\n  gap: 20px;\n  border: 0;\n}\n\n/* Palette container styling */\n\n#container {\n  /* Default value */\n  --base-color: red;\n\n  display: flex;\n  width: 100vw;\n  height: 250px;\n  box-sizing: border-box;\n}\n\n#container div {\n  flex: 1;\n}\n```\n\ncss\n\n```\n/* Complementary colors */\n/* Base color, and base color with hue channel +180 degrees */\n\n.comp :nth-child(1) {\n  background-color: var(--base-color);\n}\n\n.comp :nth-child(2) {\n  background-color: lch(from var(--base-color) l c calc(h + 180));\n}\n\n/* Use @supports to add in support old syntax that requires deg units\n   to be specified in hue calculations. This is required for Safari 16.4+. */\n@supports (color: lch(from red l c calc(h + 180deg))) {\n  .comp :nth-child(2) {\n    background-color: lch(from var(--base-color) l c calc(h + 180deg));\n  }\n}\n\n/* Triadic colors */\n/* Base color, base color with hue channel -120 degrees, and base color */\n/* with hue channel +120 degrees */\n\n.triadic :nth-child(1) {\n  background-color: var(--base-color);\n}\n\n.triadic :nth-child(2) {\n  background-color: lch(from var(--base-color) l c calc(h - 120));\n}\n\n.triadic :nth-child(3) {\n  background-color: lch(from var(--base-color) l c calc(h + 120));\n}\n\n/* Use @supports to add in support old syntax that requires deg units\n   to be specified in hue calculations. This is required for Safari 16.4+. */\n@supports (color: lch(from red l c calc(h + 120deg))) {\n  .triadic :nth-child(2) {\n    background-color: lch(from var(--base-color) l c calc(h - 120deg));\n  }\n\n  .triadic :nth-child(3) {\n    background-color: lch(from var(--base-color) l c calc(h + 120deg));\n  }\n}\n\n/* Tetradic colors */\n/* Base color, and base color with hue channel +90, +180, and +270 degrees */\n\n.tetradic :nth-child(1) {\n  background-color: var(--base-color);\n}\n\n.tetradic :nth-child(2) {\n  background-color: lch(from var(--base-color) l c calc(h + 90));\n}\n\n.tetradic :nth-child(3) {\n  background-color: lch(from var(--base-color) l c calc(h + 180));\n}\n\n.tetradic :nth-child(4) {\n  background-color: lch(from var(--base-color) l c calc(h + 270));\n}\n\n/* Use @supports to add in support old syntax that requires deg units\n   to be specified in hue calculations. This is required for Safari 16.4+. */\n@supports (color: lch(from red l c calc(h + 90deg))) {\n  .tetradic :nth-child(2) {\n    background-color: lch(from var(--base-color) l c calc(h + 90deg));\n  }\n\n  .tetradic :nth-child(3) {\n    background-color: lch(from var(--base-color) l c calc(h + 180deg));\n  }\n\n  .tetradic :nth-child(4) {\n    background-color: lch(from var(--base-color) l c calc(h + 270deg));\n  }\n}\n\n/* Monochrome colors */\n/* Base color, and base color with lightness channel -20, -10, +10, and +20 */\n\n.monochrome :nth-child(1) {\n  background-color: lch(from var(--base-color) calc(l - 20) c h);\n}\n\n.monochrome :nth-child(2) {\n  background-color: lch(from var(--base-color) calc(l - 10) c h);\n}\n\n.monochrome :nth-child(3) {\n  background-color: var(--base-color);\n}\n\n.monochrome :nth-child(4) {\n  background-color: lch(from var(--base-color) calc(l + 10) c h);\n}\n\n.monochrome :nth-child(5) {\n  background-color: lch(from var(--base-color) calc(l + 20) c h);\n}\n\n/* Hide unused swatches for each palette type */\n.comp :nth-child(2) ~ div,\n.triadic :nth-child(3) ~ div,\n.tetradic :nth-child(4) ~ div {\n  display: none;\n}\n```\n\n##### An aside on `@supports` testing\n\nIn the example CSS you'll notice [`@supports`](/en-US/docs/Web/CSS/Reference/At-rules/@supports) blocks being used to provide different [`background-color`](/en-US/docs/Web/CSS/Reference/Properties/background-color) values to browsers that support a previous draft specification of the relative color syntax. These are required because Safari's initial implementation was based on an older version of the spec in which origin color channel values resolved to [`<number>`](/en-US/docs/Web/CSS/Reference/Values/number)s or other unit types depending on the context. This meant that values sometimes required units when performing additions and subtractions, which created confusion. In newer implementations, origin color channel values always resolve to an equivalent [`<number>`](/en-US/docs/Web/CSS/Reference/Values/number) value, which means calculations are always done with unitless values.\n\nNote how the support test in each case is done using any color declaration â\u0080\u0094 `color: lch(from red l c calc(h + 90deg))` for example â\u0080\u0094 not necessarily the actual value that we need to vary for other browsers. When testing complex values like these, you should use the simplest possible declaration that still contains the syntactic difference you want to test for.\n\nIncluding a custom property in the `@supports` test doesn't work â\u0080\u0094 the test always comes back as positive regardless of what value the custom property is given. This is because a custom property value only becomes invalid when assigned to be an invalid value (or part of an invalid value) of a regular CSS property. To work around this, in each test we have replaced `var(--base-color)` with the `red` keyword.\n\n#### JavaScript\n\nIn the JavaScript, we:\n\n- Add a [`change`](/en-US/docs/Web/API/HTMLElement/change_event) event listener to the radio buttons so that when one is selected, the `setContainer()` function runs. This function updates the `class` value of the `<div>` with `id=\"container\"` with the value of the selected radio button so that the correct background colors will be applied to the child `<div>`s for the chosen palette type.\n- Add an [`input`](/en-US/docs/Web/API/Element/input_event) event listener to the color picker control so that when a new color is selected, the `setBaseColor()` function runs. This function sets the `--base-color` custom property's value to the new color.\n\njs\n\n```\nconst form = document.forms[0];\nconst radios = form.elements[\"palette-type\"];\nconst colorPicker = form.elements[\"color\"];\nconst containerElem = document.getElementById(\"container\");\n\nfor (const radio of radios) {\n  radio.addEventListener(\"change\", setContainer);\n}\n\ncolorPicker.addEventListener(\"input\", setBaseColor);\n\nfunction setContainer(e) {\n  const palType = e.target.value;\n  console.log(\"radio changed\");\n  containerElem.setAttribute(\"class\", palType);\n}\n\nfunction setBaseColor(e) {\n  console.log(\"color changed\");\n  containerElem.style.setProperty(\"--base-color\", e.target.value);\n}\n```\n\n#### Results\n\nThe output is as follows. This starts to show the power of relative CSS colors â\u0080\u0094 we are defining multiple colors and generating palettes that are updated live by adjusting a single custom property.\n\n### [Live UI color scheme updater](#live_ui_color_scheme_updater)\n\nThis example shows a card containing a heading and text, but with a twist â\u0080\u0094 below the card is a slider ([`<input type=\"range\">`](/en-US/docs/Web/HTML/Reference/Elements/input/range)) control. When its value is changed, JavaScript is used to set a `--hue` custom property value to the new slider value.\n\nThis in turn adjusts the color scheme for the entire UI:\n\n- The `--base-color` value is a relative color with its hue channel set to the value of `--hue`.\n- The other colors used in the design are relative colors based on `--base-color`. As a result, they change when the `--base-color` changes.\n\n#### HTML\n\nThe HTML for the example is shown below.\n\n- The [`<main>`](/en-US/docs/Web/HTML/Reference/Elements/main) element acts as an outer wrapper to contain the rest of the content, allowing the card and form to be centered vertically and horizontally inside `<main>` as one unit.\n- The [`<section>`](/en-US/docs/Web/HTML/Reference/Elements/section) element contains the [`<h1>`](/en-US/docs/Web/HTML/Reference/Elements/Heading_Elements) and [`<p>`](/en-US/docs/Web/HTML/Reference/Elements/p) elements that define the card's content.\n- The [`<form>`](/en-US/docs/Web/HTML/Reference/Elements/form) element contains the ([`<input type=\"range\">`](/en-US/docs/Web/HTML/Reference/Elements/input/range)) control and its [`<label>`](/en-US/docs/Web/HTML/Reference/Elements/label).\n\nhtml\n\n```\n<main>\n  <section>\n    <h1>A love of colors</h1>\n    <p>\n      Colors, the vibrant essence of our surroundings, are truly awe-inspiring.\n      From the fiery warmth of reds to the calming coolness of blues, they bring\n      unparalleled richness to our world. Colors stir emotions, ignite\n      creativity, and shape perceptions, acting as a universal language of\n      expression. In their brilliance, colors create a visually enchanting\n      tapestry that invites admiration and sparks joy.\n    </p>\n  </section>\n  <form>\n    <label for=\"hue-adjust\">Adjust the hue:</label>\n    <input\n      type=\"range\"\n      name=\"hue-adjust\"\n      id=\"hue-adjust\"\n      value=\"240\"\n      min=\"0\"\n      max=\"360\" />\n  </form>\n</main>\n```\n\n#### CSS\n\nIn the CSS the `:root` has a default `--hue` value set on it, relative [`lch()`](/en-US/docs/Web/CSS/Reference/Values/color_value/lch) colors to define the color scheme, plus a radial gradient that fills the whole body.\n\nThe relative colors are as follows:\n\n- `--base-color`: The base color takes an origin color of `red` (although any full color would do) and adjusts its hue value to the value set in the `--hue` custom property.\n- `--bg-color`: A much lighter variant of `--base-color`, intended to be used as a background. This is created by taking an origin color of `--base-color` and adding 40 to its lightness value.\n- `--complementary-color`: A complementary color 180 degrees around the color wheel from `--base-color`. This is created by taking an origin color of `--base-color` and adding 180 to its hue value.\n\nNow have a look at the rest of the CSS and take note of all the places where these colors are used. This includes [backgrounds](/en-US/docs/Web/CSS/Reference/Properties/background), [borders](/en-US/docs/Web/CSS/Reference/Properties/border), [`text-shadow`](/en-US/docs/Web/CSS/Reference/Properties/text-shadow), and even the [`accent-color`](/en-US/docs/Web/CSS/Reference/Properties/accent-color) of the slider.\n\n**Note:**\nFor brevity, only the parts of the CSS relevant to relative color usage are shown.\n\n```\nhtml {\n  font-family: sans-serif;\n}\n\nmain {\n  width: 80vw;\n  margin: 2rem auto;\n}\n\nh1 {\n  text-align: center;\n  margin: 0;\n  color: black;\n  border-radius: 16px 16px 0 0;\n  font-size: 3rem;\n  letter-spacing: -1px;\n}\n\np {\n  line-height: 1.5;\n  margin: 0;\n  padding: 1.2rem;\n}\n\nform {\n  width: fit-content;\n  display: flex;\n  margin: 2rem auto;\n  padding: 0.4rem;\n}\n```\n\ncss\n\n```\n:root {\n  /* Default hue value */\n  --hue: 240;\n\n  /* Relative color definitions */\n  --base-color: lch(from red l c var(--hue));\n  --bg-color: lch(from var(--base-color) calc(l + 40) c h);\n  --complementary-color: lch(from var(--base-color) l c calc(h + 180));\n\n  background: radial-gradient(ellipse at center, white 20%, var(--base-color));\n}\n\n/* Use @supports to add in support for --complementary-color with old\n   syntax that requires deg units to be specified in hue calculations.\n   This is required for in Safari 16.4+. */\n@supports (color: lch(from red l c calc(h + 180deg))) {\n  body {\n    --complementary-color: lch(from var(--base-color) l c calc(h + 180deg));\n  }\n}\n\n/* Box styling */\n\nsection {\n  background-color: var(--bg-color);\n  border: 3px solid var(--base-color);\n  border-radius: 20px;\n  box-shadow: 10px 10px 30px rgb(0 0 0 / 0.5);\n}\n\nh1 {\n  background-color: var(--base-color);\n  text-shadow:\n    1px 1px 1px var(--complementary-color),\n    -1px -1px 1px var(--complementary-color),\n    0 0 3px var(--complementary-color);\n}\n\n/* Range slider styling */\n\nform {\n  background-color: var(--bg-color);\n  border: 3px solid var(--base-color);\n}\n\ninput {\n  accent-color: var(--complementary-color);\n}\n```\n\n#### JavaScript\n\nThe JavaScript adds an [`input`](/en-US/docs/Web/API/Element/input_event) event listener to the slider control so that when a new value is set, the `setHue()` function runs. This function sets a new inline `--hue` custom property value on the `:root` (the `<html>` element) that overrides the original default value we set in our CSS.\n\njs\n\n```\nconst rootElem = document.querySelector(\":root\");\nconst slider = document.getElementById(\"hue-adjust\");\n\nslider.addEventListener(\"input\", setHue);\n\nfunction setHue(e) {\n  rootElem.style.setProperty(\"--hue\", e.target.value);\n}\n```\n\n#### Results\n\nThe output is shown below. Relative CSS colors are being used here to control the color scheme of an entire UI, which can be adjusted live as a single value is modified.\n\n## [See also](#see_also)\n\n- The [`<color>`](/en-US/docs/Web/CSS/Reference/Values/color_value) data type\n- [CSS colors](/en-US/docs/Web/CSS/Guides/Colors) module\n- [sRGB](https://en.wikipedia.org/wiki/SRGB) on Wikipedia\n- [CIELAB](https://en.wikipedia.org/wiki/CIELAB_color_space) on Wikipedia\n- [CSS relative color syntax](https://developer.chrome.com/blog/css-relative-color-syntax) on developer.chrome.com (2023)\n\n## Help improve MDN\n\nWas this page helpful to you?\n\nYes\n\nNo\n\n[Learn how to contribute](/en-US/docs/MDN/Community/Getting_started)\n\nThis page was last modified on Dec 16, 2025 by [MDN contributors](/en-US/docs/Web/CSS/Guides/Colors/Using_relative_colors/contributors.txt).\n\n[View this page on GitHub](https://github.com/mdn/content/blob/main/files/en-us/web/css/guides/colors/using_relative_colors/index.md?plain=1 \"Folder: en-us/web/css/guides/colors/using_relative_colors (Opens in a new tab)\") â\u0080¢ [Report a problem with this content](https://github.com/mdn/content/issues/new?template=page-report.yml&mdn-url=https%3A%2F%2Fdeveloper.mozilla.org%2Fen-US%2Fdocs%2FWeb%2FCSS%2FGuides%2FColors%2FUsing_relative_colors&metadata=%3C%21--+Do+not+make+changes+below+this+line+--%3E%0A%3Cdetails%3E%0A%3Csummary%3EPage+report+details%3C%2Fsummary%3E%0A%0A*+Folder%3A+%60en-us%2Fweb%2Fcss%2Fguides%2Fcolors%2Fusing_relative_colors%60%0A*+MDN+URL%3A+https%3A%2F%2Fdeveloper.mozilla.org%2Fen-US%2Fdocs%2FWeb%2FCSS%2FGuides%2FColors%2FUsing_relative_colors%0A*+GitHub+URL%3A+https%3A%2F%2Fgithub.com%2Fmdn%2Fcontent%2Fblob%2Fmain%2Ffiles%2Fen-us%2Fweb%2Fcss%2Fguides%2Fcolors%2Fusing_relative_colors%2Findex.md%0A*+Last+commit%3A+https%3A%2F%2Fgithub.com%2Fmdn%2Fcontent%2Fcommit%2F33094d735e90b4dcae5733331b79c51fee997410%0A*+Document+last+modified%3A+2025-12-16T15%3A14%3A26.000Z%0A%0A%3C%2Fdetails%3E \"This will take you to GitHub to file a new issue.\")",
  "tags": [
    "mdn",
    "css",
    "reference",
    "layout"
  ],
  "extracted_at": "2026-02-03T12:45:27.859242+00:00",
  "content_length": 31522,
  "content_hash": "ad4dab5b22a347cf"
}