{
  "id": "gsap__docs_v3_GSAP_Timeline_",
  "source_id": "gsap",
  "source_name": "GSAP",
  "category": "animation_motion",
  "url": "https://gsap.com/docs/v3/GSAP/Timeline/",
  "title": "Timeline | GSAP | Docs & Learning",
  "content": "On this page\nReturns :\nTimeline\nâ\u0080\u008b\nA\nTimeline\nis a powerful sequencing tool that acts as a container for tweens and other timelines, making it simple to control them as a whole and precisely manage their timing. Without Timelines, building complex sequences would be far more cumbersome because you'd need to use a\ndelay\nfor every animation. For example:\n// WITHOUT Timelines (only using delays):\ngsap\n.\nto\n(\n\"#id\"\n,\n{\nx\n:\n100\n,\nduration\n:\n1\n}\n)\n;\ngsap\n.\nto\n(\n\"#id\"\n,\n{\ny\n:\n50\n,\nduration\n:\n2\n,\ndelay\n:\n1\n}\n)\n;\n//wait 1 second\ngsap\n.\nto\n(\n\"#id\"\n,\n{\nopacity\n:\n0\n,\nduration\n:\n1\n,\ndelay\n:\n3\n}\n)\n;\n//wait 3 seconds\nWhat if you wanted to make the first animation longer? You'd need to adjust\nevery\ndelay thereafter. And what if you want to\npause()\nthe whole sequence or\nrestart()\nit or\nreverse()\nit on-the-fly or repeat it twice? This could become quite messy, but GSAP's Timelines make it incredibly simple:\n0\n1\n2\nblueSpin\n3\n4\nPlay\n// then we can control the whole thing easily...\ntl\n.\npause\n(\n)\n;\ntl\n.\nresume\n(\n)\n;\ntl\n.\nseek\n(\n1.5\n)\n;\ntl\n.\nreverse\n(\n)\n;\nNow we can adjust the timing without worrying about trickle-down changes to delays! Increase the duration of that first tween and everything automatically adjusts.\nPositioning animations in a timeline\nâ\u0080\u008b\nThe secret to building gorgeous animations with intricate timing is understanding the\nposition parameter\nwhich is used in many various Timeline methods. This one super-flexible parameter controls the placement of your tweens, labels, callbacks, pauses, and even nested timelines. In other words, it tells the timeline exactly where to insert the animation. It typically comes after the\nvars\nparameter and it has multiple behaviors:\nAbsolute time, like\n3\n(a number)\n//insert exactly 3 seconds from the start of the timeline\ntl\n.\nto\n(\n\".class\"\n,\n{\nx\n:\n100\n}\n,\n3\n)\n;\nRelative time, like\n\"+=1\"\nor\n\"-=1\"\n(relative to the\nend\nof the timeline)\n//create a gap (insert 1 second after end of timeline)\ntl\n.\nto\n(\n\".class\"\n,\n{\nx\n:\n100\n}\n,\n\"+=1\"\n)\n;\n//overlap end by 1 second\ntl\n.\nto\n(\n\".class\"\n,\n{\ny\n:\n100\n}\n,\n\"-=1\"\n)\n;\nLabel, like\n\"someLabel\"\n//insert at the \"someLabel\" label (if it doesn't exist yet, it gets added to the end of the timeline)\ntl\n.\nto\n(\n\".class\"\n,\n{\nx\n:\n100\n}\n,\n\"someLabel\"\n)\n;\nRelative to a label, like\n\"someLabel+=1\"\n//insert 2 seconds after the \"someLabel\" label\ntl\n.\nto\n(\n\".class\"\n,\n{\nx\n:\n100\n}\n,\n\"someLabel+=2\"\n)\n;\nAt the\nstart\nof most recently-added animation,\n\"<\"\n//insert at the START of the most recently added animation\ntl\n.\nto\n(\n\".class\"\n,\n{\nx\n:\n100\n}\n,\n\"<\"\n)\n;\nAt the\nend\nof the most recently-added animation,\n\">\"\n//insert at the END of the most recently added animation\ntl\n.\nto\n(\n\".class\"\n,\n{\nx\n:\n100\n}\n,\n\">\"\n)\n;\nRelative to the start of the most recently-added animation, like\n\"<1\"\n//insert 1 second after the START of the most recently added animation\ntl\n.\nto\n(\n\".class\"\n,\n{\nx\n:\n100\n}\n,\n\"<1\"\n)\n;\n//insert 2 seconds before the START of the most recently added animation (negative number)\ntl\n.\nto\n(\n\".class\"\n,\n{\ny\n:\n100\n}\n,\n\"<-2\"\n)\n;\nRelative to the end of the most recently-added animation, like\n\">1\"\n//insert 1 second after the END of the most recently added animation\ntl\n.\nto\n(\n\".class\"\n,\n{\nx\n:\n100\n,\nduration\n:\n1\n}\n,\n\">1\"\n)\n;\n//insert 2 seconds before the END of the most recently added animation (negative number)\ntl\n.\nto\n(\n\".class\"\n,\n{\ny\n:\n100\n,\nduration\n:\n1\n}\n,\n\">-2\"\n)\n;\nHint\n: think of\n\"<\"\nand\n\">\"\nas pointers to the start or end of the most recently-added animation.\nSpecial Properties and Callbacks\nâ\u0080\u008b\nAdd any of these to your vars object to give your animation special powers:\ngsap\n.\ntimeline\n(\n{\nonComplete\n:\nmyFunction\n,\nrepeat\n:\n2\n,\nrepeatDelay\n:\n1\n,\nyoyo\n:\ntrue\n,\n}\n)\n;\nAll of timeline's\nvars\nproperties are described below:\nProperty\nDescription\nautoRemoveChildren\nBoolean\nIf\nautoRemoveChildren\nis set to\ntrue\n, as soon as child tweens/timelines complete, they will automatically get killed/removed. This is normally undesireable because it prevents going backwards in time (like if you want to\nreverse()\nor set the progress lower, etc.). It can, however, improve speed and memory management. The root timelines use\nautoRemoveChildren: true\n.\ncallbackScope\nObject\nThe scope to be used for all of the callbacks (\nonStart\n,\nonUpdate\n,\nonComplete\n, etc.). The scope is what\nthis\nrefers to inside any of the callbacks.\ndefaults\nObject\nA simple way to set defaults that get inherited by the child animations.  See the \"\ndefaults\n\" section for details.\ndelay\nNumber\nAmount of delay in seconds before the animation should begin.\nonComplete\nFunction\nA function that should be called when the animation has completed.\nonCompleteParams\nArray\nAn array of parameters to pass the\nonComplete\nfunction. For example,\ngsap.timeline({onComplete: myFunction, onCompleteParams: [\"param1\", \"param2\"]});\n.\nonInterrupt\nA function to call when the animation is interrupted min animation. Note that this does not fire if the animation completes normally.\nonInterruptParams\nAn Array of parameters to pass the onInterrupt function. For example,\ngsap.to(\".class\", {x:100, onInterrupt:myFunction, onInterruptParams:[\"param1\", \"param2\"]});\n.\nonRepeat\nFunction\nA function that should be called each time the animation repeats.\nonRepeatParams\nArray\nAn Array of parameters to pass the\nonRepeat\nfunction. For example,\ngsap.timeline({onRepeat: myFunction, onRepeatParams: [\"param1\", \"param2\"]});\n.\nonReverseComplete\nFunction\nA function that should be called when the animation has reached its beginning again from the reverse direction. For example, if\nreverse()\nis called the tween will move back towards its beginning and when its\ntime\nreaches\n0\n,\nonReverseComplete\nwill be called. This can also happen if the animation is placed in a timeline instance that gets reversed and plays the animation backwards to (or past) the beginning.\nonReverseCompleteParams\nArray\nAn array of parameters to pass the\nonReverseComplete\nfunction. For example,\ngsap.timeline({onReverseComplete: myFunction, onReverseCompleteParams: [\"param1\", \"param2\"]});\n.\nonStart\nFunction\nA function that should be called when the animation begins (when its\ntime\nchanges from\n0\nto some other value which can happen more than once if the tween is restarted multiple times).\nonStartParams\nArray\nAn array of parameters to pass the\nonStart\nfunction. For example,\ngsap.timeline({onStart: myFunction, onStartParams: [\"param1\", \"param2\"]});\n.\nonUpdate\nFunction\nA function that should be called every time the animation updates (on every frame while the animation is active).\nonUpdateParams\nArray\nAn array of parameters to pass the\nonUpdate\nfunction. For example,\ngsap.timeline({onUpdate: myFunction, onUpdateParams: [\"param1\", \"param2\"]});\n.\npaused\nBoolean\nIf\ntrue\n, the animation will pause itself immediately upon creation.\nrepeat\nNumber\nNumber of times that the animation should repeat after its first iteration. For example, if\nrepeat\nis\n1\n, the animation will play a total of twice (the initial play plus 1 repeat). To repeat indefinitely, use\n-1\n.\nrepeat\nshould always be an integer.\nrepeatDelay\nNumber\nAmount of time in seconds between repeats. For example, if\nrepeat\nis\n2\nand\nrepeatDelay\nis\n1\n, the animation will play initially, then wait for 1 second before it repeats, then play again, then wait 1 second again before doing its final repeat.\nrepeatRefresh\nSetting\nrepeatRefresh: true\ncauses a repeating timeline to\ninvalidate()\nall of its child tweens and re-record their starting/ending values internally on each full iteration (not including yoyo's). This is useful when you use dynamic values (relative, random, or function-based). For example,\nx: \"random(-100, 100)\"\nwould get a new random x value on each repeat.\nduration\n,\ndelay\n, and\nstagger\ndo\nNOT\nrefresh.\nsmoothChildTiming\nBoolean\nControls whether or not child animations are repositioned automatically (changing their\nstartTime\n) in order to maintain smooth playback when timing-related properties are changed on-the-fly. For example, imagine that the timelineâ\u0080\u0099s playhead is on a child tween that is 75% complete, moving elementâ\u0080\u0099s left from 0 to 100 and then that tweenâ\u0080\u0099s\nreverse()\nmethod is called. If\nsmoothChildTiming\nis\nfalse\n(the default except for the globalTimeline), the tween would flip in place, keeping its\nstartTime\nconsistent. Therefore the playhead of the timeline would now be at the tweenâ\u0080\u0099s 25% completion point instead of 75%. See the \"\nHow to timelines work?\n\" section for details.\nyoyo\nBoolean\nIf\ntrue\n, every other repeat cycle will run in the opposite direction so that the tween appears to go back and forth (forward then backward). This has no affect on the\nreversed\nproperty though. So if\nrepeat\nis\n2\nand\nyoyo\nis\nfalse\n, it will look like: start - 1 - 2 - 3 - 1 - 2 - 3 - 1 - 2 - 3 - end. But if\nyoyo\nis\ntrue\n, it will look like: start - 1 - 2 - 3 - 3 - 2 - 1 - 1 - 2 - 3 - end.\nSetting Defaults\nâ\u0080\u008b\nAnything in the\ndefaults\nobject of a timeline gets inherited by its child animations when they get created, so if you find yourself setting the same\nease\nor\nduration\n(or any value) over and over again, this can help make your code more concise. For example:\n// WITHOUT defaults (long)\nvar\ntl\n=\ngsap\n.\ntimeline\n(\n)\n;\ntl\n.\nto\n(\n\".class1\"\n,\n{\nrotation\n:\n-\n270\n,\nduration\n:\n1\n,\nease\n:\n\"elastic\"\n}\n)\n.\nto\n(\n\".class2\"\n,\n{\nrotation\n:\n-\n360\n,\nduration\n:\n1\n,\nease\n:\n\"elastic\"\n}\n)\n.\nto\n(\n\".class3\"\n,\n{\nrotation\n:\n-\n180\n,\nduration\n:\n1\n,\nease\n:\n\"elastic\"\n}\n)\n;\n//WITH defaults (shorter)\nvar\ntl\n=\ngsap\n.\ntimeline\n(\n{\ndefaults\n:\n{\nduration\n:\n1\n,\nease\n:\n\"elastic\"\n}\n}\n)\n;\ntl\n.\nto\n(\n\".class1\"\n,\n{\nrotation\n:\n-\n270\n}\n)\n//child tweens will inherit the duration and from the parent timeline!\n.\nto\n(\n\".class2\"\n,\n{\nrotation\n:\n-\n360\n}\n)\n.\nto\n(\n\".class3\"\n,\n{\nrotation\n:\n-\n180\n}\n)\n;\nAny defaults you set this way will get pushed into every child tween - it's not limited to a certain subset of properties. Inherited defaults are easily overwritten anytime a property is declared on a child animation.\nNesting\nâ\u0080\u008b\nNest timelines within timelines as deeply as you want. This lets you modularize your code and make it more maintainable. For example, you could build your animation in sections and stitch them together in a master timeline like:\nfunction\nintro\n(\n)\n{\nvar\ntl\n=\ngsap\n.\ntimeline\n(\n)\n;\n//...add animations here...\nreturn\ntl\n;\n}\nfunction\nmiddle\n(\n)\n{\nvar\ntl\n=\ngsap\n.\ntimeline\n(\n)\n;\n//...add animations here...\nreturn\ntl\n;\n}\nfunction\nconclusion\n(\n)\n{\nvar\ntl\n=\ngsap\n.\ntimeline\n(\n)\n;\n//...add animations here...\nreturn\ntl\n;\n}\n// stitch them together in a master timeline...\nvar\nmaster\n=\ngsap\n.\ntimeline\n(\n)\n;\nmaster\n.\nadd\n(\nintro\n(\n)\n)\n.\nadd\n(\nmiddle\n(\n)\n,\n\"+=2\"\n)\n//with a gap of 2 seconds\n.\nadd\n(\nconclusion\n(\n)\n,\n\"-=1\"\n)\n;\n//overlap by 1 second\nOther Timeline Features\nâ\u0080\u008b\nSpeed up or slow down the entire timeline with its\ntimeScale()\nmethod. You can even tween it to gradually speed up or slow down the animation smoothly!\nGet or set the progress of the timeline using its\nprogress()\nor\ntotalProgress()\nmethods (totalProgress() just includes any repeats). For example, to skip to the halfway point, set\nmyTimeline.progress(0.5);\n.\nTween the\ntime()\n,\ntotalTime()\n,\nprogress()\n, or\ntotalProgress()\nto fast-forward or rewind the timeline. You could even attach a slider to one of these to give the user the ability to drag forward or backward through the timeline.\nAdd\nonComplete\n,\nonStart\n,\nonUpdate\n,\nonRepeat\nand/or\nonReverseComplete\ncallbacks using the constructor's\nvars\nobject like\nvar tl = gsap.timeline({onComplete: myFunction});\n.\nKill the tweens of a particular object inside the timeline with\nkillTweensOf(target)\nor get the tweens of an object with\ngetTweensOf()\nor get all the tweens and timelines in the timeline with\ngetChildren()\n.\nSet the timeline to repeat any number of times or indefinitely. You can even set a delay between each repeat cycle and/or cause the repeat cycles to yoyo, appearing to reverse direction every other cycle.\nGet the\ncurrentLabel()\nor find labels at various positions in the timeline using\nnextLabel()\nand\npreviousLabel()\nSample code:\n// create the timeline that repeats 3 times\n// with 1 second between each repeat and\n// then call myFunction() when it completes\nvar\ntl\n=\ngsap\n.\ntimeline\n(\n{\nrepeat\n:\n3\n,\nrepeatDelay\n:\n1\n,\nonComplete\n:\nmyFunction\n}\n)\n;\n// add a tween\ntl\n.\nto\n(\n\".class\"\n,\n{\nduration\n:\n1\n,\nx\n:\n200\n,\ny\n:\n100\n}\n)\n;\n// add another tween 0.5 seconds after the end\n// of the timeline (makes sequencing easy)\ntl\n.\nto\n(\n\"#id\"\n,\n{\nduration\n:\n0.8\n,\nopacity\n:\n0\n}\n,\n\"+=0.5\"\n)\n;\n// reverse anytime\ntl\n.\nreverse\n(\n)\n;\n// Add a \"spin\" label 3-seconds into the timeline\ntl\n.\naddLabel\n(\n\"spin\"\n,\n3\n)\n;\n// insert a rotation tween at the \"spin\" label\n// (you could also define the insertion point as the time instead of a label)\ntl\n.\nto\n(\n\".class\"\n,\n{\nduration\n:\n2\n,\nrotation\n:\n\"+=360\"\n}\n,\n\"spin\"\n)\n;\n// go to the \"spin\" label and play the timeline from there\ntl\n.\nplay\n(\n\"spin\"\n)\n;\n// nest another timeline inside your timeline...\nvar\nnested\n=\ngsap\n.\ntimeline\n(\n)\n;\nnested\n.\nto\n(\n\".class2\"\n,\n{\nduration\n:\n1\n,\nx\n:\n200\n}\n)\n;\ntl\n.\nadd\n(\nnested\n,\n\"+=3\"\n)\n;\n//add nested timeline after a 3-second gap\nHow do timelines work?\nâ\u0080\u008b\nEvery animation (Tween and Timeline) is placed on a parent Timeline. In a sense, they all have their own playheads (that's what its \"time\" refers to, or \"totalTime\" which is identical except that it includes repeats and repeatDelays) and when the parent's playhead moves to a new position, it updates the childrens' too (unless they're paused).\nWhen a timeline renders at a particular time, it loops through its children and says \"okay, you should render as if your playhead is at ____\" and if that child is a Timeline with children, it does the same to its children, right on down the line. So the playheads generally remain synchronized.\nWhen you unpause an animation (\nresume()\nor\nplay()\n), it essentially picks up the playhead and moves it so that its internal playhead is synchronized with wherever the parent's playhead is at that moment, thus things play perfectly smoothly. That is, unless the timeline's\nsmoothChildTiming\nis\nfalse\nin which case that child won't move - its\nstartTime\nwill remain locked to where it was.\nSo basically when\nsmoothChildTiming\nis\ntrue\n, the engine will rearrange things on the fly to ensure the playheads line up so that playback feels seamless and smooth. The same thing happens when you\nreverse()\nor alter the\ntimeScale\n, etc. - the animation's startTime shifts automatically. But sometimes you might not want that behavior - that's when\nsmoothChildTiming: false\nis handy on a parent timeline.\nOne more example: let's say you've got a 10-second tween that's just sitting on the root timeline and you're 2-seconds into the tween. Let's assume it started at exactly 0 on the root to make this easy, and then when it's at 2-seconds, you do\ntween.seek(5)\n. The playhead of the root isn't affected - it keeps going exactly as it always did, but in order to make that tween jump to 5 seconds and play appropriately, the tween's\nstartTime\ngets changed to -3. That way, the tween's playhead and the root playhead are perfectly aligned.\nnote\nYou can access GSAP's global timeline via\ngsap.globalTimeline\nbut be careful because if, for example, you pause() or timeScale() it, that affects EVERYTHING including delayedCalls(). You can use\ngsap.exportRoot()\ninstead to basically wrap all of the existing animations on the root (optionally excluding delayedCalls) into a new Timeline instance, isolating those from future animations you create. For example, if you have a bunch of animations going on in a game and then the user clicks a button to pop open a modal window that should slow all the game animations to 1/10ths speed...but you want you modal animations to be full-speed, that's the perfect case for exportRoot().\nProperties\nâ\u0080\u008b\nautoRemoveChildren\n: Boolean\nIf\ntrue\n, child tweens and timelines will be removed as soon as they complete.\ndata\n: *\nA place to store any data you want (initially populated with\nvars.data\nif it exists).\nlabels\n: Object\nThis stores any labels that have been added to the timeline.\nparent\n: Timeline\nThe parent\nTimeline\nto which the animation is attached. Anything that's not in a Timeline that you create is placed on the\ngsap.globalTimeline\nby default.\nscrollTrigger\n:\nScrollTrigger\n| undefined\nA handy way to access the ScrollTrigger associated with a timeline. This is only accessible if the timeline has a ScrollTrigger.\nsmoothChildTiming\n: Boolean\nControls whether or not child tweens and timelines are repositioned automatically (changing their\nstartTime\n) in order to maintain smooth playback when properties are changed on-the-fly.\nvars\n: Object\nThe configuration object passed into the original timeline via the constructor, like\ngsap.timeline({onComplete: func});\nMethods\nâ\u0080\u008b\nadd\n( child:[Tween | Timeline | Label | Callback | Array], position:[Number | String | Label] ) : self\n[override] Adds a tween, timeline, callback, or label (or an array of them) to the timeline.\naddLabel\n( label:String, position:[Number | String] ) : self\nAdds a label to the timeline, making it easy to mark important positions/times.\naddPause\n( position:[String | Number | Label], callback:Function, params:Array ) : self\nInserts a special callback that pauses playback of the timeline at a particular time or label.\ncall\n( callback:Function, params:Array, position:* ) : self\nAdds a callback to the end of the timeline (or elsewhere using the\nposition\nparameter) - this is a convenience method that accomplishes exactly the same thing as\nadd( gsap.delayedCall(...) )\nbut with less code.\nclear\n( labels:Boolean ) : self\nEmpties the timeline of all tweens, timelines, and callbacks (and optionally labels too).\ncurrentLabel\n( value:String ) : [String | self]\nGets the closest label that is at or before the current time, or jumps to a provided label (behavior depends on whether or not you pass a parameter to the method).\ndelay\n( value:Number ) : [Number | self]\nGets or sets the animation's initial\ndelay\nwhich is the length of time in seconds before the animation should begin.\nduration\n( value:Number ) : [Number | self]\n[override] Gets the timeline's duration or, if used as a setter, adjusts the timeline's timeScale to fit it within the specified duration.\nendTime\n( includeRepeats:Boolean ) : [Number | self]\nReturns the time at which the animation will finish according to the parent timeline's local time.\neventCallback\n( type:String, callback:Function, params:Array ) : [Function | self]\nGets or sets an event callback like\nonComplete\n,\nonUpdate\n,\nonStart\n,\nonReverseComplete\n, or\nonRepeat\nalong with any parameters that should be passed to that callback.\nfrom\n( target:[ Object | Array | String ], vars:Object, position:[ Number | String ] ) : self\nAdds a\n.from()\ntween to the end of the timeline (or elsewhere using the\nposition\nparameter) - this is a convenience method that accomplishes exactly the same thing as\nadd( gsap.from(...) )\nbut with less code.\nfromTo\n( target:[ Object | Array | String ], fromVars:Object, toVars:Object, position:[ Number | String ] ) : self\nAdds a\n.fromTo()\ntween to the end of the timeline - this is a convenience method that accomplishes exactly the same thing as\nadd( gsap.fromTo(...) )\nbut with less code.\ngetById\n( id:String ) : Animation\ngetChildren\n( nested:Boolean, tweens:Boolean, timelines:Boolean, ignoreBeforeTime:Number ) : Array\nReturns an array containing all the tweens and/or timelines nested in this timeline.\ngetTweensOf\n( target:[Object | Selector text | Array], nested:Boolean ) : Array\nReturns the tweens of a particular object that are inside this timeline.\nglobalTime\n( localTime:Number ) : Number\nConverts a local time to the corresponding time on the\ngsap.globalTimeline\n(factoring in all nesting, timeScales, etc.).\ninvalidate\n(  ) : self\n[override] Flushes any internally-recorded starting/ending values which can be useful if you want to restart an animation without reverting to any previously recorded starting values.\nisActive\n(  ) : Boolean\nIndicates whether or not the animation is currently active (meaning the virtual playhead is actively moving across this instance's time span and it is not paused, nor are any of its ancestor timelines).\niteration\n( value:Number ) : [Number | self]\nGets or sets the iteration (the current repeat) of timelines.\nkill\n(  ) : Timeline\nImmediately kills the timeline and removes it from its parent timeline, stopping its animation.\nkillTweensOf\n( targets:Selector text | Array | Object, props:String, onlyActive:Boolean ) : Timeline\nKills all of the tweens inside this timeline that affect the provided\ntargets\n. You can optionally specify specific properties that you want killed.\nnextLabel\n( time:Number ) : String\nReturns the next label in the timeline from the provided time. If no\ntime\nis provided, the timeline's current playhead time will be used.\npause\n( atTime:*, suppressEvents:Boolean ) : self\nPauses the instance, optionally jumping to a specific time.\npaused\n( value:Boolean ) : [Boolean | self]\nGets or sets the animation's paused state which indicates whether or not the animation is currently paused.\nplay\n( from:*, suppressEvents:Boolean ) : self\nBegins playing forward, optionally from a specific time (by default playback begins from wherever the playhead currently is).\npreviousLabel\n( time:Number ) : String\nReturns the previous label in the timeline from the provided\ntime\n. If no\ntime\nis provided, the timeline's current playhead time will be used.\nprogress\n( value:Number, suppressEvents:Boolean ) : [Number | self]\n[override] Gets or sets the timeline's progress which is a value between 0 and 1 indicating the position of the virtual playhead (excluding repeats) where 0 is at the beginning, 0.5 is halfway complete, and 1 is complete.\nrecent\n(  ) : [Tween | Timeline | Callback]\nReturns the most recently added child tween/timeline/callback regardless of its position in the timeline.\nremove\n( value:[Tween | Timeline | Callback | Label] ) : self\nRemoves a tween, timeline, callback, or label (or array of them) from the timeline.\nremoveLabel\n( label:String ) : self\nRemoves a label from the timeline and returns the time of that label.\nremovePause\n( position:[Number | Label] ) : self\nRemoves pauses that were added to a timeline via its\n.addPause()\nmethod.\nrepeat\n( value:Number ) : [Number | self]\nGets or sets the number of times that the timeline should repeat after its first iteration.\nrepeatDelay\n( value:Number ) : [Number | self]\nGets or sets the amount of time in seconds between repeats.\nrestart\n( includeDelay:Boolean, suppressEvents:Boolean ) : self\nRestarts and begins playing forward from the beginning.\nresume\n(  ) : self\nResumes playing without altering direction (forward or reversed).\nreverse\n( from:*, suppressEvents:Boolean ) : self\nReverses playback so that all aspects of the animation are oriented backwards including, for example, a tween's ease.\nreversed\n( value:Boolean ) : [Boolean | self]\nGets or sets the animation's reversed state which indicates whether or not the animation should be played backwards.\nrevert\n(  ) : Self\nReverts the Timeline and kills it, returning the targets to their pre-animation state including the removal of inline styles added by the Timeline.\nseek\n( position:*, suppressEvents:Boolean ) : self\n[override] Jumps to a specific time (or label) without affecting whether or not the instance is paused or reversed.\nset\n( target:[ Object | Array | String ], vars:Object, position:[ Number | String ] ) : self\nAdds a zero-duration tween to the end of the timeline (or elsewhere using the\nposition\nparameter) that sets values immediately when the virtual playhead reaches that position on the timeline - this is a convenience method that accomplishes exactly the same thing as\nadd( gsap.to(target, {duration: 0, ...}) )\nbut with less code.\nshiftChildren\n( amount:Number, adjustLabels:Boolean, ignoreBeforeTime:Number ) : self\nShifts the startTime of the timeline's children by a certain amount and optionally adjusts labels too.\nstartTime\n( value:Number ) : [Number | self]\nGets or sets the time at which the animation begins on its parent timeline (after any delay that was defined).\nthen\n( callback:Function ) : Promise\nReturns a promise so that you can uses promises to track when a tween or timeline is complete.\ntime\n( value:Number, suppressEvents:Boolean ) : [Number | self]\n[override] Gets or sets the local position of the playhead (essentially the current time), not including any repeats or repeatDelays.\ntimeScale\n( value:Number ) : [Number | self]\nFactor that's used to scale time in the animation where 1 = normal speed (the default), 0.5 = half speed, 2 = double speed, etc.\nto\n( target:[ Object | Array | String ], vars:Object, position:[ Number | String ] ) : self\nAdds a\ngsap.to()\ntween to the end of the timeline (or elsewhere using the\nposition\nparameter) - this is a convenience method that accomplishes exactly the same thing as\nadd( gsap.to(...) )\nbut with less code.\ntotalDuration\n( value:Number ) : [Number | self]\nGets or sets the total duration of the timeline in seconds including any repeats or repeatDelays.\ntotalProgress\n( value:Number, suppressEvents:Boolean ) : [Number | self]\n[override] Gets or sets the timeline's total progress which is a value between 0 and 1 indicating the position of the virtual playhead (including repeats) where 0 is at the beginning, 0.5 is at the halfway point, and 1 is at the end (complete).\ntotalTime\n( time:Number, suppressEvents:Boolean ) : [Number | self]\nGets or sets the position of the playhead according to the\ntotalDuration\nwhich includes any repeats and repeatDelays.\ntweenFromTo\n( fromPosition:[Number | Label], toPosition:[Number | Label], vars:Object ) : Tween\nCreates a linear tween that essentially scrubs the playhead from a particular time or label to another time or label and then stops.\ntweenTo\n( position:[Number | Label], vars:Object ) : Tween\nCreates a linear tween that essentially scrubs the playhead to a particular time or label and then stops.\nyoyo\n( value:Boolean ) : [Boolean | self]\nGets or sets the timeline's yoyo state, where true causes the timeline to go back and forth, alternating backward and forward on each repeat.\nContents\nReturns : Timeline\nPositioning animations in a timeline\nSpecial Properties and Callbacks\nSetting Defaults\nNesting\nOther Timeline Features\nHow do timelines work?\nProperties\nMethods",
  "content_markdown": "On this page\n\n### Returns : [Timeline](/docs/v3/GSAP/Timeline)[â\u0080\u008b](#returns--timeline \"Direct link to returns--timeline\")\n\nA [Timeline](/docs/v3/GSAP/Timeline) is a powerful sequencing tool that acts as a container for tweens and other timelines, making it simple to control them as a whole and precisely manage their timing. Without Timelines, building complex sequences would be far more cumbersome because you'd need to use a `delay` for every animation. For example:\n\n```\n// WITHOUT Timelines (only using delays):  \ngsap.to(\"#id\", { x: 100, duration: 1 });  \ngsap.to(\"#id\", { y: 50, duration: 2, delay: 1 }); //wait 1 second  \ngsap.to(\"#id\", { opacity: 0, duration: 1, delay: 3 }); //wait 3 seconds\n```\n\nWhat if you wanted to make the first animation longer? You'd need to adjust *every* delay thereafter. And what if you want to `pause()` the whole sequence or `restart()` it or `reverse()` it on-the-fly or repeat it twice? This could become quite messy, but GSAP's Timelines make it incredibly simple:\n\n0\n\n1\n\n2blueSpin\n\n3\n\n4\n\nPlay\n\n```\n// then we can control the whole thing easily...  \ntl.pause();  \ntl.resume();  \ntl.seek(1.5);  \ntl.reverse();\n```\n\nNow we can adjust the timing without worrying about trickle-down changes to delays! Increase the duration of that first tween and everything automatically adjusts.\n\n## Positioning animations in a timeline[â\u0080\u008b](#positioning-animations-in-a-timeline \"Direct link to Positioning animations in a timeline\")\n\nThe secret to building gorgeous animations with intricate timing is understanding the [position parameter](/resources/position-parameter) which is used in many various Timeline methods. This one super-flexible parameter controls the placement of your tweens, labels, callbacks, pauses, and even nested timelines. In other words, it tells the timeline exactly where to insert the animation. It typically comes after the **vars** parameter and it has multiple behaviors:\n\n- Absolute time, like `3` (a number)\n\n```\n//insert exactly 3 seconds from the start of the timeline  \ntl.to(\".class\", { x: 100 }, 3);\n```\n\n- Relative time, like `\"+=1\"` or `\"-=1\"` (relative to the **end** of the timeline)\n\n```\n//create a gap (insert 1 second after end of timeline)  \ntl.to(\".class\", { x: 100 }, \"+=1\");  \n  \n//overlap end by 1 second  \ntl.to(\".class\", { y: 100 }, \"-=1\");\n```\n\n- Label, like `\"someLabel\"`\n\n```\n//insert at the \"someLabel\" label (if it doesn't exist yet, it gets added to the end of the timeline)  \ntl.to(\".class\", { x: 100 }, \"someLabel\");\n```\n\n- Relative to a label, like `\"someLabel+=1\"`\n\n```\n//insert 2 seconds after the \"someLabel\" label  \ntl.to(\".class\", { x: 100 }, \"someLabel+=2\");\n```\n\n- At the **start** of most recently-added animation, `\"<\"`\n\n```\n//insert at the START of the most recently added animation  \ntl.to(\".class\", { x: 100 }, \"<\");\n```\n\n- At the **end** of the most recently-added animation, `\">\"`\n\n```\n//insert at the END of the most recently added animation  \ntl.to(\".class\", { x: 100 }, \">\");\n```\n\n- Relative to the start of the most recently-added animation, like `\"<1\"`\n\n```\n//insert 1 second after the START of the most recently added animation  \ntl.to(\".class\", { x: 100 }, \"<1\");  \n  \n//insert 2 seconds before the START of the most recently added animation (negative number)  \ntl.to(\".class\", { y: 100 }, \"<-2\");\n```\n\n- Relative to the end of the most recently-added animation, like `\">1\"`\n\n```\n//insert 1 second after the END of the most recently added animation  \ntl.to(\".class\", { x: 100, duration: 1 }, \">1\");  \n  \n//insert 2 seconds before the END of the most recently added animation (negative number)  \ntl.to(\".class\", { y: 100, duration: 1 }, \">-2\");\n```\n\n**Hint**: think of `\"<\"` and `\">\"` as pointers to the start or end of the most recently-added animation.\n\n## Special Properties and Callbacks[â\u0080\u008b](#special-properties-and-callbacks \"Direct link to Special Properties and Callbacks\")\n\nAdd any of these to your vars object to give your animation special powers:\n\n```\ngsap.timeline({  \n  onComplete: myFunction,  \n  repeat: 2,  \n  repeatDelay: 1,  \n  yoyo: true,  \n});\n```\n\nAll of timeline's `vars` properties are described below:\n\n### Property\n\n### Description\n\n- #### autoRemoveChildren\n\n  Boolean If `autoRemoveChildren` is set to `true`, as soon as child tweens/timelines complete, they will automatically get killed/removed. This is normally undesireable because it prevents going backwards in time (like if you want to `reverse()` or set the progress lower, etc.). It can, however, improve speed and memory management. The root timelines use `autoRemoveChildren: true`.\n- #### callbackScope\n\n  Object The scope to be used for all of the callbacks (`onStart`, `onUpdate`, `onComplete`, etc.). The scope is what `this` refers to inside any of the callbacks.\n- #### defaults\n\n  Object A simple way to set defaults that get inherited by the child animations. See the \"[defaults](https://gsap.com/docs/v3/GSAP/Timeline#setting-defaults)\" section for details.\n- #### delay\n\n  Number Amount of delay in seconds before the animation should begin.\n- #### onComplete\n\n  Function A function that should be called when the animation has completed.\n- #### onCompleteParams\n\n  Array An array of parameters to pass the `onComplete` function. For example, `gsap.timeline({onComplete: myFunction, onCompleteParams: [\"param1\", \"param2\"]});`.\n- #### onInterrupt\n\n  A function to call when the animation is interrupted min animation. Note that this does not fire if the animation completes normally.\n- #### onInterruptParams\n\n  An Array of parameters to pass the onInterrupt function. For example, `gsap.to(\".class\", {x:100, onInterrupt:myFunction, onInterruptParams:[\"param1\", \"param2\"]});`.\n- #### onRepeat\n\n  Function A function that should be called each time the animation repeats.\n- #### onRepeatParams\n\n  Array An Array of parameters to pass the `onRepeat` function. For example, `gsap.timeline({onRepeat: myFunction, onRepeatParams: [\"param1\", \"param2\"]});`.\n- #### onReverseComplete\n\n  Function A function that should be called when the animation has reached its beginning again from the reverse direction. For example, if `reverse()` is called the tween will move back towards its beginning and when its `time` reaches `0`, `onReverseComplete` will be called. This can also happen if the animation is placed in a timeline instance that gets reversed and plays the animation backwards to (or past) the beginning.\n- #### onReverseCompleteParams\n\n  Array An array of parameters to pass the `onReverseComplete` function. For example, `gsap.timeline({onReverseComplete: myFunction, onReverseCompleteParams: [\"param1\", \"param2\"]});`.\n- #### onStart\n\n  Function A function that should be called when the animation begins (when its `time` changes from `0` to some other value which can happen more than once if the tween is restarted multiple times).\n- #### onStartParams\n\n  Array An array of parameters to pass the `onStart` function. For example, `gsap.timeline({onStart: myFunction, onStartParams: [\"param1\", \"param2\"]});`.\n- #### onUpdate\n\n  Function A function that should be called every time the animation updates (on every frame while the animation is active).\n- #### onUpdateParams\n\n  Array An array of parameters to pass the `onUpdate` function. For example, `gsap.timeline({onUpdate: myFunction, onUpdateParams: [\"param1\", \"param2\"]});`.\n- #### paused\n\n  Boolean If `true`, the animation will pause itself immediately upon creation.\n- #### repeat\n\n  Number Number of times that the animation should repeat after its first iteration. For example, if `repeat` is `1`, the animation will play a total of twice (the initial play plus 1 repeat). To repeat indefinitely, use `-1`. `repeat` should always be an integer.\n- #### repeatDelay\n\n  Number Amount of time in seconds between repeats. For example, if `repeat` is `2` and `repeatDelay` is `1`, the animation will play initially, then wait for 1 second before it repeats, then play again, then wait 1 second again before doing its final repeat.\n- #### repeatRefresh\n\n  Setting `repeatRefresh: true` causes a repeating timeline to `invalidate()` all of its child tweens and re-record their starting/ending values internally on each full iteration (not including yoyo's). This is useful when you use dynamic values (relative, random, or function-based). For example, `x: \"random(-100, 100)\"` would get a new random x value on each repeat. `duration`, `delay`, and `stagger` do **NOT** refresh.\n- #### smoothChildTiming\n\n  Boolean Controls whether or not child animations are repositioned automatically (changing their `startTime`) in order to maintain smooth playback when timing-related properties are changed on-the-fly. For example, imagine that the timelineâ\u0080\u0099s playhead is on a child tween that is 75% complete, moving elementâ\u0080\u0099s left from 0 to 100 and then that tweenâ\u0080\u0099s `reverse()` method is called. If `smoothChildTiming` is `false` (the default except for the globalTimeline), the tween would flip in place, keeping its `startTime` consistent. Therefore the playhead of the timeline would now be at the tweenâ\u0080\u0099s 25% completion point instead of 75%. See the \"[How to timelines work?](https://gsap.com/docs/v3/GSAP/Timeline#mechanics)\" section for details.\n- #### yoyo\n\n  Boolean If `true`, every other repeat cycle will run in the opposite direction so that the tween appears to go back and forth (forward then backward). This has no affect on the `reversed` property though. So if `repeat` is `2` and `yoyo` is `false`, it will look like: start - 1 - 2 - 3 - 1 - 2 - 3 - 1 - 2 - 3 - end. But if `yoyo` is `true`, it will look like: start - 1 - 2 - 3 - 3 - 2 - 1 - 1 - 2 - 3 - end.\n\n## Setting Defaults[â\u0080\u008b](#setting-defaults \"Direct link to Setting Defaults\")\n\nAnything in the `defaults` object of a timeline gets inherited by its child animations when they get created, so if you find yourself setting the same `ease` or `duration` (or any value) over and over again, this can help make your code more concise. For example:\n\n```\n// WITHOUT defaults (long)  \nvar tl = gsap.timeline();  \ntl.to(\".class1\", { rotation: -270, duration: 1, ease: \"elastic\" })  \n  .to(\".class2\", { rotation: -360, duration: 1, ease: \"elastic\" })  \n  .to(\".class3\", { rotation: -180, duration: 1, ease: \"elastic\" });  \n  \n//WITH defaults (shorter)  \nvar tl = gsap.timeline({ defaults: { duration: 1, ease: \"elastic\" } });  \ntl.to(\".class1\", { rotation: -270 }) //child tweens will inherit the duration and from the parent timeline!  \n  .to(\".class2\", { rotation: -360 })  \n  .to(\".class3\", { rotation: -180 });\n```\n\nAny defaults you set this way will get pushed into every child tween - it's not limited to a certain subset of properties. Inherited defaults are easily overwritten anytime a property is declared on a child animation.\n\n## Nesting[â\u0080\u008b](#nesting \"Direct link to Nesting\")\n\nNest timelines within timelines as deeply as you want. This lets you modularize your code and make it more maintainable. For example, you could build your animation in sections and stitch them together in a master timeline like:\n\n```\nfunction intro() {  \n  var tl = gsap.timeline();  \n  //...add animations here...  \n  return tl;  \n}  \n  \nfunction middle() {  \n  var tl = gsap.timeline();  \n  //...add animations here...  \n  return tl;  \n}  \n  \nfunction conclusion() {  \n  var tl = gsap.timeline();  \n  //...add animations here...  \n  return tl;  \n}  \n  \n// stitch them together in a master timeline...  \nvar master = gsap.timeline();  \nmaster  \n  .add(intro())  \n  .add(middle(), \"+=2\") //with a gap of 2 seconds  \n  .add(conclusion(), \"-=1\"); //overlap by 1 second\n```\n\n## Other Timeline Features[â\u0080\u008b](#other-timeline-features \"Direct link to Other Timeline Features\")\n\n- Speed up or slow down the entire timeline with its `timeScale()` method. You can even tween it to gradually speed up or slow down the animation smoothly!\n- Get or set the progress of the timeline using its `progress()` or `totalProgress()` methods (totalProgress() just includes any repeats). For example, to skip to the halfway point, set `myTimeline.progress(0.5);`.\n- Tween the `time()`, `totalTime()`, `progress()`, or `totalProgress()` to fast-forward or rewind the timeline. You could even attach a slider to one of these to give the user the ability to drag forward or backward through the timeline.\n- Add `onComplete`, `onStart`, `onUpdate`, `onRepeat` and/or `onReverseComplete` callbacks using the constructor's `vars` object like `var tl = gsap.timeline({onComplete: myFunction});`.\n- Kill the tweens of a particular object inside the timeline with `killTweensOf(target)` or get the tweens of an object with `getTweensOf()` or get all the tweens and timelines in the timeline with `getChildren()`.\n- Set the timeline to repeat any number of times or indefinitely. You can even set a delay between each repeat cycle and/or cause the repeat cycles to yoyo, appearing to reverse direction every other cycle.\n- Get the `currentLabel()` or find labels at various positions in the timeline using `nextLabel()` and `previousLabel()`\n\n**Sample code:**\n\n```\n// create the timeline that repeats 3 times  \n// with 1 second between each repeat and  \n// then call myFunction() when it completes  \nvar tl = gsap.timeline({ repeat: 3, repeatDelay: 1, onComplete: myFunction });  \n  \n// add a tween  \ntl.to(\".class\", { duration: 1, x: 200, y: 100 });  \n  \n// add another tween 0.5 seconds after the end  \n// of the timeline (makes sequencing easy)  \ntl.to(\"#id\", { duration: 0.8, opacity: 0 }, \"+=0.5\");  \n  \n// reverse anytime  \ntl.reverse();  \n  \n// Add a \"spin\" label 3-seconds into the timeline  \ntl.addLabel(\"spin\", 3);  \n  \n// insert a rotation tween at the \"spin\" label  \n// (you could also define the insertion point as the time instead of a label)  \ntl.to(\".class\", { duration: 2, rotation: \"+=360\" }, \"spin\");  \n  \n// go to the \"spin\" label and play the timeline from there  \ntl.play(\"spin\");  \n  \n// nest another timeline inside your timeline...  \nvar nested = gsap.timeline();  \nnested.to(\".class2\", { duration: 1, x: 200 });  \ntl.add(nested, \"+=3\"); //add nested timeline after a 3-second gap\n```\n\n## How do timelines work?[â\u0080\u008b](#mechanics \"Direct link to How do timelines work?\")\n\nEvery animation (Tween and Timeline) is placed on a parent Timeline. In a sense, they all have their own playheads (that's what its \"time\" refers to, or \"totalTime\" which is identical except that it includes repeats and repeatDelays) and when the parent's playhead moves to a new position, it updates the childrens' too (unless they're paused).\n\nWhen a timeline renders at a particular time, it loops through its children and says \"okay, you should render as if your playhead is at \\_\\_\\_\\_\" and if that child is a Timeline with children, it does the same to its children, right on down the line. So the playheads generally remain synchronized.\n\nWhen you unpause an animation (`resume()` or `play()`), it essentially picks up the playhead and moves it so that its internal playhead is synchronized with wherever the parent's playhead is at that moment, thus things play perfectly smoothly. That is, unless the timeline's `smoothChildTiming` is `false` in which case that child won't move - its `startTime` will remain locked to where it was.\n\nSo basically when `smoothChildTiming` is `true`, the engine will rearrange things on the fly to ensure the playheads line up so that playback feels seamless and smooth. The same thing happens when you `reverse()` or alter the `timeScale`, etc. - the animation's startTime shifts automatically. But sometimes you might not want that behavior - that's when `smoothChildTiming: false` is handy on a parent timeline.\n\nOne more example: let's say you've got a 10-second tween that's just sitting on the root timeline and you're 2-seconds into the tween. Let's assume it started at exactly 0 on the root to make this easy, and then when it's at 2-seconds, you do `tween.seek(5)`. The playhead of the root isn't affected - it keeps going exactly as it always did, but in order to make that tween jump to 5 seconds and play appropriately, the tween's `startTime` gets changed to -3. That way, the tween's playhead and the root playhead are perfectly aligned.\n\nnote\n\n- You can access GSAP's global timeline via [`gsap.globalTimeline`](/docs/v3/GSAP/gsap.globalTimeline()) but be careful because if, for example, you pause() or timeScale() it, that affects EVERYTHING including delayedCalls(). You can use [`gsap.exportRoot()`](/docs/v3/GSAP/gsap.exportRoot()) instead to basically wrap all of the existing animations on the root (optionally excluding delayedCalls) into a new Timeline instance, isolating those from future animations you create. For example, if you have a bunch of animations going on in a game and then the user clicks a button to pop open a modal window that should slow all the game animations to 1/10ths speed...but you want you modal animations to be full-speed, that's the perfect case for exportRoot().\n\n## **Properties**[â\u0080\u008b](#properties \"Direct link to properties\")\n\n|  |  |\n| --- | --- |\n| [autoRemoveChildren](/docs/v3/GSAP/Timeline/autoRemoveChildren) : Boolean | If `true`, child tweens and timelines will be removed as soon as they complete. |\n| [data](/docs/v3/GSAP/Timeline/data) : \\* | A place to store any data you want (initially populated with `vars.data` if it exists). |\n| [labels](/docs/v3/GSAP/Timeline/labels) : Object | This stores any labels that have been added to the timeline. |\n| [parent](/docs/v3/GSAP/Timeline/parent) : Timeline | The parent [Timeline](/docs/v3/GSAP/Timeline) to which the animation is attached. Anything that's not in a Timeline that you create is placed on the [gsap.globalTimeline](/docs/v3/GSAP/gsap.globalTimeline) by default. |\n| [scrollTrigger](/docs/v3/GSAP/Timeline/scrollTrigger): [ScrollTrigger](/docs/v3/Plugins/ScrollTrigger/) | undefined | A handy way to access the ScrollTrigger associated with a timeline. This is only accessible if the timeline has a ScrollTrigger. |\n| [smoothChildTiming](/docs/v3/GSAP/Timeline/smoothChildTiming) : Boolean | Controls whether or not child tweens and timelines are repositioned automatically (changing their `startTime`) in order to maintain smooth playback when properties are changed on-the-fly. |\n| [vars](/docs/v3/GSAP/Timeline/vars) : Object | The configuration object passed into the original timeline via the constructor, like `gsap.timeline({onComplete: func});` |\n\n## **Methods**[â\u0080\u008b](#methods \"Direct link to methods\")\n\n|  |  |\n| --- | --- |\n| [add](/docs/v3/GSAP/Timeline/add())( child:[Tween | Timeline | Label | Callback | Array], position:[Number | String | Label] ) : self | [override] Adds a tween, timeline, callback, or label (or an array of them) to the timeline. |\n| [addLabel](/docs/v3/GSAP/Timeline/addLabel())( label:String, position:[Number | String] ) : self | Adds a label to the timeline, making it easy to mark important positions/times. |\n| [addPause](/docs/v3/GSAP/Timeline/addPause())( position:[String | Number | Label], callback:Function, params:Array ) : self | Inserts a special callback that pauses playback of the timeline at a particular time or label. |\n| [call](/docs/v3/GSAP/Timeline/call())( callback:Function, params:Array, position:\\* ) : self | Adds a callback to the end of the timeline (or elsewhere using the `position` parameter) - this is a convenience method that accomplishes exactly the same thing as `add( gsap.delayedCall(...) )` but with less code. |\n| [clear](/docs/v3/GSAP/Timeline/clear())( labels:Boolean ) : self | Empties the timeline of all tweens, timelines, and callbacks (and optionally labels too). |\n| [currentLabel](/docs/v3/GSAP/Timeline/currentLabel())( value:String ) : [String | self] | Gets the closest label that is at or before the current time, or jumps to a provided label (behavior depends on whether or not you pass a parameter to the method). |\n| [delay](/docs/v3/GSAP/Timeline/delay())( value:Number ) : [Number | self] | Gets or sets the animation's initial `delay` which is the length of time in seconds before the animation should begin. |\n| [duration](/docs/v3/GSAP/Timeline/duration())( value:Number ) : [Number | self] | [override] Gets the timeline's duration or, if used as a setter, adjusts the timeline's timeScale to fit it within the specified duration. |\n| [endTime](/docs/v3/GSAP/Timeline/endTime())( includeRepeats:Boolean ) : [Number | self] | Returns the time at which the animation will finish according to the parent timeline's local time. |\n| [eventCallback](/docs/v3/GSAP/Timeline/eventCallback())( type:String, callback:Function, params:Array ) : [Function | self] | Gets or sets an event callback like `onComplete`, `onUpdate`, `onStart`, `onReverseComplete`, or `onRepeat` along with any parameters that should be passed to that callback. |\n| [from](/docs/v3/GSAP/Timeline/from())( target:[ Object | Array | String ], vars:Object, position:[ Number | String ] ) : self | Adds a `.from()` tween to the end of the timeline (or elsewhere using the `position` parameter) - this is a convenience method that accomplishes exactly the same thing as `add( gsap.from(...) )` but with less code. |\n| [fromTo](/docs/v3/GSAP/Timeline/fromTo())( target:[ Object | Array | String ], fromVars:Object, toVars:Object, position:[ Number | String ] ) : self | Adds a `.fromTo()` tween to the end of the timeline - this is a convenience method that accomplishes exactly the same thing as `add( gsap.fromTo(...) )` but with less code. |\n| [getById](/docs/v3/GSAP/Timeline/getById())( id:String ) : Animation |  |\n| [getChildren](/docs/v3/GSAP/Timeline/getChildren())( nested:Boolean, tweens:Boolean, timelines:Boolean, ignoreBeforeTime:Number ) : Array | Returns an array containing all the tweens and/or timelines nested in this timeline. |\n| [getTweensOf](/docs/v3/GSAP/Timeline/getTweensOf())( target:[Object | Selector text | Array], nested:Boolean ) : Array | Returns the tweens of a particular object that are inside this timeline. |\n| [globalTime](/docs/v3/GSAP/Timeline/globalTime())( localTime:Number ) : Number | Converts a local time to the corresponding time on the [gsap.globalTimeline](/docs/v3/GSAP/gsap.globalTimeline) (factoring in all nesting, timeScales, etc.). |\n| [invalidate](/docs/v3/GSAP/Timeline/invalidate())( ) : self | [override] Flushes any internally-recorded starting/ending values which can be useful if you want to restart an animation without reverting to any previously recorded starting values. |\n| [isActive](/docs/v3/GSAP/Timeline/isActive())( ) : Boolean | Indicates whether or not the animation is currently active (meaning the virtual playhead is actively moving across this instance's time span and it is not paused, nor are any of its ancestor timelines). |\n| [iteration](/docs/v3/GSAP/Timeline/iteration())( value:Number ) : [Number | self] | Gets or sets the iteration (the current repeat) of timelines. |\n| [kill](/docs/v3/GSAP/Timeline/kill())( ) : Timeline | Immediately kills the timeline and removes it from its parent timeline, stopping its animation. |\n| [killTweensOf](/docs/v3/GSAP/Timeline/killTweensOf())( targets:Selector text | Array | Object, props:String, onlyActive:Boolean ) : Timeline | Kills all of the tweens inside this timeline that affect the provided `targets`. You can optionally specify specific properties that you want killed. |\n| [nextLabel](/docs/v3/GSAP/Timeline/nextLabel())( time:Number ) : String | Returns the next label in the timeline from the provided time. If no `time` is provided, the timeline's current playhead time will be used. |\n| [pause](/docs/v3/GSAP/Timeline/pause())( atTime:\\*, suppressEvents:Boolean ) : self | Pauses the instance, optionally jumping to a specific time. |\n| [paused](/docs/v3/GSAP/Timeline/paused())( value:Boolean ) : [Boolean | self] | Gets or sets the animation's paused state which indicates whether or not the animation is currently paused. |\n| [play](/docs/v3/GSAP/Timeline/play())( from:\\*, suppressEvents:Boolean ) : self | Begins playing forward, optionally from a specific time (by default playback begins from wherever the playhead currently is). |\n| [previousLabel](/docs/v3/GSAP/Timeline/previousLabel())( time:Number ) : String | Returns the previous label in the timeline from the provided `time`. If no `time` is provided, the timeline's current playhead time will be used. |\n| [progress](/docs/v3/GSAP/Timeline/progress())( value:Number, suppressEvents:Boolean ) : [Number | self] | [override] Gets or sets the timeline's progress which is a value between 0 and 1 indicating the position of the virtual playhead (excluding repeats) where 0 is at the beginning, 0.5 is halfway complete, and 1 is complete. |\n| [recent](/docs/v3/GSAP/Timeline/recent())( ) : [Tween | Timeline | Callback] | Returns the most recently added child tween/timeline/callback regardless of its position in the timeline. |\n| [remove](/docs/v3/GSAP/Timeline/remove())( value:[Tween | Timeline | Callback | Label] ) : self | Removes a tween, timeline, callback, or label (or array of them) from the timeline. |\n| [removeLabel](/docs/v3/GSAP/Timeline/removeLabel())( label:String ) : self | Removes a label from the timeline and returns the time of that label. |\n| [removePause](/docs/v3/GSAP/Timeline/removePause())( position:[Number | Label] ) : self | Removes pauses that were added to a timeline via its `.addPause()` method. |\n| [repeat](/docs/v3/GSAP/Timeline/repeat())( value:Number ) : [Number | self] | Gets or sets the number of times that the timeline should repeat after its first iteration. |\n| [repeatDelay](/docs/v3/GSAP/Timeline/repeatDelay())( value:Number ) : [Number | self] | Gets or sets the amount of time in seconds between repeats. |\n| [restart](/docs/v3/GSAP/Timeline/restart())( includeDelay:Boolean, suppressEvents:Boolean ) : self | Restarts and begins playing forward from the beginning. |\n| [resume](/docs/v3/GSAP/Timeline/resume())( ) : self | Resumes playing without altering direction (forward or reversed). |\n| [reverse](/docs/v3/GSAP/Timeline/reverse())( from:\\*, suppressEvents:Boolean ) : self | Reverses playback so that all aspects of the animation are oriented backwards including, for example, a tween's ease. |\n| [reversed](/docs/v3/GSAP/Timeline/reversed())( value:Boolean ) : [Boolean | self] | Gets or sets the animation's reversed state which indicates whether or not the animation should be played backwards. |\n| [revert](/docs/v3/GSAP/Timeline/revert())( ) : Self | Reverts the Timeline and kills it, returning the targets to their pre-animation state including the removal of inline styles added by the Timeline. |\n| [seek](/docs/v3/GSAP/Timeline/seek())( position:\\*, suppressEvents:Boolean ) : self | [override] Jumps to a specific time (or label) without affecting whether or not the instance is paused or reversed. |\n| [set](/docs/v3/GSAP/Timeline/set())( target:[ Object | Array | String ], vars:Object, position:[ Number | String ] ) : self | Adds a zero-duration tween to the end of the timeline (or elsewhere using the `position` parameter) that sets values immediately when the virtual playhead reaches that position on the timeline - this is a convenience method that accomplishes exactly the same thing as `add( gsap.to(target, {duration: 0, ...}) )` but with less code. |\n| [shiftChildren](/docs/v3/GSAP/Timeline/shiftChildren())( amount:Number, adjustLabels:Boolean, ignoreBeforeTime:Number ) : self | Shifts the startTime of the timeline's children by a certain amount and optionally adjusts labels too. |\n| [startTime](/docs/v3/GSAP/Timeline/startTime())( value:Number ) : [Number | self] | Gets or sets the time at which the animation begins on its parent timeline (after any delay that was defined). |\n| [then](/docs/v3/GSAP/Timeline/then())( callback:Function ) : Promise | Returns a promise so that you can uses promises to track when a tween or timeline is complete. |\n| [time](/docs/v3/GSAP/Timeline/time())( value:Number, suppressEvents:Boolean ) : [Number | self] | [override] Gets or sets the local position of the playhead (essentially the current time), not including any repeats or repeatDelays. |\n| [timeScale](/docs/v3/GSAP/Timeline/timeScale())( value:Number ) : [Number | self] | Factor that's used to scale time in the animation where 1 = normal speed (the default), 0.5 = half speed, 2 = double speed, etc. |\n| [to](/docs/v3/GSAP/Timeline/to())( target:[ Object | Array | String ], vars:Object, position:[ Number | String ] ) : self | Adds a `gsap.to()` tween to the end of the timeline (or elsewhere using the `position` parameter) - this is a convenience method that accomplishes exactly the same thing as `add( gsap.to(...) )` but with less code. |\n| [totalDuration](/docs/v3/GSAP/Timeline/totalDuration())( value:Number ) : [Number | self] | Gets or sets the total duration of the timeline in seconds including any repeats or repeatDelays. |\n| [totalProgress](/docs/v3/GSAP/Timeline/totalProgress())( value:Number, suppressEvents:Boolean ) : [Number | self] | [override] Gets or sets the timeline's total progress which is a value between 0 and 1 indicating the position of the virtual playhead (including repeats) where 0 is at the beginning, 0.5 is at the halfway point, and 1 is at the end (complete). |\n| [totalTime](/docs/v3/GSAP/Timeline/totalTime())( time:Number, suppressEvents:Boolean ) : [Number | self] | Gets or sets the position of the playhead according to the `totalDuration` which includes any repeats and repeatDelays. |\n| [tweenFromTo](/docs/v3/GSAP/Timeline/tweenFromTo())( fromPosition:[Number | Label], toPosition:[Number | Label], vars:Object ) : Tween | Creates a linear tween that essentially scrubs the playhead from a particular time or label to another time or label and then stops. |\n| [tweenTo](/docs/v3/GSAP/Timeline/tweenTo())( position:[Number | Label], vars:Object ) : Tween | Creates a linear tween that essentially scrubs the playhead to a particular time or label and then stops. |\n| [yoyo](/docs/v3/GSAP/Timeline/yoyo())( value:Boolean ) : [Boolean | self] | Gets or sets the timeline's yoyo state, where true causes the timeline to go back and forth, alternating backward and forward on each repeat. |\n\n## Contents\n\n- [Returns : Timeline](#returns--timeline)\n- [Positioning animations in a timeline](#positioning-animations-in-a-timeline)\n- [Special Properties and Callbacks](#special-properties-and-callbacks)\n- [Setting Defaults](#setting-defaults)\n- [Nesting](#nesting)\n- [Other Timeline Features](#other-timeline-features)\n- [How do timelines work?](#mechanics)\n- [**Properties**](#properties)\n- [**Methods**](#methods)",
  "tags": [
    "gsap",
    "animation",
    "javascript",
    "scrolltrigger"
  ],
  "extracted_at": "2026-02-03T12:48:48.197008+00:00",
  "content_length": 26326,
  "content_hash": "f25e704f7909681d"
}