{
  "meta": {
    "name": "SELF-EVOLUTION: Iterative Architecture Improvement",
    "budget": 1.00,
    "mode": "recursive",
    "description": "Improve your own architecture iteratively. Make it the best you can possibly make it."
  },
  "tasks": [
    {
      "id": "evolve-1",
      "phase": 1,
      "description": "READ AND UNDERSTAND: Read ARCHITECTURE_EVOLUTION_PROPOSAL.md, AGI_ROADMAP_2026.md, and AI_RESEARCH_FINDINGS.md. Synthesize the key insights into a single CURRENT_CAPABILITIES.md that honestly assesses what the swarm can and cannot do RIGHT NOW."
    },
    {
      "id": "evolve-2",
      "phase": 1,
      "description": "IDENTIFY BOTTLENECKS: Analyze grind_spawner_unified.py, inference_engine.py, and the grind_logs/*.json files. What are the ACTUAL bottlenecks slowing down execution? Create BOTTLENECK_ANALYSIS.md with concrete measurements and proposed fixes."
    },
    {
      "id": "evolve-3",
      "phase": 1,
      "description": "DESIGN IMPROVEMENT: Based on the bottleneck analysis, design ONE concrete improvement to the swarm architecture. Not theoretical - something that can be implemented NOW. Write IMPROVEMENT_SPEC_V1.md with exact code changes needed."
    },
    {
      "id": "evolve-4",
      "phase": 2,
      "description": "IMPLEMENT IMPROVEMENT V1: Implement the improvement from IMPROVEMENT_SPEC_V1.md. Create the actual Python files. Test them. Document what worked and what didn't in IMPLEMENTATION_LOG_V1.md."
    },
    {
      "id": "evolve-5",
      "phase": 2,
      "description": "MEASURE IMPACT: Run a benchmark comparing before/after the V1 improvement. Measure: task completion rate, cost per task, time per task, error rate. Write BENCHMARK_V1.md with actual numbers."
    },
    {
      "id": "evolve-6",
      "phase": 2,
      "description": "ITERATE - DESIGN V2: Based on V1 results, design the NEXT improvement. What did V1 reveal? What's the new bottleneck? Write IMPROVEMENT_SPEC_V2.md."
    },
    {
      "id": "evolve-7",
      "phase": 3,
      "description": "IMPLEMENT IMPROVEMENT V2: Implement V2. Create files, test, document in IMPLEMENTATION_LOG_V2.md."
    },
    {
      "id": "evolve-8",
      "phase": 3,
      "description": "MEASURE V2 IMPACT: Benchmark V2. Compare to V1 baseline. Write BENCHMARK_V2.md."
    },
    {
      "id": "evolve-9",
      "phase": 3,
      "description": "ITERATE - DESIGN V3: Based on V2 results, design V3 improvement. Write IMPROVEMENT_SPEC_V3.md."
    },
    {
      "id": "evolve-10",
      "phase": 4,
      "description": "IMPLEMENT V3: Implement V3 improvement. Document in IMPLEMENTATION_LOG_V3.md."
    },
    {
      "id": "evolve-11",
      "phase": 4,
      "description": "FINAL BENCHMARK: Comprehensive benchmark comparing original baseline to V3. Write EVOLUTION_RESULTS.md with full metrics."
    },
    {
      "id": "evolve-12",
      "phase": 4,
      "description": "ARCHITECTURE SYNTHESIS: Combine all improvements into a unified EVOLVED_ARCHITECTURE.md. This is the new canonical architecture document. Include: what changed, why, measured impact, and recommended next steps."
    },
    {
      "id": "evolve-13",
      "phase": 5,
      "description": "SELF-CRITIQUE: Honestly evaluate the evolution process. What worked? What failed? What would you do differently? Write SELF_CRITIQUE.md - be brutally honest."
    },
    {
      "id": "evolve-14",
      "phase": 5,
      "description": "FUTURE ROADMAP: Based on everything learned, write NEXT_EVOLUTION_ROADMAP.md - what should the NEXT $1 of compute be spent on? Prioritize by expected impact."
    },
    {
      "id": "evolve-15",
      "phase": 5,
      "description": "META-LEARNING: Extract generalizable lessons from this evolution cycle. What patterns emerged? Write META_LESSONS_LEARNED.md that future swarm runs can use to be smarter from the start."
    }
  ]
}
