{
  "id": "wai-aria-apg__WAI_ARIA_apg_patterns_combobox_",
  "source_id": "wai-aria-apg",
  "source_name": "WAI-ARIA Authoring Practices Guide",
  "category": "accessibility",
  "url": "https://www.w3.org/WAI/ARIA/apg/patterns/combobox/",
  "title": "Combobox Pattern | APG | WAI | W3C",
  "content": "Combobox Pattern\nAbout This Pattern\nA\ncombobox\nis an input widget that has an associated popup.\n          The popup enables users to choose a value for the input from a collection.\n          The popup may be a\nlistbox\n,\ngrid\n,\ntree\n, or\ndialog.\nIn some implementations, the popup presents allowed values, while in other implementations, the popup presents suggested values.\n          Many implementations also include a third optional element -- a graphical\nOpen\nbutton adjacent to the combobox, which indicates availability of the popup.\n          Activating the\nOpen\nbutton displays the popup if suggestions are available.\nThe combobox pattern supports several optional behaviors.\n          The one that most shapes interaction is text input.\n          Some comboboxes allow users to type and edit text in the combobox and others do not.\n          If a combobox does not support text input, it is referred to as select-only, meaning the only way users can set its value is by selecting a value in the popup.\n          For example, in some browsers, an HTML\nselect\nelement with\nsize=\"1\"\nis presented to assistive technologies as a combobox.\n          Alternatively, if a combobox supports text input, it is referred to as editable.\n          An editable combobox may either allow users to input any arbitrary value, or it may restrict its value to a discrete set of allowed values, in which case typing input serves to filter suggestions presented in the popup.\nThe popup is hidden by default, i.e., the default state is collapsed.\n          The conditions that trigger expansion -- display of the popup --are specific to each implementation.\n          Some possible conditions that trigger expansion include:\nIt is displayed when the\nDown Arrow\nkey is pressed or the\nOpen\nbutton is activated.\n            Optionally, if the combobox is editable and contains a string that does not match an allowed value, expansion does not occur.\nIt is displayed when the combobox receives focus even if the combobox is editable and empty.\nIf the combobox is editable, the popup is displayed only if a certain number of characters are typed in the combobox and those characters match some portion of one of the suggested values.\nCombobox widgets are useful for acquiring user input in either of two scenarios:\nThe value must be one of a predefined set of allowed values, e.g., a location field must contain a valid location name.\n            Note that the listbox and menu button patterns are also useful in this scenario; differences between combobox and alternative patterns are described below.\nAn arbitrary value is allowed, but it is advantageous to suggest possible values to users.\n            For example, a search field may suggest similar or previous searches to save the user time.\nThe nature of possible values presented by a popup and the way they are presented is called the autocomplete behavior.\n          Comboboxes can have one of four forms of autocomplete:\nNo autocomplete:\nThe combobox is editable, and when the popup is triggered, the suggested values it contains are the same regardless of the characters typed in the combobox.\n            For example, the popup suggests a set of recently entered values, and the suggestions do not change as the user types.\nList autocomplete with manual selection:\nWhen the popup is triggered, it presents suggested values.\n            If the combobox is editable, the suggested values complete or logically correspond to the characters typed in the combobox.\n            The character string the user has typed will become the value of the combobox unless the user selects a value in the popup.\nList autocomplete with automatic selection:\nThe combobox is editable, and when the popup is triggered, it presents suggested values that complete or logically correspond to the characters typed in the combobox, and the first suggestion is automatically highlighted as selected.\n            The automatically selected suggestion becomes the value of the combobox when the combobox loses focus unless the user chooses a different suggestion or changes the character string in the combobox.\nList with inline autocomplete:\nThis is the same as list with automatic selection with one additional feature.\n            The portion of the selected suggestion that has not been typed by the user, a completion string, appears inline after the input cursor in the combobox.\n            The inline completion string is visually highlighted and has a selected state.\nIf a combobox is editable and has any form of list autocomplete, the popup may appear and disappear as the user types.\n          For example, if the user types a two character string that triggers five suggestions to be displayed but then types a third character that forms a string that does not have any matching suggestions, the popup may close and, if present, the inline completion string disappears.\nTwo other widgets that are also visually compact and enable users to make a single choice from a set of discrete choices are\nlistbox\nand\nmenu button\n.\n          One feature that distinguishes combobox from both listbox and menu button is that the user's choice can be presented as a value in an editable field, which gives users the ability to select some or all of the value for copying to the clipboard.\n          Comboboxes and menu buttons can be implemented so users can explore the set of allowed choices without losing a previously made choice.\n          That is, users can navigate the set of available choices in a combobox popup or menu and then press\nescape\n, which closes the popup or menu without changing previous input.\n          In contrast, navigating among options in a single-select listbox immediately changes its value, and\nEscape\ndoes not provide an undo mechanism.\n          Comboboxes and listboxes can be marked as required with\naria-required=\"true\"\n, and they have an accessible name that is distinct from their value.\n          Thus, when assistive technology users focus either a combobox or listbox in its default state, they can perceive both a name and value for the widget.\n          However, a menu button cannot be marked required, and while it has an accessible name, it does not have a value so is not suitable for conveying the user's choice in its collapsed state.\nExamples\nSelect-Only Combobox\n: A single-select combobox with no text input that is functionally similar to an HTML\nselect\nelement.\nEditable Combobox with Both List and Inline Autocomplete\n: An editable combobox that demonstrates the autocomplete behavior known as\nlist with inline autocomplete\n.\nEditable Combobox with List Autocomplete\n: An editable combobox that demonstrates the autocomplete behavior known as\nlist with manual selection\n.\nEditable Combobox Without Autocomplete\n: An editable combobox that demonstrates the behavior associated with\naria-autocomplete=none\n.\nEditable Combobox with Grid Popup\n: An editable combobox that presents suggestions in a grid, enabling users to navigate descriptive information about each suggestion.\nDate Picker Combobox\n: An editable date input combobox that opens a dialog containing a calendar grid and buttons for navigating by month and year.\nKeyboard Interaction\nTab\n: The combobox is in the page\nTab\nsequence.\nNote: The popup indicator icon or button (if present), the popup, and the popup descendants are excluded from the page\nTab\nsequence.\nCombobox Keyboard Interaction\nWhen focus is in the combobox:\nDown Arrow\n: If the popup is available, moves focus into the popup:\nIf the autocomplete behavior automatically selected a suggestion before\nDown Arrow\nwas pressed, focus is placed on the suggestion following the automatically selected suggestion.\nOtherwise, places focus on the first focusable element in the popup.\nUp Arrow\n(Optional): If the popup is available, places focus on the last focusable element in the popup.\nEscape\n: Dismisses the popup if it is visible.\n            Optionally, if the popup is hidden before\nEscape\nis pressed, clears the combobox.\nEnter\n: If the combobox is editable and an autocomplete suggestion is selected in the popup, accepts the suggestion either by placing the input cursor at the end of the accepted value in the combobox or by performing a default action on the value.\n            For example, in a messaging application, the default action may be to add the accepted value to a list of message recipients and then clear the combobox so the user can add another recipient.\nPrintable Characters:\nIf the combobox is editable, type characters in the combobox.\n                Note that some implementations may regard certain characters as invalid and prevent their input.\nIf the combobox is not editable, optionally moves focus to a value that starts with the typed characters.\nIf the combobox is editable, it supports standard single line text editing keys appropriate for the device platform (see note below).\nAlt\n+\nDown Arrow\n(Optional): If the popup is available but not displayed, displays the popup without moving focus.\nAlt\n+\nUp Arrow\n(Optional): If the popup is displayed:\nIf the popup contains focus, returns focus to the combobox.\nCloses the popup.\nNote\nStandard single line text editing keys appropriate for the device platform:\ninclude keys for input, cursor movement, selection, and text manipulation.\nStandard key assignments for editing functions depend on the device operating system.\nThe most robust approach for providing text editing functions is to rely on browsers, which supply them for HTML inputs with type text and for elements with the\ncontenteditable\nHTML attribute.\nIMPORTANT:\nEnsure JavaScript does not interfere with browser-provided text editing functions by capturing key events for the keys used to perform them.\nListbox Popup Keyboard Interaction\nWhen focus is in a listbox popup:\nEnter\n: Accepts the focused option in the listbox by closing the popup, placing the accepted value in the combobox, and if the combobox is editable, placing the input cursor at the end of the value.\nEscape\n: Closes the popup and returns focus to the combobox.\n            Optionally, if the combobox is editable, clears the contents of the combobox.\nDown Arrow\n: Moves focus to and selects the next option.\n            If focus is on the last option, either returns focus to the combobox or does nothing.\nUp Arrow\n: Moves focus to and selects the previous option.\n            If focus is on the first option, either returns focus to the combobox or does nothing.\nRight Arrow\n: If the combobox is editable, returns focus to the combobox without closing the popup and moves the input cursor one character to the right.\n            If the input cursor is on the right-most character, the cursor does not move.\nLeft Arrow\n: If the combobox is editable, returns focus to the combobox without closing the popup and moves the input cursor one character to the left.\n            If the input cursor is on the left-most character, the cursor does not move.\nHome\n(Optional): Either moves focus to and selects the first option or, if the combobox is editable, returns focus to the combobox and places the cursor on the first character.\nEnd\n(Optional): Either moves focus to the last option or, if the combobox is editable, returns focus to the combobox and places the cursor after the last character.\nAny printable character:\nIf the combobox is editable, returns the focus to the combobox without closing the popup and types the character.\nOtherwise, moves focus to the next option with a name that starts with the characters typed.\nBackspace\n(Optional): If the combobox is editable, returns focus to the combobox and deletes the character prior to the cursor.\nDelete\n(Optional): If the combobox is editable, returns focus to the combobox, removes the selected state if a suggestion was selected, and removes the inline autocomplete string if present.\nNote\nDOM Focus is maintained on the combobox and the assistive technology focus is moved within the listbox using\naria-activedescendant\nas described in\nManaging Focus in Composites Using aria-activedescendant\n.\nSelection follows focus in the listbox; the listbox allows only one suggested value to be selected at a time for the combobox value.\nGrid Popup Keyboard Interaction\nIn a grid popup, each suggested value may be represented by either a single cell or an entire row.\n          See notes below for how this aspect of grid design effects the keyboard interaction design and the way that selection moves in response to focus movements.\nEnter\n: Accepts the currently selected suggested value by closing the popup, placing the selected value in the combobox, and if the combobox is editable, placing the input cursor at the end of the value.\nEscape\n: Closes the popup and returns focus to the combobox.\n            Optionally, if the combobox is editable, clears the contents of the combobox.\nRight Arrow\n: Moves focus one cell to the right.\n            Optionally, if focus is on the right-most cell in the row, focus may move to the first cell in the following row.\n            If focus is on the last cell in the grid, either does nothing or returns focus to the combobox.\nLeft Arrow\n: Moves focus one cell to the left.\n            Optionally, if focus is on the left-most cell in the row, focus may move to the last cell in the previous row.\n            If focus is on the first cell in the grid, either does nothing or returns focus to the combobox.\nDown Arrow\n: Moves focus one cell down.\n            If focus is in the last row of the grid, either does nothing or returns focus to the combobox.\nUp Arrow\n: Moves focus one cell up.\n            If focus is in the first row of the grid, either does nothing or returns focus to the combobox.\nPage Down\n(Optional): Moves focus down an author-determined number of rows, typically scrolling so the bottom row in the currently visible set of rows becomes one of the first visible rows.\n            If focus is in the last row of the grid, focus does not move.\nPage Up\n(Optional): Moves focus up an author-determined number of rows, typically scrolling so the top row in the currently visible set of rows becomes one of the last visible rows.\n            If focus is in the first row of the grid, focus does not move.\nHome\n(Optional):\nEither:\nMoves focus to the first cell in the row that contains focus.\n                Or, if the grid has fewer than three cells per row or multiple suggested values per row, focus may move to the first cell in the grid.\nIf the combobox is editable, returns focus to the combobox and places the cursor on the first character.\nEnd\n(Optional):\nEither:\nMoves focus to the last cell in the row that contains focus.\n                Or, if the grid has fewer than three cells per row or multiple suggested values per row, focus may move to the last cell in the grid.\nIf the combobox is editable, returns focus to the combobox and places the cursor after the last character.\nControl\n+\nHome\n(optional): moves focus to the first row.\nControl\n+\nEnd\n(Optional): moves focus to the last row.\nAny printable character: If the combobox is editable, returns the focus to the combobox without closing the popup and types the character.\nBackspace\n(Optional): If the combobox is editable, returns focus to the combobox and deletes the character prior to the cursor.\nDelete\n(Optional): If the combobox is editable, returns focus to the combobox, removes the selected state if a suggestion was selected, and removes the inline autocomplete string if present.\nNote\nDOM Focus is maintained on the combobox and the assistive technology focus is moved within the grid using\naria-activedescendant\nas described in\nManaging Focus in Composites Using aria-activedescendant\n.\nThe grid allows only one suggested value to be selected at a time for the combobox value.\nIn a grid popup, each suggested value may be represented by either a single cell or an entire row.\n              This aspect of design effects focus and selection movement:\nIf every cell contains a different suggested value:\nSelection follows focus so that the cell containing focus is selected.\nHorizontal arrow key navigation typically wraps from one row to another.\nVertical arrow key navigation typically wraps from one column to another.\nIf all cells in a row contain information about the same suggested value:\nEither the row containing focus is selected or a cell containing a suggested value is selected when any cell in the same row contains focus.\nHorizontal key navigation may wrap from one row to another.\nVertical arrow key navigation\ndoes not\nwrap from one column to another.\nTree Popup Keyboard Interaction\nIn some implementations of tree popups, some or all parent nodes may serve as suggestion category labels so may not be selectable values.\n          See notes below for how this aspect of the design effects the way selection moves in response to focus movements.\nWhen focus is in a vertically oriented tree popup:\nEnter\n: Accepts the currently selected suggested value by closing the popup, placing the selected value in the combobox, and if the combobox is editable, placing the input cursor at the end of the value.\nEscape\n: Closes the popup and returns focus to the combobox.\n            Optionally, clears the contents of the combobox.\nRight arrow\n:\nWhen focus is on a closed node, opens the node; focus and selection do not move.\nWhen focus is on a open node, moves focus to the first child node and selects it if it is selectable.\nWhen focus is on an end node, does nothing.\nLeft arrow\n:\nWhen focus is on an open node, closes the node.\nWhen focus is on a child node that is also either an end node or a closed node, moves focus to its parent node and selects it if it is selectable.\nWhen focus is on a root node that is also either an end node or a closed node, does nothing.\nDown Arrow\n: Moves focus to the next node that is focusable without opening or closing a node and selects it if it is selectable.\nUp Arrow\n: Moves focus to the previous node that is focusable without opening or closing a node and selects it if it is selectable.\nHome\n: Moves focus to the first focusable node in the tree without opening or closing a node and selects it if it is selectable.\nEnd\n: Moves focus to the last focusable node in the tree without opening or closing a node and selects it if it is selectable.\nAny printable character:\nIf the combobox is editable, returns the focus to the combobox without closing the popup and types the character.\nOtherwise, moves focus to the next suggested value with a name that starts with the characters typed.\nNote\nDOM Focus is maintained on the combobox and the assistive technology focus is moved within the tree using\naria-activedescendant\nas described in\nManaging Focus in Composites Using aria-activedescendant\n.\nThe tree allows only one suggested value to be selected at a time for the combobox value.\nIn a tree popup, some or all parent nodes may not be selectable values; they may serve as category labels for suggested values.\n              If focus moves to a node that is not a selectable value, either:\nThe previously selected node, if any, remains selected until focus moves to a node that is selectable.\nThere is no selected value.\nIn either case, focus is visually distinct from selection so users can readily see if a value is selected or not.\nIf nodes in the tree are arranged horizontally (\naria-orientation\nis set to\nhorizontal\n):\nDown Arrow\nperforms as\nRight Arrow\nis described above, and vice versa.\nUp Arrow\nperforms as\nLeft Arrow\nis described above, and vice versa.\nDialog Popup Keyboard Interaction\nWhen focus is in a dialog popup:\nThere are two ways to close the popup and return focus to the combobox:\nPerform an action in the dialog, such as activate a button, that specifies a value for the combobox.\nCancel out of the dialog, e.g., press\nEscape\nor activate the cancel button in the dialog.\n                Canceling either returns focus to the text box without changing the combobox value or returns focus to the combobox and clears the combobox.\nThe dialog implements the keyboard interaction defined in the\nmodal dialog pattern.\nNote\nUnlike other combobox popups, dialogs do not support\naria-activedescendant\nso DOM focus moves into the dialog from the combobox.\nWAI-ARIA Roles, States, and Properties\nThe element that serves as an input and displays the combobox value has role\ncombobox\n.\nThe combobox element has\naria-controls\nset to a value that refers to the element that serves as the popup.\n            Note that\naria-controls\nonly needs to be set when the popup is visible.\n            However, it is valid to reference an element that is not visible.\nThe popup is an element that has role\nlistbox\n,\ntree\n,\ngrid\n, or\ndialog\n.\nIf the popup has a role other than\nlistbox\n, the element with role\ncombobox\nhas\naria-haspopup\nset to a value that corresponds to the popup type.\n            That is,\naria-haspopup\nis set to\ngrid\n,\ntree\n, or\ndialog\n.\n            Note that elements with role\ncombobox\nhave an implicit\naria-haspopup\nvalue of\nlistbox\n.\nWhen the combobox popup is not visible, the element with role\ncombobox\nhas\naria-expanded\nset to\nfalse\n.\n            When the popup element is visible,\naria-expanded\nis set to\ntrue\n.\n            Note that elements with role\ncombobox\nhave a default value for\naria-expanded\nof\nfalse\n.\nWhen a combobox receives focus, DOM focus is placed on the combobox element.\nWhen a descendant of a listbox, grid, or tree popup is focused, DOM focus remains on the combobox and the combobox has\naria-activedescendant\nset to a value that refers to the focused element within the popup.\nFor a combobox that controls a listbox, grid, or tree popup, when a suggested value is visually indicated as the currently selected value, the\noption\n,\ngridcell\n,\nrow\n, or\ntreeitem\ncontaining that value has\naria-selected\nset to\ntrue\n.\nIf the combobox has a visible label and the combobox element is an HTML element that can be labelled using the HTML\nlabel\nelement (e.g., the\ninput\nelement), it is labeled using the\nlabel\nelement.\n            Otherwise, if it has a visible label, the combobox element has\naria-labelledby\nset to a value that refers to the labelling element.\n            Otherwise, the combobox element has a label provided by\naria-label\n.\nThe combobox element has\naria-autocomplete\nset to a value that corresponds to its autocomplete behavior:\nnone\n: When the popup is displayed, the suggested values it contains are the same regardless of the characters typed in the combobox.\nlist\n: When the popup is triggered, it presents suggested values.\n                If the combobox is editable, the values complete or logically correspond to the characters typed in the combobox.\nboth\n: When the popup is triggered, it presents suggested values that complete or logically correspond to the characters typed in the combobox.\n                In addition, the portion of the selected suggestion that has not been typed by the user, known as the\ncompletion string\n, appears inline after the input cursor in the combobox.\n                The inline completion string is visually highlighted and has a selected state.\nNote\nIn ARIA 1.0, the combobox referenced its popup with\naria-owns\ninstead of\naria-controls\n.\n              While user agents might support comboboxes with\naria-owns\nfor backwards compatibility with legacy content, it is strongly recommended that authors use\naria-controls\n.\nWhen referring to the roles, states, and properties documentation for the below list of patterns used for popups, keep in mind that a combobox is a single-select widget where selection follows focus in the popup.\nThe roles, states, and properties for popup elements are defined in their respective design patterns:\nListbox Roles, States, and Properties\nGrid Roles, States, and Properties\nTree Roles, States, and Properties\nDialog Roles, States, and Properties",
  "content_markdown": "Combobox Pattern\n\n## About This Pattern\n\nA [combobox](https://w3c.github.io/aria/#combobox) is an input widget that has an associated popup.\nThe popup enables users to choose a value for the input from a collection.\nThe popup may be a [listbox](../listbox/), [grid](../grid/), [tree](../treeview/), or [dialog.](../dialog-modal/)\n\nIn some implementations, the popup presents allowed values, while in other implementations, the popup presents suggested values.\nMany implementations also include a third optional element -- a graphical \"Open\" button adjacent to the combobox, which indicates availability of the popup.\nActivating the \"Open\" button displays the popup if suggestions are available.\n\nThe combobox pattern supports several optional behaviors.\nThe one that most shapes interaction is text input.\nSome comboboxes allow users to type and edit text in the combobox and others do not.\nIf a combobox does not support text input, it is referred to as select-only, meaning the only way users can set its value is by selecting a value in the popup.\nFor example, in some browsers, an HTML `select` element with `size=\"1\"` is presented to assistive technologies as a combobox.\nAlternatively, if a combobox supports text input, it is referred to as editable.\nAn editable combobox may either allow users to input any arbitrary value, or it may restrict its value to a discrete set of allowed values, in which case typing input serves to filter suggestions presented in the popup.\n\nThe popup is hidden by default, i.e., the default state is collapsed.\nThe conditions that trigger expansion -- display of the popup --are specific to each implementation.\nSome possible conditions that trigger expansion include:\n\n- It is displayed when the `Down Arrow` key is pressed or the \"Open\" button is activated.\n  Optionally, if the combobox is editable and contains a string that does not match an allowed value, expansion does not occur.\n- It is displayed when the combobox receives focus even if the combobox is editable and empty.\n- If the combobox is editable, the popup is displayed only if a certain number of characters are typed in the combobox and those characters match some portion of one of the suggested values.\n\nCombobox widgets are useful for acquiring user input in either of two scenarios:\n\n1. The value must be one of a predefined set of allowed values, e.g., a location field must contain a valid location name.\n   Note that the listbox and menu button patterns are also useful in this scenario; differences between combobox and alternative patterns are described below.\n2. An arbitrary value is allowed, but it is advantageous to suggest possible values to users.\n   For example, a search field may suggest similar or previous searches to save the user time.\n\nThe nature of possible values presented by a popup and the way they are presented is called the autocomplete behavior.\nComboboxes can have one of four forms of autocomplete:\n\n1. **No autocomplete:** The combobox is editable, and when the popup is triggered, the suggested values it contains are the same regardless of the characters typed in the combobox.\n   For example, the popup suggests a set of recently entered values, and the suggestions do not change as the user types.\n2. **List autocomplete with manual selection:** When the popup is triggered, it presents suggested values.\n   If the combobox is editable, the suggested values complete or logically correspond to the characters typed in the combobox.\n   The character string the user has typed will become the value of the combobox unless the user selects a value in the popup.\n3. **List autocomplete with automatic selection:** The combobox is editable, and when the popup is triggered, it presents suggested values that complete or logically correspond to the characters typed in the combobox, and the first suggestion is automatically highlighted as selected.\n   The automatically selected suggestion becomes the value of the combobox when the combobox loses focus unless the user chooses a different suggestion or changes the character string in the combobox.\n4. **List with inline autocomplete:** This is the same as list with automatic selection with one additional feature.\n   The portion of the selected suggestion that has not been typed by the user, a completion string, appears inline after the input cursor in the combobox.\n   The inline completion string is visually highlighted and has a selected state.\n\nIf a combobox is editable and has any form of list autocomplete, the popup may appear and disappear as the user types.\nFor example, if the user types a two character string that triggers five suggestions to be displayed but then types a third character that forms a string that does not have any matching suggestions, the popup may close and, if present, the inline completion string disappears.\n\nTwo other widgets that are also visually compact and enable users to make a single choice from a set of discrete choices are [listbox](../listbox/) and [menu button](../menu-button/).\nOne feature that distinguishes combobox from both listbox and menu button is that the user's choice can be presented as a value in an editable field, which gives users the ability to select some or all of the value for copying to the clipboard.\nComboboxes and menu buttons can be implemented so users can explore the set of allowed choices without losing a previously made choice.\nThat is, users can navigate the set of available choices in a combobox popup or menu and then press `escape`, which closes the popup or menu without changing previous input.\nIn contrast, navigating among options in a single-select listbox immediately changes its value, and `Escape` does not provide an undo mechanism.\nComboboxes and listboxes can be marked as required with `aria-required=\"true\"`, and they have an accessible name that is distinct from their value.\nThus, when assistive technology users focus either a combobox or listbox in its default state, they can perceive both a name and value for the widget.\nHowever, a menu button cannot be marked required, and while it has an accessible name, it does not have a value so is not suitable for conveying the user's choice in its collapsed state.\n\n![](../../../../content-images/wai-aria-practices/images/pattern-combobox.svg)\n\n## Examples\n\n- [Select-Only Combobox](examples/combobox-select-only/): A single-select combobox with no text input that is functionally similar to an HTML `select` element.\n- [Editable Combobox with Both List and Inline Autocomplete](examples/combobox-autocomplete-both/): An editable combobox that demonstrates the autocomplete behavior known as \"list with inline autocomplete\".\n- [Editable Combobox with List Autocomplete](examples/combobox-autocomplete-list/): An editable combobox that demonstrates the autocomplete behavior known as \"list with manual selection\".\n- [Editable Combobox Without Autocomplete](examples/combobox-autocomplete-none/): An editable combobox that demonstrates the behavior associated with `aria-autocomplete=none`.\n- [Editable Combobox with Grid Popup](examples/grid-combo/): An editable combobox that presents suggestions in a grid, enabling users to navigate descriptive information about each suggestion.\n- [Date Picker Combobox](examples/combobox-datepicker/): An editable date input combobox that opens a dialog containing a calendar grid and buttons for navigating by month and year.\n\n## Keyboard Interaction\n\n- `Tab`: The combobox is in the page `Tab` sequence.\n- Note: The popup indicator icon or button (if present), the popup, and the popup descendants are excluded from the page `Tab` sequence.\n\n### Combobox Keyboard Interaction\n\nWhen focus is in the combobox:\n\n- `Down Arrow`: If the popup is available, moves focus into the popup:\n  - If the autocomplete behavior automatically selected a suggestion before `Down Arrow` was pressed, focus is placed on the suggestion following the automatically selected suggestion.\n  - Otherwise, places focus on the first focusable element in the popup.\n- `Up Arrow` (Optional): If the popup is available, places focus on the last focusable element in the popup.\n- `Escape`: Dismisses the popup if it is visible.\n  Optionally, if the popup is hidden before `Escape` is pressed, clears the combobox.\n- `Enter`: If the combobox is editable and an autocomplete suggestion is selected in the popup, accepts the suggestion either by placing the input cursor at the end of the accepted value in the combobox or by performing a default action on the value.\n  For example, in a messaging application, the default action may be to add the accepted value to a list of message recipients and then clear the combobox so the user can add another recipient.\n- Printable Characters:\n  - If the combobox is editable, type characters in the combobox.\n    Note that some implementations may regard certain characters as invalid and prevent their input.\n  - If the combobox is not editable, optionally moves focus to a value that starts with the typed characters.\n- If the combobox is editable, it supports standard single line text editing keys appropriate for the device platform (see note below).\n- `Alt` + `Down Arrow` (Optional): If the popup is available but not displayed, displays the popup without moving focus.\n- `Alt` + `Up Arrow` (Optional): If the popup is displayed:\n  - If the popup contains focus, returns focus to the combobox.\n  - Closes the popup.\n\n#### Note\n\nStandard single line text editing keys appropriate for the device platform:\n\n1. include keys for input, cursor movement, selection, and text manipulation.\n2. Standard key assignments for editing functions depend on the device operating system.\n3. The most robust approach for providing text editing functions is to rely on browsers, which supply them for HTML inputs with type text and for elements with the `contenteditable` HTML attribute.\n4. **IMPORTANT:** Ensure JavaScript does not interfere with browser-provided text editing functions by capturing key events for the keys used to perform them.\n\n### Listbox Popup Keyboard Interaction\n\nWhen focus is in a listbox popup:\n\n- `Enter`: Accepts the focused option in the listbox by closing the popup, placing the accepted value in the combobox, and if the combobox is editable, placing the input cursor at the end of the value.\n- `Escape`: Closes the popup and returns focus to the combobox.\n  Optionally, if the combobox is editable, clears the contents of the combobox.\n- `Down Arrow`: Moves focus to and selects the next option.\n  If focus is on the last option, either returns focus to the combobox or does nothing.\n- `Up Arrow`: Moves focus to and selects the previous option.\n  If focus is on the first option, either returns focus to the combobox or does nothing.\n- `Right Arrow`: If the combobox is editable, returns focus to the combobox without closing the popup and moves the input cursor one character to the right.\n  If the input cursor is on the right-most character, the cursor does not move.\n- `Left Arrow`: If the combobox is editable, returns focus to the combobox without closing the popup and moves the input cursor one character to the left.\n  If the input cursor is on the left-most character, the cursor does not move.\n- `Home` (Optional): Either moves focus to and selects the first option or, if the combobox is editable, returns focus to the combobox and places the cursor on the first character.\n- `End` (Optional): Either moves focus to the last option or, if the combobox is editable, returns focus to the combobox and places the cursor after the last character.\n- Any printable character:\n  - If the combobox is editable, returns the focus to the combobox without closing the popup and types the character.\n  - Otherwise, moves focus to the next option with a name that starts with the characters typed.\n- `Backspace` (Optional): If the combobox is editable, returns focus to the combobox and deletes the character prior to the cursor.\n- `Delete` (Optional): If the combobox is editable, returns focus to the combobox, removes the selected state if a suggestion was selected, and removes the inline autocomplete string if present.\n\n#### Note\n\n1. DOM Focus is maintained on the combobox and the assistive technology focus is moved within the listbox using `aria-activedescendant` as described in\n   [Managing Focus in Composites Using aria-activedescendant](../../practices/keyboard-interface/#kbd_focus_activedescendant).\n2. Selection follows focus in the listbox; the listbox allows only one suggested value to be selected at a time for the combobox value.\n\n### Grid Popup Keyboard Interaction\n\nIn a grid popup, each suggested value may be represented by either a single cell or an entire row.\nSee notes below for how this aspect of grid design effects the keyboard interaction design and the way that selection moves in response to focus movements.\n\n- `Enter`: Accepts the currently selected suggested value by closing the popup, placing the selected value in the combobox, and if the combobox is editable, placing the input cursor at the end of the value.\n- `Escape`: Closes the popup and returns focus to the combobox.\n  Optionally, if the combobox is editable, clears the contents of the combobox.\n- `Right Arrow`: Moves focus one cell to the right.\n  Optionally, if focus is on the right-most cell in the row, focus may move to the first cell in the following row.\n  If focus is on the last cell in the grid, either does nothing or returns focus to the combobox.\n- `Left Arrow`: Moves focus one cell to the left.\n  Optionally, if focus is on the left-most cell in the row, focus may move to the last cell in the previous row.\n  If focus is on the first cell in the grid, either does nothing or returns focus to the combobox.\n- `Down Arrow`: Moves focus one cell down.\n  If focus is in the last row of the grid, either does nothing or returns focus to the combobox.\n- `Up Arrow`: Moves focus one cell up.\n  If focus is in the first row of the grid, either does nothing or returns focus to the combobox.\n- `Page Down` (Optional): Moves focus down an author-determined number of rows, typically scrolling so the bottom row in the currently visible set of rows becomes one of the first visible rows.\n  If focus is in the last row of the grid, focus does not move.\n- `Page Up` (Optional): Moves focus up an author-determined number of rows, typically scrolling so the top row in the currently visible set of rows becomes one of the last visible rows.\n  If focus is in the first row of the grid, focus does not move.\n- `Home` (Optional): **Either:**\n  - Moves focus to the first cell in the row that contains focus.\n    Or, if the grid has fewer than three cells per row or multiple suggested values per row, focus may move to the first cell in the grid.\n  - If the combobox is editable, returns focus to the combobox and places the cursor on the first character.\n- `End` (Optional): **Either:**\n  - Moves focus to the last cell in the row that contains focus.\n    Or, if the grid has fewer than three cells per row or multiple suggested values per row, focus may move to the last cell in the grid.\n  - If the combobox is editable, returns focus to the combobox and places the cursor after the last character.\n- `Control` + `Home` (optional): moves focus to the first row.\n- `Control` + `End` (Optional): moves focus to the last row.\n- Any printable character: If the combobox is editable, returns the focus to the combobox without closing the popup and types the character.\n- `Backspace` (Optional): If the combobox is editable, returns focus to the combobox and deletes the character prior to the cursor.\n- `Delete` (Optional): If the combobox is editable, returns focus to the combobox, removes the selected state if a suggestion was selected, and removes the inline autocomplete string if present.\n\n#### Note\n\n1. DOM Focus is maintained on the combobox and the assistive technology focus is moved within the grid using `aria-activedescendant` as described in\n   [Managing Focus in Composites Using aria-activedescendant](../../practices/keyboard-interface/#kbd_focus_activedescendant).\n2. The grid allows only one suggested value to be selected at a time for the combobox value.\n3. In a grid popup, each suggested value may be represented by either a single cell or an entire row.\n   This aspect of design effects focus and selection movement:\n   1. If every cell contains a different suggested value:\n      - Selection follows focus so that the cell containing focus is selected.\n      - Horizontal arrow key navigation typically wraps from one row to another.\n      - Vertical arrow key navigation typically wraps from one column to another.\n   2. If all cells in a row contain information about the same suggested value:\n      - Either the row containing focus is selected or a cell containing a suggested value is selected when any cell in the same row contains focus.\n      - Horizontal key navigation may wrap from one row to another.\n      - Vertical arrow key navigation **does not** wrap from one column to another.\n\n### Tree Popup Keyboard Interaction\n\nIn some implementations of tree popups, some or all parent nodes may serve as suggestion category labels so may not be selectable values.\nSee notes below for how this aspect of the design effects the way selection moves in response to focus movements.\n\nWhen focus is in a vertically oriented tree popup:\n\n- `Enter`: Accepts the currently selected suggested value by closing the popup, placing the selected value in the combobox, and if the combobox is editable, placing the input cursor at the end of the value.\n- `Escape`: Closes the popup and returns focus to the combobox.\n  Optionally, clears the contents of the combobox.\n- `Right arrow`:\n  - When focus is on a closed node, opens the node; focus and selection do not move.\n  - When focus is on a open node, moves focus to the first child node and selects it if it is selectable.\n  - When focus is on an end node, does nothing.\n- `Left arrow`:\n  - When focus is on an open node, closes the node.\n  - When focus is on a child node that is also either an end node or a closed node, moves focus to its parent node and selects it if it is selectable.\n  - When focus is on a root node that is also either an end node or a closed node, does nothing.\n- `Down Arrow`: Moves focus to the next node that is focusable without opening or closing a node and selects it if it is selectable.\n- `Up Arrow`: Moves focus to the previous node that is focusable without opening or closing a node and selects it if it is selectable.\n- `Home`: Moves focus to the first focusable node in the tree without opening or closing a node and selects it if it is selectable.\n- `End`: Moves focus to the last focusable node in the tree without opening or closing a node and selects it if it is selectable.\n- Any printable character:\n  - If the combobox is editable, returns the focus to the combobox without closing the popup and types the character.\n  - Otherwise, moves focus to the next suggested value with a name that starts with the characters typed.\n\n#### Note\n\n1. DOM Focus is maintained on the combobox and the assistive technology focus is moved within the tree using `aria-activedescendant` as described in\n   [Managing Focus in Composites Using aria-activedescendant](../../practices/keyboard-interface/#kbd_focus_activedescendant).\n2. The tree allows only one suggested value to be selected at a time for the combobox value.\n3. In a tree popup, some or all parent nodes may not be selectable values; they may serve as category labels for suggested values.\n   If focus moves to a node that is not a selectable value, either:\n   - The previously selected node, if any, remains selected until focus moves to a node that is selectable.\n   - There is no selected value.\n   - In either case, focus is visually distinct from selection so users can readily see if a value is selected or not.\n4. If nodes in the tree are arranged horizontally ([aria-orientation](https://w3c.github.io/aria/#aria-orientation) is set to `horizontal`):\n   1. `Down Arrow` performs as `Right Arrow` is described above, and vice versa.\n   2. `Up Arrow` performs as `Left Arrow` is described above, and vice versa.\n\n### Dialog Popup Keyboard Interaction\n\nWhen focus is in a dialog popup:\n\n- There are two ways to close the popup and return focus to the combobox:\n  1. Perform an action in the dialog, such as activate a button, that specifies a value for the combobox.\n  2. Cancel out of the dialog, e.g., press `Escape` or activate the cancel button in the dialog.\n     Canceling either returns focus to the text box without changing the combobox value or returns focus to the combobox and clears the combobox.\n- The dialog implements the keyboard interaction defined in the [modal dialog pattern.](../dialog-modal/)\n\n#### Note\n\nUnlike other combobox popups, dialogs do not support `aria-activedescendant` so DOM focus moves into the dialog from the combobox.\n\n## WAI-ARIA Roles, States, and Properties\n\n- The element that serves as an input and displays the combobox value has role [combobox](https://w3c.github.io/aria/#combobox).\n- The combobox element has [aria-controls](https://w3c.github.io/aria/#aria-controls) set to a value that refers to the element that serves as the popup.\n  Note that `aria-controls` only needs to be set when the popup is visible.\n  However, it is valid to reference an element that is not visible.\n- The popup is an element that has role [listbox](https://w3c.github.io/aria/#listbox), [tree](https://w3c.github.io/aria/#tree), [grid](https://w3c.github.io/aria/#grid), or [dialog](https://w3c.github.io/aria/#dialog).\n- If the popup has a role other than `listbox`, the element with role `combobox` has [aria-haspopup](https://w3c.github.io/aria/#aria-haspopup) set to a value that corresponds to the popup type.\n  That is, `aria-haspopup` is set to `grid`, `tree`, or `dialog`.\n  Note that elements with role `combobox` have an implicit `aria-haspopup` value of `listbox`.\n- When the combobox popup is not visible, the element with role `combobox` has [aria-expanded](https://w3c.github.io/aria/#aria-expanded) set to `false`.\n  When the popup element is visible, `aria-expanded` is set to `true`.\n  Note that elements with role `combobox` have a default value for `aria-expanded` of `false`.\n- When a combobox receives focus, DOM focus is placed on the combobox element.\n- When a descendant of a listbox, grid, or tree popup is focused, DOM focus remains on the combobox and the combobox has [aria-activedescendant](https://w3c.github.io/aria/#aria-activedescendant) set to a value that refers to the focused element within the popup.\n- For a combobox that controls a listbox, grid, or tree popup, when a suggested value is visually indicated as the currently selected value, the `option`, `gridcell`, `row`, or `treeitem` containing that value has [aria-selected](https://w3c.github.io/aria/#aria-selected) set to `true`.\n- If the combobox has a visible label and the combobox element is an HTML element that can be labelled using the HTML `label` element (e.g., the `input` element), it is labeled using the `label` element.\n  Otherwise, if it has a visible label, the combobox element has [aria-labelledby](https://w3c.github.io/aria/#aria-labelledby) set to a value that refers to the labelling element.\n  Otherwise, the combobox element has a label provided by [aria-label](https://w3c.github.io/aria/#aria-label).\n- The combobox element has [aria-autocomplete](https://w3c.github.io/aria/#aria-autocomplete) set to a value that corresponds to its autocomplete behavior:\n  - `none`: When the popup is displayed, the suggested values it contains are the same regardless of the characters typed in the combobox.\n  - `list`: When the popup is triggered, it presents suggested values.\n    If the combobox is editable, the values complete or logically correspond to the characters typed in the combobox.\n  - `both`: When the popup is triggered, it presents suggested values that complete or logically correspond to the characters typed in the combobox.\n    In addition, the portion of the selected suggestion that has not been typed by the user, known as the \"completion string\", appears inline after the input cursor in the combobox.\n    The inline completion string is visually highlighted and has a selected state.\n\n### Note\n\n1. In ARIA 1.0, the combobox referenced its popup with [aria-owns](https://w3c.github.io/aria/#aria-owns) instead of [aria-controls](https://w3c.github.io/aria/#aria-controls).\n   While user agents might support comboboxes with [aria-owns](https://w3c.github.io/aria/#aria-owns) for backwards compatibility with legacy content, it is strongly recommended that authors use [aria-controls](https://w3c.github.io/aria/#aria-controls).\n2. When referring to the roles, states, and properties documentation for the below list of patterns used for popups, keep in mind that a combobox is a single-select widget where selection follows focus in the popup.\n3. The roles, states, and properties for popup elements are defined in their respective design patterns:\n   - [Listbox Roles, States, and Properties](../listbox/#roles_states_properties)\n   - [Grid Roles, States, and Properties](../grid/#roles_states_properties)\n   - [Tree Roles, States, and Properties](../treeview/#roles_states_properties)\n   - [Dialog Roles, States, and Properties](../dialog-modal/#roles_states_properties)",
  "tags": [
    "aria",
    "accessibility",
    "patterns",
    "w3c"
  ],
  "extracted_at": "2026-02-03T14:23:49.125075+00:00",
  "content_length": 23833,
  "content_hash": "4caa6f1df40749cf"
}