{
  "id": "wai-aria-apg__WAI_ARIA_apg_practices_names-and-descriptions_",
  "source_id": "wai-aria-apg",
  "source_name": "WAI-ARIA Authoring Practices Guide",
  "category": "accessibility",
  "url": "https://www.w3.org/WAI/ARIA/apg/practices/names-and-descriptions/",
  "title": "Providing Accessible Names and Descriptions | APG | WAI | W3C",
  "content": "Providing Accessible Names and Descriptions\nIntroduction\nProviding elements with accessible names, and where appropriate, accessible descriptions, is one of the most important responsibilities authors have when developing accessible web experiences.\n          While doing so is straightforward for most elements, technical mistakes that can completely block users of assistive technologies are easy to make and unfortunately common.\n          To help authors effectively provide accessible names and descriptions, this section explains their purpose, when authors need to provide them, how browsers assemble them, and rules for coding and composing them.\n          It also guides authors in the use of the following naming and describing techniques and WAI-ARIA properties:\nNaming:\nNaming with child content.\nNaming with a string attribute via\naria-label\n.\nNaming by referencing content with\naria-labelledby\n.\nNaming form controls with the label element.\nNaming fieldsets with the legend element.\nNaming tables and figures with captions.\nFallback names derived from titles and placeholders.\nDescribing:\nDescribing by referencing content with\naria-describedby\n.\nDescribing tables and figures with captions.\nDescriptions derived from titles.\nWhat ARE Accessible Names and Descriptions?\nAn accessible name is a short string, typically 1 to 3 words, that authors associate with an element to provide users of assistive technologies with a label for the element.\n          For example, an input field might have an accessible name of \"User ID\" or a button might be named \"Submit\".\nAn accessible name serves two primary purposes for users of assistive technologies, such as screen readers:\nConvey the purpose or intent of the element.\nDistinguish the element from other elements on the page.\nBoth the WAI-ARIA specification and WCAG require all focusable, interactive elements to have an accessible name.\n          In addition dialogs and some structural containers, such as\ntables\nand\nregions\n, are required to have a name.\n          Many other elements can be named, but whether a name will enhance the accessible experience is determined by various characteristics of the surrounding context.\n          Finally, there are some elements where providing an accessible name is technically possible but not advisable.\n          The\nAccessible Name Guidance by Role\nsection lists naming requirements and guidelines for every ARIA role.\nAn accessible description is also an author-provided string that is rendered by assistive technologies.\n          Authors supply a description when there is a need to associate additional information with an element, such as instructions or format requirements for an input field.\nAssistive technologies present names differently from descriptions.\n          For instance, screen readers typically announce the name and role of an element first, e.g., a button named\nMute Conversation\ncould be spoken as\nMute Conversation button\n.\n          If an element has a state, it could be announced either before or after the name and role; after name and role is the typical default.\n          For example, a switch button named\nMute Conversation\nin the\noff\nstate could be announced as\nMute Conversation switch button off\n.\n          Because descriptions are optional strings that are usually significantly longer than names, they are presented last, sometimes after a slight delay.\n          For example,\nMute Conversation Switch button off, Silences alerts and notifications about activity in this conversation.\nTo reduce verbosity, some screen readers do not announce descriptions by default but instead inform users of their presence so that users can press a key that will announce the description.\nHow Are Name and Description Strings Derived?\nBecause there are several elements and attributes for specifying text to include in an accessible name or description string, and because authors can combine them in a practically endless number of ways, browsers implement fairly complex algorithms for assembling the strings.\n          The sections on\naccessible name calculation\nand\naccessible description calculation\nexplain the algorithms and how they implement precedence.\n          However, most authors do not need such detailed understanding of the algorithms since nearly all circumstances where a name or description is useful are supported by the coding patterns described in the\nnaming techniques\nand\ndescribing techniques\nsections.\nCardinal Rules of Naming\nRule 1: Heed Warnings and Test Thoroughly\nSeveral of the\nnaming techniques\nbelow include notes that warn against specific coding patterns that are either prohibited by the ARIA specification or fall into gray space that is not yet fully specified.\n            Some of these prohibited or ambiguous patterns may appear logical and even yield desired names in some browsers.\n            However, it is unlikely they will provide consistent results across browsers, especially over time as work to improve the consistency of name calculation across browsers progresses.\nIn addition to heeding the warnings provided in the naming techniques, it is difficult to over emphasize the importance of testing to ensure that names browsers calculate match expectations.\nRule 2: Prefer Visible Text\nWhen a user interface includes visible text that could be used to provide an appropriate accessible name, using the visible text for the accessible name simplifies maintenance, prevents bugs, and reduces language translation requirements.\n            When names are generated from text that exists only in markup and is never displayed visually, there is a greater likelihood that accessible names will not be updated when the user interface design or content are changed.\nIf an interactive element, such as an input field or button, does not have a visually persistent text label, consider adjusting the design to include one.\n            In addition to serving as a more robust source for an accessible name, visible text labels enhance accessibility for many people with disabilities who do not use assistive technologies that present invisible accessible names.\n            In most circumstances, visible text labels also make the user interface easier to understand for all users.\nRule 3: Prefer Native Techniques\nIn HTML documents, whenever possible, rely on HTML naming techniques, such as the HTML\nlabel\nelement for form elements and\ncaption\nelement for tables.\n            While less flexible, their simplicity and reliance on visible text help ensure robust accessible experiences.\n            Several of the\nnaming techniques\nhighlight specific accessibility advantages of using HTML features instead of ARIA attributes.\nRule 4: Avoid Browser Fallback\nWhen authors do not specify an accessible name using an element or attribute that is intended for naming, browsers attempt to help assistive technology users by resorting to fallback methods for generating a name.\n            For example, the HTML\ntitle\nand\nplaceholder\nattributes are used as last resort sources of content for accessible names.\n            Because the purpose of these attributes is not naming, their content typically yields low quality accessible names that are not effective.\nRule 5: Compose Brief, Useful Names\nSimilar to how visually crowded screens and ambiguous icons reduce usability, excessively long, insufficiently distinct, or unclear accessible names can make a user interface very difficult, or even impossible, to use for someone who relies on a non-visual form of the user interface.\n            In other words, for a web experience to be accessible, its accessible names must be effective.\n            The section on\nComposing Effective and User-friendly Accessible Names\nprovides guidance for balancing brevity and clarity.\nNaming Techniques\nNaming with Child Content\nCertain elements get their name from the content they contain.\n            For example, the following link is named \"Home\".\n<a href=\"/\">Home</a>\nWhen assistive technologies render an element that gets its accessible name from its content, such as a link or button, the accessible name is the only content the user can perceive for that element.\n            This is in contrast to other elements, such as text fields or tables, where the accessible name is a label that is presented in addition to the value or content of the element.\n            For instance, the accessible name of a table can be derived from a caption element, and assistive technologies render both the caption and all other content contained inside the table.\nElements having one of the following roles are, by default, named by a string calculated from their descendant content:\nbutton\ncell\ncheckbox\ncolumnheader\ngridcell\nheading\nlink\nmenuitem (content contained in a child\nmenu\nelement is excluded.)\nmenuitemcheckbox\nmenuitemradio\noption\nradio\nrow\nrowheader\nswitch\ntab\ntooltip\ntreeitem (content included in a child\ngroup\nelement is excluded.)\nWhen calculating a name from content for an element, user agents recursively walk through each of its descendant elements, calculate a name string for each descendant, and concatenate the resulting strings.\n            In two special cases, certain descendants are ignored:\ngroup\ndescendants of\ntreeitem\nelements and\nmenu\ndescendants of\nmenuitem\nelements are omitted from the calculation.\n            For example, in the following\ntree\n, the name of the first tree item is\nFruits\n;\nApples\n,\nBananas\n, and\nOranges\nare omitted.\n<ul role=\"tree\">\n  <li role=\"treeitem\">Fruits\n    <ul role=\"group\">\n      <li role=\"treeitem\">Apples</li>\n      <li role=\"treeitem\">Bananas</li>\n      <li role=\"treeitem\">Oranges</li>\n    </ul>\n  </li>\n</ul>\nWarning\nIf an element with one of the above roles that supports naming from child content is named by using\naria-label\nor\naria-labelledby\n, content contained in the element and its descendants is hidden from assistive technology users unless the descendant content is referenced by\naria-labelledby\n.\n            It is strongly recommended to avoid using either of these attributes to override content of one of the above elements except in rare circumstances where hiding content from assistive technology users is beneficial.\n            In addition, in situations where visible content is hidden from assistive technology users by use of one of these attributes, thorough testing with assistive technologies is particularly important.\nNaming with a String Attribute Via\naria-label\nThe\naria-label\nproperty enables authors to name an element with a string that is not visually rendered.\n            For example, the name of the following button is \"Close\".\n<button type=\"button\" aria-label=\"Close\">X</button>\nThe\naria-label\nproperty is useful when there is no visible text content that will serve as an appropriate accessible name.\nThe\naria-label\nproperty affects assistive technology users in one of two different ways, depending on the role of the element to which it is applied.\n            When applied to an element with one of the roles that supports\nnaming from child content\n,\naria-label\nhides descendant content from assistive technology users and replaces it with the value of\naria-label\n.\n            However, when applied to nearly any other type of element, assistive technologies will render both the value of\naria-label\nand the content of the element.\n            For example, the name of the following navigation region is \"Product\".\n<nav aria-label=\"Product\">\n  <!-- list of navigation links to product pages -->\n</nav>\nWhen encountering this navigation region, a screen reader user will hear the name and role of the element, e.g., \"Product navigation region\", and then be able to read through the links contained in the region.\nWarning\nIf\naria-label\nis applied to an element with one of the roles that supports\nnaming from child content\n, content contained in the element and its descendants is hidden from assistive technology users.\n                It is strongly recommended to avoid using\naria-label\nto override content of one of these elements except in rare circumstances where hiding content from assistive technology users is beneficial.\nThere are certain types of elements, such as paragraphs and list items, that should not be named with\naria-label\n.\n                They are identified in the table in the\nAccessible Name Guidance by Role\nsection.\nBecause the value of\naria-label\nis not rendered visually, testing with assistive technologies to ensure the expected name is presented to users is particularly important.\nWhen a user interface is translated into multiple languages, ensure that\naria-label\nvalues are translated.\nNaming with Referenced Content Via\naria-labelledby\nThe\naria-labelledby property\nenables authors to reference other elements on the page to define an accessible name.\n            For example, the following switch is named by the text content of a previous sibling element.\n<span id=\"night-mode-label\">Night mode</span>\n<span role=\"switch\" aria-checked=\"false\" tabindex=\"0\" aria-labelledby=\"night-mode-label\"></span>\nNote that while using\naria-labelledby\nis similar in this situation to using an HTML\nlabel\nelement with the\nfor\nattribute, one significant difference is that browsers do not automatically make clicking on the labeling element activate the labeled element; that is an author responsibility.\n            However, HTML\nlabel\ncannot be used to label a\nspan\nelement.\n            Fortunately, an HTML\ninput\nwith\ntype=\"checkbox\"\nallows the ARIA\nswitch\nrole, so when feasible, using the following approach creates a more robust solution.\n<label for=\"night-mode\">Night mode</label>\n<input type=\"checkbox\" role=\"switch\" id=\"night-mode\">\nThe\naria-labelledby\nproperty is useful in a wide variety of situations because:\nIt has the highest precedence when browsers calculate accessible names, i.e., it overrides names from child content and all other naming attributes, including\naria-label\n.\nIt can concatenate content from multiple elements into a single name string.\nIt incorporates content from elements regardless of their visibility, i.e., it even includes content from elements with the HTML\nhidden\nattribute, CSS\ndisplay: none\n, or CSS\nvisibility: hidden\nin the calculated name string.\nIt incorporates the value of input elements, i.e., if it references a textbox, the value of the textbox is included in the calculated name string.\nAn example of referencing a hidden element with\naria-labelledby\ncould be a label for a night switch control:\n<span id=\"night-mode-label\" hidden>Night mode</span>\n<input type=\"checkbox\" role=\"switch\" aria-labelledby=\"night-mode-label\">\nIn some cases, the most effective name for an element is its own content combined with the content of another element.\n            Because\naria-labelledby\nhas highest precedence in name calculation, in those situations, it is possible to use\naria-labelledby\nto reference both the element itself and the other element.\n            In the following example, the \"Read more...\" link is named by the element itself and the article’s heading, resulting in a name for the link of \"Read more... 7 ways you can help save the bees\".\n<h2 id=\"bees-heading\">7 ways you can help save the bees</h2>\n<p>Bees are disappearing rapidly. Here are seven things you can do to help.</p>\n<p><a id=\"bees-read-more\" aria-labelledby=\"bees-read-more bees-heading\">Read more...</a></p>\nWhen multiple elements are referenced by\naria-labelledby\n, text content from each referenced element is concatenated in the order specified in the\naria-labelledby\nvalue.\n            If an element is referenced more than one time, only the first reference is processed.\n            When concatenating content from multiple elements, browsers trim leading and trailing white space and separate content from each element with a single space.\n<button id=\"download-button\" aria-labelledby=\"download-button download-details\">Download</button>\n<span id=\"download-details\">PDF, 2.4 MB</span>\nIn the above example, the accessible name of the button will be \"Download PDF, 2.4 MB\", with a space between \"Download\" and \"PDF\", and not \"DownloadPDF, 2.4 MB\".\nWarning\nThe\naria-labelledby\nproperty cannot be chained, i.e., if an element with\naria-labelledby\nreferences another element that also has\naria-labelledby\n, the\naria-labelledby\nattribute on the referenced element will be ignored.\nIf an element is referenced by\naria-labelledby\nmore than one time during a name calculation, the second and any subsequent references will be ignored.\nThere are certain types of elements, such as paragraphs and list items, that should not be named with\naria-labelledby\n.\n                They are identified in the table in the\nAccessible Name Guidance by Role\nsection.\nIf\naria-labelledby\nis applied to an element with one of the roles that supports\nnaming from child content\n, content contained in the element and its descendants is hidden from assistive technology users unless it is also referenced by\naria-labelledby\n.\n                It is strongly recommended to avoid using this attribute to override content of one of these elements except in rare circumstances where hiding content from assistive technology users is beneficial.\nBecause calculating the name of an element with\naria-labelledby\ncan be complex and reference hidden content, testing with assistive technologies to ensure the expected name is presented to users is particularly important.\nNaming Form Controls with the Label Element\nThe HTML\nlabel\nelement enables authors to identify content that serves as a label and associate it with a form control.\n            When a\nlabel\nelement is associated with a form control, browsers calculate an accessible name for the form control from the\nlabel\ncontent.\n            For example, text displayed adjacent to a checkbox may be visually associated with the checkbox, so it is understood as the checkbox label by users who can perceive that visual association.\n            However, unless the text is programmatically associated with the checkbox, assistive technology users will experience a checkbox without a label.\nHTML provides two ways of associating a label with a form control.\n            The one that provides the broadest browser and assistive technology support is to set the\nfor\nattribute on the\nlabel\nelement to the\nid\nof the control.\n            This way of associating the label with the control is often called explicit association.\n<input type=\"checkbox\" name=\"subscribe\" id=\"subscribe_checkbox\">\n<label for=\"subscribe_checkbox\">subscribe to our newsletter</label>\nThe other way, which is known as implicit association,  is to wrap the checkbox and the labeling text in a\nlabel\nelement.\n            Some combinations of assistive technologies and browsers fail to treat the element as having an accessible name that is specified by using implicit association.\n<label>\n<input type=\"checkbox\" name=\"subscribe\">\nsubscribe to our newsletter\n</label>\nUsing the\nlabel\nelement is an effective technique for satisfying\nRule 2: Prefer Visible Text\n.\n            It also satisfies\nRule 3: Prefer Native Techniques\n.\n            Native HTML labels offer an important usability and accessibility advantage over ARIA labeling techniques: browsers automatically make clicking the label equivalent to clicking the form control.\n            This increases the hit area of the form control.\nNaming Fieldsets with the Legend Element\nThe HTML\nfieldset\nelement can be used to group form controls, and the\nlegend\nelement can be used to give the group a name.\n            For example, a group of radio buttons can be grouped together in a\nfieldset\n, where the\nlegend\nelement labels the group for the radio buttons.\n<fieldset>\n  <legend>Select your starter class</legend>\n  <label><input type=\"radio\" name=\"starter-class\" value=\"green\">Green</label>\n  <label><input type=\"radio\" name=\"starter-class\" value=\"red\">Red</label>\n  <label><input type=\"radio\" name=\"starter-class\" value=\"blue\">Blue</label>\n</fieldset>\nThis grouping technique is particularly useful for presenting multiple choice questions.\n            It enables authors to associate a question with a group of answers.\n            If a question is not programmatically associated with its answer options, assistive technology users may access the answers without being aware of the question.\nSimilar benefits can be gained from grouping and naming other types of related form fields using\nfieldset\nand\nlegend\n.\n<fieldset>\n  <legend>Shipping address</legend>\n  <p><label>Full name <input name=\"name\" required></label></p>\n  <p><label>Address line 1 <input name=\"address-1\" required></label></p>\n  <p><label>Address line 2 <input name=\"address-2\"></label></p>\n  ...\n</fieldset>\n<fieldset>\n  <legend>Billing address</legend>\n  ...\n</fieldset>\nUsing the\nlegend\nelement to name a\nfieldset\nelement satisfies\nRule 2: Prefer Visible Text\nand\nRule 3: Prefer Native Techniques\n.\nNaming Tables and Figures with Captions\nThe accessible name for HTML\ntable\nand\nfigure\nelements can be derived from a child\ncaption\nor\nfigcaption\nelement, respectively.\n            Tables and figures often have a caption to explain what they are about, how to read them, and sometimes giving them numbers used to refer to them in surrounding prose.\n            Captions can help all users better understand content, but are especially helpful to users of assistive technologies.\nIn HTML, the\ntable\nelement marks up a data table, and can be provided with a caption using the\ncaption\nelement.\n            If the\ntable\nelement does not have\naria-label\nor\naria-labelledby\n, then the\ncaption\nwill be used as the accessible name.\n            For example, the accessible name of the following table is\nSpecial opening hours\n.\n<table>\n  <caption>Special opening hours</caption>\n  <tr><td>30 May</td><td>Closed</td></tr>\n  <tr><td>6 June</td><td>11:00-16:00</td></tr>\n</table>\nThe following example gives the table a number (\nTable 1\n) so it can be referenced.\n<table>\n  <caption>Table 1. Traditional dietary intake of Okinawans and other Japanese circa 1950</caption>\n  <thead>\n    <tr>\n      <th></th>\n      <th>Okinawa, 1949</th>\n      <th>Japan, 1950</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>Total calories</th>\n      <td>1785</td>\n      <td>2068</td>\n\n      [...]\n\n</table>\nNote: Above table content is from\nCaloric restriction, the traditional Okinawan diet, and healthy aging: the diet of the world's longest-lived people and its potential impact on morbidity and life span\n.\nIf a\ntable\nis named using\naria-label\nor\naria-labelledby\n, then a\ncaption\nelement, if present, will become an accessible description.\n            For an example, see\nDescribing Tables and Figures with Captions\n.\nSimilarly, an HTML\nfigure\nelement can be given a caption using the\nfigcaption\nelement.\n            The caption can appear before or after the figure, but it is more common for figures to have the caption after.\n<figure>\n  <img alt=\"Painting of a person walking in a desert.\" src=\"Hole_JesusalDesierto.jpg\">\n  <figcaption>Jesus entering the desert as imagined by William Hole, 1908</figcaption>\n</figure>\nLike with\ntable\nelements, if a\nfigure\nis not named using\naria-label\nor\naria-labelledby\n, the content of the\nfigcaption\nelement will be used as the accessible name.\n            However unlike\ntable\nelements, if the\nfigcaption\nelement is not used for the name, it does not become an accessible description unless it is referenced by\naria-describedby\n.\n            Nevertheless, assistive technologies will render the content of a\nfigcaption\nregardless of whether it is used as a name, description, or neither.\nUsing the\ncaption\nelement to name a\ntable\nelement, or a\nfigcaption\nelement to name a\nfigure\nelement, satisfies\nRule 2: Prefer Visible Text\nand\nRule 3: Prefer Native Techniques\n.\nFallback Names Derived from Titles and Placeholders\nWhen an accessible name is not provided using one of the primary techniques (e.g., the\naria-label\nor\naria-labelledby\nattributes), or native markup techniques (e.g., the HTML\nlabel\nelement, or the\nalt\nattribute of the HTML\nimg\nelement), browsers calculate an accessible name from other attributes as a fallback mechanism.\n            Because the attributes used in fallback name calculation are not intended for naming, they typically yield low quality accessible names that are not effective.\n            So, As advised by\nRule 4: Avoid Browser Fallback\n, prefer the explicit labeling techniques described above over fallback techniques described in this section.\nAny HTML element can have a\ntitle\nattribute specified.\n            The\ntitle\nattribute may be used as the element's fallback accessible name.\n            The\ntitle\nattribute is commonly presented visually as a tooltip when the user hovers over the element with a pointing device, which is not particularly discoverable, and is also not accessible to visual users without a pointing device.\nFor example, a\nfieldset\nelement without a\nlegend\nelement child, but with a\ntitle\nattribute, gets its accessible name from the\ntitle\nattribute.\n<fieldset title=\"Select your starter class\">\n  <label><input type=\"radio\" name=\"starter-class\" value=\"green\">Green</label>\n  <label><input type=\"radio\" name=\"starter-class\" value=\"red\">Red</label>\n  <label><input type=\"radio\" name=\"starter-class\" value=\"blue\">Blue</label>\n</fieldset>\nFor the HTML\ninput\nand\ntextarea\nelements, the\nplaceholder\nattribute is used as a fallback labeling mechanism if nothing else (including the\ntitle\nattribute) results in a label.\n            It is better to use a\nlabel\nelement, since it does not disappear visually when the user focuses the form control.\n<!-- Using a <label> is recommended -->\n<label>Search <input type=search name=q></label>\n\n<!-- A placeholder is used as fallback -->\n<input type=search name=q placeholder=\"Search\">\nComposing Effective and User-friendly Accessible Names\nFor assistive technology users, especially screen reader users, the quality of accessible names is one of the most significant contributors to usability.\n          Names that do not provide enough information reduce users' effectiveness while names that are too long reduce efficiency.\n          And, names that are difficult to understand reduce effectiveness, efficiency, and enjoyment.\nThe following guidelines provide a starting point for crafting user friendly names.\nConvey function or purpose, not form.\n            For example, if an icon that looks like the letter\nX\ncloses a dialog, name it\nClose\n, not\nX\n.\n            Similarly, if a set of navigation links in the left side bar navigate among the product pages in a shopping site, name the navigation region\nProduct\n, not\nLeft\n.\nPut the most distinguishing and important words first.\n            Often, for interactive elements that perform an action, this means a verb is the first word.\n            For instance, if a list of contacts displays\nEdit\n,\nDelete\n, and\nActions\nbuttons for each contact, then\nEdit John Doe\n,\nDelete John Doe\n, and\nActions for John Doe\nwould be better accessible names than\nJohn Doe edit\n,\nJohn Doe delete\n, and\nJohn Doe actions\n.\n            By placing the verb first in the name, screen reader users can more easily and quickly distinguish the buttons from one another as well as from the element that opens the contact card for John Doe.\nBe concise.\n            For many elements, one to three words is sufficient.\n            Only add more words when necessary.\nDo NOT include a WAI-ARIA role name in the accessible name.\n            For example, do not include the word\nbutton\nin the name of a button, the word\nimage\nin the name of an image, or the word\nnavigation\nin the name of a navigation region.\n            Doing so would create duplicate screen reader output since screen readers convey the role of an element in addition to its name.\nCreate unique names for elements with the same role unless the elements are actually identical.\n            For example, ensure every link on a page has a different name except in cases where multiple links reference the same location.\n            Similarly, give every navigation region on a page a different name unless there are regions with identical content that performs identical navigation functions.\nStart names with a capital letter; it helps some screen readers speak them with appropriate inflection.\n            Do not end names with a period; they are not sentences.\nAccessible Name Guidance by Role\nCertain elements always require a name, others may usually or sometimes require a name, and still others should never be named.\n          The table below lists all ARIA roles and provides the following information for each:\nNecessity of Naming\nIndicates how necessary it is for authors to add a naming attribute or element to supplement or override the content of an element with the specified role.\n            This column may include one of the following values:\nRequired\nOnly If\nContent Insufficient: An element with this role is named by its descendant content.\n                If\naria-label\nor\naria-labelledby\nis applied, content contained in the element and its descendants is hidden from assistive technology users unless it is also referenced by\naria-labelledby\n.\n                Avoid hiding descendant content except in the rare circumstances where doing so benefits assistive technology users.\nRequired: The ARIA specification requires authors to provide a name; a missing name causes accessibility validators to report an error.\nRecommended: Providing a name is strongly recommended.\nDiscretionary: Naming is either optional or, in the circumstances described in the guidance column, is discouraged.\nDo Not Name: Naming is strongly discouraged even if it is technically permitted; often assistive technologies do not render a name even if provided.\nProhibited: The ARIA specification does not permit the element to be named; If a name is specified, accessibility validators will report an error.\nGuidance:\nProvides information to help determine if providing a name is beneficial, and if so, describes any recommended techniques.\nrole\nNecessity of Naming\nGuidance\nalert\nDiscretionary\nSome screen readers announce the name of an alert before announcing the content of the alert.\n                Thus,\naria-label\nprovides a method for prefacing the visible content of an alert with text that is not displayed as part of the alert.\n                Using\naria-label\nis functionally equivalent to providing off-screen text in the contents of the alert, except off-screen text would be announced by screen readers that do not support\naria-label\non\nalert\nelements.\nalertdialog\nRequired\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\napplication\nRequired\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\narticle\nRecommended\nRecommended to distinguish articles from one another; helps users when navigating among articles.\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nbanner\nDiscretionary\nNecessary in the uncommon circumstance where two banner landmark regions are present on the same page.\n                    It is otherwise optional.\nNamed using\naria-labelledby\nif a visible label is present, otherwise with\naria-label\n.\nSee the\nBanner Landmark\nsection.\nblockquote\nDiscretionary\nIf a visible label is present, associating it with the blockquote by using\naria-labelledby\ncould benefit some assistive technology users.\nbutton\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide descendant content from assistive technologies.\nIdeally named by visible, descendant content.\ncaption\nProhibited\ncell\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide descendant content from assistive technologies.\nIdeally named by visible, descendant content.\nNote that a name is not required; assistive technologies expect an empty cell in a table to be represented by an empty name.\nNote that associated row or column headers do not name a\ncell\n; the name of a cell in a table is its content.\n                    Headers are complementary information.\ncheckbox\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide any descendant content from assistive technologies.\nIf based on HTML\ntype=\"checkbox\"\n, use a\nlabel\nelement.\nOtherwise, reference visible content via\naria-labelledby\n.\ncode\nProhibited\ncolumnheader\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide descendant content from assistive technologies.\nIdeally named by visible, descendant content.\nIf the\ncolumnheader\nrole is implied from an HTML\nth\n, the HTML\nabbr\nattribute can be used to specify an abbreviated version of the name that is only announced when screen readers are reading an associated\ncell\nwithin the\ntable\n,\ngrid\n, or\ntreegrid\n.\ncombobox\nRequired\nIf the\ncombobox\nrole is applied to an HTML\nselect\nor\ninput\nelement, can be named with an HTML\nlabel\nelement.\nOtherwise use\naria-labelledby\nif a visible label is present.\nUse\naria-label\nif a visible label is not present.\ncomplementary\nRecommended\nNaming is necessary when two complementary landmark regions are present on the same page.\nNaming is recommended even when one complementary region is present to help users understand the purpose of the region's content when navigating among landmark regions.\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nSee the\nComplementary Landmark\nsection.\ncontentinfo\nDiscretionary\nNecessary in the uncommon circumstance where two contentinfo landmark regions are present on the same page.\n                    It is otherwise optional.\nNamed using\naria-labelledby\nif a visible label is present, otherwise with\naria-label\n.\ndefinition\nRecommended\nReference the term being defined with\nrole=\"term\"\n, using\naria-labelledby\n.\ndeletion\nProhibited\ndialog\nRequired\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\ndirectory\nDiscretionary\nNaming can help users understand the purpose of the directory.\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\ndocument\nDiscretionary\nElements with the\ndocument\nrole are contained within an element with the\napplication\nrole, which is required to have a name.\n                Typically, the name of the\napplication\nelement will provide sufficient context and identity for the\ndocument\nelement.\n                Because the\napplication\nelement is used only to create unusual, custom widgets, careful assessment is necessary to determine whether or not adding an accessible name is beneficial.\nemphasis\nProhibited\nfeed\nRecommended\nHelps screen reader users understand the context and purpose of the feed.\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nSee the\nFeed Pattern\n.\nfigure\nRecommended\nFor HTML, use the\nfigure\nand\nfigcaption\nelements.\n                    The\nfigcaption\nwill serve as the accessible name for the\nfigure\n.\n                    See the\nNaming Tables and Figures with Captions\nsection.\nWhen not using HTML, or when retrofitting legacy HTML, use the\naria-labelledby\non the figure, pointing to the figure's caption.\nIf there is no visible caption,\naria-label\ncan be used.\nform\nRecommended\nHelps screen reader users understand the context and purpose of the form landmark.\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nSee the\nForm Landmark\nsection.\ngeneric\nProhibited\ngrid\nRequired\nIf the\ngrid\nis applied to an HTML\ntable\nelement, then the accessible name can be derived from the table's\ncaption\nelement.\nOtherwise, use\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\ngridcell\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide descendant content from assistive technologies.\nIdeally named by visible, descendant content.\nNote that a name is not required; assistive technologies expect an empty cell in a grid to be represented by an empty name.\nNote that associated row or column headers do not name a\ngridcell\n; the name of a cell in a grid is its content.\n                    Headers are complementary information.\ngroup\nDiscretionary\nWhen using the HTML\nfieldset\nelement, the accessible name can be derived from the\nlegend\nelement.\nWhen using the HTML\ndetails\nelement, do not provide an accessible name for this element.\n                    The user interacts with the\nsummary\nelement, and that can derive its accessible name from its contents.\nWhen using the HTML\noptgroup\nelement, use the\nlabel\nattribute.\nOtherwise, use\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nheading\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide descendant content from assistive technologies.\nIdeally named by visible, descendant content.\ninsertion\nProhibited\nimg\nRequired\nFor the HTML\nimg\nelement, use the\nalt\nattribute.\n                For other elements with the\nimg\nrole, use\naria-labelledby\nor\naria-label\n.\nlink\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide descendant content from assistive technologies.\nIdeally named by visible, descendant content.\nlist\nDiscretionary\nPotentially beneficial for users of screen readers that support both list names and navigation among lists on a page.\nPotentially a source of distracting or undesirable screen reader verbosity, especially if nested within a named container, such as a navigation region.\nCan be named using\naria-labelledby\nif a visible label is present, otherwise with\naria-label\n.\nlistbox\nRequired\nIf the\nlistbox\nrole is applied to an HTML\nselect\nelement (with the\nmultiple\nattribute or a\nsize\nattribute having a value greater than 1), can be named with an HTML\nlabel\nelement.\nOtherwise use\naria-labelledby\nif a visible label is present.\nUse\naria-label\nif a visible label is not present.\nSee the\nListbox Pattern\n.\nlistitem\nDo Not Name\nNaming is not supported by assistive technologies; it is necessary to include relevant content within the list item.\nlog\nDiscretionary\nSome screen readers announce the name of a log element before announcing the content of the log element.\n                Thus,\naria-label\nprovides a method for prefacing the visible content of a log element with text that is not displayed as part of the log element.\n                Using\naria-label\nis functionally equivalent to providing off-screen text in the contents of the log element, except off-screen text would be announced by screen readers that do not support\naria-label\non\nlog\nelements.\nmark\nProhibited\nmain\nDiscretionary\nPotentially helpful for orienting assistive technology users, especially in single-page applications where main content changes happen without generating a page load event.\nCan be named using\naria-labelledby\nif a visible label is present, otherwise with\naria-label\n.\nSee the\nMain Landmark\nsection.\nmarquee\nDiscretionary\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nmath\nRecommended\nIf the\nmath\nelement has only presentational children and the accessible name is intended to convey the mathematical expression, use\naria-label\nto provide a string that represents the expression.\nIf the\nmath\nelement contains navigable content that conveys the mathematical expression and a visible label for the expression is present, use\naria-labelledby\n.\nOtherwise, use a\naria-label\nto name the expression, e.g.,\naria-label=\"Pythagorean Theorem\"\n.\nmenu\nRecommended\nUse\naria-labelledby\nto refer to the menuitem or button that controls this element's display.\nOtherwise, use\naria-label\n.\nSee the\nMenu and Menubar Pattern\n.\nmenubar\nRecommended\nHelps screen reader users understand the context and purpose of\nmenuitem\nelements in a\nmenubar\n.\n                    Naming a\nmenubar\nis comparable to naming a menu button.\n                    The name of a\nbutton\nthat opens a\nmenu\nconveys the purpose of the menu it opens.\n                    Since a\nmenubar\nelement is displayed persistently, a name on the\nmenubar\ncan serve that same purpose.\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nSee the\nMenu and Menubar Pattern\n.\nmenuitem\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide any descendant content from assistive technologies.\nIdeally named by visible, descendant content.\nNote: content contained within a child\nmenu\nis automatically excluded from the accessible name calculation.\nSee the\nMenu and Menubar Pattern\n.\nmenuitemcheckbox\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide any descendant content from assistive technologies.\nIdeally named by visible, descendant content.\nSee the\nMenu and Menubar Pattern\n.\nmenuitemradio\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide any descendant content from assistive technologies.\nIdeally named by visible, descendant content.\nSee the\nMenu and Menubar Pattern\n.\nmeter\nRequired\nIf based on an HTML\nmeter\nelement, can be named with an HTML\nlabel\nelement.\nOtherwise use\naria-labelledby\nif a visible label is present.\nUse\naria-label\nif a visible label is not present.\nnavigation\nRecommended\nHelps screen reader users understand the context and purpose of the navigation landmark.\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nSee the\nNavigation Landmark\nsection.\nnone\nProhibited\nAn element with\nrole=\"none\"\nis not part of the accessibility tree (except in error cases). Do not use\naria-labelledby\nor\naria-label\n.\nnote\nDiscretionary\nNaming is optional, but can help screen reader users understand the context and purpose of the note.\nNamed using\naria-labelledby\nif a visible label is present, otherwise with\naria-label\n.\noption\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide any descendant content from assistive technologies.\nIdeally named by visible, descendant content.\nSee the\nCombobox Pattern\n.\nparagraph\nProhibited\npresentation\nProhibited\nAn element with\nrole=\"presentation\"\nis not part of the accessibility tree (except in error cases).\n                Do not use\naria-labelledby\nor\naria-label\n.\nprogressbar\nRequired\nIf the\nprogressbar\nrole is applied to an HTML\nprogress\nelement, can be named with an HTML\nlabel\nelement.\nOtherwise use\naria-labelledby\nif a visible label is present.\nUse\naria-label\nif a visible label is not present.\nradio\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide any descendant content from assistive technologies.\nIf based on HTML\ntype=\"checkbox\"\n, use a\nlabel\nelement.\nOtherwise, reference visible content via\naria-labelledby\n.\nradiogroup\nRequired\nRecommended to help assistive technology users understand the purpose of the group of\nradio\nbuttons.\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nSee the\nRadio Group Pattern\n.\nregion\nRequired\nHelps screen reader users understand the context and purpose of the landmark.\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nSee the\nRegion Landmark\nsection.\nrow\nRequired\nOnly If\nContent Insufficient\nAND\ndescendant of a\ntreegrid\nAND\nthe row is focusable\nWhen\nrow\nelements are focusable in a\ntreegrid\n, screen readers announce the entire contents of a row when navigating by row.\n                This is typically the most appropriate behavior.\n                However, in some circumstances, it could be beneficial to change the order in which cells are announced or exclude announcement of certain cells by using\naria-labelledby\nto specify which cells to announce.\nrowgroup\nDo Not Name\nNaming is not supported by assistive technologies.\nrowheader\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide descendant content from assistive technologies.\nIdeally named by visible, descendant content.\nIf the\nrowheader\nrole is implied from an HTML\nth\n, the HTML\nabbr\nattribute can be used to specify an abbreviated version of the name that is only announced when screen readers are reading an associated\ncell\nwithin the\ntable\n,\ngrid\n, or\ntreegrid\n.\nscrollbar\nDiscretionary\nNaming is optional, but can potentially help screen reader users understand the purpose of the scrollbar.\n                    The purpose is also conveyed using the\naria-controls\nattribute, which is required for\nscrollbar\n.\nNamed using\naria-labelledby\nif a visible label is present, otherwise with\naria-label\n.\nsearch\nRecommended\nHelps screen reader users understand the context and purpose of the search landmark.\nNamed using\naria-labelledby\nif a visible label is present, otherwise with\naria-label\n.\nSee the\nSearch Landmark\nsection.\nsearchbox\nRequired\nIf the\nsearchbox\nrole is applied to an HTML\ninput\nelement, can be named with an HTML\nlabel\nelement.\nOtherwise use\naria-labelledby\nif a visible label is present.\nUse\naria-label\nif a visible label is not present.\nseparator\nDiscretionary\nRecommended if there is more than one focusable\nseparator\nelement on the page.\nCan help assistive technology users understand the purpose of the separator.\nNamed using\naria-labelledby\nif a visible label is present, otherwise with\naria-label\n.\nslider\nRequired\nIf the\nslider\nrole is applied to an HTML\ninput\nelement, can be named with an HTML\nlabel\nelement.\nOtherwise use\naria-labelledby\nif a visible label is present.\nUse\naria-label\nif a visible label is not present.\nSee the\nSlider Pattern\nand the\nSlider (Multi-Thumb) Pattern\n.\nspinbutton\nRequired\nIf the\ntextbox\nrole is applied to an HTML\ninput\nelement, can be named with an HTML\nlabel\nelement.\nOtherwise use\naria-labelledby\nif a visible label is present.\nUse\naria-label\nif a visible label is not present.\nSee the\nSpinbutton Pattern\n.\nstatus\nDiscretionary\nSome screen readers announce the name of a status element before announcing the content of the status element.\n                Thus,\naria-label\nprovides a method for prefacing the visible content of a status element with text that is not displayed as part of the status element.\n                Using\naria-label\nis functionally equivalent to providing off-screen text in the contents of the status element, except off-screen text would be announced by screen readers that do not support\naria-label\non\nstatus\nelements.\nstrong\nProhibited\nsubscript\nProhibited\nsuperscript\nProhibited\nswitch\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide any descendant content from assistive technologies.\nIf based on HTML\ntype=\"checkbox\"\n, use a\nlabel\nelement.\nOtherwise, reference visible content via\naria-labelledby\n.\ntab\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide descendant content from assistive technologies.\nIdeally named by visible, descendant content.\ntable\nRequired\nIf using HTML\ntable\nelement, use the\ncaption\nelement.\nOtherwise use\naria-labelledby\nif a visible label is present.\nUse\naria-label\nif a visible label is not present.\nSee the\nTable Pattern\n.\ntablist\nRecommended\nHelps screen reader users understand the context and purpose of the tablist.\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nSee the\nCarousel Pattern\nand\nTabs Pattern\n.\ntabpanel\nRequired\nUse\naria-labelledby\npointing to the\ntab\nelement that controls the\ntabpanel\n.\nSee the\nCarousel Pattern\nand\nTabs Pattern\n.\nterm\nDo Not Name\nSince a term is usually the name for the\nrole=\"definition\"\nelement, it could be confusing if the term itself also has a name.\ntextbox\nRequired\nIf the\ntextbox\nrole is applied to an HTML\ninput\nor\ntextarea\nelement, can be named with an HTML\nlabel\nelement.\nOtherwise use\naria-labelledby\nif a visible label is present.\nUse\naria-label\nif a visible label is not present.\ntime\nDo Not Name\nNaming is not supported by assistive technologies.\ntimer\nDiscretionary\nSome screen readers announce the name of a timer element before announcing the content of the timer element.\n                Thus,\naria-label\nprovides a method for prefacing the visible content of a timer element with text that is not displayed as part of the timer element.\n                Using\naria-label\nis functionally equivalent to providing off-screen text in the contents of the timer element, except off-screen text would be announced by screen readers that do not support\naria-label\non\ntimer\nelements.\ntoolbar\nRecommended\nIf there is more than one\ntoolbar\nelement on the page, naming is required.\nHelps assistive technology users to understand the purpose of the toolbar, even when there is only one toolbar on the page.\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nSee the\nToolbar Pattern\n.\ntooltip\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide descendant content from assistive technologies.\nIdeally named by visible, descendant content.\ntree\nRequired\nUse\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nSee the\nTree View Pattern\n.\ntreegrid\nRequired\nIf the\ntreegrid\nis applied to an HTML\ntable\nelement, then the accessible name can be derived from the table's\ncaption\nelement.\nOtherwise, use\naria-labelledby\nif a visible label is present, otherwise use\naria-label\n.\nSee the\nTreegrid Pattern\n.\ntreeitem\nRequired\nOnly If\nContent Insufficient\nWarning! Using\naria-label\nor\naria-labelledby\nwill hide any descendant content from assistive technologies.\nIdeally named by visible, descendant content.\nNote: content contained within a child\ngroup\nis automatically excluded from the accessible name calculation.\nSee the\nTree View Pattern\n.\nAccessible name calculation\nUser agents construct an accessible name string for an element by walking through a list of potential naming methods and using the first that generates a name.\n          The algorithm they follow is defined in the\naccessible name specification\n.\n          It is roughly like the following:\nThe\naria-labelledby\nproperty is used if present.\nIf the name is still empty, the\naria-label\nproperty is used if present.\nIf the name is still empty, then host-language-specific attributes or elements are used if present.\n              For HTML, these are, depending on the element:\ninput\nwhose\ntype\nattribute is in the Button, Submit Button, or Reset Button state\nThe\nvalue\nattribute.\ninput\nwhose\ntype\nattribute is in the Image Button state\nimg\narea\nThe\nalt\nattribute.\nfieldset\nThe first child\nlegend\nelement.\nOther form elements\nThe associated\nlabel\nelement(s).\nfigure\nThe first child\nfigcaption\nelement.\ntable\nThe first child\ncaption\nelement.\nIf the name is still empty, then for elements with a role that supports naming from child content, the content of the element is used.\nFinally, if the name is still empty, then other fallback host-language-specific attributes or elements are used if present.\n              For HTML, these are, depending on the element:\ninput\nwhose\ntype\nattribute is in the Text, Password, Search, Telephone, or URL states\ntextarea\nThe\ntitle\nattribute.\n                Otherwise, the\nplaceholder\nattribute.\ninput\nwhose\ntype\nattribute is in the Submit Button state\nA localized string of the word \"submit\".\ninput\nwhose\ntype\nattribute is in the Reset Button state\nA localized string of the word \"reset\".\ninput\nwhose\ntype\nattribute is in the Image Button state\nThe\ntitle\nattribute.\n                Otherwise, a localized string of the phrase \"Submit Query\".\nsummary\nThe word \"Details\".\nOther elements\nThe\ntitle\nattribute.\nThe final step is a fallback mechanism.\n          Generally when labeling an element, use one of the non-fallback mechanisms.\nWhen calculating a name from content, the user agent walks through all descendant nodes except in the cases of\ntreeitem\nand\nmenuitem\nas described below.\n          And, when following references in an\naria-labelledby\nattribute, it similarly walks the tree of each referenced element.\n          Thus, the naming algorithm is recursive.\n          The following two sections explain non-recursive and recursive examples of how the algorithm works.\nWhen calculating a name from content for the\ntreeitem\nrole, descendant content of child\ngroup\nelements are not included.\n          For example, in the following\ntree\n, the name of the first tree item is\nFruits\n;\nApples\n,\nBananas\n, and\nOranges\nare automatically omitted.\n<ul role=\"tree\">\n  <li role=\"treeitem\">Fruits\n    <ul role=\"group\">\n      <li role=\"treeitem\">Apples</li>\n      <li role=\"treeitem\">Bananas</li>\n      <li role=\"treeitem\">Oranges</li>\n    </ul>\n  </li>\n</ul>\nSimilarly, when calculating a name from content for the\nmenuitem\nrole, descendant content of child\nmenu\nelements are not included.\n          So, the name of the first parent\nmenuitem\nin the following\nmenu\nis\nFruits\n.\n<ul role=\"menu\">\n  <li role=\"menuitem\">Fruits\n    <ul role=\"menu\">\n      <li role=\"menuitem\">Apples</li>\n      <li role=\"menuitem\">Bananas</li>\n      <li role=\"menuitem\">Oranges</li>\n    </ul>\n  </li>\n</ul>\nExamples of non-recursive accessible name calculation\nConsider an\ninput\nelement that has no associated\nlabel\nelement and only a\nname\nattribute and so does not have an accessible name (do not do this):\n<input name=\"code\">\nIf there is a\nplaceholder\nattribute, then it serves as a naming fallback mechanism (avoid doing this):\n<input name=\"code\"\n  placeholder=\"One-time code\">\nIf there is also a\ntitle\nattribute, then it is used as the accessible name instead of\nplaceholder\n, but it is still a fallback (avoid doing this):\n<input name=\"code\"\n  placeholder=\"123456\"\n  title=\"One-time code\">\nIf there is also a\nlabel\nelement (recommended), then that is used as the accessible name, and the\ntitle\nattribute is instead used as the accessible description:\n<label>One-time code\n  <input name=\"code\"\n    placeholder=\"123456\"\n    title=\"Get your code from the app.\">\n</label>\nIf there is also an\naria-label\nattribute (not recommended unless it adds clarity for assistive technology users), then that becomes the accessible name, overriding the\nlabel\nelement:\n<label>Code\n  <input name=\"code\"\n    aria-label=\"One-time code\"\n    placeholder=\"123456\"\n    title=\"Get your code from the app.\">\n</label>\nIf there is also an\naria-labelledby\nattribute, that wins over the other elements and attributes (the\naria-label\nattribute ought to be removed if it is not used):\n<p>Please fill in your <span id=\"code-label\">one-time code</span> to log in.</p>\n<p>\n  <label>Code\n    <input name=\"code\"\n    aria-labelledby=\"code-label\"\n    aria-label=\"This is ignored\"\n    placeholder=\"123456\"\n    title=\"Get your code from the app.\">\n  </label>\n</p>\nExamples of recursive accessible name calculation\nThe accessible name calculation algorithm will be invoked recursively when necessary.\n            An\naria-labelledby\nreference causes the algorithm to be invoked recursively, and when computing an accessible name from content the algorithm is invoked recursively for each child node.\nIn this example, the label for the button is computed by recursing into each child node, resulting in\nMove to trash\n.\n<button>Move to <img src=\"bin.svg\" alt=\"trash\"></button>\nWhen following an\naria-labelledby\nreference, the algorithm avoids following the same reference twice to avoid infinite loops.\nIn this example, the label for the button is computed by first following the\naria-labelledby\nreference to the parent element, and then computing the label for that element from the child nodes, first visiting the\nbutton\nelement again but ignoring the\naria-labelledby\nreference and instead using the\naria-label\n, and then visiting the next child (the text node).\n            The resulting label is\nRemove meeting: Daily status report\n.\n<div id=\"meeting-1\">\n  <button aria-labelledby=\"meeting-1\" aria-label=\"Remove meeting:\">X</button>\n  Daily status report\n</div>\nDescribing Techniques\nDescribing by referencing content with\naria-describedby\nThe\naria-describedby\nproperty works similarly to the\naria-labelledby\nproperty.\n            For example, a button could be described by a sibling paragraph.\n<button aria-describedby=\"trash-desc\">Move to trash</button>\n...\n<p id=\"trash-desc\">Items in the trash will be permanently removed after 30 days.</p>\nDescriptions are reduced to text strings.\n            For example, if the description contains an HTML\nimg\nelement, a text equivalent of the image is computed.\n<button aria-describedby=\"trash-desc\">Move to <img src=\"bin.svg\" alt=\"trash\"></button>\n...\n<p id=\"trash-desc\">Items in <img src=\"bin.svg\" alt=\"the trash\"> will be permanently removed after 30 days.</p>\nAs with\naria-labelledby\n, it is possible to reference an element using\naria-describedby\neven if that element is hidden.\n            For example, a text field in a form could have a description that is hidden by default, but can be revealed on request using a disclosure widget.\n            The description could also be referenced from the text field directly with\naria-describedby\n.\n            In the following example, the accessible description for the\ninput\nelement is\nYour username is the name that you use to log in to this service.\n<label for=\"username\">Username</label>\n<input id=\"username\" name=\"username\" aria-describedby=\"username-desc\">\n<button aria-expanded=\"false\" aria-controls=\"username-desc\" aria-label=\"Help about username\">?</button>\n<p id=\"username-desc\" hidden>\n  Your username is the name that you use to log in to this service.\n</p>\nDescribing Tables and Figures with Captions\nIn HTML, if the\ntable\nis named using\naria-label\nor\naria-labelledby\n, a child\ncaption\nelement becomes an accessible description.\n            For example, a preceding heading might serve as an appropriate accessible name, and the\ncaption\nelement might contain a longer description.\n            In such a situation,\naria-labelledby\ncould be used on the\ntable\nto set the accessible name to the heading content and the\ncaption\nwould become the accessible description.\n<h2 id=\"events-heading\">Upcoming events</h2>\n<table aria-labelledby=\"events-heading\">\n  <caption>\n    Calendar of upcoming events, weeks 27 through 31, with each week starting with\n    Monday. The first column is the week number.\n  </caption>\n  <tr><th>Week</th><th>Monday</th><th>Tuesday</th><th>Wednesday</th><th>Thursday</th><th>Friday</th><th>Saturday</th><th>Sunday</th></tr>\n  <tr><td>27</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr>\n  <tr><td>28</td><td></td><td></td><td></td><td></td><td></td><td></td><td><a href=\"/events/9856\">Crown Princess's birthday</a></td></tr>\n  <tr><td>29</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr>\n  <tr><td>30</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr>\n  <tr><td>31</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr>\n</table>\nThe HTML\nfigure\nelement can get its accessible\nname\nfrom its\nfigcaption\nelement, but it will not be used as the accessible\ndescription\n, even if it was not used as the accessible name.\n            If the\nfigcaption\nelement is appropriate as an accessible description, and the accessible name is set using\naria-labelledby\nor\naria-label\n, then the\nfigcaption\ncan be explicitly set as the accessible description using the\naria-describedby\nattribute.\n<h2 id=\"neutron\">Neutron</h2>\n<figure aria-labelledby=\"neutron\" aria-describedby=\"neutron-caption\">\n  <img src=\"neutron.svg\" alt=\"Within the neutron are three quarks (blue 'u', red 'd', green 'd') that are interconnected.\">\n  <figcaption id=\"neutron-caption\">\n    The quark content of the neutron. The color assignment of individual quarks is\n    arbitrary, but all three colors must be present. Forces between quarks are\n    mediated by gluons.\n  </figcaption>\n</figure>\nDescriptions Derived from Titles\nIf an accessible description was not provided using the\naria-describedby\nattribute or one of the primary host-language-specific attributes or elements (e.g., the\ncaption\nelement for\ntable\n), then, for HTML, if the element has a\ntitle\nattribute, that is used as the accessible description.\nA visible description together with\naria-describedby\nis generally recommended.\n            If a description that is not visible is desired, then the\ntitle\nattribute can be used, for any HTML element that can have an accessible description.\nNote that the\ntitle\nattribute might not be accessible to some users, in particular sighted users not using a screen reader and not using a pointing device that supports hover (e.g., a mouse).\nFor example, an\ninput\nelement with input constrained using the\npattern\nattribute can use the\ntitle\nattribute to describe what the expected input is.\n<label> Part number:\n  <input pattern=\"[0-9][A-Z]{3}\" name=\"part\"\n    title=\"A part number is a digit followed by three uppercase letters.\"/>\n</label>\nThe\ntitle\nattribute in this case can be shown to the user as a tooltip when the user hovers or focuses the control, but also as part of the error message when the user agent validates the form, if the\ninput\nelement's value doesn't match the\npattern\n.\nAs another example, a link can use the\ntitle\nattribute to describe the link in more detail.\n<a href=\"http://twitter.com/W3C\"\n  title=\"Follow W3C on Twitter\">\n  <img src=\"/2008/site/images/Twitter_bird_logo_2012.svg\"\n    alt=\"Twitter\" class=\"social-icon\" height=\"40\" />\n</a>\nAccessible description calculation\nLike the\naccessible name calculation\n, the accessible description calculation produces a text string.\nThe accessible description calculation algorithm is the same as the accessible name calculation algorithm except for a few branch points that depend on whether a name or description is being calculated.\n          In particular, when accumulating text for an accessible description, the algorithm uses\naria-describedby\ninstead of\naria-labelledby\n.\nUser agents construct an accessible description string for an element by walking through a list of potential description methods and using the first that generates a description.\n          The algorithm they follow is defined in the\naccessible name specification\n.\n          It is roughly like the following:\nThe\naria-describedby\nproperty is used if present.\nIf the description is still empty, then host-language-specific attributes or elements are used if present, if it wasn't already used as the accessible name.\n              For HTML, these are, depending on the element:\ninput\nwhose\ntype\nattribute is in the Button, Submit Button, or Reset Button state\nThe\nvalue\nattribute.\nsummary\nThe element's subtree.\ntable\nThe first child\ncaption\nelement.\nFinally, if the description is still empty, then other host-language-specific attributes or elements are used if present, if it wasn't already used for the accessible name.\n              For HTML, this is the\ntitle\nattribute.",
  "content_markdown": "Providing Accessible Names and Descriptions\n\n## Introduction\n\nProviding elements with accessible names, and where appropriate, accessible descriptions, is one of the most important responsibilities authors have when developing accessible web experiences.\nWhile doing so is straightforward for most elements, technical mistakes that can completely block users of assistive technologies are easy to make and unfortunately common.\nTo help authors effectively provide accessible names and descriptions, this section explains their purpose, when authors need to provide them, how browsers assemble them, and rules for coding and composing them.\nIt also guides authors in the use of the following naming and describing techniques and WAI-ARIA properties:\n\n- Naming:\n  - Naming with child content.\n  - Naming with a string attribute via `aria-label`.\n  - Naming by referencing content with `aria-labelledby`.\n  - Naming form controls with the label element.\n  - Naming fieldsets with the legend element.\n  - Naming tables and figures with captions.\n  - Fallback names derived from titles and placeholders.\n- Describing:\n  - Describing by referencing content with `aria-describedby`.\n  - Describing tables and figures with captions.\n  - Descriptions derived from titles.\n\n## What ARE Accessible Names and Descriptions?\n\nAn accessible name is a short string, typically 1 to 3 words, that authors associate with an element to provide users of assistive technologies with a label for the element.\nFor example, an input field might have an accessible name of \"User ID\" or a button might be named \"Submit\".\n\nAn accessible name serves two primary purposes for users of assistive technologies, such as screen readers:\n\n1. Convey the purpose or intent of the element.\n2. Distinguish the element from other elements on the page.\n\nBoth the WAI-ARIA specification and WCAG require all focusable, interactive elements to have an accessible name.\nIn addition dialogs and some structural containers, such as [tables](https://w3c.github.io/aria/#table) and [regions](https://w3c.github.io/aria/#region), are required to have a name.\nMany other elements can be named, but whether a name will enhance the accessible experience is determined by various characteristics of the surrounding context.\nFinally, there are some elements where providing an accessible name is technically possible but not advisable.\nThe [Accessible Name Guidance by Role](#naming_role_guidance) section lists naming requirements and guidelines for every ARIA role.\n\nAn accessible description is also an author-provided string that is rendered by assistive technologies.\nAuthors supply a description when there is a need to associate additional information with an element, such as instructions or format requirements for an input field.\n\nAssistive technologies present names differently from descriptions.\nFor instance, screen readers typically announce the name and role of an element first, e.g., a button named \"Mute Conversation\"could be spoken as \"Mute Conversation button\".\nIf an element has a state, it could be announced either before or after the name and role; after name and role is the typical default.\nFor example, a switch button named \"Mute Conversation\" in the \"off\" state could be announced as \"Mute Conversation switch button off\".\nBecause descriptions are optional strings that are usually significantly longer than names, they are presented last, sometimes after a slight delay.\nFor example, \"Mute Conversation Switch button off, Silences alerts and notifications about activity in this conversation.\"\nTo reduce verbosity, some screen readers do not announce descriptions by default but instead inform users of their presence so that users can press a key that will announce the description.\n\n## How Are Name and Description Strings Derived?\n\nBecause there are several elements and attributes for specifying text to include in an accessible name or description string, and because authors can combine them in a practically endless number of ways, browsers implement fairly complex algorithms for assembling the strings.\nThe sections on [accessible name calculation](#name_calculation) and [accessible description calculation](#description_calculation) explain the algorithms and how they implement precedence.\nHowever, most authors do not need such detailed understanding of the algorithms since nearly all circumstances where a name or description is useful are supported by the coding patterns described in the [naming techniques](#naming_techniques) and [describing techniques](#describing_techniques) sections.\n\n## Cardinal Rules of Naming\n\n### Rule 1: Heed Warnings and Test Thoroughly\n\nSeveral of the [naming techniques](#naming_techniques) below include notes that warn against specific coding patterns that are either prohibited by the ARIA specification or fall into gray space that is not yet fully specified.\nSome of these prohibited or ambiguous patterns may appear logical and even yield desired names in some browsers.\nHowever, it is unlikely they will provide consistent results across browsers, especially over time as work to improve the consistency of name calculation across browsers progresses.\n\nIn addition to heeding the warnings provided in the naming techniques, it is difficult to over emphasize the importance of testing to ensure that names browsers calculate match expectations.\n\n### Rule 2: Prefer Visible Text\n\nWhen a user interface includes visible text that could be used to provide an appropriate accessible name, using the visible text for the accessible name simplifies maintenance, prevents bugs, and reduces language translation requirements.\nWhen names are generated from text that exists only in markup and is never displayed visually, there is a greater likelihood that accessible names will not be updated when the user interface design or content are changed.\n\nIf an interactive element, such as an input field or button, does not have a visually persistent text label, consider adjusting the design to include one.\nIn addition to serving as a more robust source for an accessible name, visible text labels enhance accessibility for many people with disabilities who do not use assistive technologies that present invisible accessible names.\nIn most circumstances, visible text labels also make the user interface easier to understand for all users.\n\n### Rule 3: Prefer Native Techniques\n\nIn HTML documents, whenever possible, rely on HTML naming techniques, such as the HTML `label` element for form elements and `caption` element for tables.\nWhile less flexible, their simplicity and reliance on visible text help ensure robust accessible experiences.\nSeveral of the [naming techniques](#naming_techniques) highlight specific accessibility advantages of using HTML features instead of ARIA attributes.\n\n### Rule 4: Avoid Browser Fallback\n\nWhen authors do not specify an accessible name using an element or attribute that is intended for naming, browsers attempt to help assistive technology users by resorting to fallback methods for generating a name.\nFor example, the HTML `title` and `placeholder` attributes are used as last resort sources of content for accessible names.\nBecause the purpose of these attributes is not naming, their content typically yields low quality accessible names that are not effective.\n\n### Rule 5: Compose Brief, Useful Names\n\nSimilar to how visually crowded screens and ambiguous icons reduce usability, excessively long, insufficiently distinct, or unclear accessible names can make a user interface very difficult, or even impossible, to use for someone who relies on a non-visual form of the user interface.\nIn other words, for a web experience to be accessible, its accessible names must be effective.\nThe section on [Composing Effective and User-friendly Accessible Names](#naming_effectively) provides guidance for balancing brevity and clarity.\n\n## Naming Techniques\n\n### Naming with Child Content\n\nCertain elements get their name from the content they contain.\nFor example, the following link is named \"Home\".\n\n```\n<a href=\"/\">Home</a>\n```\n\nWhen assistive technologies render an element that gets its accessible name from its content, such as a link or button, the accessible name is the only content the user can perceive for that element.\nThis is in contrast to other elements, such as text fields or tables, where the accessible name is a label that is presented in addition to the value or content of the element.\nFor instance, the accessible name of a table can be derived from a caption element, and assistive technologies render both the caption and all other content contained inside the table.\n\nElements having one of the following roles are, by default, named by a string calculated from their descendant content:\n\n- button\n- cell\n- checkbox\n- columnheader\n- gridcell\n- heading\n- link\n- menuitem (content contained in a child `menu` element is excluded.)\n- menuitemcheckbox\n- menuitemradio\n- option\n- radio\n- row\n- rowheader\n- switch\n- tab\n- tooltip\n- treeitem (content included in a child `group` element is excluded.)\n\nWhen calculating a name from content for an element, user agents recursively walk through each of its descendant elements, calculate a name string for each descendant, and concatenate the resulting strings.\nIn two special cases, certain descendants are ignored: `group` descendants of `treeitem` elements and `menu` descendants of `menuitem` elements are omitted from the calculation.\nFor example, in the following `tree`, the name of the first tree item is \"Fruits\"; \"Apples\", \"Bananas\", and \"Oranges\" are omitted.\n\n```\n<ul role=\"tree\">\n  <li role=\"treeitem\">Fruits\n    <ul role=\"group\">\n      <li role=\"treeitem\">Apples</li>\n      <li role=\"treeitem\">Bananas</li>\n      <li role=\"treeitem\">Oranges</li>\n    </ul>\n  </li>\n</ul>\n```\n\n#### Warning\n\nIf an element with one of the above roles that supports naming from child content is named by using `aria-label` or `aria-labelledby`, content contained in the element and its descendants is hidden from assistive technology users unless the descendant content is referenced by `aria-labelledby`.\nIt is strongly recommended to avoid using either of these attributes to override content of one of the above elements except in rare circumstances where hiding content from assistive technology users is beneficial.\nIn addition, in situations where visible content is hidden from assistive technology users by use of one of these attributes, thorough testing with assistive technologies is particularly important.\n\n### Naming with a String Attribute Via `aria-label`\n\nThe [aria-label](https://w3c.github.io/aria/#aria-label) property enables authors to name an element with a string that is not visually rendered.\nFor example, the name of the following button is \"Close\".\n\n```\n<button type=\"button\" aria-label=\"Close\">X</button>\n```\n\nThe `aria-label` property is useful when there is no visible text content that will serve as an appropriate accessible name.\n\nThe `aria-label` property affects assistive technology users in one of two different ways, depending on the role of the element to which it is applied.\nWhen applied to an element with one of the roles that supports [naming from child content](#naming_with_child_content), `aria-label` hides descendant content from assistive technology users and replaces it with the value of `aria-label`.\nHowever, when applied to nearly any other type of element, assistive technologies will render both the value of `aria-label` and the content of the element.\nFor example, the name of the following navigation region is \"Product\".\n\n```\n<nav aria-label=\"Product\">\n  <!-- list of navigation links to product pages -->\n</nav>\n```\n\nWhen encountering this navigation region, a screen reader user will hear the name and role of the element, e.g., \"Product navigation region\", and then be able to read through the links contained in the region.\n\n#### Warning\n\n1. If `aria-label` is applied to an element with one of the roles that supports [naming from child content](#naming_with_child_content), content contained in the element and its descendants is hidden from assistive technology users.\n   It is strongly recommended to avoid using `aria-label` to override content of one of these elements except in rare circumstances where hiding content from assistive technology users is beneficial.\n2. There are certain types of elements, such as paragraphs and list items, that should not be named with `aria-label`.\n   They are identified in the table in the [Accessible Name Guidance by Role](#naming_role_guidance) section.\n3. Because the value of `aria-label` is not rendered visually, testing with assistive technologies to ensure the expected name is presented to users is particularly important.\n4. When a user interface is translated into multiple languages, ensure that `aria-label` values are translated.\n\n### Naming with Referenced Content Via `aria-labelledby`\n\nThe [aria-labelledby property](https://w3c.github.io/aria/#aria-labelledby) enables authors to reference other elements on the page to define an accessible name.\nFor example, the following switch is named by the text content of a previous sibling element.\n\n```\n<span id=\"night-mode-label\">Night mode</span>\n<span role=\"switch\" aria-checked=\"false\" tabindex=\"0\" aria-labelledby=\"night-mode-label\"></span>\n```\n\nNote that while using `aria-labelledby` is similar in this situation to using an HTML `label` element with the `for` attribute, one significant difference is that browsers do not automatically make clicking on the labeling element activate the labeled element; that is an author responsibility.\nHowever, HTML `label` cannot be used to label a `span` element.\nFortunately, an HTML `input` with `type=\"checkbox\"` allows the ARIA `switch` role, so when feasible, using the following approach creates a more robust solution.\n\n```\n<label for=\"night-mode\">Night mode</label>\n<input type=\"checkbox\" role=\"switch\" id=\"night-mode\">\n```\n\nThe `aria-labelledby` property is useful in a wide variety of situations because:\n\n- It has the highest precedence when browsers calculate accessible names, i.e., it overrides names from child content and all other naming attributes, including `aria-label`.\n- It can concatenate content from multiple elements into a single name string.\n- It incorporates content from elements regardless of their visibility, i.e., it even includes content from elements with the HTML `hidden` attribute, CSS `display: none`, or CSS `visibility: hidden` in the calculated name string.\n- It incorporates the value of input elements, i.e., if it references a textbox, the value of the textbox is included in the calculated name string.\n\nAn example of referencing a hidden element with `aria-labelledby` could be a label for a night switch control:\n\n```\n<span id=\"night-mode-label\" hidden>Night mode</span>\n<input type=\"checkbox\" role=\"switch\" aria-labelledby=\"night-mode-label\">\n```\n\nIn some cases, the most effective name for an element is its own content combined with the content of another element.\nBecause `aria-labelledby` has highest precedence in name calculation, in those situations, it is possible to use `aria-labelledby` to reference both the element itself and the other element.\nIn the following example, the \"Read more...\" link is named by the element itself and the article’s heading, resulting in a name for the link of \"Read more... 7 ways you can help save the bees\".\n\n```\n<h2 id=\"bees-heading\">7 ways you can help save the bees</h2>\n<p>Bees are disappearing rapidly. Here are seven things you can do to help.</p>\n<p><a id=\"bees-read-more\" aria-labelledby=\"bees-read-more bees-heading\">Read more...</a></p>\n```\n\nWhen multiple elements are referenced by `aria-labelledby`, text content from each referenced element is concatenated in the order specified in the `aria-labelledby` value.\nIf an element is referenced more than one time, only the first reference is processed.\nWhen concatenating content from multiple elements, browsers trim leading and trailing white space and separate content from each element with a single space.\n\n```\n<button id=\"download-button\" aria-labelledby=\"download-button download-details\">Download</button>\n<span id=\"download-details\">PDF, 2.4 MB</span>\n```\n\nIn the above example, the accessible name of the button will be \"Download PDF, 2.4 MB\", with a space between \"Download\" and \"PDF\", and not \"DownloadPDF, 2.4 MB\".\n\n#### Warning\n\n1. The `aria-labelledby` property cannot be chained, i.e., if an element with `aria-labelledby` references another element that also has `aria-labelledby`, the `aria-labelledby` attribute on the referenced element will be ignored.\n2. If an element is referenced by `aria-labelledby` more than one time during a name calculation, the second and any subsequent references will be ignored.\n3. There are certain types of elements, such as paragraphs and list items, that should not be named with `aria-labelledby`.\n   They are identified in the table in the [Accessible Name Guidance by Role](#naming_role_guidance) section.\n4. If `aria-labelledby` is applied to an element with one of the roles that supports [naming from child content](#naming_with_child_content), content contained in the element and its descendants is hidden from assistive technology users unless it is also referenced by `aria-labelledby`.\n   It is strongly recommended to avoid using this attribute to override content of one of these elements except in rare circumstances where hiding content from assistive technology users is beneficial.\n5. Because calculating the name of an element with `aria-labelledby` can be complex and reference hidden content, testing with assistive technologies to ensure the expected name is presented to users is particularly important.\n\n### Naming Form Controls with the Label Element\n\nThe HTML `label` element enables authors to identify content that serves as a label and associate it with a form control.\nWhen a `label` element is associated with a form control, browsers calculate an accessible name for the form control from the `label` content.\nFor example, text displayed adjacent to a checkbox may be visually associated with the checkbox, so it is understood as the checkbox label by users who can perceive that visual association.\nHowever, unless the text is programmatically associated with the checkbox, assistive technology users will experience a checkbox without a label.\n\nHTML provides two ways of associating a label with a form control.\nThe one that provides the broadest browser and assistive technology support is to set the `for` attribute on the `label` element to the `id` of the control.\nThis way of associating the label with the control is often called explicit association.\n\n```\n<input type=\"checkbox\" name=\"subscribe\" id=\"subscribe_checkbox\">\n<label for=\"subscribe_checkbox\">subscribe to our newsletter</label>\n```\n\nThe other way, which is known as implicit association, is to wrap the checkbox and the labeling text in a `label` element.\nSome combinations of assistive technologies and browsers fail to treat the element as having an accessible name that is specified by using implicit association.\n\n```\n<label>\n<input type=\"checkbox\" name=\"subscribe\">\nsubscribe to our newsletter\n</label>\n```\n\nUsing the `label` element is an effective technique for satisfying [Rule 2: Prefer Visible Text](#naming_rule_visible_text).\nIt also satisfies [Rule 3: Prefer Native Techniques](#naming_rule_native_techniques).\nNative HTML labels offer an important usability and accessibility advantage over ARIA labeling techniques: browsers automatically make clicking the label equivalent to clicking the form control.\nThis increases the hit area of the form control.\n\n### Naming Fieldsets with the Legend Element\n\nThe HTML `fieldset` element can be used to group form controls, and the `legend` element can be used to give the group a name.\nFor example, a group of radio buttons can be grouped together in a `fieldset`, where the `legend` element labels the group for the radio buttons.\n\n```\n<fieldset>\n  <legend>Select your starter class</legend>\n  <label><input type=\"radio\" name=\"starter-class\" value=\"green\">Green</label>\n  <label><input type=\"radio\" name=\"starter-class\" value=\"red\">Red</label>\n  <label><input type=\"radio\" name=\"starter-class\" value=\"blue\">Blue</label>\n</fieldset>\n```\n\nThis grouping technique is particularly useful for presenting multiple choice questions.\nIt enables authors to associate a question with a group of answers.\nIf a question is not programmatically associated with its answer options, assistive technology users may access the answers without being aware of the question.\n\nSimilar benefits can be gained from grouping and naming other types of related form fields using `fieldset` and `legend`.\n\n```\n<fieldset>\n  <legend>Shipping address</legend>\n  <p><label>Full name <input name=\"name\" required></label></p>\n  <p><label>Address line 1 <input name=\"address-1\" required></label></p>\n  <p><label>Address line 2 <input name=\"address-2\"></label></p>\n  ...\n</fieldset>\n<fieldset>\n  <legend>Billing address</legend>\n  ...\n</fieldset>\n```\n\nUsing the `legend` element to name a `fieldset` element satisfies [Rule 2: Prefer Visible Text](#naming_rule_visible_text) and [Rule 3: Prefer Native Techniques](#naming_rule_native_techniques).\n\n### Naming Tables and Figures with Captions\n\nThe accessible name for HTML `table` and `figure` elements can be derived from a child `caption` or `figcaption` element, respectively.\nTables and figures often have a caption to explain what they are about, how to read them, and sometimes giving them numbers used to refer to them in surrounding prose.\nCaptions can help all users better understand content, but are especially helpful to users of assistive technologies.\n\nIn HTML, the `table` element marks up a data table, and can be provided with a caption using the `caption` element.\nIf the `table` element does not have `aria-label` or `aria-labelledby`, then the `caption` will be used as the accessible name.\nFor example, the accessible name of the following table is \"Special opening hours\".\n\n```\n<table>\n  <caption>Special opening hours</caption>\n  <tr><td>30 May</td><td>Closed</td></tr>\n  <tr><td>6 June</td><td>11:00-16:00</td></tr>\n</table>\n```\n\nThe following example gives the table a number (\"Table 1\") so it can be referenced.\n\n```\n<table>\n  <caption>Table 1. Traditional dietary intake of Okinawans and other Japanese circa 1950</caption>\n  <thead>\n    <tr>\n      <th></th>\n      <th>Okinawa, 1949</th>\n      <th>Japan, 1950</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>Total calories</th>\n      <td>1785</td>\n      <td>2068</td>\n\n      [...]\n\n</table>\n```\n\nNote: Above table content is from [Caloric restriction, the traditional Okinawan diet, and healthy aging: the diet of the world's longest-lived people and its potential impact on morbidity and life span](https://www.ncbi.nlm.nih.gov/pubmed/17986602).\n\nIf a `table` is named using `aria-label` or `aria-labelledby`, then a `caption` element, if present, will become an accessible description.\nFor an example, see [Describing Tables and Figures with Captions](#describing_with_captions).\n\nSimilarly, an HTML `figure` element can be given a caption using the `figcaption` element.\nThe caption can appear before or after the figure, but it is more common for figures to have the caption after.\n\n```\n<figure>\n  <img alt=\"Painting of a person walking in a desert.\" src=\"Hole_JesusalDesierto.jpg\">\n  <figcaption>Jesus entering the desert as imagined by William Hole, 1908</figcaption>\n</figure>\n```\n\nLike with `table` elements, if a `figure` is not named using `aria-label` or `aria-labelledby`, the content of the `figcaption` element will be used as the accessible name.\nHowever unlike `table` elements, if the `figcaption` element is not used for the name, it does not become an accessible description unless it is referenced by `aria-describedby`.\nNevertheless, assistive technologies will render the content of a `figcaption` regardless of whether it is used as a name, description, or neither.\n\nUsing the `caption` element to name a `table` element, or a `figcaption` element to name a `figure` element, satisfies [Rule 2: Prefer Visible Text](#naming_rule_visible_text) and [Rule 3: Prefer Native Techniques](#naming_rule_native_techniques).\n\n### Fallback Names Derived from Titles and Placeholders\n\nWhen an accessible name is not provided using one of the primary techniques (e.g., the `aria-label` or `aria-labelledby` attributes), or native markup techniques (e.g., the HTML `label` element, or the `alt` attribute of the HTML `img` element), browsers calculate an accessible name from other attributes as a fallback mechanism.\nBecause the attributes used in fallback name calculation are not intended for naming, they typically yield low quality accessible names that are not effective.\nSo, As advised by [Rule 4: Avoid Browser Fallback](#naming_rule_avoid_fallback), prefer the explicit labeling techniques described above over fallback techniques described in this section.\n\nAny HTML element can have a `title` attribute specified.\nThe `title` attribute may be used as the element's fallback accessible name.\nThe `title` attribute is commonly presented visually as a tooltip when the user hovers over the element with a pointing device, which is not particularly discoverable, and is also not accessible to visual users without a pointing device.\n\nFor example, a `fieldset` element without a `legend` element child, but with a `title` attribute, gets its accessible name from the `title` attribute.\n\n```\n<fieldset title=\"Select your starter class\">\n  <label><input type=\"radio\" name=\"starter-class\" value=\"green\">Green</label>\n  <label><input type=\"radio\" name=\"starter-class\" value=\"red\">Red</label>\n  <label><input type=\"radio\" name=\"starter-class\" value=\"blue\">Blue</label>\n</fieldset>\n```\n\nFor the HTML `input` and `textarea` elements, the `placeholder` attribute is used as a fallback labeling mechanism if nothing else (including the `title` attribute) results in a label.\nIt is better to use a `label` element, since it does not disappear visually when the user focuses the form control.\n\n```\n<!-- Using a <label> is recommended -->\n<label>Search <input type=search name=q></label>\n\n<!-- A placeholder is used as fallback -->\n<input type=search name=q placeholder=\"Search\">\n```\n\n## Composing Effective and User-friendly Accessible Names\n\nFor assistive technology users, especially screen reader users, the quality of accessible names is one of the most significant contributors to usability.\nNames that do not provide enough information reduce users' effectiveness while names that are too long reduce efficiency.\nAnd, names that are difficult to understand reduce effectiveness, efficiency, and enjoyment.\n\nThe following guidelines provide a starting point for crafting user friendly names.\n\n- Convey function or purpose, not form.\n  For example, if an icon that looks like the letter \"X\" closes a dialog, name it \"Close\", not \"X\".\n  Similarly, if a set of navigation links in the left side bar navigate among the product pages in a shopping site, name the navigation region \"Product\", not \"Left\".\n- Put the most distinguishing and important words first.\n  Often, for interactive elements that perform an action, this means a verb is the first word.\n  For instance, if a list of contacts displays \"Edit\", \"Delete\", and \"Actions\" buttons for each contact, then \"Edit John Doe\", \"Delete John Doe\", and \"Actions for John Doe\" would be better accessible names than \"John Doe edit\", \"John Doe delete\", and \"John Doe actions\".\n  By placing the verb first in the name, screen reader users can more easily and quickly distinguish the buttons from one another as well as from the element that opens the contact card for John Doe.\n- Be concise.\n  For many elements, one to three words is sufficient.\n  Only add more words when necessary.\n- Do NOT include a WAI-ARIA role name in the accessible name.\n  For example, do not include the word \"button\" in the name of a button, the word \"image\" in the name of an image, or the word \"navigation\" in the name of a navigation region.\n  Doing so would create duplicate screen reader output since screen readers convey the role of an element in addition to its name.\n- Create unique names for elements with the same role unless the elements are actually identical.\n  For example, ensure every link on a page has a different name except in cases where multiple links reference the same location.\n  Similarly, give every navigation region on a page a different name unless there are regions with identical content that performs identical navigation functions.\n- Start names with a capital letter; it helps some screen readers speak them with appropriate inflection.\n  Do not end names with a period; they are not sentences.\n\n## Accessible Name Guidance by Role\n\nCertain elements always require a name, others may usually or sometimes require a name, and still others should never be named.\nThe table below lists all ARIA roles and provides the following information for each:\n\nNecessity of Naming\n:   Indicates how necessary it is for authors to add a naming attribute or element to supplement or override the content of an element with the specified role.\n    This column may include one of the following values:\n\n    - Required **Only If** Content Insufficient: An element with this role is named by its descendant content.\n      If `aria-label` or `aria-labelledby` is applied, content contained in the element and its descendants is hidden from assistive technology users unless it is also referenced by `aria-labelledby`.\n      Avoid hiding descendant content except in the rare circumstances where doing so benefits assistive technology users.\n    - Required: The ARIA specification requires authors to provide a name; a missing name causes accessibility validators to report an error.\n    - Recommended: Providing a name is strongly recommended.\n    - Discretionary: Naming is either optional or, in the circumstances described in the guidance column, is discouraged.\n    - Do Not Name: Naming is strongly discouraged even if it is technically permitted; often assistive technologies do not render a name even if provided.\n    - Prohibited: The ARIA specification does not permit the element to be named; If a name is specified, accessibility validators will report an error.\n\nGuidance:\n:   Provides information to help determine if providing a name is beneficial, and if so, describes any recommended techniques.\n\n| role | Necessity of Naming | Guidance |\n| --- | --- | --- |\n| [`alert`](https://w3c.github.io/aria/#alert) | Discretionary | Some screen readers announce the name of an alert before announcing the content of the alert. Thus, `aria-label` provides a method for prefacing the visible content of an alert with text that is not displayed as part of the alert. Using `aria-label` is functionally equivalent to providing off-screen text in the contents of the alert, except off-screen text would be announced by screen readers that do not support `aria-label` on `alert` elements. |\n| [`alertdialog`](https://w3c.github.io/aria/#alertdialog) | Required | Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. |\n| [`application`](https://w3c.github.io/aria/#application) | Required | Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. |\n| [`article`](https://w3c.github.io/aria/#article) | Recommended | - Recommended to distinguish articles from one another; helps users when navigating among articles. - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. |\n| [`banner`](https://w3c.github.io/aria/#banner) | Discretionary | - Necessary in the uncommon circumstance where two banner landmark regions are present on the same page.   It is otherwise optional. - Named using `aria-labelledby` if a visible label is present, otherwise with `aria-label`. - See the [Banner Landmark](../landmark-regions/#aria_lh_banner) section. |\n| [`blockquote`](https://w3c.github.io/aria/#blockquote) | Discretionary | If a visible label is present, associating it with the blockquote by using `aria-labelledby` could benefit some assistive technology users. |\n| [`button`](https://w3c.github.io/aria/#button) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide descendant content from assistive technologies. - Ideally named by visible, descendant content. |\n| [`caption`](https://w3c.github.io/aria/#caption) | Prohibited |  |\n| [`cell`](https://w3c.github.io/aria/#cell) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide descendant content from assistive technologies. - Ideally named by visible, descendant content. - Note that a name is not required; assistive technologies expect an empty cell in a table to be represented by an empty name. - Note that associated row or column headers do not name a `cell`; the name of a cell in a table is its content.   Headers are complementary information. |\n| [`checkbox`](https://w3c.github.io/aria/#checkbox) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide any descendant content from assistive technologies. - If based on HTML `type=\"checkbox\"`, use a `label` element. - Otherwise, reference visible content via `aria-labelledby`. |\n| [`code`](https://w3c.github.io/aria/#code) | Prohibited |  |\n| [`columnheader`](https://w3c.github.io/aria/#columnheader) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide descendant content from assistive technologies. - Ideally named by visible, descendant content. - If the `columnheader` role is implied from an HTML `th`, the HTML `abbr` attribute can be used to specify an abbreviated version of the name that is only announced when screen readers are reading an associated `cell` within the `table`, `grid`, or `treegrid`. |\n| [`combobox`](https://w3c.github.io/aria/#combobox) | Required | - If the `combobox` role is applied to an HTML `select` or `input` element, can be named with an HTML `label` element. - Otherwise use `aria-labelledby` if a visible label is present. - Use `aria-label` if a visible label is not present. |\n| [`complementary`](https://w3c.github.io/aria/#complementary) | Recommended | - Naming is necessary when two complementary landmark regions are present on the same page. - Naming is recommended even when one complementary region is present to help users understand the purpose of the region's content when navigating among landmark regions. - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. - See the [Complementary Landmark](../landmark-regions/#aria_lh_complementary) section. |\n| [`contentinfo`](https://w3c.github.io/aria/#contentinfo) | Discretionary | - Necessary in the uncommon circumstance where two contentinfo landmark regions are present on the same page.   It is otherwise optional. - Named using `aria-labelledby` if a visible label is present, otherwise with `aria-label`. |\n| [`definition`](https://w3c.github.io/aria/#definition) | Recommended | Reference the term being defined with `role=\"term\"`, using `aria-labelledby`. |\n| [`deletion`](https://w3c.github.io/aria/#deletion) | Prohibited |  |\n| [`dialog`](https://w3c.github.io/aria/#dialog) | Required | Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. |\n| [`directory`](https://w3c.github.io/aria/#directory) | Discretionary | - Naming can help users understand the purpose of the directory. - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. |\n| [`document`](https://w3c.github.io/aria/#document) | Discretionary | Elements with the `document` role are contained within an element with the `application` role, which is required to have a name. Typically, the name of the `application` element will provide sufficient context and identity for the `document` element. Because the `application` element is used only to create unusual, custom widgets, careful assessment is necessary to determine whether or not adding an accessible name is beneficial. |\n| [`emphasis`](https://w3c.github.io/aria/#emphasis) | Prohibited |  |\n| [`feed`](https://w3c.github.io/aria/#feed) | Recommended | - Helps screen reader users understand the context and purpose of the feed. - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. - See the [Feed Pattern](../../patterns/feed/). |\n| [`figure`](https://w3c.github.io/aria/#figure) | Recommended | - For HTML, use the `figure` and `figcaption` elements.   The `figcaption` will serve as the accessible name for the `figure`.   See the [Naming Tables and Figures with Captions](#naming_with_captions) section. - When not using HTML, or when retrofitting legacy HTML, use the `aria-labelledby` on the figure, pointing to the figure's caption. - If there is no visible caption, `aria-label` can be used. |\n| [`form`](https://w3c.github.io/aria/#form) | Recommended | - Helps screen reader users understand the context and purpose of the form landmark. - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. - See the [Form Landmark](../landmark-regions/#aria_lh_form) section. |\n| [`generic`](https://w3c.github.io/aria/#generic) | Prohibited |  |\n| [`grid`](https://w3c.github.io/aria/#grid) | Required | - If the `grid` is applied to an HTML `table` element, then the accessible name can be derived from the table's `caption` element. - Otherwise, use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. |\n| [`gridcell`](https://w3c.github.io/aria/#gridcell) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide descendant content from assistive technologies. - Ideally named by visible, descendant content. - Note that a name is not required; assistive technologies expect an empty cell in a grid to be represented by an empty name. - Note that associated row or column headers do not name a `gridcell`; the name of a cell in a grid is its content.   Headers are complementary information. |\n| [`group`](https://w3c.github.io/aria/#group) | Discretionary | - When using the HTML `fieldset` element, the accessible name can be derived from the `legend` element. - When using the HTML `details` element, do not provide an accessible name for this element.   The user interacts with the `summary` element, and that can derive its accessible name from its contents. - When using the HTML `optgroup` element, use the `label` attribute. - Otherwise, use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. |\n| [`heading`](https://w3c.github.io/aria/#heading) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide descendant content from assistive technologies. - Ideally named by visible, descendant content. |\n| [`insertion`](https://w3c.github.io/aria/#insertion) | Prohibited |  |\n| [`img`](https://w3c.github.io/aria/#img) | Required | For the HTML `img` element, use the `alt` attribute. For other elements with the `img` role, use `aria-labelledby` or `aria-label`. |\n| [`link`](https://w3c.github.io/aria/#link) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide descendant content from assistive technologies. - Ideally named by visible, descendant content. |\n| [`list`](https://w3c.github.io/aria/#list) | Discretionary | - Potentially beneficial for users of screen readers that support both list names and navigation among lists on a page. - Potentially a source of distracting or undesirable screen reader verbosity, especially if nested within a named container, such as a navigation region. - Can be named using `aria-labelledby` if a visible label is present, otherwise with `aria-label`. |\n| [`listbox`](https://w3c.github.io/aria/#listbox) | Required | - If the `listbox` role is applied to an HTML `select` element (with the `multiple` attribute or a `size` attribute having a value greater than 1), can be named with an HTML `label` element. - Otherwise use `aria-labelledby` if a visible label is present. - Use `aria-label` if a visible label is not present. - See the [Listbox Pattern](../../patterns/listbox/). |\n| [`listitem`](https://w3c.github.io/aria/#listitem) | Do Not Name | Naming is not supported by assistive technologies; it is necessary to include relevant content within the list item. |\n| [`log`](https://w3c.github.io/aria/#log) | Discretionary | Some screen readers announce the name of a log element before announcing the content of the log element. Thus, `aria-label` provides a method for prefacing the visible content of a log element with text that is not displayed as part of the log element. Using `aria-label` is functionally equivalent to providing off-screen text in the contents of the log element, except off-screen text would be announced by screen readers that do not support `aria-label` on `log` elements. |\n| [`mark`](https://w3c.github.io/aria/#mark) | Prohibited |  |\n| [`main`](https://w3c.github.io/aria/#main) | Discretionary | - Potentially helpful for orienting assistive technology users, especially in single-page applications where main content changes happen without generating a page load event. - Can be named using `aria-labelledby` if a visible label is present, otherwise with `aria-label`. - See the [Main Landmark](../landmark-regions/#aria_lh_main) section. |\n| [`marquee`](https://w3c.github.io/aria/#marquee) | Discretionary | Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. |\n| [`math`](https://w3c.github.io/aria/#math) | Recommended | - If the `math` element has only presentational children and the accessible name is intended to convey the mathematical expression, use `aria-label` to provide a string that represents the expression. - If the `math` element contains navigable content that conveys the mathematical expression and a visible label for the expression is present, use `aria-labelledby`. - Otherwise, use a`aria-label` to name the expression, e.g., `aria-label=\"Pythagorean Theorem\"`. |\n| [`menu`](https://w3c.github.io/aria/#menu) | Recommended | - Use `aria-labelledby` to refer to the menuitem or button that controls this element's display. - Otherwise, use `aria-label`. - See the [Menu and Menubar Pattern](../../patterns/menubar/). |\n| [`menubar`](https://w3c.github.io/aria/#menubar) | Recommended | - Helps screen reader users understand the context and purpose of `menuitem` elements in a `menubar`.   Naming a `menubar` is comparable to naming a menu button.   The name of a `button` that opens a `menu` conveys the purpose of the menu it opens.   Since a `menubar` element is displayed persistently, a name on the `menubar` can serve that same purpose. - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. - See the [Menu and Menubar Pattern](../../patterns/menubar/). |\n| [`menuitem`](https://w3c.github.io/aria/#menuitem) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide any descendant content from assistive technologies. - Ideally named by visible, descendant content. - Note: content contained within a child `menu` is automatically excluded from the accessible name calculation. - See the [Menu and Menubar Pattern](../../patterns/menubar/). |\n| [`menuitemcheckbox`](https://w3c.github.io/aria/#menuitemcheckbox) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide any descendant content from assistive technologies. - Ideally named by visible, descendant content. - See the [Menu and Menubar Pattern](../../patterns/menubar/). |\n| [`menuitemradio`](https://w3c.github.io/aria/#menuitemradio) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide any descendant content from assistive technologies. - Ideally named by visible, descendant content. - See the [Menu and Menubar Pattern](../../patterns/menubar/). |\n| [`meter`](https://w3c.github.io/aria/#meter) | Required | - If based on an HTML `meter` element, can be named with an HTML `label` element. - Otherwise use `aria-labelledby` if a visible label is present. - Use `aria-label` if a visible label is not present. |\n| [`navigation`](https://w3c.github.io/aria/#navigation) | Recommended | - Helps screen reader users understand the context and purpose of the navigation landmark. - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. - See the [Navigation Landmark](../landmark-regions/#aria_lh_navigation) section. |\n| [`none`](https://w3c.github.io/aria/#none) | Prohibited | An element with `role=\"none\"` is not part of the accessibility tree (except in error cases). Do not use `aria-labelledby` or `aria-label`. |\n| [`note`](https://w3c.github.io/aria/#note) | Discretionary | - Naming is optional, but can help screen reader users understand the context and purpose of the note. - Named using `aria-labelledby` if a visible label is present, otherwise with `aria-label`. |\n| [`option`](https://w3c.github.io/aria/#option) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide any descendant content from assistive technologies. - Ideally named by visible, descendant content. - See the [Combobox Pattern](../../patterns/combobox/). |\n| [`paragraph`](https://w3c.github.io/aria/#paragraph) | Prohibited |  |\n| [`presentation`](https://w3c.github.io/aria/#presentation) | Prohibited | An element with `role=\"presentation\"` is not part of the accessibility tree (except in error cases). Do not use `aria-labelledby` or `aria-label`. |\n| [`progressbar`](https://w3c.github.io/aria/#progressbar) | Required | - If the `progressbar` role is applied to an HTML `progress` element, can be named with an HTML `label` element. - Otherwise use `aria-labelledby` if a visible label is present. - Use `aria-label` if a visible label is not present. |\n| [`radio`](https://w3c.github.io/aria/#radio) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide any descendant content from assistive technologies. - If based on HTML `type=\"checkbox\"`, use a `label` element. - Otherwise, reference visible content via `aria-labelledby`. |\n| [`radiogroup`](https://w3c.github.io/aria/#radiogroup) | Required | - Recommended to help assistive technology users understand the purpose of the group of `radio` buttons. - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. - See the [Radio Group Pattern](../../patterns/radio/). |\n| [`region`](https://w3c.github.io/aria/#region) | Required | - Helps screen reader users understand the context and purpose of the landmark. - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. - See the [Region Landmark](../landmark-regions/#aria_lh_region) section. |\n| [`row`](https://w3c.github.io/aria/#row) | Required **Only If** Content Insufficient **AND** descendant of a `treegrid` **AND** the row is focusable | When `row` elements are focusable in a [treegrid](../../patterns/treegrid/), screen readers announce the entire contents of a row when navigating by row. This is typically the most appropriate behavior. However, in some circumstances, it could be beneficial to change the order in which cells are announced or exclude announcement of certain cells by using `aria-labelledby` to specify which cells to announce. |\n| [`rowgroup`](https://w3c.github.io/aria/#rowgroup) | Do Not Name | Naming is not supported by assistive technologies. |\n| [`rowheader`](https://w3c.github.io/aria/#rowheader) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide descendant content from assistive technologies. - Ideally named by visible, descendant content. - If the `rowheader` role is implied from an HTML `th`, the HTML `abbr` attribute can be used to specify an abbreviated version of the name that is only announced when screen readers are reading an associated `cell` within the `table`, `grid`, or `treegrid`. |\n| [`scrollbar`](https://w3c.github.io/aria/#scrollbar) | Discretionary | - Naming is optional, but can potentially help screen reader users understand the purpose of the scrollbar.   The purpose is also conveyed using the `aria-controls` attribute, which is required for `scrollbar`. - Named using `aria-labelledby` if a visible label is present, otherwise with `aria-label`. |\n| [`search`](https://w3c.github.io/aria/#search) | Recommended | - Helps screen reader users understand the context and purpose of the search landmark. - Named using `aria-labelledby` if a visible label is present, otherwise with `aria-label`. - See the [Search Landmark](../landmark-regions/#aria_lh_search) section. |\n| [`searchbox`](https://w3c.github.io/aria/#searchbox) | Required | - If the `searchbox` role is applied to an HTML `input` element, can be named with an HTML `label` element. - Otherwise use `aria-labelledby` if a visible label is present. - Use `aria-label` if a visible label is not present. |\n| [`separator`](https://w3c.github.io/aria/#separator) | Discretionary | - Recommended if there is more than one focusable `separator` element on the page. - Can help assistive technology users understand the purpose of the separator. - Named using `aria-labelledby` if a visible label is present, otherwise with `aria-label`. |\n| [`slider`](https://w3c.github.io/aria/#slider) | Required | - If the `slider` role is applied to an HTML `input` element, can be named with an HTML `label` element. - Otherwise use `aria-labelledby` if a visible label is present. - Use `aria-label` if a visible label is not present. - See the [Slider Pattern](../../patterns/slider/) and the [Slider (Multi-Thumb) Pattern](../../patterns/slider-multithumb/). |\n| [`spinbutton`](https://w3c.github.io/aria/#spinbutton) | Required | - If the `textbox` role is applied to an HTML `input` element, can be named with an HTML `label` element. - Otherwise use `aria-labelledby` if a visible label is present. - Use `aria-label` if a visible label is not present. - See the [Spinbutton Pattern](../../patterns/spinbutton/). |\n| [`status`](https://w3c.github.io/aria/#status) | Discretionary | Some screen readers announce the name of a status element before announcing the content of the status element. Thus, `aria-label` provides a method for prefacing the visible content of a status element with text that is not displayed as part of the status element. Using `aria-label` is functionally equivalent to providing off-screen text in the contents of the status element, except off-screen text would be announced by screen readers that do not support `aria-label` on `status` elements. |\n| [`strong`](https://w3c.github.io/aria/#strong) | Prohibited |  |\n| [`subscript`](https://w3c.github.io/aria/#subscript) | Prohibited |  |\n| [`superscript`](https://w3c.github.io/aria/#superscript) | Prohibited |  |\n| [`switch`](https://w3c.github.io/aria/#switch) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide any descendant content from assistive technologies. - If based on HTML `type=\"checkbox\"`, use a `label` element. - Otherwise, reference visible content via `aria-labelledby`. |\n| [`tab`](https://w3c.github.io/aria/#tab) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide descendant content from assistive technologies. - Ideally named by visible, descendant content. |\n| [`table`](https://w3c.github.io/aria/#table) | Required | - If using HTML `table` element, use the `caption` element. - Otherwise use `aria-labelledby` if a visible label is present. - Use `aria-label` if a visible label is not present. - See the [Table Pattern](../../patterns/table/). |\n| [`tablist`](https://w3c.github.io/aria/#tablist) | Recommended | - Helps screen reader users understand the context and purpose of the tablist. - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. - See the [Carousel Pattern](../../patterns/carousel/) and [Tabs Pattern](../../patterns/tabs/). |\n| [`tabpanel`](https://w3c.github.io/aria/#tabpanel) | Required | - Use `aria-labelledby` pointing to the `tab` element that controls the `tabpanel`. - See the [Carousel Pattern](../../patterns/carousel/) and [Tabs Pattern](../../patterns/tabs/). |\n| [`term`](https://w3c.github.io/aria/#term) | Do Not Name | Since a term is usually the name for the `role=\"definition\"` element, it could be confusing if the term itself also has a name. |\n| [`textbox`](https://w3c.github.io/aria/#textbox) | Required | - If the `textbox` role is applied to an HTML `input` or `textarea` element, can be named with an HTML `label` element. - Otherwise use `aria-labelledby` if a visible label is present. - Use `aria-label` if a visible label is not present. |\n| [`time`](https://w3c.github.io/aria/#time) | Do Not Name | Naming is not supported by assistive technologies. |\n| [`timer`](https://w3c.github.io/aria/#timer) | Discretionary | Some screen readers announce the name of a timer element before announcing the content of the timer element. Thus, `aria-label` provides a method for prefacing the visible content of a timer element with text that is not displayed as part of the timer element. Using `aria-label` is functionally equivalent to providing off-screen text in the contents of the timer element, except off-screen text would be announced by screen readers that do not support `aria-label` on `timer` elements. |\n| [`toolbar`](https://w3c.github.io/aria/#toolbar) | Recommended | - If there is more than one `toolbar` element on the page, naming is required. - Helps assistive technology users to understand the purpose of the toolbar, even when there is only one toolbar on the page. - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. - See the [Toolbar Pattern](../../patterns/toolbar/). |\n| [`tooltip`](https://w3c.github.io/aria/#tooltip) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide descendant content from assistive technologies. - Ideally named by visible, descendant content. |\n| [`tree`](https://w3c.github.io/aria/#tree) | Required | - Use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. - See the [Tree View Pattern](../../patterns/treeview/). |\n| [`treegrid`](https://w3c.github.io/aria/#treegrid) | Required | - If the `treegrid` is applied to an HTML `table` element, then the accessible name can be derived from the table's `caption` element. - Otherwise, use `aria-labelledby` if a visible label is present, otherwise use `aria-label`. - See the [Treegrid Pattern](../../patterns/treegrid/). |\n| [`treeitem`](https://w3c.github.io/aria/#treeitem) | Required **Only If** Content Insufficient | - Warning! Using `aria-label` or `aria-labelledby` will hide any descendant content from assistive technologies. - Ideally named by visible, descendant content. - Note: content contained within a child `group` is automatically excluded from the accessible name calculation. - See the [Tree View Pattern](../../patterns/treeview/). |\n\n## Accessible name calculation\n\nUser agents construct an accessible name string for an element by walking through a list of potential naming methods and using the first that generates a name.\nThe algorithm they follow is defined in the [accessible name specification](https://w3c.github.io/accname/).\nIt is roughly like the following:\n\n1. The `aria-labelledby` property is used if present.\n2. If the name is still empty, the `aria-label` property is used if present.\n3. If the name is still empty, then host-language-specific attributes or elements are used if present.\n   For HTML, these are, depending on the element:\n\n   `input` whose `type` attribute is in the Button, Submit Button, or Reset Button state\n   :   The `value` attribute.\n\n   `input` whose `type` attribute is in the Image Button state\n\n   `img`\n\n   `area`\n   :   The `alt` attribute.\n\n   `fieldset`\n   :   The first child `legend` element.\n\n   Other form elements\n   :   The associated `label` element(s).\n\n   `figure`\n   :   The first child `figcaption` element.\n\n   `table`\n   :   The first child `caption` element.\n4. If the name is still empty, then for elements with a role that supports naming from child content, the content of the element is used.\n5. Finally, if the name is still empty, then other fallback host-language-specific attributes or elements are used if present.\n   For HTML, these are, depending on the element:\n\n   `input` whose `type` attribute is in the Text, Password, Search, Telephone, or URL states\n\n   `textarea`\n   :   The `title` attribute.\n       Otherwise, the `placeholder` attribute.\n\n   `input` whose `type` attribute is in the Submit Button state\n   :   A localized string of the word \"submit\".\n\n   `input` whose `type` attribute is in the Reset Button state\n   :   A localized string of the word \"reset\".\n\n   `input` whose `type` attribute is in the Image Button state\n   :   The `title` attribute.\n       Otherwise, a localized string of the phrase \"Submit Query\".\n\n   `summary`\n   :   The word \"Details\".\n\n   Other elements\n   :   The `title` attribute.\n\nThe final step is a fallback mechanism.\nGenerally when labeling an element, use one of the non-fallback mechanisms.\n\nWhen calculating a name from content, the user agent walks through all descendant nodes except in the cases of `treeitem` and `menuitem` as described below.\nAnd, when following references in an `aria-labelledby` attribute, it similarly walks the tree of each referenced element.\nThus, the naming algorithm is recursive.\nThe following two sections explain non-recursive and recursive examples of how the algorithm works.\n\nWhen calculating a name from content for the `treeitem` role, descendant content of child `group` elements are not included.\nFor example, in the following `tree`, the name of the first tree item is \"Fruits\"; \"Apples\", \"Bananas\", and \"Oranges\" are automatically omitted.\n\n```\n<ul role=\"tree\">\n  <li role=\"treeitem\">Fruits\n    <ul role=\"group\">\n      <li role=\"treeitem\">Apples</li>\n      <li role=\"treeitem\">Bananas</li>\n      <li role=\"treeitem\">Oranges</li>\n    </ul>\n  </li>\n</ul>\n```\n\nSimilarly, when calculating a name from content for the `menuitem` role, descendant content of child `menu` elements are not included.\nSo, the name of the first parent `menuitem` in the following `menu` is \"Fruits\".\n\n```\n<ul role=\"menu\">\n  <li role=\"menuitem\">Fruits\n    <ul role=\"menu\">\n      <li role=\"menuitem\">Apples</li>\n      <li role=\"menuitem\">Bananas</li>\n      <li role=\"menuitem\">Oranges</li>\n    </ul>\n  </li>\n</ul>\n```\n\n### Examples of non-recursive accessible name calculation\n\nConsider an `input` element that has no associated `label` element and only a `name` attribute and so does not have an accessible name (do not do this):\n\n```\n<input name=\"code\">\n```\n\nIf there is a `placeholder` attribute, then it serves as a naming fallback mechanism (avoid doing this):\n\n```\n<input name=\"code\"\n  placeholder=\"One-time code\">\n```\n\nIf there is also a `title` attribute, then it is used as the accessible name instead of `placeholder`, but it is still a fallback (avoid doing this):\n\n```\n<input name=\"code\"\n  placeholder=\"123456\"\n  title=\"One-time code\">\n```\n\nIf there is also a `label` element (recommended), then that is used as the accessible name, and the `title` attribute is instead used as the accessible description:\n\n```\n<label>One-time code\n  <input name=\"code\"\n    placeholder=\"123456\"\n    title=\"Get your code from the app.\">\n</label>\n```\n\nIf there is also an `aria-label` attribute (not recommended unless it adds clarity for assistive technology users), then that becomes the accessible name, overriding the `label` element:\n\n```\n<label>Code\n  <input name=\"code\"\n    aria-label=\"One-time code\"\n    placeholder=\"123456\"\n    title=\"Get your code from the app.\">\n</label>\n```\n\nIf there is also an `aria-labelledby` attribute, that wins over the other elements and attributes (the `aria-label` attribute ought to be removed if it is not used):\n\n```\n<p>Please fill in your <span id=\"code-label\">one-time code</span> to log in.</p>\n<p>\n  <label>Code\n    <input name=\"code\"\n    aria-labelledby=\"code-label\"\n    aria-label=\"This is ignored\"\n    placeholder=\"123456\"\n    title=\"Get your code from the app.\">\n  </label>\n</p>\n```\n\n### Examples of recursive accessible name calculation\n\nThe accessible name calculation algorithm will be invoked recursively when necessary.\nAn `aria-labelledby` reference causes the algorithm to be invoked recursively, and when computing an accessible name from content the algorithm is invoked recursively for each child node.\n\nIn this example, the label for the button is computed by recursing into each child node, resulting in \"Move to trash\".\n\n```\n<button>Move to <img src=\"bin.svg\" alt=\"trash\"></button>\n```\n\nWhen following an `aria-labelledby` reference, the algorithm avoids following the same reference twice to avoid infinite loops.\n\nIn this example, the label for the button is computed by first following the `aria-labelledby` reference to the parent element, and then computing the label for that element from the child nodes, first visiting the `button` element again but ignoring the `aria-labelledby` reference and instead using the `aria-label`, and then visiting the next child (the text node).\nThe resulting label is \"Remove meeting: Daily status report\".\n\n```\n<div id=\"meeting-1\">\n  <button aria-labelledby=\"meeting-1\" aria-label=\"Remove meeting:\">X</button>\n  Daily status report\n</div>\n```\n\n## Describing Techniques\n\n### Describing by referencing content with `aria-describedby`\n\nThe `aria-describedby` property works similarly to the `aria-labelledby` property.\nFor example, a button could be described by a sibling paragraph.\n\n```\n<button aria-describedby=\"trash-desc\">Move to trash</button>\n...\n<p id=\"trash-desc\">Items in the trash will be permanently removed after 30 days.</p>\n```\n\nDescriptions are reduced to text strings.\nFor example, if the description contains an HTML `img` element, a text equivalent of the image is computed.\n\n```\n<button aria-describedby=\"trash-desc\">Move to <img src=\"bin.svg\" alt=\"trash\"></button>\n...\n<p id=\"trash-desc\">Items in <img src=\"bin.svg\" alt=\"the trash\"> will be permanently removed after 30 days.</p>\n```\n\nAs with `aria-labelledby`, it is possible to reference an element using `aria-describedby` even if that element is hidden.\nFor example, a text field in a form could have a description that is hidden by default, but can be revealed on request using a disclosure widget.\nThe description could also be referenced from the text field directly with `aria-describedby`.\nIn the following example, the accessible description for the `input` element is \"Your username is the name that you use to log in to this service.\"\n\n```\n<label for=\"username\">Username</label>\n<input id=\"username\" name=\"username\" aria-describedby=\"username-desc\">\n<button aria-expanded=\"false\" aria-controls=\"username-desc\" aria-label=\"Help about username\">?</button>\n<p id=\"username-desc\" hidden>\n  Your username is the name that you use to log in to this service.\n</p>\n```\n\n### Describing Tables and Figures with Captions\n\nIn HTML, if the `table` is named using `aria-label` or `aria-labelledby`, a child `caption` element becomes an accessible description.\nFor example, a preceding heading might serve as an appropriate accessible name, and the `caption` element might contain a longer description.\nIn such a situation, `aria-labelledby` could be used on the `table` to set the accessible name to the heading content and the `caption` would become the accessible description.\n\n```\n<h2 id=\"events-heading\">Upcoming events</h2>\n<table aria-labelledby=\"events-heading\">\n  <caption>\n    Calendar of upcoming events, weeks 27 through 31, with each week starting with\n    Monday. The first column is the week number.\n  </caption>\n  <tr><th>Week</th><th>Monday</th><th>Tuesday</th><th>Wednesday</th><th>Thursday</th><th>Friday</th><th>Saturday</th><th>Sunday</th></tr>\n  <tr><td>27</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr>\n  <tr><td>28</td><td></td><td></td><td></td><td></td><td></td><td></td><td><a href=\"/events/9856\">Crown Princess's birthday</a></td></tr>\n  <tr><td>29</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr>\n  <tr><td>30</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr>\n  <tr><td>31</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr>\n</table>\n```\n\nThe HTML `figure` element can get its accessible *name* from its `figcaption` element, but it will not be used as the accessible *description*, even if it was not used as the accessible name.\nIf the `figcaption` element is appropriate as an accessible description, and the accessible name is set using `aria-labelledby` or `aria-label`, then the `figcaption` can be explicitly set as the accessible description using the `aria-describedby` attribute.\n\n```\n<h2 id=\"neutron\">Neutron</h2>\n<figure aria-labelledby=\"neutron\" aria-describedby=\"neutron-caption\">\n  <img src=\"neutron.svg\" alt=\"Within the neutron are three quarks (blue 'u', red 'd', green 'd') that are interconnected.\">\n  <figcaption id=\"neutron-caption\">\n    The quark content of the neutron. The color assignment of individual quarks is\n    arbitrary, but all three colors must be present. Forces between quarks are\n    mediated by gluons.\n  </figcaption>\n</figure>\n```\n\n### Descriptions Derived from Titles\n\nIf an accessible description was not provided using the `aria-describedby` attribute or one of the primary host-language-specific attributes or elements (e.g., the `caption` element for `table`), then, for HTML, if the element has a `title` attribute, that is used as the accessible description.\n\nA visible description together with `aria-describedby` is generally recommended.\nIf a description that is not visible is desired, then the `title` attribute can be used, for any HTML element that can have an accessible description.\n\nNote that the `title` attribute might not be accessible to some users, in particular sighted users not using a screen reader and not using a pointing device that supports hover (e.g., a mouse).\n\nFor example, an `input` element with input constrained using the `pattern` attribute can use the `title` attribute to describe what the expected input is.\n\n```\n<label> Part number:\n  <input pattern=\"[0-9][A-Z]{3}\" name=\"part\"\n    title=\"A part number is a digit followed by three uppercase letters.\"/>\n</label>\n```\n\nThe `title` attribute in this case can be shown to the user as a tooltip when the user hovers or focuses the control, but also as part of the error message when the user agent validates the form, if the `input` element's value doesn't match the `pattern`.\n\nAs another example, a link can use the `title` attribute to describe the link in more detail.\n\n```\n<a href=\"http://twitter.com/W3C\"\n  title=\"Follow W3C on Twitter\">\n  <img src=\"/2008/site/images/Twitter_bird_logo_2012.svg\"\n    alt=\"Twitter\" class=\"social-icon\" height=\"40\" />\n</a>\n```\n\n## Accessible description calculation\n\nLike the [accessible name calculation](#name_calculation), the accessible description calculation produces a text string.\n\nThe accessible description calculation algorithm is the same as the accessible name calculation algorithm except for a few branch points that depend on whether a name or description is being calculated.\nIn particular, when accumulating text for an accessible description, the algorithm uses `aria-describedby` instead of `aria-labelledby`.\n\nUser agents construct an accessible description string for an element by walking through a list of potential description methods and using the first that generates a description.\nThe algorithm they follow is defined in the [accessible name specification](https://w3c.github.io/accname/).\nIt is roughly like the following:\n\n1. The `aria-describedby` property is used if present.\n2. If the description is still empty, then host-language-specific attributes or elements are used if present, if it wasn't already used as the accessible name.\n   For HTML, these are, depending on the element:\n\n   `input` whose `type` attribute is in the Button, Submit Button, or Reset Button state\n   :   The `value` attribute.\n\n   `summary`\n   :   The element's subtree.\n\n   `table`\n   :   The first child `caption` element.\n3. Finally, if the description is still empty, then other host-language-specific attributes or elements are used if present, if it wasn't already used for the accessible name.\n   For HTML, this is the `title` attribute.",
  "tags": [
    "aria",
    "accessibility",
    "patterns",
    "w3c"
  ],
  "extracted_at": "2026-02-03T14:23:30.876993+00:00",
  "content_length": 62748,
  "content_hash": "2c158b44db7d1845"
}