{"complexity": "complex", "subtasks": [{"id": 1, "assigned_to": "CODER", "description": "Write a Python script `prune_experiments.py` that scans the `experiments/` directory and produces a list of all experiment sub‑directories whose last‑modified timestamp is older than 24 hours. The script must output this list to a variable or file for later steps and must **exclude any directory modified today**.", "acceptance_criteria": "The script correctly identifies and prints (or stores) only experiment directories older than 24 hours, with no false positives for today’s directories. Running the script on a test set of directories produces the expected list."}, {"id": 2, "assigned_to": "CODER", "description": "Extend the script to analyze each candidate directory from step 1 and decide if it contains *useful output*: at least one non‑empty file and no exact duplicate of another directory’s contents. Use file size and SHA‑256 hashes to detect duplicate files across directories. Mark directories as `keep` or `remove` accordingly.", "acceptance_criteria": "For each examined directory the script records a boolean flag (`keep`/`remove`). Directories with only empty files or whose file set is an exact duplicate of another older directory are flagged for removal. The duplicate‑detection logic is deterministic and documented in comments."}, {"id": 3, "assigned_to": "CODER", "description": "Implement the deletion step: safely delete all directories flagged for removal in step 2. Before deletion, log the full path and total size of each directory. Ensure the script aborts if any directory slated for deletion is found to have a modification time within the last 24 hours (extra safety check).", "acceptance_criteria": "Running the script on a controlled test environment deletes only the intended directories, logs each deletion with path and size, and never deletes a directory modified within the last 24 hours. No errors or exceptions are raised during deletion."}, {"id": 4, "assigned_to": "CODER", "description": "After deletions, compute and print a summary report: total number of directories deleted, total number kept, and total bytes freed by the deletions. The report should be human‑readable and also written to a `prune_report.txt` file in the project root.", "acceptance_criteria": "The script outputs a clear summary (e.g., `Deleted: X directories, Kept: Y directories, Freed: Z bytes`) to stdout and writes the same information to `prune_report.txt`. The numbers match the actual filesystem changes when verified manually."}], "next_role": "CODER", "critic_review": {"score": 1.0, "issues": [], "feedback": ["[OK] Code quality looks good!"], "passed": true, "timestamp": "2026-02-03T20:19:04.479988", "context": {"filename": "/app/grind_logs/session_1_run_145.json", "task": "PRUNE: experiments/ directory\n\nThere are 1824 experiment directories, most are garbage duplicates.\n\n1. List all experiments older than 24 hours\n2. Check which ones have actual useful output (non-empty, non-duplicate files)\n3. Delete empty or duplicate experiment directories\n4. Keep only experiments with unique, substantial output\n5. Report: X deleted, Y kept, Z bytes freed\n\nBE CAREFUL - don't delete anything from today.", "session_id": 1, "run": 145}}, "quality_score": 1.0, "critic_feedback": ["[OK] Code quality looks good!"], "critic_retry_count": 0}