{"complexity": "complex", "subtasks": [{"id": 1, "assigned_to": "CODER", "description": "Write a Python script `prune_experiments.py` that scans the `experiments/` directory, lists all experiment sub‑directories whose last‑modified timestamp is older than 24 hours, and records their paths.", "acceptance_criteria": "The script prints a clear list of qualifying directories. No directories from the current day are included. The script runs without error on a fresh checkout."}, {"id": 2, "assigned_to": "CODER", "description": "Extend the script to examine each listed experiment directory and decide if it contains useful output: at least one non‑empty file and not a duplicate of another experiment (use SHA‑256 hash of file contents to detect duplicates).", "acceptance_criteria": "For each directory the script marks it as `keep` or `remove`. Duplicate detection correctly groups identical file sets, and empty directories are flagged for removal."}, {"id": 3, "assigned_to": "CODER", "description": "Implement safe deletion: remove only directories marked `remove` (empty or duplicate) while preserving all `keep` directories. Ensure the operation never touches directories modified within the last 24 hours.", "acceptance_criteria": "After execution, only the intended directories are deleted. The script logs each deletion and confirms that no today‑modified directories were removed."}, {"id": 4, "assigned_to": "CODER", "description": "Calculate and report a summary: number of directories deleted (X), number kept (Y), and total bytes freed (Z). Append this report to the script output.", "acceptance_criteria": "The final console output includes a line like `Deleted: X, Kept: Y, Bytes freed: Z`. The byte count matches the sum of file sizes removed."}, {"id": 5, "assigned_to": "CODER", "description": "Add basic error handling and safety prompts (e.g., a `--dry-run` flag) and ensure the script follows the project's style guidelines (PEP 8). Include a short README explaining usage.", "acceptance_criteria": "The script runs with `--dry-run` showing what would be deleted without performing deletions. Code passes `flake8`/`pylint` checks, and the README provides clear instructions."}], "next_role": "CODER", "critic_review": {"score": 1.0, "issues": [], "feedback": ["[OK] Code quality looks good!"], "passed": true, "timestamp": "2026-02-03T20:16:42.501105", "context": {"filename": "/app/grind_logs/session_1_run_118.json", "task": "PRUNE: experiments/ directory\n\nThere are 1824 experiment directories, most are garbage duplicates.\n\n1. List all experiments older than 24 hours\n2. Check which ones have actual useful output (non-empty, non-duplicate files)\n3. Delete empty or duplicate experiment directories\n4. Keep only experiments with unique, substantial output\n5. Report: X deleted, Y kept, Z bytes freed\n\nBE CAREFUL - don't delete anything from today.", "session_id": 1, "run": 118}}, "quality_score": 1.0, "critic_feedback": ["[OK] Code quality looks good!"], "critic_retry_count": 0}