{"complexity": "complex", "subtasks": [{"id": 1, "assigned_to": "CODER", "description": "Write a Python script that scans the `experiments/` directory and produces a list of all experiment sub‑directories whose last‑modified timestamp is older than 24 hours.", "acceptance_criteria": "The script outputs a JSON or plain‑text list of paths for every experiment directory older than 24 h and excludes any directory modified within the last 24 h."}, {"id": 2, "assigned_to": "CODER", "description": "Extend the script to inspect each older experiment directory and determine whether it contains useful output: (a) at least one non‑empty file, and (b) its file contents are not exact duplicates of another experiment’s files (use file hashing to detect duplicates). Mark directories that are empty or duplicate for removal.", "acceptance_criteria": "For each older directory the script records a status flag (`keep` or `delete`). A directory is flagged `delete` if it has no non‑empty files or if all its files are byte‑wise duplicates of files in another directory."}, {"id": 3, "assigned_to": "CODER", "description": "Implement the deletion step: safely delete all directories flagged `delete` while ensuring no directory from today is touched. While deleting, accumulate statistics: number of directories deleted, number kept, and total bytes freed.", "acceptance_criteria": "After execution, the script reports `X deleted, Y kept, Z bytes freed`. No directories modified within the last 24 h are removed, and the filesystem reflects the deletions."}, {"id": 4, "assigned_to": "CODER", "description": "Add a final reporting section that prints a concise summary of the operation (deleted/kept counts and bytes freed) and writes the same summary to a file `prune_experiments_report.txt` in the project root.", "acceptance_criteria": "Running the script creates/overwrites `prune_experiments_report.txt` containing the exact same summary printed to stdout. The file is human‑readable and includes the three metrics."}], "next_role": "CODER", "critic_review": {"score": 1.0, "issues": [], "feedback": ["[OK] Code quality looks good!"], "passed": true, "timestamp": "2026-02-03T20:16:15.472181", "context": {"filename": "/app/grind_logs/session_1_run_113.json", "task": "PRUNE: experiments/ directory\n\nThere are 1824 experiment directories, most are garbage duplicates.\n\n1. List all experiments older than 24 hours\n2. Check which ones have actual useful output (non-empty, non-duplicate files)\n3. Delete empty or duplicate experiment directories\n4. Keep only experiments with unique, substantial output\n5. Report: X deleted, Y kept, Z bytes freed\n\nBE CAREFUL - don't delete anything from today.", "session_id": 1, "run": 113}}, "quality_score": 1.0, "critic_feedback": ["[OK] Code quality looks good!"], "critic_retry_count": 0}