{"complexity": "complex", "subtasks": [{"id": 1, "assigned_to": "CODER", "description": "Create a safe, idempotent Python script (e.g., `prune_experiments.py`) that:\n1. Scans the `experiments/` directory and lists all sub‑directories older than 24 hours.\n2. Determines which of those contain useful output (non‑empty files) and which are empty or duplicate (identical file hashes across directories).\n3. Generates two lists: directories to KEEP and directories to DELETE (excluding any created today).\n4. Implements a dry‑run mode and a confirmed‑delete mode that removes only the DELETE list, frees disk space, and records the total bytes reclaimed.\n5. Prints a concise summary: `X deleted, Y kept, Z bytes freed`.\n", "acceptance_criteria": "The script runs without error on a test `experiments/` tree, correctly separates today’s folders from older ones, accurately flags empty or duplicate directories, provides a dry‑run option, and produces the required summary output."}, {"id": 2, "assigned_to": "REVIEWER", "description": "Review the `prune_experiments.py` implementation for safety, correctness, and style. Verify that:\n- No directories created today are ever deleted.\n- Duplicate detection uses reliable hashing (e.g., SHA‑256).\n- Errors (permissions, missing files) are handled gracefully.\n- The script includes logging and a dry‑run flag.\n- Unit‑style tests on a mock directory pass.\n", "acceptance_criteria": "Reviewer signs off after confirming the script meets all safety requirements, passes the mock‑directory tests, and the summary output matches expected values."}, {"id": 3, "assigned_to": "DOCUMENTER", "description": "Write a short audit report (README or markdown) that records:\n- Number of experiment directories deleted.\n- Number kept.\n- Total bytes freed.\n- Any assumptions or limitations (e.g., duplicate detection only on file contents, not metadata).\n- Instructions for re‑running the script in dry‑run mode.\n", "acceptance_criteria": "Document is clear, includes the exact numbers produced by the script, and can be used for future audits."}], "next_role": "CODER", "critic_review": {"score": 1.0, "issues": [], "feedback": ["[OK] Code quality looks good!"], "passed": true, "timestamp": "2026-02-03T20:17:43.310986", "context": {"filename": "/app/grind_logs/session_1_run_130.json", "task": "PRUNE: experiments/ directory\n\nThere are 1824 experiment directories, most are garbage duplicates.\n\n1. List all experiments older than 24 hours\n2. Check which ones have actual useful output (non-empty, non-duplicate files)\n3. Delete empty or duplicate experiment directories\n4. Keep only experiments with unique, substantial output\n5. Report: X deleted, Y kept, Z bytes freed\n\nBE CAREFUL - don't delete anything from today.", "session_id": 1, "run": 130}}, "quality_score": 1.0, "critic_feedback": ["[OK] Code quality looks good!"], "critic_retry_count": 0}