{"complexity": "complex", "subtasks": [{"id": 1, "assigned_to": "CODER", "description": "Scan the `experiments/` directory and produce a list of all experiment sub‑directories whose last‑modified timestamp is older than 24 hours (exclude any directory modified today). Save this list to a temporary file or variable for later steps.", "acceptance_criteria": "A JSON or plain‑text list (one path per line) of qualifying experiment directories is created. The list contains no entries that were modified within the last 24 hours."}, {"id": 2, "assigned_to": "CODER", "description": "For each directory from the list, examine its contents to decide if it holds useful output: (a) at least one non‑empty file, and (b) the file(s) are not exact duplicates of files found in any other experiment directory (use file hash comparison). Produce two collections: `keep_dirs` (unique, substantial output) and `delete_dirs` (empty or duplicate).", "acceptance_criteria": "Two separate lists are produced. `keep_dirs` contains only directories with at least one non‑empty, non‑duplicate file. `delete_dirs` contains directories that are empty or whose files are exact duplicates of files in another directory."}, {"id": 3, "assigned_to": "CODER", "description": "Delete all directories identified in `delete_dirs` safely (use `shutil.rmtree` with error handling). Ensure no directory from today is touched. Record the total number of directories deleted and the total bytes freed.", "acceptance_criteria": "All `delete_dirs` are removed from the filesystem. The script outputs the count of deleted directories and the total reclaimed disk space in bytes. No directories modified today remain deleted."}, {"id": 4, "assigned_to": "CODER", "description": "Print a final report summarizing the operation: number of directories deleted, number kept, and total bytes freed. Optionally write this report to `experiments/prune_report.txt` for audit purposes.", "acceptance_criteria": "A concise summary (e.g., `Deleted: X, Kept: Y, Freed: Z bytes`) is printed to stdout and also saved to `experiments/prune_report.txt`. The numbers match the actions performed in previous steps."}], "next_role": "CODER", "critic_review": {"score": 1.0, "issues": [], "feedback": ["[OK] Code quality looks good!"], "passed": true, "timestamp": "2026-02-03T20:12:28.217665", "context": {"filename": "/app/grind_logs/session_1_run_70.json", "task": "PRUNE: experiments/ directory\n\nThere are 1824 experiment directories, most are garbage duplicates.\n\n1. List all experiments older than 24 hours\n2. Check which ones have actual useful output (non-empty, non-duplicate files)\n3. Delete empty or duplicate experiment directories\n4. Keep only experiments with unique, substantial output\n5. Report: X deleted, Y kept, Z bytes freed\n\nBE CAREFUL - don't delete anything from today.", "session_id": 1, "run": 70}}, "quality_score": 1.0, "critic_feedback": ["[OK] Code quality looks good!"], "critic_retry_count": 0}