{"complexity": "complex", "subtasks": [{"id": 1, "assigned_to": "CODER", "description": "Create a Python script `prune_experiments.py` that scans the `experiments/` directory and lists all experiment sub‑directories whose modification time is older than 24 hours.", "acceptance_criteria": "The script prints a sorted list of absolute paths for all qualifying experiment directories; no directories from the current day are included."}, {"id": 2, "assigned_to": "CODER", "description": "Extend the script to inspect each listed experiment directory and determine whether it contains useful output: at least one non‑empty file and not a duplicate of another experiment (same file hashes).", "acceptance_criteria": "For every directory the script records a flag `useful: true/false`. Duplicate detection is based on SHA‑256 hashes of files; directories with only duplicate files are marked `useful: false`."}, {"id": 3, "assigned_to": "CODER", "description": "Implement deletion logic: safely delete directories marked as not useful (empty or duplicate only) while preserving all directories from today. After deletions, compute total bytes freed and count of deleted vs kept experiments.", "acceptance_criteria": "The script deletes only the intended directories, prints a summary like `Deleted: X, Kept: Y, Freed: Z bytes`, and never touches directories modified within the last 24 hours."}, {"id": 4, "assigned_to": "DOCUMENTER", "description": "Write a short README `prune_experiments.md` that explains how to run the script, its safety checks, and the meaning of the final report.", "acceptance_criteria": "The markdown file contains usage instructions, required Python version, a description of the safety guard (no‑delete‑today), and an example of the output summary."}], "next_role": "CODER", "critic_review": {"score": 1.0, "issues": [], "feedback": ["[OK] Code quality looks good!"], "passed": true, "timestamp": "2026-02-03T20:13:11.871011", "context": {"filename": "/app/grind_logs/session_1_run_78.json", "task": "PRUNE: experiments/ directory\n\nThere are 1824 experiment directories, most are garbage duplicates.\n\n1. List all experiments older than 24 hours\n2. Check which ones have actual useful output (non-empty, non-duplicate files)\n3. Delete empty or duplicate experiment directories\n4. Keep only experiments with unique, substantial output\n5. Report: X deleted, Y kept, Z bytes freed\n\nBE CAREFUL - don't delete anything from today.", "session_id": 1, "run": 78}}, "quality_score": 1.0, "critic_feedback": ["[OK] Code quality looks good!"], "critic_retry_count": 0}