{
  "id": "webaim__techniques_alttext_",
  "source_id": "webaim",
  "source_name": "WebAIM Accessibility Resources",
  "category": "accessibility",
  "url": "https://webaim.org/techniques/alttext/",
  "title": "Alternative Text",
  "content": "Alternative Text\nYou are here:\nHome\n>\nArticles\n> Alternative Text\nIntroduction\nAlternative text is a textual substitute for non-text content in web pages. This article is focused on\nimages\n, but its principles also apply to multimedia and other non-text content.\nAlternative text serves several functions:\nScreen readers announce alternative text in place of images, helping users with visual or certain cognitive disabilities perceive the content and function of the images.\nIf an image fails to load or the user has blocked images, the browser will present the alternative text visually in place of the image.\nSearch engines use alternative text and factor it into their assessment of the page purpose and content.\nAlthough technology is getting better at recognizing what an image\ndepicts\n, algorithms alone cannot understand what an image\nmeans\nwithin the context of the overall page. A maple leaf might represent Canada, or it might just illustrate the leaf of a tree. Web page authors must provide alternative text that represents the\ncontent\nand\nfunction\nof their images.\nAlternative text can be presented in two ways:\nwithin the\nalt\nattribute of the\n<img>\nelement\nwithin visible body text near the image, or when the text equivalent cannot be presented succinctly, alternative text can be presented on a separate page, linked from either the image or a text link adjacent to the image\nThus, alternative text is about more than just the\nalt\nattribute.\nEvery\nimage should have an\nalt\nattribute, even if it's\nalt=\"\"\n(sometimes called \"null\" alternative text).\nContext is Everything\nConsider this image of Ellen Ochoa:\nThis image may need vastly different alternative text depending on how it is used.\nNote\nTo best present these principles of alternative text, most images within this article have been given\nalt=\"example image\"\n. However, the content of the images is typically presented within page context.\nExample 1\nAs the first Hispanic woman to go to space, and, later, the first Hispanic director of Johnson Space Center, Ellen Ochoa is widely regarded as a role model.\nWhat would you choose as\nalt\ntext for the image in Example 1?\n\"Astronaut Ellen Ochoa\"\n\"Image of Ellen Ochoa, Astronaut\"\n\"Ellen Ochoa, the first Hispanic woman to go into space\"\nEmpty\nalt\nattribute (\nalt=\"\"\n)\nFirst, consider its\ncontent\nand\nfunction\n. An image only has a function if it is linked (or has an\n<area>\nwithin a\n<map>\n), or if it's in a\n<button>\n. In this case, the image does not have a function.\nAssessing and summarizing an image's content can be more difficult. If the image's content is presented within the surrounding text, then\nalt=\"\"\nmay be all that's needed.\nIn the example above, the image content informs the user that this is Ellen Ochoa. Her mode of dress further conveys that she is an astronaut—which is meaningful, given her achievements.\nBased on this, we recommend\nalt=\"Astronaut Ellen Ochoa\"\n.\n\"Image of Ellen Ochoa, Astronaut\" redundantly describes the image as an image.\n\"Ellen Ochoa, the first Hispanic woman to go into space\" includes information that is not part of the image, and is also redundant with the body text.\nAn empty\nalt\nattribute is not appropriate either. Even though the body text names Ellen Ochoa, visual users can tell this directly from the content of the image—and so, since the image conveys content, it needs more than an empty\nalt\nattribute.\nImportant\nThe\nalt\nattribute should\ntypically\n:\nbe accurate and equivalent\nin representing content and function.\nbe succinct.\nContent (if any) and function (if any) should be presented as succinctly as possible, without sacrificing accuracy. Typically, only a few words are necessary, though rarely a short sentence or two may be appropriate.\nnot be redundant\nor provide the same information as text near the image.\nnot include phrases like \"image of ...\" or \"graphic of ...\", etc.\nThis would be redundant since screen readers already announce \"graphic\" along with the\nalt\ntext. If the fact that an image is a photograph or illustration, etc. is important content, it may be useful to include this in alternative text.\nExample 2\nEllen Ochoa, Astronaut\nAs the first Hispanic woman to go to space, and, later, the first Hispanic director of Johnson Space Center, Ellen Ochoa is widely regarded as a role model.\nWhat\nalt\ntext would you choose for the image in Example 2?\n\"Image\"\n\"Ellen Ochoa\"\nempty\nalt\nattribute (\nalt=\"\"\n)\nIn this case, the content of the image is presented in adjacent text, so\nalt=\"\"\nis the best choice.\n\"Ellen Ochoa\" would be redundant. \"Image\" provides no useful information.\nFunctional Images\nImages are often used not only to provide content, but to provide important functions, such as navigation.\nExample 3\nEllen Ochoa, Astronaut\nNote that this image is linked (and is the only content within that link). What\nalt\ntext would you choose here?\n\"Read More\"\n\"Astronaut Ellen Ochoa\"\n\"Wikipedia entry for Ellen Ochoa, Astronaut\"\nempty\nalt\nattribute (\nalt=\"\"\n)\nThe image is also a link, so it has a function. Since no adjacent text\nwithin the link\ndescribes the link's function, it must be conveyed within the image\nalt\nattribute.\nSo,\nalt=\"Astronaut Ellen Ochoa\"\nis the best choice.\nA screen reader would typically read \"Link, Image, Astronaut Ellen Ochoa. Ellen Ochoa, Astronaut\". The redundancy is necessary to adequately describe the function of the linked image, especially if it were to be accessed in isolation from the adjacent text, such as if a screen reader user were navigating by links.\n\"Wikipedia entry for Ellen Ochoa, Astronaut\" provides content other than that conveyed by the image—the fact the link goes to Wikipedia.\n\"Read More\" does not provide enough information, especially out of context.\nEmpty\nalt\ntext would never be appropriate here. When an image is the\nonly\ncontent inside a link or button,\nalt\ntext is all that a screen reader has to go on. If it's empty or missing, screen readers might read the image filename or the URL of the linked page in hopes that this may be helpful to the user, but this is not always the case.\nThis example would be more accessible for all users if both the image and the text caption were contained within one link:\nEllen Ochoa, Astronaut\nNow, both the content and function of the linked image are presented as text within the link, so the image would have\nalt=\"\"\nto avoid redundancy. A screen reader would typically read, \"Link, Ellen Ochoa, Astronaut\"—much more efficient than above.\nWhen possible, avoid using \"link to...\", \"click here for...\", etc. in the\nalt\nattribute. Screen readers already announce links as links.\nExample 4\nDownload the employment application\nWhat\nalt\ntext would you choose for the icon image in Example 4? Note that the icon is within the link.\n\"Employment application\"\n\"PDF\"\n\"PDF icon\"\nThe content of the image is presented in context, so\nalt=\"\"\nis appropriate.\n\"PDF\" is the best choice. This conveys the content of the icon—no more, no less.\n\"Employment application\" would be redundant. The function (\"Download the employment application\") is presented within the text of the link, so it does not need to be included again within the\nalt\nattribute.\n\"PDF icon\" describes what the image looks like, but it is not the most appropriate for this context—\"icon\" is redundant here. (If this icon were used in a different context, it may be important that the user know that it is an icon.)\nEmpty\nalt\ntext would omit the important information that the image presents—that the link is to a PDF document.\nIf the icon alone was linked without the adjacent text, then the\nalt\ntext would need to fully convey the content and function of the link/image combination:\nalt=\"Download the employment application in PDF format\"\n. \"PDF format\" alone would not be sufficient for the linked icon, especially if the page includes many PDF links and icons—a screen reader user navigating through the linked icons would hear, \"PDF format, PDF format, PDF format...\"\nDecorative Images\nA \"decorative\" image is one that...\ndoes not present important content,\nis used for layout or non-informative purposes, and\ndoes not have a function (e.g., is not a link).\nDecorative images should have\nalt=\"\"\n.\nExample 5\nWhat\nalt\ntext would you choose for the horizontal separator image in Example 5?\n\"Decorative line\"\n\"Beginning of footer\"\n\"Separator\"\nalt=\"\"\nWhile this image conveys a separation between document sections, it is just a visual reinforcement of a structure that is already presented in text.\nBecause the image does not convey additional content,\nalt=\"\"\nis the most appropriate choice.\nNote\nWhen an image is used only for decorative purposes, it is best to remove the image from the page content and instead define it as a CSS background image. This will remove the need for alternative text entirely, and will remove the image from the semantic and structural flow of the page.\nExample 6\nOur business promises the best service you will find on the planet. Our team is professionally trained to offer excellent customer service throughout the contract negotiation process.\nCustomer satisfaction is our top priority and is guaranteed, or your money back.\nWhat would be the appropriate\nalt\nattribute for the image in Example 6?\n\"Handshake\"\n\"Businessmen shake hands to complete a contract\"\nalt=\"\"\n\"We guarantee our professional services\"\nBecause the image does not convey relevant or important content, empty\nalt\ntext is best here.\nConsider: If the image were deleted, would important content be lost? In this case, probably not. Many images like this force meaningless, redundant, verbose\nalt\ntext on screen reader users even though they don't provide useful content visually.\n\"Handshake\" and \"businessmen shake hands to complete a contract\" describe the image, but this is superfluous information.\n\"We guarantee our professional services\" is not correct. This is another mistake too commonly seen across the web—using\nalt\nto inject extraneous information (or information directed to search engines) that doesn't \"fit\" anywhere else. The coder's rationale may be to err on the side of verbosity—but why err at all?\nNote\nIn many cases you can ask, \"if I could not use this image, what would I put in its place?\" If the answer is \"nothing,\" then\nalt=\"\"\nis probably sufficient.\nAdvanced Images\nIn some cases, determining\nalt\ntext is more subjective. User testing—with and without a screen reader—can help you generate some ideas.\nForm image buttons\nForm image buttons that merely present rasterized text should be replaced with true text, styled with CSS as desired. If an image cannot be avoided, the image needs an\nalt\nattribute that describes the function of the button. The\nalt\ntext should describe what the button will do when activated, such as \"Search\", \"Submit\", \"Register\", \"Place your order\", etc. For instance,\n<input type=\"image\" alt=\"Submit Search\">\nmight be appropriate for an image button on a site search form.\nImage maps\nWhen using a client-side image\n<map>\n, the main image's\nalt\nattribute must convey the content that is presented within the image, but that is not presented with the image map hot spots. For instance, a State of New York map that has an\n<area>\nfor each county might have\nalt=\"Counties of New York\"\n. If the main image does not convey content, but is primarily just a container for the hot spots, then\nalt=\"\"\nis appropriate.\nEach\n<area>\nmust\nalso have an equivalent\nalt\nattribute, because each\n<area>\nprovides a function. For a New York counties image map, each\n<area alt>\nwould contain the name of the county.\nBy contrast,\nserver-side\nimage maps (which pass mouse click coordinates back to the server for interpretation) are not perceivable by screen readers, and are inoperable by keyboard and screen reader users. Server-side image maps should be replaced by client-side image maps.\nCSS images\nCSS images should be used for decorative images which do not need alternative text. Images that convey content should not generally be defined in CSS. They should be within the page content. It is not possible to add alternative text directly to CSS or other background images, so when background images do present content, that content must be made accessible within the page markup. If the PDF icon image in Example 4 above were instead presented via a CSS background image, you could use a text replacement technique to present the content within the link:\n<a href=\"application.pdf\">Download the Employment Application<span class=\"pdficon\"> (PDF)</span></a>\nYou would then use CSS to position the \"(PDF)\" text (the\nspan class=\"pdficon\"\nelement)\noff-screen\n. Sighted users would see the PDF background image and screen reader users would hear the off-screen \"(PDF)\" text.\nLogos\nMany websites link the main branding logo to the home page. Providing alternative text for the image, such as your company name (\nalt=\"Acme Company\"\n), will usually suffice. The word \"logo\" (\nalt=\"Acme Company Logo\"\n) is usually not an important part of the image's content or function. Similarly, it is usually not necessary to indicate that the image links to the home page (\nalt=\"Acme Company home page\"\n) because this is a common convention—hearing \"Link, Graphic, Acme Company\" at the top of a web page is sufficient for a screen reader user to know that it is a logo linked to the home page.\nComplex images\nWhen an equivalent alternative for a complex image (chart, graph, map, etc.) will not fit inside a succinct\nalt\nattribute (perhaps a couple sentences in length), then the alternative must be provided elsewhere. This might be an adjacent data table on the same page, or it might be on a separate web page, linked from the page with the image. The link can be adjacent to the image, or the image itself could be linked to the description page. The alternative text for the image should still describe the general content of the image.\n<img src=\"sales.jpg\" alt=\"Line chart of annual sales data\"><br>\n<a href=\"salesdata.htm\">View sales data</a>\nNote on\nlongdesc\nThe\nlongdesc\nattribute is deprecated and should not be used. It was an HTML4 attribute that created a reference to a long description page, but was never well supported in screen readers.\nExample 7\nIn this painting, the artist Emanuel Leutze used light, color, form, perspective, proportion, and motion to create the composition.\nWhat\nalt\ntext would you choose for the image in Example 7?\n\"George Washington\"\n\"Painting of George Washington\"\n\"Painting of George Washington crossing the Delaware River\"\n\"A classic painting demonstrating the use of light and color to create composition.\"\n\"Painting of George Washington crossing the Delaware River. Swirling waves surround the boat where the majestic George Washington looks forward out of the storm and into the rays of light across the river as he leads his wary troops to battle.\"\nThe image is not linked, so there is no function. We should then determine if the content of the image is presented in the surrounding text. In this case, it is not (at least not entirely).  But this image is more challenging.\n\"George Washington\" is probably inadequate.\n\"Painting of George Washington\" is better, but in this case, it is appropriate to describe the image as a painting, as opposed to a photograph or other image type, but it does not provide enough content to be considered equivalent.\n\"Painting of George Washington crossing the Delaware River\" provides more information that may help the user identify the content itself. Remember that alternative text is not just for users who are blind. Many sighted users would be able to identify the specific painting in question given this description, whereas \"George Washington\" alone would not be descriptive enough.\nThe final (verbose) option might be appropriate if the art technique is more important than the subject. It may also be appropriate if a detailed examination of the painting is in order, but this level of detail would probably be better within the body text.\nThere is no\none\nright answer here. The best alternative text will depend on the context and intended content of the image.\nFigure and figcaption\nThe\n<figure>\nelement, designed to contain an\n<img>\nand a\n<figcaption>\n, is self-contained and typically referenced as a single unit from the main flow of the document. A\n<figure>\ncan be separated from the main flow of the document without affecting the document's meaning.\nA\n<figure>\ncreates a semantic association with its contained\n<figcaption>\n, which may provide a summary of or additional information about the figure and/or relate the figure back to the containing document. However, the\n<img>\nstill needs\nalt\ntext—and to prevent redundancy, this information should not be conveyed via the\n<figcaption>\n.\nConclusion\nDespite being one of the biggest issues affecting web accessibility, we continue to see still divergent and incorrect methods for implementing alternative text on the web. If the development community could fully embrace equivalent alternative text, the web would be a much more accessible place!\nEllen Ochoa Image Credit: NASA, Public domain, via Wikimedia Commons.",
  "content_markdown": "# Alternative Text\n\nYou are here: [Home](/) > [Articles](/articles/) > Alternative Text\n\n## Introduction\n\nAlternative text is a textual substitute for non-text content in web pages. This article is focused on [images](/techniques/images), but its principles also apply to multimedia and other non-text content.\n\nAlternative text serves several functions:\n\n- Screen readers announce alternative text in place of images, helping users with visual or certain cognitive disabilities perceive the content and function of the images.\n- If an image fails to load or the user has blocked images, the browser will present the alternative text visually in place of the image.\n- Search engines use alternative text and factor it into their assessment of the page purpose and content.\n\nAlthough technology is getting better at recognizing what an image **depicts**, algorithms alone cannot understand what an image **means** within the context of the overall page. A maple leaf might represent Canada, or it might just illustrate the leaf of a tree. Web page authors must provide alternative text that represents the **content** and **function** of their images.\n\nAlternative text can be presented in two ways:\n\n- within the `alt` attribute of the `<img>` element\n- within visible body text near the image, or when the text equivalent cannot be presented succinctly, alternative text can be presented on a separate page, linked from either the image or a text link adjacent to the image\n\nThus, alternative text is about more than just the `alt` attribute.\n\n**Every** image should have an `alt` attribute, even if it's `alt=\"\"` (sometimes called \"null\" alternative text).\n\n## Context is Everything\n\nConsider this image of Ellen Ochoa:\n\n![example image](media/ellen-ochoa.jpg)\n\nThis image may need vastly different alternative text depending on how it is used.\n\nNote\n\nTo best present these principles of alternative text, most images within this article have been given `alt=\"example image\"`. However, the content of the images is typically presented within page context.\n\n### Example 1\n\n![example image](media/ellen-ochoa.jpg)\n\nAs the first Hispanic woman to go to space, and, later, the first Hispanic director of Johnson Space Center, Ellen Ochoa is widely regarded as a role model.\n\nWhat would you choose as `alt` text for the image in Example 1?\n\n- \"Astronaut Ellen Ochoa\"\n- \"Image of Ellen Ochoa, Astronaut\"\n- \"Ellen Ochoa, the first Hispanic woman to go into space\"\n- Empty `alt` attribute (`alt=\"\"` )\n\nFirst, consider its **content** and **function**. An image only has a function if it is linked (or has an `<area>` within a `<map>`), or if it's in a `<button>` . In this case, the image does not have a function.\n\nAssessing and summarizing an image's content can be more difficult. If the image's content is presented within the surrounding text, then `alt=\"\"` may be all that's needed.\n\nIn the example above, the image content informs the user that this is Ellen Ochoa. Her mode of dress further conveys that she is an astronaut—which is meaningful, given her achievements.\n\n**Based on this, we recommend `alt=\"Astronaut Ellen Ochoa\"`.**\n\n\"Image of Ellen Ochoa, Astronaut\" redundantly describes the image as an image.\n\n\"Ellen Ochoa, the first Hispanic woman to go into space\" includes information that is not part of the image, and is also redundant with the body text.\n\nAn empty `alt` attribute is not appropriate either. Even though the body text names Ellen Ochoa, visual users can tell this directly from the content of the image—and so, since the image conveys content, it needs more than an empty `alt` attribute.\n\nImportant\n\nThe `alt` attribute should **typically**:\n\n- **be accurate and equivalent** in representing content and function.\n- **be succinct.** Content (if any) and function (if any) should be presented as succinctly as possible, without sacrificing accuracy. Typically, only a few words are necessary, though rarely a short sentence or two may be appropriate.\n- **not be redundant** or provide the same information as text near the image.\n- **not include phrases like \"image of ...\" or \"graphic of ...\", etc.** This would be redundant since screen readers already announce \"graphic\" along with the `alt` text. If the fact that an image is a photograph or illustration, etc. is important content, it may be useful to include this in alternative text.\n\n### Example 2\n\n![](media/ellen-ochoa.jpg)  \n**Ellen Ochoa, Astronaut**\n\nAs the first Hispanic woman to go to space, and, later, the first Hispanic director of Johnson Space Center, Ellen Ochoa is widely regarded as a role model.\n\nWhat `alt` text would you choose for the image in Example 2?\n\n- \"Image\"\n- \"Ellen Ochoa\"\n- empty `alt` attribute (`alt=\"\"` )\n\n**In this case, the content of the image is presented in adjacent text, so `alt=\"\"` is the best choice.**\n\n\"Ellen Ochoa\" would be redundant. \"Image\" provides no useful information.\n\n## Functional Images\n\nImages are often used not only to provide content, but to provide important functions, such as navigation.\n\n### Example 3\n\n[![example image](media/ellen-ochoa.jpg)](//en.wikipedia.org/wiki/Ellen_Ochoa)  \n**Ellen Ochoa, Astronaut**\n\nNote that this image is linked (and is the only content within that link). What `alt` text would you choose here?\n\n- \"Read More\"\n- \"Astronaut Ellen Ochoa\"\n- \"Wikipedia entry for Ellen Ochoa, Astronaut\"\n- empty `alt` attribute (`alt=\"\"` )\n\nThe image is also a link, so it has a function. Since no adjacent text **within the link** describes the link's function, it must be conveyed within the image `alt` attribute.\n\n**So, `alt=\"Astronaut Ellen Ochoa\"` is the best choice.** A screen reader would typically read \"Link, Image, Astronaut Ellen Ochoa. Ellen Ochoa, Astronaut\". The redundancy is necessary to adequately describe the function of the linked image, especially if it were to be accessed in isolation from the adjacent text, such as if a screen reader user were navigating by links.\n\n\"Wikipedia entry for Ellen Ochoa, Astronaut\" provides content other than that conveyed by the image—the fact the link goes to Wikipedia.\n\n\"Read More\" does not provide enough information, especially out of context.\n\nEmpty `alt` text would never be appropriate here. When an image is the **only** content inside a link or button, `alt` text is all that a screen reader has to go on. If it's empty or missing, screen readers might read the image filename or the URL of the linked page in hopes that this may be helpful to the user, but this is not always the case.\n\nThis example would be more accessible for all users if both the image and the text caption were contained within one link:\n\n[![example image](media/ellen-ochoa.jpg)  \n**Ellen Ochoa, Astronaut**](//en.wikipedia.org/wiki/Ellen_Ochoa)\n\nNow, both the content and function of the linked image are presented as text within the link, so the image would have `alt=\"\"` to avoid redundancy. A screen reader would typically read, \"Link, Ellen Ochoa, Astronaut\"—much more efficient than above.\n\nWhen possible, avoid using \"link to...\", \"click here for...\", etc. in the `alt` attribute. Screen readers already announce links as links.\n\n### Example 4\n\n[Download the employment application ![example image](media/pdf.gif)](https://webaim.org/techniques/alttext/media/generic_link.htm)\n\nWhat `alt` text would you choose for the icon image in Example 4? Note that the icon is within the link.\n\n- \"Employment application\"\n- \"PDF\"\n- \"PDF icon\"\n- The content of the image is presented in context, so `alt=\"\"` is appropriate.\n\n**\"PDF\" is the best choice. This conveys the content of the icon—no more, no less.**\n\n\"Employment application\" would be redundant. The function (\"Download the employment application\") is presented within the text of the link, so it does not need to be included again within the `alt` attribute.\n\n\"PDF icon\" describes what the image looks like, but it is not the most appropriate for this context—\"icon\" is redundant here. (If this icon were used in a different context, it may be important that the user know that it is an icon.)\n\nEmpty `alt` text would omit the important information that the image presents—that the link is to a PDF document.\n\nIf the icon alone was linked without the adjacent text, then the `alt` text would need to fully convey the content and function of the link/image combination: `alt=\"Download the employment application in PDF format\"`. \"PDF format\" alone would not be sufficient for the linked icon, especially if the page includes many PDF links and icons—a screen reader user navigating through the linked icons would hear, \"PDF format, PDF format, PDF format...\"\n\n## Decorative Images\n\nA \"decorative\" image is one that...\n\n- does not present important content,\n- is used for layout or non-informative purposes, and\n- does not have a function (e.g., is not a link).\n\nDecorative images should have `alt=\"\"` .\n\n### Example 5\n\n![example image](media/separator.gif)\n\nWhat `alt` text would you choose for the horizontal separator image in Example 5?\n\n- \"Decorative line\"\n- \"Beginning of footer\"\n- \"Separator\"\n- `alt=\"\"`\n\nWhile this image conveys a separation between document sections, it is just a visual reinforcement of a structure that is already presented in text.\n\n**Because the image does not convey additional content, `alt=\"\"` is the most appropriate choice.**\n\nNote\n\nWhen an image is used only for decorative purposes, it is best to remove the image from the page content and instead define it as a CSS background image. This will remove the need for alternative text entirely, and will remove the image from the semantic and structural flow of the page.\n\n### Example 6\n\n![example image](media/handshake.jpg)Our business promises the best service you will find on the planet. Our team is professionally trained to offer excellent customer service throughout the contract negotiation process.\n\nCustomer satisfaction is our top priority and is guaranteed, or your money back.\n\nWhat would be the appropriate `alt` attribute for the image in Example 6?\n\n- \"Handshake\"\n- \"Businessmen shake hands to complete a contract\"\n- `alt=\"\"`\n- \"We guarantee our professional services\"\n\n**Because the image does not convey relevant or important content, empty `alt` text is best here.** Consider: If the image were deleted, would important content be lost? In this case, probably not. Many images like this force meaningless, redundant, verbose `alt` text on screen reader users even though they don't provide useful content visually.\n\n\"Handshake\" and \"businessmen shake hands to complete a contract\" describe the image, but this is superfluous information.\n\n\"We guarantee our professional services\" is not correct. This is another mistake too commonly seen across the web—using `alt` to inject extraneous information (or information directed to search engines) that doesn't \"fit\" anywhere else. The coder's rationale may be to err on the side of verbosity—but why err at all?\n\nNote\n\nIn many cases you can ask, \"if I could not use this image, what would I put in its place?\" If the answer is \"nothing,\" then `alt=\"\"` is probably sufficient.\n\n## Advanced Images\n\nIn some cases, determining `alt` text is more subjective. User testing—with and without a screen reader—can help you generate some ideas.\n\n### Form image buttons\n\nForm image buttons that merely present rasterized text should be replaced with true text, styled with CSS as desired. If an image cannot be avoided, the image needs an `alt` attribute that describes the function of the button. The `alt` text should describe what the button will do when activated, such as \"Search\", \"Submit\", \"Register\", \"Place your order\", etc. For instance, `<input type=\"image\" alt=\"Submit Search\">` might be appropriate for an image button on a site search form.\n\n### Image maps\n\nWhen using a client-side image `<map>` , the main image's `alt` attribute must convey the content that is presented within the image, but that is not presented with the image map hot spots. For instance, a State of New York map that has an `<area>` for each county might have `alt=\"Counties of New York\"`. If the main image does not convey content, but is primarily just a container for the hot spots, then `alt=\"\"` is appropriate.\n\nEach `<area>` *must* also have an equivalent `alt` attribute, because each `<area>` provides a function. For a New York counties image map, each `<area alt>` would contain the name of the county.\n\nBy contrast, **server-side** image maps (which pass mouse click coordinates back to the server for interpretation) are not perceivable by screen readers, and are inoperable by keyboard and screen reader users. Server-side image maps should be replaced by client-side image maps.\n\n### CSS images\n\nCSS images should be used for decorative images which do not need alternative text. Images that convey content should not generally be defined in CSS. They should be within the page content. It is not possible to add alternative text directly to CSS or other background images, so when background images do present content, that content must be made accessible within the page markup. If the PDF icon image in Example 4 above were instead presented via a CSS background image, you could use a text replacement technique to present the content within the link:\n\n<a href=\"application.pdf\">Download the Employment Application<span class=\"pdficon\"> (PDF)</span></a>\n\nYou would then use CSS to position the \"(PDF)\" text (the `span class=\"pdficon\"` element) [off-screen](/techniques/css/invisiblecontent/). Sighted users would see the PDF background image and screen reader users would hear the off-screen \"(PDF)\" text.\n\n### Logos\n\nMany websites link the main branding logo to the home page. Providing alternative text for the image, such as your company name (`alt=\"Acme Company\"`), will usually suffice. The word \"logo\" (`alt=\"Acme Company Logo\"`) is usually not an important part of the image's content or function. Similarly, it is usually not necessary to indicate that the image links to the home page (`alt=\"Acme Company home page\"`) because this is a common convention—hearing \"Link, Graphic, Acme Company\" at the top of a web page is sufficient for a screen reader user to know that it is a logo linked to the home page.\n\n### Complex images\n\nWhen an equivalent alternative for a complex image (chart, graph, map, etc.) will not fit inside a succinct `alt` attribute (perhaps a couple sentences in length), then the alternative must be provided elsewhere. This might be an adjacent data table on the same page, or it might be on a separate web page, linked from the page with the image. The link can be adjacent to the image, or the image itself could be linked to the description page. The alternative text for the image should still describe the general content of the image.\n\n<img src=\"sales.jpg\" alt=\"Line chart of annual sales data\"><br>  \n<a href=\"salesdata.htm\">View sales data</a>\n\nNote on `longdesc`\n\nThe `longdesc` attribute is deprecated and should not be used. It was an HTML4 attribute that created a reference to a long description page, but was never well supported in screen readers.\n\n#### Example 7\n\n![example image](media/gw2.jpg)\n\nIn this painting, the artist Emanuel Leutze used light, color, form, perspective, proportion, and motion to create the composition.\n\nWhat `alt` text would you choose for the image in Example 7?\n\n- \"George Washington\"\n- \"Painting of George Washington\"\n- \"Painting of George Washington crossing the Delaware River\"\n- \"A classic painting demonstrating the use of light and color to create composition.\"\n- \"Painting of George Washington crossing the Delaware River. Swirling waves surround the boat where the majestic George Washington looks forward out of the storm and into the rays of light across the river as he leads his wary troops to battle.\"\n\nThe image is not linked, so there is no function. We should then determine if the content of the image is presented in the surrounding text. In this case, it is not (at least not entirely). But this image is more challenging.\n\n\"George Washington\" is probably inadequate.\n\n\"Painting of George Washington\" is better, but in this case, it is appropriate to describe the image as a painting, as opposed to a photograph or other image type, but it does not provide enough content to be considered equivalent.\n\n\"Painting of George Washington crossing the Delaware River\" provides more information that may help the user identify the content itself. Remember that alternative text is not just for users who are blind. Many sighted users would be able to identify the specific painting in question given this description, whereas \"George Washington\" alone would not be descriptive enough.\n\nThe final (verbose) option might be appropriate if the art technique is more important than the subject. It may also be appropriate if a detailed examination of the painting is in order, but this level of detail would probably be better within the body text.\n\nThere is no **one** right answer here. The best alternative text will depend on the context and intended content of the image.\n\n### Figure and figcaption\n\nThe `<figure>` element, designed to contain an `<img>` and a `<figcaption>`, is self-contained and typically referenced as a single unit from the main flow of the document. A `<figure>` can be separated from the main flow of the document without affecting the document's meaning.\n\nA `<figure>` creates a semantic association with its contained `<figcaption>`, which may provide a summary of or additional information about the figure and/or relate the figure back to the containing document. However, the `<img>` still needs `alt` text—and to prevent redundancy, this information should not be conveyed via the `<figcaption>` .\n\n## Conclusion\n\nDespite being one of the biggest issues affecting web accessibility, we continue to see still divergent and incorrect methods for implementing alternative text on the web. If the development community could fully embrace equivalent alternative text, the web would be a much more accessible place!\n\n*Ellen Ochoa Image Credit: NASA, Public domain, via Wikimedia Commons.*",
  "tags": [
    "webaim",
    "accessibility",
    "techniques",
    "testing"
  ],
  "extracted_at": "2026-02-03T14:30:01.626764+00:00",
  "content_length": 17038,
  "content_hash": "8b62c0ff2500031d"
}