{
  "id": "webaim__standards_wcag_checklist",
  "source_id": "webaim",
  "source_name": "WebAIM Accessibility Resources",
  "category": "accessibility",
  "url": "https://webaim.org/standards/wcag/checklist",
  "title": "WebAIM's WCAG 2 Checklist",
  "content": "WebAIM's WCAG 2 Checklist\nYou are here:\nHome\n>\nArticles\n>\nWCAG\n> WCAG 2 Checklist\nWebAIM Accessibility Testing Services\nThe experts at WebAIM can audit your web site and provide a detailed report to help you remediate accessibility and WCAG compliance issues.\nLearn more about WebAIM Evaluation Services\nImportant!\nThe following is\nNOT\nthe Web Content Accessibility Guidelines (WCAG) 2. It is a checklist that presents our recommendations for implementing the most common accessibility principles and techniques for those seeking WCAG conformance. The language used here significantly simplifies and condenses\nthe official WCAG 2.2 specification\nand supporting materials to make it easier to implement and verify for web pages. The checklist contains links to the official success criteria.\nA PDF version of this checklist\nis also available\nTools\nShow success criteria from WCAG version...\n2.0\n2.1\n2.2\nShow level...\nA\nAA\nAAA\nPerceivable\nWeb content is made available to the senses - sight, hearing, and/or touch\nGuideline 1.1\nProvide text alternatives for any non-text content\n1.1.1 Non-text Content\nA\n2.0\nImages, image buttons, and image map hot spots have appropriate, equivalent\nalternative text\n.\nImages that do not convey content, are decorative, or contain content that is already conveyed in text are given empty alternative text (\nalt=\"\"\n) or implemented as CSS backgrounds. All linked images have descriptive alternative text.\nEquivalent alternatives to complex images are provided in context or on a separate linked page.\nForm buttons have a descriptive value.\nInputs have associated\naccessible names\n.\nEmbedded multimedia is identified via accessible text.\nFrames and iframes are appropriately\ntitled\n.\nGuideline 1.2\nProvide alternatives for time-based media.\nNOTE: If the audio or video is designated as an alternative to web content (e.g., an audio or sign language version of a web page), then the web content itself serves as the alternative.\n1.2.1 Audio-only and Video-only (Prerecorded)\nA\n2.0\nA\ndescriptive transcript\nof relevant content is provided for non-live audio-only (audio podcasts, MP3 files, etc.).\nA descriptive transcript or\naudio description\nof relevant content is provided for non-live video-only, unless the video is decorative.\n1.2.2 Captions (Prerecorded)\nA\n2.0\nSynchronized captions\nare provided for non-live video (YouTube videos, etc.).\n1.2.3 Audio Description or Media Alternative (Prerecorded)\nA\n2.0\nA descriptive transcript\nor\naudio description is provided for non-live video.\nNOTE: Only required if there is relevant visual content that is not presented in the audio.\n1.2.4 Captions (Live)\nAA\n2.0\nSynchronized captions are provided for live media that contains audio (audio-only broadcasts, web casts, video conferences, etc.)\n1.2.5 Audio Description (Prerecorded)\nAA\n2.0\nAudio descriptions are provided for non-live video.\nNOTE: Only required if there is relevant visual content that is not presented in the audio.\nWhile not required at Level AA, for optimal accessibility WebAIM recommends descriptive transcripts in addition to audio descriptions.\n1.2.6 Sign Language (Prerecorded)\nAAA\n2.0\nA sign language video is provided for media that contains audio.\n1.2.7 Extended Audio Description (Prerecorded)\nAAA\n2.0\nWhen audio description cannot be added to video due to insufficient pauses in the audio, an alternative version of the video with pauses that allow audio descriptions is provided.\n1.2.8 Media Alternative (Prerecorded)\nAAA\n2.0\nA descriptive transcript is provided for pre-recorded media that has a video track. For optimal accessibility, WebAIM strongly recommends transcripts for all multimedia.\n1.2.9 Audio-only (Live)\nAAA\n2.0\nA descriptive text transcript (e.g., the script of the live audio) is provided for live content that has audio.\nGuideline 1.3\nCreate content that can be presented in different ways (for example simpler layout) without losing information or structure.\n1.3.1 Info and Relationships\nA\n2.0\nSemantic markup\nis appropriately used to designate headings, regions/landmarks, lists, emphasized or special text, etc.\nTables\nare used for tabular data and data cells are associated with their headers. Data table captions, if present, are associated to data tables.\nText labels\nare associated with form inputs. Related form controls are grouped with fieldset/legend. ARIA labelling may be used when standard HTML is insufficient.\n1.3.2 Meaningful Sequence\nA\n2.0\nThe\nreading and navigation order\n(determined by code order) is logical and intuitive.\n1.3.3 Sensory Characteristics\nA\n2.0\nInstructions do not rely upon shape, size, or visual location (e.g., \"Click the square icon to continue\" or \"Instructions are in the right-hand column\").\nInstructions do not rely upon sound (e.g., \"A beeping sound indicates you may continue.\").\n1.3.4 Orientation\nAA\n2.1\nOrientation of web content is not restricted to only portrait or landscape, unless a specific orientation is necessary.\n1.3.5 Identify Input Purpose\nAA\n2.1\nInput fields that collect\ncertain types of user information\nhave an appropriate\nautocomplete\nattribute defined.\n1.3.6 Identify Purpose\nAAA\n2.1\nRegions/landmarks are used to identify page regions.\nARIA is used, where appropriate, to enhance HTML semantics to better identify the purpose of interface components.\nGuideline 1.4\nMake it easier for users to see and hear content including separating foreground from background.\n1.4.1 Use of Color\nA\n2.0\nColor is not used as the sole method of conveying content or distinguishing visual elements.\nColor alone is not used to distinguish\nlinks\nfrom surrounding text unless the\ncontrast ratio\nbetween the link and the surrounding text is at least 3:1\nand\nan additional distinction (e.g., it becomes underlined) is provided when the link is hovered over and receives keyboard focus.\n1.4.2 Audio Control\nA\n2.0\nA mechanism is provided to stop, pause, mute, or adjust volume for audio that automatically plays on a page for more than 3 seconds.\n1.4.3 Contrast (Minimum)\nAA\n2.0\nText and images of text have a contrast ratio of at least 4.5:1.\nLarge text - at least 18 point (typically 24px) or 14 point (typically 18.66px) and bold - has a contrast ratio of at least 3:1.\n1.4.4 Resize text\nAA\n2.0\nThe page is readable and functional when the page is zoomed to 200%. NOTE:\n1.4.10 (below)\nintroduces additional requirements for zoomed content.\n1.4.5 Images of Text\nAA\n2.0\nIf the same visual presentation can be made using text alone, an image is not used to present that text.\n1.4.6 Contrast (Enhanced)\nAAA\n2.0\nText and images of text have a contrast ratio of at least 7:1.\nLarge text - at least 18 point (typically 24px) or 14 point (typically 18.66px) and bold - has a contrast ratio of at least 4.5:1.\n1.4.7 Low or No Background Audio\nAAA\n2.0\nAudio with speech has no or very low background noise so the speech is easily distinguished.\n1.4.8 Visual Presentation\nAAA\n2.0\nBlocks of text over one sentence in length:\nAre no more than 80 characters wide.\nAre NOT fully justified (aligned to both the left and the right margins).\nHave adequate line spacing (at least 1/2 the height of the text) and paragraph spacing (1.5 times line spacing).\nHave defined or inherited foreground and background colors.\nDo NOT require horizontal scrolling when the text size is doubled.\n1.4.9 Images of Text (No Exception)\nAAA\n2.0\nText is used within an image only for decoration (the image does not convey content) OR when the information cannot be presented with text alone.\n1.4.10 Reflow\nAA\n2.1\nNo loss of content or functionality occurs, and horizontal scrolling is avoided when content is presented at a width of 320 pixels.\nThis requires responsive design for most web sites. This is best tested by setting the browser window to 1280 pixels wide and then zooming the page content to 400%.\nContent that requires horizontal scrolling, such as data tables, complex images (such as maps and charts), toolbars, etc. are exempted.\n1.4.11 Non-text Contrast\nAA\n2.1\nA contrast ratio of at least 3:1 is present for differentiating graphical objects (such as icons and components of charts or graphs) and author-customized interface components (such as buttons, form controls, and focus indicators/outlines).\nAt least 3:1 contrast is maintained in the various states (focus, hover, active, etc.) of author-customized interactive components.\n1.4.12 Text Spacing\nAA\n2.1\nNo loss of content or functionality occurs when the user adapts paragraph spacing to 2 times the font size, text line height/spacing to 1.5 times the font size, word spacing to .16 times the font size, and letter spacing to .12 times the font size.\nThis is best supported by avoiding pixel height definitions for elements that contain text.\n1.4.13 Content on Hover or Focus\nAA\n2.1\nWhen additional content is presented on hover or keyboard focus:\nThe newly revealed content can be dismissed (generally via the Esc key) without moving the pointer or keyboard focus, unless the content presents an input error or does not obscure or interfere with other page content.\nThe pointer can be moved to the new content without the content disappearing.\nThe new content must remain visible until the pointer or keyboard focus is moved away from the triggering control, the new content is dismissed, or the new content is no longer relevant.\nOperable\nInterface forms, controls, and navigation are operable.\nGuideline 2.1\nMake all functionality available from a keyboard.\n2.1.1 Keyboard\nA\n2.0\nAll page functionality is available using the\nkeyboard\n, unless the functionality cannot be accomplished in any known way using a keyboard (e.g., free hand drawing).\nPage-specified shortcut keys and accesskeys (accesskey should typically be avoided) do not conflict with existing browser and screen reader shortcuts.\n2.1.2 No Keyboard Trap\nA\n2.0\nKeyboard\nfocus is never locked or trapped at one particular page element. The user can navigate to and from all navigable page elements using only a keyboard.\n2.1.3 Keyboard (No Exception)\nAAA\n2.0\nAll page functionality is available using the keyboard.\n2.1.4 Character Key Shortcuts\nA\n2.1\nIf a keyboard shortcut uses printable character keys, then the user must be able to disable the key command, change the defined key to a non-printable key (Ctrl, Alt, etc.), or only activate the shortcut when an associated interface component or button is focused.\nGuideline 2.2\nProvide users enough time to read and use content.\n2.2.1 Timing Adjustable\nA\n2.0\nIf a page or application has a time limit, the user is given options to turn off, adjust, or extend that time limit. This is not a requirement for real-time events (e.g., an auction), where the time limit is absolutely required, or if the time limit is longer than 20 hours.\n2.2.2 Pause, Stop, Hide\nA\n2.0\nAutomatically moving, blinking, or scrolling content (such as carousels, marquees, or animations) that lasts longer than 5 seconds can be paused, stopped, or hidden by the user.\nAutomatically updating content (e.g., a dynamically-updating news ticker, chat messages, etc.) can be paused, stopped, or hidden by the user or the user can manually control the timing of the updates.\n2.2.3 No Timing\nAAA\n2.0\nThe content and functionality have no time limits or constraints.\n2.2.4 Interruptions\nAAA\n2.0\nInterruptions (alerts, page updates, etc.) can be postponed or suppressed by the user.\n2.2.5 Re-authenticating\nAAA\n2.0\nIf an authentication session expires, the user can re-authenticate and continue the activity without losing any data from the current page.\n2.2.6 Timeouts\nAAA\n2.1\nUsers must be warned of any timeout that could result in data loss, unless the data is preserved for longer than 20 hours of user inactivity.\nGuideline 2.3\nDo not design content in a way that is known to cause seizures.\n2.3.1 Three Flashes or Below Threshold\nA\n2.0\nNo page content\nflashes\nmore than 3 times per second unless that flashing content is sufficiently small and the flashes are of low contrast and do not contain too much red. (\nSee general flash and red flash thresholds\n)\n2.3.2 Three Flashes\nAAA\n2.0\nNo page content flashes more than 3 times per second.\n2.3.3 Animation from Interactions\nAAA\n2.1\nUsers can disable non-essential animation and movement that is triggered by user interaction.\nGuideline 2.4\nProvide ways to help users navigate, find content, and determine where they are.\n2.4.1 Bypass Blocks\nA\n2.0\nA link is provided to\nskip navigation\nand other page elements that are repeated across web pages.\nWhile proper use of headings or regions/landmarks is sufficient to meet this success criterion, because keyboard navigation by headings or regions is not supported in most browsers, WebAIM recommends a \"skip\" link in addition to headings and regions.\n2.4.2 Page Titled\nA\n2.0\nThe web page has a descriptive and informative\npage title\n.\n2.4.3 Focus Order\nA\n2.0\nThe navigation order of links, form controls, etc. is logical and intuitive.\n2.4.4 Link Purpose (In Context)\nA\n2.0\nThe purpose of each link (or image button or image map hotspot) can be determined from the link text alone, or from the link text and its context (e.g., surrounding text, list item, previous heading, or table headers).\nLinks with the same text that go to different locations are readily distinguishable.\n2.4.5 Multiple Ways\nAA\n2.0\nMultiple ways\nare available to find other web pages on the site - at least two of: a list of related pages, table of contents, site map, site search, or list of all available web pages.\n2.4.6 Headings and Labels\nAA\n2.0\nPage headings and labels for form and interactive controls are informative. Avoid duplicating heading and label text unless the structure provides adequate differentiation between them.\n2.4.7 Focus Visible\nAA\n2.0\nThere is a visible indicator for page elements when they receive keyboard focus.\n2.4.8 Location\nAAA\n2.0\nIf a web page is part of a sequence of pages or within a complex site structure, an indication of the current page location is provided, for example, through breadcrumbs or specifying the current step in a sequence (e.g., \"Step 2 of 5 - Shipping Address\").\n2.4.9 Link Purpose (Link Only)\nAAA\n2.0\nThe purpose of each link (or image button or image map hotspot) can be determined from the link text alone.\nThere are no links with the same text that go to different locations.\n2.4.10 Section Headings\nAAA\n2.0\nBeyond providing an overall document structure, individual sections of content are designated using headings, where appropriate.\n2.4.11 Focus Not Obscured (Minimum)\nAA\n2.2\nWhen elements have keyboard focus, they are not entirely covered or hidden by page content.\n2.4.12 Focus Not Obscured (Enhanced)\nAAA\n2.2\nWhen elements have keyboard focus, they are entirely visible.\n2.4.13 Focus Appearance\nAAA\n2.2\nIf a custom focus indicator or background color is in place, the focus indicator pixels must:\nhave at least 3:1 contrast between focused/unfocused states\nbe at least as large as the area of a 2 pixel thick perimeter surrounding the element. The formula\n(width × 4) + (height × 4) = focus indicator area\ncan be used for rectangular components.\nGuideline 2.5\nMake it easier for users to operate functionality through various inputs beyond keyboard.\n2.5.1 Pointer Gestures\nA\n2.1\nIf multipoint or path-based gestures (such as pinching, swiping, or dragging across the screen) are not essential to the functionality, then the functionality can also be performed with a single point activation (such as activating a button).\n2.5.2 Pointer Cancellation\nA\n2.1\nTo help avoid inadvertent activation of controls, avoid non-essential down-event (e.g.,\nonmousedown\n) activation when clicking, tapping, or long pressing the screen. For complex interactions (such as drag and drop),\nonmousedown\ncan be used if an associated\nonmouseup\n(or similar) event can be aborted or reversed.\n2.5.3 Label in Name\nA\n2.1\nIf an interface component (link, button, etc.) presents text (or images of text), the accessible name (label, alternative text, aria-label, etc.) for that component must include the visible text.\n2.5.4 Motion Actuation\nA\n2.1\nFunctionality that is triggered by moving the device (such as shaking or panning a mobile device) or by user movement (such as waving to a camera) can be disabled and equivalent functionality is provided via standard controls like buttons.\n2.5.5 Target Size\nAAA\n2.1\nClickable targets are at least 44 by 44 pixels in size unless an alternative target of that size is provided, the target is inline (such as a link within a sentence), the target is not author-modified (such as a default checkbox), or the small target size is essential to the functionality.\n2.5.6 Concurrent Input Mechanisms\nAAA\n2.1\nContent does not require a specific input type, such as touch-only or keyboard-only, but must support alternative inputs (such as using a keyboard on a mobile device).\n2.5.7 Dragging Movements\nAA\n2.2\nFunctionality that uses pointer dragging can also be achieved using a single pointer without dragging (unless dragging is essential).\n2.5.8 Target Size (Minimum)\nAA\n2.2\nPointer input target sizes are at least 24 by 24 pixels unless:\nA 24 pixel diameter circle centered on the target element does not intersect with any other target or a 24 pixel circle centered on an adjacent target.\nThe functionality can be achieved in some other conformant manner.\nThe target is in a sentence or list.\nThe target size can't be modified or is essential to the functionality.\nUnderstandable\nInformation and the operation of user interface must be understandable.\nGuideline 3.1\nMake text content readable and understandable.\n3.1.1 Language of Page\nA\n2.0\nThe language of the page is identified using the\nlang\nattribute (e.g.,\n<html lang=\"en\">\n).\n3.1.2 Language of Parts\nAA\n2.0\nThe language of page content that is in a different language is identified using the\nlang\nattribute (e.g.,\n<blockquote lang=\"es\">\n).\n3.1.3 Unusual Words\nAAA\n2.0\nWords\nthat may be ambiguous, unfamiliar, or used in a very specific way are defined through adjacent text, a definition list, a glossary, or other suitable method.\n3.1.4 Abbreviations\nAAA\n2.0\nThe meaning of an unfamiliar abbreviation is provided by expanding it the first time it is used, using the\n<abbr>\nelement, or linking to a definition or glossary.\n3.1.5 Reading Level\nAAA\n2.0\nA more understandable alternative is provided for content that is more advanced than can be reasonably read by a person with roughly 9 years of primary education.\n3.1.6 Pronunciation\nAAA\n2.0\nIf the pronunciation of a word is vital to understanding that word, its pronunciation is provided immediately following the word or via a link or glossary.\nGuideline 3.2\nMake Web pages appear and operate in predictable ways.\n3.2.1 On Focus\nA\n2.0\nWhen a page element receives focus, it does not result in a substantial change to the page, the spawning of a pop-up window, an additional change of keyboard focus, or any other change that could confuse or disorient the user.\n3.2.2 On Input\nA\n2.0\nWhen a user inputs information or interacts with a control, it does not result in a substantial change to the page, the spawning of a pop-up window, an additional change of keyboard focus, or any other change that could confuse or disorient the user unless the user is informed of the change ahead of time.\n3.2.3 Consistent Navigation\nAA\n2.0\nNavigation links that are repeated on web pages do not change order when navigating through the site.\n3.2.4 Consistent Identification\nAA\n2.0\nElements that have the same functionality across multiple web pages are consistently identified. For example, a search box at the top of the site should always be labeled the same way.\n3.2.5 Change on Request\nAAA\n2.0\nSubstantial changes to the page, the spawning of pop-up windows, uncontrolled changes of keyboard focus, or any other change that could confuse or disorient the user must be initiated by the user. Alternatively, the user is provided an option to disable such changes.\n3.2.6 Consistent Help\nA\n2.2\nContact and self-help details or functionality are presented consistently when present on multiple web pages.\nGuideline 3.3\nHelp users avoid and correct mistakes.\n3.3.1 Error Identification\nA\n2.0\nRequired inputs or inputs that require a specific format, value, or length provide this information within the element's label.\nForm validation\nerrors are efficient, intuitive, and accessible. The error is clearly identified, quick access to the problematic element is provided, and the user can easily fix the error and resubmit the form.\n3.3.2 Labels or Instructions\nA\n2.0\nInputs are identified by labels or instructions that help users know what information to enter.\n3.3.3 Error Suggestion\nAA\n2.0\nIf an input error is detected (via client-side or server-side validation), suggestions are provided for fixing the input in a timely and accessible manner.\n3.3.4 Error Prevention (Legal, Financial, Data)\nAA\n2.0\nSubmissions, changes, and deletions of legal, financial, or test data can be reversed, verified, or confirmed.\n3.3.5 Help\nAAA\n2.0\nInstructions and cues are provided in context to help in form completion and submission.\n3.3.6 Error Prevention (All)\nAAA\n2.0\nIf the user can submit information, the submission is reversible, verified, or confirmed.\n3.3.7 Redundant Entry\nA\n2.2\nInformation that a user must re-enter to complete a single-session process must be auto-populated or available for the user to select, unless re-entering the information is essential to the functionality, the information poses security issues, or the previously-entered information is no longer valid.\n3.3.8 Accessible Authentication (Minimum)\nAA\n2.2\nA cognitive function test (such as remembering a password or solving a puzzle) is not required for any step in an authentication process unless the cognitive function test can be bypassed in some way, can be completed with assistance by some other mechanism, uses object recognition (such as \"click on the photo of a flower\"), or uses identification of non-text content provided by the user (such as a user-provided image).\n3.3.9 Accessible Authentication (Enhanced)\nAAA\n2.2\nA cognitive function test (such as remembering a password or solving a puzzle) is not required for any step in an authentication process unless the cognitive function test can be bypassed in some way or can be completed with assistance by some other mechanism.\nRobust\nContent must be robust enough that it can be interpreted reliably by a wide variety of user agents, including assistive technologies.\nGuideline 4.1\nMaximize compatibility with current and future user agents, including assistive technologies.\n4.1.1 Parsing (Obsolete and removed)\nA\n2.0\nNOTE: This success criterion is no longer useful and as of 2023 has been removed from WCAG. It previously required that significant HTML validation/parsing errors be avoided.\n4.1.2 Name, Role, Value\nA\n2.0\nMarkup is used in a way that facilitates accessibility. This includes following the HTML specifications and using forms, input labels, frame titles, etc. appropriately.\nARIA is used appropriately to enhance accessibility when HTML is not sufficient.\n4.1.3 Status Messages\nAA\n2.1\nIf an important status message is presented and focus is not set to that message, the message must be announced to screen reader users, typically via an ARIA alert or live region.\nThis checklist is provided as a resource to help implement\nWeb Content Accessibility Guidelines (WCAG) 2.2\n(W3C Recommendation), which is\nCopyright\n© 2017-2023\nW3C\n®\n.",
  "content_markdown": "# WebAIM's WCAG 2 Checklist\n\nYou are here: [Home](/) > [Articles](/articles/) > [WCAG](/standards/wcag) > WCAG 2 Checklist\n\nWebAIM Accessibility Testing Services\n\nThe experts at WebAIM can audit your web site and provide a detailed report to help you remediate accessibility and WCAG compliance issues.\n\n[Learn more about WebAIM Evaluation Services](/services/evaluation)\n\nImportant!\n\nThe following is **NOT** the Web Content Accessibility Guidelines (WCAG) 2. It is a checklist that presents our recommendations for implementing the most common accessibility principles and techniques for those seeking WCAG conformance. The language used here significantly simplifies and condenses [the official WCAG 2.2 specification](//www.w3.org/TR/WCAG22/) and supporting materials to make it easier to implement and verify for web pages. The checklist contains links to the official success criteria.\n\n[A PDF version of this checklist](/standards/wcag/WCAG2Checklist.pdf) is also available\n\n## Tools\n\nShow success criteria from WCAG version...\n2.0  \n2.1  \n2.2  \n\nShow level...\nA  \nAA  \nAAA  \n\n## Perceivable Web content is made available to the senses - sight, hearing, and/or touch\n\n### Guideline 1.1 Provide text alternatives for any non-text content\n\n#### [1.1.1 Non-text Content](//www.w3.org/TR/WCAG22/#non-text-content) A 2.0\n\n- Images, image buttons, and image map hot spots have appropriate, equivalent [alternative text](/techniques/alttext/).\n- Images that do not convey content, are decorative, or contain content that is already conveyed in text are given empty alternative text (`alt=\"\"`) or implemented as CSS backgrounds. All linked images have descriptive alternative text.\n- Equivalent alternatives to complex images are provided in context or on a separate linked page.\n- Form buttons have a descriptive value.\n- Inputs have associated [accessible names](/articles/label-name/).\n- Embedded multimedia is identified via accessible text.\n- Frames and iframes are appropriately [titled](/techniques/frames/).\n\n### Guideline 1.2 Provide alternatives for time-based media.\n\nNOTE: If the audio or video is designated as an alternative to web content (e.g., an audio or sign language version of a web page), then the web content itself serves as the alternative.\n\n#### [1.2.1 Audio-only and Video-only (Prerecorded)](//www.w3.org/TR/WCAG22/#audio-only-and-video-only-prerecorded) A 2.0\n\n- A [descriptive transcript](/techniques/captions/#transcripts) of relevant content is provided for non-live audio-only (audio podcasts, MP3 files, etc.).\n- A descriptive transcript or [audio description](/techniques/captions/#ad) of relevant content is provided for non-live video-only, unless the video is decorative.\n\n#### [1.2.2 Captions (Prerecorded)](//www.w3.org/TR/WCAG22/#captions-prerecorded) A 2.0\n\n- [Synchronized captions](/techniques/captions/) are provided for non-live video (YouTube videos, etc.).\n\n#### [1.2.3 Audio Description or Media Alternative (Prerecorded)](//www.w3.org/TR/WCAG22/#audio-description-or-media-alternative-prerecorded) A 2.0\n\n- A descriptive transcript **or** audio description is provided for non-live video.   \n  NOTE: Only required if there is relevant visual content that is not presented in the audio.\n\n#### [1.2.4 Captions (Live)](//www.w3.org/TR/WCAG22/#captions-live) AA 2.0\n\n- Synchronized captions are provided for live media that contains audio (audio-only broadcasts, web casts, video conferences, etc.)\n\n#### [1.2.5 Audio Description (Prerecorded)](//www.w3.org/TR/WCAG22/#audio-description-prerecorded) AA 2.0\n\n- Audio descriptions are provided for non-live video.  \n  NOTE: Only required if there is relevant visual content that is not presented in the audio.\n- While not required at Level AA, for optimal accessibility WebAIM recommends descriptive transcripts in addition to audio descriptions.\n\n#### [1.2.6 Sign Language (Prerecorded)](//www.w3.org/TR/WCAG22/#sign-language-prerecorded) AAA 2.0\n\n- A sign language video is provided for media that contains audio.\n\n#### [1.2.7 Extended Audio Description (Prerecorded)](//www.w3.org/TR/WCAG22/#extended-audio-description-prerecorded) AAA 2.0\n\n- When audio description cannot be added to video due to insufficient pauses in the audio, an alternative version of the video with pauses that allow audio descriptions is provided.\n\n#### [1.2.8 Media Alternative (Prerecorded)](//www.w3.org/TR/WCAG22/#media-alternative-prerecorded) AAA 2.0\n\n- A descriptive transcript is provided for pre-recorded media that has a video track. For optimal accessibility, WebAIM strongly recommends transcripts for all multimedia.\n\n#### [1.2.9 Audio-only (Live)](//www.w3.org/TR/WCAG22/#audio-only-live) AAA 2.0\n\n- A descriptive text transcript (e.g., the script of the live audio) is provided for live content that has audio.\n\n### Guideline 1.3 Create content that can be presented in different ways (for example simpler layout) without losing information or structure.\n\n#### [1.3.1 Info and Relationships](//www.w3.org/TR/WCAG22/#info-and-relationships) A 2.0\n\n- [Semantic markup](/techniques/semanticstructure/) is appropriately used to designate headings, regions/landmarks, lists, emphasized or special text, etc.\n- [Tables](/techniques/tables/data) are used for tabular data and data cells are associated with their headers. Data table captions, if present, are associated to data tables.\n- [Text labels](/techniques/forms/controls) are associated with form inputs. Related form controls are grouped with fieldset/legend. ARIA labelling may be used when standard HTML is insufficient.\n\n#### [1.3.2 Meaningful Sequence](//www.w3.org/TR/WCAG22/#meaningful-sequence) A 2.0\n\n- The [reading and navigation order](/techniques/screenreader/#linearization) (determined by code order) is logical and intuitive.\n\n#### [1.3.3 Sensory Characteristics](//www.w3.org/TR/WCAG22/#sensory-characteristics) A 2.0\n\n- Instructions do not rely upon shape, size, or visual location (e.g., \"Click the square icon to continue\" or \"Instructions are in the right-hand column\").\n- Instructions do not rely upon sound (e.g., \"A beeping sound indicates you may continue.\").\n\n#### [1.3.4 Orientation](//www.w3.org/TR/WCAG22/#orientation) AA 2.1\n\n- Orientation of web content is not restricted to only portrait or landscape, unless a specific orientation is necessary.\n\n#### [1.3.5 Identify Input Purpose](//www.w3.org/TR/WCAG22/#identify-input-purpose) AA 2.1\n\n- Input fields that collect [certain types of user information](//www.w3.org/TR/WCAG22/#input-purposes) have an appropriate `autocomplete` attribute defined.\n\n#### [1.3.6 Identify Purpose](//www.w3.org/TR/WCAG22/#identify-purpose) AAA 2.1\n\n- Regions/landmarks are used to identify page regions.\n- ARIA is used, where appropriate, to enhance HTML semantics to better identify the purpose of interface components.\n\n### Guideline 1.4 Make it easier for users to see and hear content including separating foreground from background.\n\n#### [1.4.1 Use of Color](//www.w3.org/TR/WCAG22/#use-of-color) A 2.0\n\n- Color is not used as the sole method of conveying content or distinguishing visual elements.\n- Color alone is not used to distinguish [links](/techniques/hypertext/) from surrounding text unless the [contrast ratio](/resources/linkcontrastchecker/) between the link and the surrounding text is at least 3:1 *and* an additional distinction (e.g., it becomes underlined) is provided when the link is hovered over and receives keyboard focus.\n\n#### [1.4.2 Audio Control](//www.w3.org/TR/WCAG22/#audio-control) A 2.0\n\n- A mechanism is provided to stop, pause, mute, or adjust volume for audio that automatically plays on a page for more than 3 seconds.\n\n#### [1.4.3 Contrast (Minimum)](//www.w3.org/TR/WCAG22/#contrast-minimum) AA 2.0\n\n- Text and images of text have a contrast ratio of at least 4.5:1.\n- Large text - at least 18 point (typically 24px) or 14 point (typically 18.66px) and bold - has a contrast ratio of at least 3:1.\n\n#### [1.4.4 Resize text](//www.w3.org/TR/WCAG22/#resize-text) AA 2.0\n\n- The page is readable and functional when the page is zoomed to 200%. NOTE: [1.4.10 (below)](#sc1.4.10) introduces additional requirements for zoomed content.\n\n#### [1.4.5 Images of Text](//www.w3.org/TR/WCAG22/#images-of-text) AA 2.0\n\n- If the same visual presentation can be made using text alone, an image is not used to present that text.\n\n#### [1.4.6 Contrast (Enhanced)](//www.w3.org/TR/WCAG22/#contrast-enhanced) AAA 2.0\n\n- Text and images of text have a contrast ratio of at least 7:1.\n- Large text - at least 18 point (typically 24px) or 14 point (typically 18.66px) and bold - has a contrast ratio of at least 4.5:1.\n\n#### [1.4.7 Low or No Background Audio](//www.w3.org/TR/WCAG22/#low-or-no-background-audio) AAA 2.0\n\n- Audio with speech has no or very low background noise so the speech is easily distinguished.\n\n#### [1.4.8 Visual Presentation](//www.w3.org/TR/WCAG22/#visual-presentation) AAA 2.0\n\n- Blocks of text over one sentence in length:\n  - Are no more than 80 characters wide.\n  - Are NOT fully justified (aligned to both the left and the right margins).\n  - Have adequate line spacing (at least 1/2 the height of the text) and paragraph spacing (1.5 times line spacing).\n  - Have defined or inherited foreground and background colors.\n  - Do NOT require horizontal scrolling when the text size is doubled.\n\n#### [1.4.9 Images of Text (No Exception)](//www.w3.org/TR/WCAG22/#images-of-text-no-exception) AAA 2.0\n\n- Text is used within an image only for decoration (the image does not convey content) OR when the information cannot be presented with text alone.\n\n#### [1.4.10 Reflow](//www.w3.org/TR/WCAG22/#reflow) AA 2.1\n\n- No loss of content or functionality occurs, and horizontal scrolling is avoided when content is presented at a width of 320 pixels.\n  - This requires responsive design for most web sites. This is best tested by setting the browser window to 1280 pixels wide and then zooming the page content to 400%.\n- Content that requires horizontal scrolling, such as data tables, complex images (such as maps and charts), toolbars, etc. are exempted.\n\n#### [1.4.11 Non-text Contrast](//www.w3.org/TR/WCAG22/#non-text-contrast) AA 2.1\n\n- A contrast ratio of at least 3:1 is present for differentiating graphical objects (such as icons and components of charts or graphs) and author-customized interface components (such as buttons, form controls, and focus indicators/outlines).\n- At least 3:1 contrast is maintained in the various states (focus, hover, active, etc.) of author-customized interactive components.\n\n#### [1.4.12 Text Spacing](//www.w3.org/TR/WCAG22/#text-spacing) AA 2.1\n\n- No loss of content or functionality occurs when the user adapts paragraph spacing to 2 times the font size, text line height/spacing to 1.5 times the font size, word spacing to .16 times the font size, and letter spacing to .12 times the font size.\n- This is best supported by avoiding pixel height definitions for elements that contain text.\n\n#### [1.4.13 Content on Hover or Focus](//www.w3.org/TR/WCAG22/#content-on-hover-or-focus) AA 2.1\n\n- When additional content is presented on hover or keyboard focus:\n  - The newly revealed content can be dismissed (generally via the Esc key) without moving the pointer or keyboard focus, unless the content presents an input error or does not obscure or interfere with other page content.\n  - The pointer can be moved to the new content without the content disappearing.\n  - The new content must remain visible until the pointer or keyboard focus is moved away from the triggering control, the new content is dismissed, or the new content is no longer relevant.\n\n## Operable Interface forms, controls, and navigation are operable.\n\n### Guideline 2.1 Make all functionality available from a keyboard.\n\n#### [2.1.1 Keyboard](//www.w3.org/TR/WCAG22/#keyboard) A 2.0\n\n- All page functionality is available using the [keyboard](/techniques/keyboard/), unless the functionality cannot be accomplished in any known way using a keyboard (e.g., free hand drawing).\n- Page-specified shortcut keys and accesskeys (accesskey should typically be avoided) do not conflict with existing browser and screen reader shortcuts.\n\n#### [2.1.2 No Keyboard Trap](//www.w3.org/TR/WCAG22/#no-keyboard-trap) A 2.0\n\n- [Keyboard](/techniques/keyboard/) focus is never locked or trapped at one particular page element. The user can navigate to and from all navigable page elements using only a keyboard.\n\n#### [2.1.3 Keyboard (No Exception)](//www.w3.org/TR/WCAG22/#keyboard-no-exception) AAA 2.0\n\n- All page functionality is available using the keyboard.\n\n#### [2.1.4 Character Key Shortcuts](//www.w3.org/TR/WCAG22/#character-key-shortcuts) A 2.1\n\n- If a keyboard shortcut uses printable character keys, then the user must be able to disable the key command, change the defined key to a non-printable key (Ctrl, Alt, etc.), or only activate the shortcut when an associated interface component or button is focused.\n\n### Guideline 2.2 Provide users enough time to read and use content.\n\n#### [2.2.1 Timing Adjustable](//www.w3.org/TR/WCAG22/#timing-adjustable) A 2.0\n\n- If a page or application has a time limit, the user is given options to turn off, adjust, or extend that time limit. This is not a requirement for real-time events (e.g., an auction), where the time limit is absolutely required, or if the time limit is longer than 20 hours.\n\n#### [2.2.2 Pause, Stop, Hide](//www.w3.org/TR/WCAG22/#pause-stop-hide) A 2.0\n\n- Automatically moving, blinking, or scrolling content (such as carousels, marquees, or animations) that lasts longer than 5 seconds can be paused, stopped, or hidden by the user.\n- Automatically updating content (e.g., a dynamically-updating news ticker, chat messages, etc.) can be paused, stopped, or hidden by the user or the user can manually control the timing of the updates.\n\n#### [2.2.3 No Timing](//www.w3.org/TR/WCAG22/#no-timing) AAA 2.0\n\n- The content and functionality have no time limits or constraints.\n\n#### [2.2.4 Interruptions](//www.w3.org/TR/WCAG22/#interruptions) AAA 2.0\n\n- Interruptions (alerts, page updates, etc.) can be postponed or suppressed by the user.\n\n#### [2.2.5 Re-authenticating](//www.w3.org/TR/WCAG22/#re-authenticating) AAA 2.0\n\n- If an authentication session expires, the user can re-authenticate and continue the activity without losing any data from the current page.\n\n#### [2.2.6 Timeouts](//www.w3.org/TR/WCAG22/#timeouts) AAA 2.1\n\n- Users must be warned of any timeout that could result in data loss, unless the data is preserved for longer than 20 hours of user inactivity.\n\n### Guideline 2.3 Do not design content in a way that is known to cause seizures.\n\n#### [2.3.1 Three Flashes or Below Threshold](//www.w3.org/TR/WCAG22/#three-flashes-or-below-threshold) A 2.0\n\n- No page content [flashes](/articles/seizure/) more than 3 times per second unless that flashing content is sufficiently small and the flashes are of low contrast and do not contain too much red. ([See general flash and red flash thresholds](//www.w3.org/TR/WCAG22/#dfn-general-flash-and-red-flash-thresholds))\n\n#### [2.3.2 Three Flashes](//www.w3.org/TR/WCAG22/#three-flashes) AAA 2.0\n\n- No page content flashes more than 3 times per second.\n\n#### [2.3.3 Animation from Interactions](//www.w3.org/TR/WCAG22/#animation-from-interactions) AAA 2.1\n\n- Users can disable non-essential animation and movement that is triggered by user interaction.\n\n### Guideline 2.4 Provide ways to help users navigate, find content, and determine where they are.\n\n#### [2.4.1 Bypass Blocks](//www.w3.org/TR/WCAG22/#bypass-blocks) A 2.0\n\n- A link is provided to [skip navigation](/techniques/skipnav/) and other page elements that are repeated across web pages.\n- While proper use of headings or regions/landmarks is sufficient to meet this success criterion, because keyboard navigation by headings or regions is not supported in most browsers, WebAIM recommends a \"skip\" link in addition to headings and regions.\n\n#### [2.4.2 Page Titled](//www.w3.org/TR/WCAG22/#page-titled) A 2.0\n\n- The web page has a descriptive and informative [page title](/techniques/pagetitle/).\n\n#### [2.4.3 Focus Order](//www.w3.org/TR/WCAG22/#focus-order) A 2.0\n\n- The navigation order of links, form controls, etc. is logical and intuitive.\n\n#### [2.4.4 Link Purpose (In Context)](//www.w3.org/TR/WCAG22/#link-purpose-in-context) A 2.0\n\n- The purpose of each link (or image button or image map hotspot) can be determined from the link text alone, or from the link text and its context (e.g., surrounding text, list item, previous heading, or table headers).\n- Links with the same text that go to different locations are readily distinguishable.\n\n#### [2.4.5 Multiple Ways](//www.w3.org/TR/WCAG22/#multiple-ways) AA 2.0\n\n- [Multiple ways](/techniques/sitetools/) are available to find other web pages on the site - at least two of: a list of related pages, table of contents, site map, site search, or list of all available web pages.\n\n#### [2.4.6 Headings and Labels](//www.w3.org/TR/WCAG22/#headings-and-labels) AA 2.0\n\n- Page headings and labels for form and interactive controls are informative. Avoid duplicating heading and label text unless the structure provides adequate differentiation between them.\n\n#### [2.4.7 Focus Visible](//www.w3.org/TR/WCAG22/#focus-visible) AA 2.0\n\n- There is a visible indicator for page elements when they receive keyboard focus.\n\n#### [2.4.8 Location](//www.w3.org/TR/WCAG22/#location) AAA 2.0\n\n- If a web page is part of a sequence of pages or within a complex site structure, an indication of the current page location is provided, for example, through breadcrumbs or specifying the current step in a sequence (e.g., \"Step 2 of 5 - Shipping Address\").\n\n#### [2.4.9 Link Purpose (Link Only)](//www.w3.org/TR/WCAG22/#link-purpose-link-only) AAA 2.0\n\n- The purpose of each link (or image button or image map hotspot) can be determined from the link text alone.\n- There are no links with the same text that go to different locations.\n\n#### [2.4.10 Section Headings](//www.w3.org/TR/WCAG22/#section-headings) AAA 2.0\n\n- Beyond providing an overall document structure, individual sections of content are designated using headings, where appropriate.\n\n#### [2.4.11 Focus Not Obscured (Minimum)](//www.w3.org/TR/WCAG22/#focus-not-obscured-minimum) AA 2.2\n\n- When elements have keyboard focus, they are not entirely covered or hidden by page content.\n\n#### [2.4.12 Focus Not Obscured (Enhanced)](//www.w3.org/TR/WCAG22/#focus-not-obscured-enhanced) AAA 2.2\n\n- When elements have keyboard focus, they are entirely visible.\n\n#### [2.4.13 Focus Appearance](//www.w3.org/TR/WCAG22/#focus-appearance) AAA 2.2\n\n- If a custom focus indicator or background color is in place, the focus indicator pixels must:\n  - have at least 3:1 contrast between focused/unfocused states\n  - be at least as large as the area of a 2 pixel thick perimeter surrounding the element. The formula `(width × 4) + (height × 4) = focus indicator area` can be used for rectangular components.\n\n### Guideline 2.5 Make it easier for users to operate functionality through various inputs beyond keyboard.\n\n#### [2.5.1 Pointer Gestures](//www.w3.org/TR/WCAG22/#pointer-gestures) A 2.1\n\n- If multipoint or path-based gestures (such as pinching, swiping, or dragging across the screen) are not essential to the functionality, then the functionality can also be performed with a single point activation (such as activating a button).\n\n#### [2.5.2 Pointer Cancellation](//www.w3.org/TR/WCAG22/#pointer-cancellation) A 2.1\n\n- To help avoid inadvertent activation of controls, avoid non-essential down-event (e.g., `onmousedown`) activation when clicking, tapping, or long pressing the screen. For complex interactions (such as drag and drop), `onmousedown` can be used if an associated `onmouseup` (or similar) event can be aborted or reversed.\n\n#### [2.5.3 Label in Name](//www.w3.org/TR/WCAG22/#label-in-name) A 2.1\n\n- If an interface component (link, button, etc.) presents text (or images of text), the accessible name (label, alternative text, aria-label, etc.) for that component must include the visible text.\n\n#### [2.5.4 Motion Actuation](//www.w3.org/TR/WCAG22/#motion-actuation) A 2.1\n\n- Functionality that is triggered by moving the device (such as shaking or panning a mobile device) or by user movement (such as waving to a camera) can be disabled and equivalent functionality is provided via standard controls like buttons.\n\n#### [2.5.5 Target Size](//www.w3.org/TR/WCAG22/#target-size) AAA 2.1\n\n- Clickable targets are at least 44 by 44 pixels in size unless an alternative target of that size is provided, the target is inline (such as a link within a sentence), the target is not author-modified (such as a default checkbox), or the small target size is essential to the functionality.\n\n#### [2.5.6 Concurrent Input Mechanisms](//www.w3.org/TR/WCAG22/#concurrent-input-mechanisms) AAA 2.1\n\n- Content does not require a specific input type, such as touch-only or keyboard-only, but must support alternative inputs (such as using a keyboard on a mobile device).\n\n#### [2.5.7 Dragging Movements](//www.w3.org/TR/WCAG22/#dragging-movements) AA 2.2\n\n- Functionality that uses pointer dragging can also be achieved using a single pointer without dragging (unless dragging is essential).\n\n#### [2.5.8 Target Size (Minimum)](//www.w3.org/TR/WCAG22/#target-size-minimum) AA 2.2\n\n- Pointer input target sizes are at least 24 by 24 pixels unless:\n  - A 24 pixel diameter circle centered on the target element does not intersect with any other target or a 24 pixel circle centered on an adjacent target.\n  - The functionality can be achieved in some other conformant manner.\n  - The target is in a sentence or list.\n  - The target size can't be modified or is essential to the functionality.\n\n## Understandable Information and the operation of user interface must be understandable.\n\n### Guideline 3.1 Make text content readable and understandable.\n\n#### [3.1.1 Language of Page](//www.w3.org/TR/WCAG22/#language-of-page) A 2.0\n\n- The language of the page is identified using the `lang` attribute (e.g., `<html lang=\"en\">`).\n\n#### [3.1.2 Language of Parts](//www.w3.org/TR/WCAG22/#language-of-parts) AA 2.0\n\n- The language of page content that is in a different language is identified using the `lang` attribute (e.g., `<blockquote lang=\"es\">`).\n\n#### [3.1.3 Unusual Words](//www.w3.org/TR/WCAG22/#unusual-words) AAA 2.0\n\n- [Words](/techniques/writing/) that may be ambiguous, unfamiliar, or used in a very specific way are defined through adjacent text, a definition list, a glossary, or other suitable method.\n\n#### [3.1.4 Abbreviations](//www.w3.org/TR/WCAG22/#abbreviations) AAA 2.0\n\n- The meaning of an unfamiliar abbreviation is provided by expanding it the first time it is used, using the `<abbr>` element, or linking to a definition or glossary.\n\n#### [3.1.5 Reading Level](//www.w3.org/TR/WCAG22/#reading-level) AAA 2.0\n\n- A more understandable alternative is provided for content that is more advanced than can be reasonably read by a person with roughly 9 years of primary education.\n\n#### [3.1.6 Pronunciation](//www.w3.org/TR/WCAG22/#pronunciation) AAA 2.0\n\n- If the pronunciation of a word is vital to understanding that word, its pronunciation is provided immediately following the word or via a link or glossary.\n\n### Guideline 3.2 Make Web pages appear and operate in predictable ways.\n\n#### [3.2.1 On Focus](//www.w3.org/TR/WCAG22/#on-focus) A 2.0\n\n- When a page element receives focus, it does not result in a substantial change to the page, the spawning of a pop-up window, an additional change of keyboard focus, or any other change that could confuse or disorient the user.\n\n#### [3.2.2 On Input](//www.w3.org/TR/WCAG22/#on-input) A 2.0\n\n- When a user inputs information or interacts with a control, it does not result in a substantial change to the page, the spawning of a pop-up window, an additional change of keyboard focus, or any other change that could confuse or disorient the user unless the user is informed of the change ahead of time.\n\n#### [3.2.3 Consistent Navigation](//www.w3.org/TR/WCAG22/#consistent-navigation) AA 2.0\n\n- Navigation links that are repeated on web pages do not change order when navigating through the site.\n\n#### [3.2.4 Consistent Identification](//www.w3.org/TR/WCAG22/#consistent-identification) AA 2.0\n\n- Elements that have the same functionality across multiple web pages are consistently identified. For example, a search box at the top of the site should always be labeled the same way.\n\n#### [3.2.5 Change on Request](//www.w3.org/TR/WCAG22/#change-on-request) AAA 2.0\n\n- Substantial changes to the page, the spawning of pop-up windows, uncontrolled changes of keyboard focus, or any other change that could confuse or disorient the user must be initiated by the user. Alternatively, the user is provided an option to disable such changes.\n\n#### [3.2.6 Consistent Help](//www.w3.org/TR/WCAG22/#consistent-help) A 2.2\n\n- Contact and self-help details or functionality are presented consistently when present on multiple web pages.\n\n### Guideline 3.3 Help users avoid and correct mistakes.\n\n#### [3.3.1 Error Identification](//www.w3.org/TR/WCAG22/#error-identification) A 2.0\n\n- Required inputs or inputs that require a specific format, value, or length provide this information within the element's label.\n- [Form validation](/techniques/formvalidation/) errors are efficient, intuitive, and accessible. The error is clearly identified, quick access to the problematic element is provided, and the user can easily fix the error and resubmit the form.\n\n#### [3.3.2 Labels or Instructions](//www.w3.org/TR/WCAG22/#labels-or-instructions) A 2.0\n\n- Inputs are identified by labels or instructions that help users know what information to enter.\n\n#### [3.3.3 Error Suggestion](//www.w3.org/TR/WCAG22/#error-suggestion) AA 2.0\n\n- If an input error is detected (via client-side or server-side validation), suggestions are provided for fixing the input in a timely and accessible manner.\n\n#### [3.3.4 Error Prevention (Legal, Financial, Data)](//www.w3.org/TR/WCAG22/#error-prevention-legal-financial-data) AA 2.0\n\n- Submissions, changes, and deletions of legal, financial, or test data can be reversed, verified, or confirmed.\n\n#### [3.3.5 Help](//www.w3.org/TR/WCAG22/#help) AAA 2.0\n\n- Instructions and cues are provided in context to help in form completion and submission.\n\n#### [3.3.6 Error Prevention (All)](//www.w3.org/TR/WCAG22/#error-prevention-all) AAA 2.0\n\n- If the user can submit information, the submission is reversible, verified, or confirmed.\n\n#### [3.3.7 Redundant Entry](//www.w3.org/TR/WCAG22/#redundant-entry) A 2.2\n\n- Information that a user must re-enter to complete a single-session process must be auto-populated or available for the user to select, unless re-entering the information is essential to the functionality, the information poses security issues, or the previously-entered information is no longer valid.\n\n#### [3.3.8 Accessible Authentication (Minimum)](//www.w3.org/TR/WCAG22/#accessible-authentication-minimum) AA 2.2\n\n- A cognitive function test (such as remembering a password or solving a puzzle) is not required for any step in an authentication process unless the cognitive function test can be bypassed in some way, can be completed with assistance by some other mechanism, uses object recognition (such as \"click on the photo of a flower\"), or uses identification of non-text content provided by the user (such as a user-provided image).\n\n#### [3.3.9 Accessible Authentication (Enhanced)](//www.w3.org/TR/WCAG22/#accessible-authentication-enhanced) AAA 2.2\n\n- A cognitive function test (such as remembering a password or solving a puzzle) is not required for any step in an authentication process unless the cognitive function test can be bypassed in some way or can be completed with assistance by some other mechanism.\n\n## Robust Content must be robust enough that it can be interpreted reliably by a wide variety of user agents, including assistive technologies.\n\n### Guideline 4.1 Maximize compatibility with current and future user agents, including assistive technologies.\n\n#### [4.1.1 Parsing (Obsolete and removed)](//www.w3.org/TR/WCAG22/#parsing) A 2.0\n\nNOTE: This success criterion is no longer useful and as of 2023 has been removed from WCAG. It previously required that significant HTML validation/parsing errors be avoided.\n\n#### [4.1.2 Name, Role, Value](//www.w3.org/TR/WCAG22/#name-role-value) A 2.0\n\n- Markup is used in a way that facilitates accessibility. This includes following the HTML specifications and using forms, input labels, frame titles, etc. appropriately.\n- ARIA is used appropriately to enhance accessibility when HTML is not sufficient.\n\n#### [4.1.3 Status Messages](//www.w3.org/TR/WCAG22/#status-messages) AA 2.1\n\n- If an important status message is presented and focus is not set to that message, the message must be announced to screen reader users, typically via an ARIA alert or live region.\n\nThis checklist is provided as a resource to help implement [Web Content Accessibility Guidelines (WCAG) 2.2](//www.w3.org/TR/WCAG22/) (W3C Recommendation), which is [Copyright](//www.w3.org/Consortium/Legal/ipr-notice#Copyright) © 2017-2023 [W3C](//www.w3.org/)®.",
  "tags": [
    "webaim",
    "accessibility",
    "techniques",
    "testing"
  ],
  "extracted_at": "2026-02-03T14:25:41.396943+00:00",
  "content_length": 23381,
  "content_hash": "f360d457103daeb0"
}