{
  "id": "nngroup__articles_horizontal-scrolling_",
  "source_id": "nngroup",
  "source_name": "Nielsen Norman Group Articles",
  "category": "ux_research",
  "url": "https://www.nngroup.com/articles/horizontal-scrolling/",
  "title": "Beware Horizontal Scrolling and Mimicking Swipe on Desktop",
  "content": "6\nBeware Horizontal Scrolling and Mimicking Swipe on Desktop\nKatie Sherwin\nKatie Sherwin\nApril 27, 2014\n2014-04-27\nShare\nEmail article\nShare on LinkedIn\nShare on Twitter\nSummary:\nEven as more sites mimic swiping gestures and incorporate horizontal scrolling in desktop designs, users remain reluctant to move sideways through content.\nFor years, we’ve known that\nhorizontal scrolling is painful for users on desktop computers\n. Even with the wide adoption of mobile devices, where touch gestures are used to swipe for content,\nusers on desktop websites have not embraced horizontal scrolling\n. This article addresses some of the inherent issues with the touchscreen-inspired horizontal scrolling and offers some alternatives and suggestions for how to help users move laterally through content. Obviously, you cannot literally swipe if you don’t have a touchscreen; throughout this article, we’ll use quotes around the word “swipe” to refer to the analog of the touchscreen swipe gesture on the desktop.\nIn This Article:\nThe Appeal of Horizontal Scrolling\nThe Risks of Horizontal Scrolling on the Desktop\nRecommendations for Implementing Horizontal Scrolling or “Swiping” on the Desktop\nConclusion\nThe Appeal of Horizontal Scrolling\nThe dominant standard for moving through long pages of content on desktop sites is by scrolling vertically. The conventional mouse and the scroll wheel make it easy for people to scroll up and down, thus reinforcing the pattern.\nWebsites that intentionally break convention and move the canvas left to right across a page often do so for one of the following reasons:\nConsistency across devices\n. Our research on\nmobile devices\nindicates that horizontal swiping is common and users are comfortable with the swiping gesture on phone and tablet touchscreens. Responsive or mobile-first sites use the horizontal “swiping” across all devices, including desktops, because a single\ndesign across devices is cheaper to produce and supposedly offers a consistent experience.\nHowever, because horizontal scrolling is a lot less common on desktops, users often have no idea that they can discover content by “swiping” on large screens. Since people interact with mobile and desktop devices differently, the\none-size-fits-all approach can backfire\n. The key point is that users are most likely to consider consistency as applying to the user experience they have while\nflittering between websites\non their current device. They are less likely to remember the exact interaction techniques a particular site employed on a different device where they accessed that site some time ago.\nBrowsing through nonessential content\n. Not everything is critical content. For secondary information, for example images in a photo gallery, horizontal scrolling lets users see a small sample of the content and gives them the option to quickly “swipe” or click for more. For some content, it’s fine that customers won’t scroll through an entire filmstrip. Just be sure you’re not placing essential content behind a horizontal scroll, because not everyone will discover it.\nSaving vertical screen space.\nRather than displaying all the content at once on a very long page, horizontal layouts introduce users to smaller chunks of information. The layout is flexible and extensible, because content can be added both vertically and horizontally.\nHulu.com: Filmstrips by category are stacked, so users can see options within a category by “swiping” to the side, or scrolling down to see different categories. This use of two dimensions helps users by showing a variety of options without making them visit separate category pages.\nShowcasing a distinctive design.\nMany sites, especially those of artists and digital agencies, use horizontal scrolling on their sites in order to stand out and offer a glimpse into their design capabilities. In contrast, for mainstream sites, being different for the sake of being different is a terrible design rationale.\nThe Risks of Horizontal Scrolling on the Desktop\nWhile horizontal scrolling is acceptable in some situations, it should be applied with caution. Be aware: horizontal scrolling on the desktop is one of the few interactions that consistently generate\nnegative responses from users\n. (Anecdotally, the disdain for it is so widespread, that I like to use it to illustrate what user experience is to people unfamiliar with the field. I ask if they can think of a website scrolling horizontally. They usually groan and say they hate it, and then I explain how we look at things like that and find ways to make them better. Usually they respond along the lines of\n“Thank you, I wish there were more of you.”\n).\nNote that although “swiping” on the desktop does not evoke the same level of negative reaction as the traditional horizontal scrollbar, it does still pose similar risks. Let’s look at 3 main reasons why horizontal scrolling and “swiping” are problematic on the desktop.\n1. The traditional horizontal scrollbar burdens the user by requiring constant attention and greater physical effort to maintain the dragging.\nMost people use scrollbars to scroll, and not the scroll arrows. However, moving across a thin tunnel (like the scrollbar) is difficult because it requires careful steering of the pointing device. (This is an instance of the steering law, which says that the time it takes a user to steer a pointing device through a tunnel depends on the length and the width of the tunnel: the longer and narrower the tunnel, the more time it takes users to move the pointer from one end to another. The steering law is derived from Fitts’ law, which we discuss in our\nHuman-Computer Interaction course\n). As a result, using a scrollbar on the desktop has a\nhigh interaction cost\nand slows people down. In a recent user test, a participant became frustrated scrolling sideways through product listings and complained,\n“It’s taking me forever to scroll through this.”\n2. Users may ignore content accessible through horizontal scrolling or “swiping” as they don’t expect content there.\nOur research found that even strong cues such as arrows frequently remain unnoticed. People expect to scroll vertically for additional content, but they don’t expect to scroll sideways. Horizontal scrolling works against their preexisting\nmental model\nof a web page.\nApple.com: This eyetracking heat map shows how a user looking at a filmstrip of product images never glanced at the arrows, and thus never saw the other products in the rest of the filmstrip.\n3. Even obvious cues for horizontal scrolling have weak\ninformation scent\n.\nEven if people do notice cues for horizontal scrolling, they may not want to risk loading content that they cannot predict. Content hidden by a horizontal scroll is at a disadvantage because even salient visual cues don’t offer strong information scent: users can hardly guess what information they will get once they click on an arrow or scroll horizontally. In implementations where the entire page “swipes” to reveal new content, the risk of disappointment is even higher: the user may have to wait through a long page load only to discover that the new page is irrelevant for her needs.\nUSAToday.com: Users ignored the arrows on the sides of the article pages, because it was not clear what would be revealed if they clicked. When specifically asked about the arrows, one user said,\n“I wouldn’t use these. I want to read what I want to read.”\nRecommendations for Implementing Horizontal Scrolling or “Swiping” on the Desktop\nIf you are considering mimicking the swipe gesture or using horizontal scrolling on your desktop site, follow these recommendations to make it easier for your users to notice and access your content.\n1. Don’t make “swiping” the primary navigation on your site.\nDon’t force users to “swipe” through your content: some will, many won’t. Allow for alternative ways of navigation: give users the option to navigate with menus, too. Menus tell users what’s on your site and help them find the information that they need. Users rely on them to go deeper into your site or move between categories.\nWithout global navigation\n, it’s harder for users to move around and discover more content.\nDennys.com: This design offers obvious global navigation in addition to arrows to advance through content. In testing this site, a user never used the arrows to swipe between pages. Instead, he relied entirely on the global navigation and was able to complete all the tasks successfully. Note, too, that the partial visibility of the content on either side of the main panel makes it less jarring when the content moves into focus.\n2. Don’t make users guess how much content is left.\nUse a scrollbar or pagination to show how much more content there is. It’s always best to show users where they are in your site, so they can better orient themselves. Tell people how much is left, so they can decide how much further to go. Or, in the case of a loop, users want to know when they’ve arrived back at the start.\nAmazon.com: Page numbers and a link to go back to the start of the filmstrip offer useful context for how many options are left and how to quickly jump back to the beginning.\n3. Create obvious, visible cues for horizontal swiping.\nLet users advance through content on click and with the keyboard. If arrows are only visible on hover (like in the Netflix example below), people might not ever discover that there is more content. For both individual pages and\ncarousels\n, design visible target areas where people can click to advance to new content.\nNetflix.com: In its regular state, there are no visual cues to indicate that more content is available (top). Arrows appear only on hover (bottom). Additionally, to see more content within a category, users must hover over the arrow. When they do so, the strip starts to move; if users want to see more items, they must be careful not to move their mouse away from the arrow area. Not only does this interaction take a lot of effort and sustained attention, but it’s also slower and can cause a dizzying effect that is more nuisance than fun. Clicking to advance the entire set would be much faster.\nConclusion\nScrolling and “swiping” horizontally on the desktop is a different experience than on touchscreen tablets and mobile devices. This is one more example of why it is important to understand that people use mobile devices, tablets, and desktops differently, and why it’s beneficial to optimize design for different uses. Avoid breaking convention just to stand out, or to solve a multiplatform-development challenge. Instead, evaluate whether or not horizontal scrolling is really appropriate for your users, so you can be sure that your design enhances their experience instead of degrading it.\nLearn more about horizontal scrolling, carousels, and filmstrip design, and ways in which you can make them usable in our\nWeb Page Design course\n.\nRelated Courses\nWeb Page UX Design\nStrategically combine content, visuals, and interactive components to design successful web pages\nInteraction\nEmerging Patterns in Interface Design\nTrending UX patterns and their impact on the total user experience\nInteraction\nThe Human Mind and Usability\nUse psychology to predict and explain how your customers think and act\nInteraction\nscrolling,Design Patterns,Interaction Design,Visual Design,Web Usability,web trends\nRelated Topics\nDesign Patterns\nDesign Patterns\nInteraction Design\nVisual Design\nWeb Usability\nLearn More:\nInfinite Scrolling: When to Use It, When to Avoid It\nTim Neusesser\n·\n4 min\nWhy Didn't People Scroll? The Illusion of Completeness\nAurora Harley\n·\n2 min\nDo People Scroll? What Information Foraging Says\nRaluca Budiu\n·\n3 min\nRelated Articles:\nThe Illusion of Completeness: What It Is and How to Avoid It\nKim Flaherty\n·\n7 min\nWeb UX: Study Guide\nHuei-Hsin Wang\n·\n15 min\nAI-Powered Tools for UX Research in 2023: Issues and Limitations\nFeifei Liu and  Kate Moran\n·\n10 min\nInfinite Scrolling Is Not for Every Website\nHoa Loranger\n·\n3 min\nTop 10 Application-Design Mistakes\nJakob Nielsen and  Page Laubheimer\n·\n13 min\nHow Channels, Devices, and Touchpoints Impact the Customer Journey\nKim Flaherty\n·\n3 min",
  "content_markdown": "6\n\n# Beware Horizontal Scrolling and Mimicking Swipe on Desktop\n\nKatie Sherwin\n\n![](https://media.nngroup.com/media/people/photos/Katie_Sherwin_portrait.jpg.256x256_q75_autocrop_crop-smart_upscale.jpg)\n\n[Katie Sherwin](/articles/author/katie-sherwin/)\n\nApril 27, 2014\n2014-04-27\n\n[Share](#)\n\n- [Email article](mailto:?subject=NN/g Article: Beware Horizontal Scrolling and Mimicking Swipe on Desktop  &body=https://www.nngroup.com/articles/horizontal-scrolling/)\n- [Share on LinkedIn](http://www.linkedin.com/shareArticle?mini=true&url=http://www.nngroup.com/articles/horizontal-scrolling/&title=Beware Horizontal Scrolling and Mimicking Swipe on Desktop  &source=Nielsen%20Norman%20Group)\n- [Share on Twitter](https://twitter.com/intent/tweet?url=http://www.nngroup.com/articles/horizontal-scrolling/&text=Beware Horizontal Scrolling and Mimicking Swipe on Desktop  &via=nngroup)\n\nSummary: \nEven as more sites mimic swiping gestures and incorporate horizontal scrolling in desktop designs, users remain reluctant to move sideways through content.\n\nFor years, we’ve known that [horizontal scrolling is painful for users on desktop computers](http://www.nngroup.com/articles/scrolling-and-scrollbars/). Even with the wide adoption of mobile devices, where touch gestures are used to swipe for content, **users on desktop websites have not embraced horizontal scrolling**. This article addresses some of the inherent issues with the touchscreen-inspired horizontal scrolling and offers some alternatives and suggestions for how to help users move laterally through content. Obviously, you cannot literally swipe if you don’t have a touchscreen; throughout this article, we’ll use quotes around the word “swipe” to refer to the analog of the touchscreen swipe gesture on the desktop.\n\n## In This Article:\n\n- [The Appeal of Horizontal Scrolling](#toc-the-appeal-of-horizontal-scrolling-1)\n- [The Risks of Horizontal Scrolling on the Desktop](#toc-the-risks-of-horizontal-scrolling-on-the-desktop-2)\n- [Recommendations for Implementing Horizontal Scrolling or “Swiping” on the Desktop](#toc-recommendations-for-implementing-horizontal-scrolling-or-swiping-on-the-desktop-3)\n- [Conclusion](#toc-conclusion-4)\n\n## The Appeal of Horizontal Scrolling\n\nThe dominant standard for moving through long pages of content on desktop sites is by scrolling vertically. The conventional mouse and the scroll wheel make it easy for people to scroll up and down, thus reinforcing the pattern.\n\nWebsites that intentionally break convention and move the canvas left to right across a page often do so for one of the following reasons:\n\n- **Consistency across devices**. Our research on [mobile devices](http://www.nngroup.com/articles/mobile-usability-update/) indicates that horizontal swiping is common and users are comfortable with the swiping gesture on phone and tablet touchscreens. Responsive or mobile-first sites use the horizontal “swiping” across all devices, including desktops, because a single **design across devices is cheaper to produce and supposedly offers a consistent experience.** However, because horizontal scrolling is a lot less common on desktops, users often have no idea that they can discover content by “swiping” on large screens. Since people interact with mobile and desktop devices differently, the [one-size-fits-all approach can backfire](http://www.nngroup.com/articles/scaling-user-interfaces/). The key point is that users are most likely to consider consistency as applying to the user experience they have while [flittering between websites](http://www.nngroup.com/articles/users-interleave-sites-and-genres/) on their current device. They are less likely to remember the exact interaction techniques a particular site employed on a different device where they accessed that site some time ago.\n- **Browsing through nonessential content**. Not everything is critical content. For secondary information, for example images in a photo gallery, horizontal scrolling lets users see a small sample of the content and gives them the option to quickly “swipe” or click for more. For some content, it’s fine that customers won’t scroll through an entire filmstrip. Just be sure you’re not placing essential content behind a horizontal scroll, because not everyone will discover it.\n- **Saving vertical screen space.** Rather than displaying all the content at once on a very long page, horizontal layouts introduce users to smaller chunks of information. The layout is flexible and extensible, because content can be added both vertically and horizontally.\n  ![Stacked filmstrips used to save space](//s3.amazonaws.com/media.nngroup.com/media/editor/2014/04/23/hulu-stacked-filmstrips.png)\n\n  *Hulu.com: Filmstrips by category are stacked, so users can see options within a category by “swiping” to the side, or scrolling down to see different categories. This use of two dimensions helps users by showing a variety of options without making them visit separate category pages.*\n- **Showcasing a distinctive design.** Many sites, especially those of artists and digital agencies, use horizontal scrolling on their sites in order to stand out and offer a glimpse into their design capabilities. In contrast, for mainstream sites, being different for the sake of being different is a terrible design rationale.\n\n## The Risks of Horizontal Scrolling on the Desktop\n\nWhile horizontal scrolling is acceptable in some situations, it should be applied with caution. Be aware: horizontal scrolling on the desktop is one of the few interactions that consistently generate **negative responses from users**. (Anecdotally, the disdain for it is so widespread, that I like to use it to illustrate what user experience is to people unfamiliar with the field. I ask if they can think of a website scrolling horizontally. They usually groan and say they hate it, and then I explain how we look at things like that and find ways to make them better. Usually they respond along the lines of *“Thank you, I wish there were more of you.”*).\n\nNote that although “swiping” on the desktop does not evoke the same level of negative reaction as the traditional horizontal scrollbar, it does still pose similar risks. Let’s look at 3 main reasons why horizontal scrolling and “swiping” are problematic on the desktop.\n\n### 1. The traditional horizontal scrollbar burdens the user by requiring constant attention and greater physical effort to maintain the dragging.\n\nMost people use scrollbars to scroll, and not the scroll arrows. However, moving across a thin tunnel (like the scrollbar) is difficult because it requires careful steering of the pointing device. (This is an instance of the steering law, which says that the time it takes a user to steer a pointing device through a tunnel depends on the length and the width of the tunnel: the longer and narrower the tunnel, the more time it takes users to move the pointer from one end to another. The steering law is derived from Fitts’ law, which we discuss in our [Human-Computer Interaction course](http://www.nngroup.com/courses/hci/)). As a result, using a scrollbar on the desktop has a [high interaction cost](http://www.nngroup.com/articles/interaction-cost-definition/) and slows people down. In a recent user test, a participant became frustrated scrolling sideways through product listings and complained, *“It’s taking me forever to scroll through this.”*\n\n### 2. Users may ignore content accessible through horizontal scrolling or “swiping” as they don’t expect content there.\n\nOur research found that even strong cues such as arrows frequently remain unnoticed. People expect to scroll vertically for additional content, but they don’t expect to scroll sideways. Horizontal scrolling works against their preexisting [mental model](http://www.nngroup.com/articles/mental-models/) of a web page.\n\n![Eyetracking heatmap of filmstrip](//s3.amazonaws.com/media.nngroup.com/media/editor/2014/04/23/apple-filmstrip-heatmap.png)\n\n*Apple.com: This eyetracking heat map shows how a user looking at a filmstrip of product images never glanced at the arrows, and thus never saw the other products in the rest of the filmstrip.*\n\n### 3. Even obvious cues for horizontal scrolling have weak [information scent](http://www.nngroup.com/articles/information-scent/).\n\nEven if people do notice cues for horizontal scrolling, they may not want to risk loading content that they cannot predict. Content hidden by a horizontal scroll is at a disadvantage because even salient visual cues don’t offer strong information scent: users can hardly guess what information they will get once they click on an arrow or scroll horizontally. In implementations where the entire page “swipes” to reveal new content, the risk of disappointment is even higher: the user may have to wait through a long page load only to discover that the new page is irrelevant for her needs.\n\n![Arrows have weak information scent](//s3.amazonaws.com/media.nngroup.com/media/editor/2014/04/23/usatoday-slider-arrow.png)\n\n*USAToday.com: Users ignored the arrows on the sides of the article pages, because it was not clear what would be revealed if they clicked. When specifically asked about the arrows, one user said,* “I wouldn’t use these. I want to read what I want to read.”\n\n## Recommendations for Implementing Horizontal Scrolling or “Swiping” on the Desktop\n\nIf you are considering mimicking the swipe gesture or using horizontal scrolling on your desktop site, follow these recommendations to make it easier for your users to notice and access your content.\n\n### 1. Don’t make “swiping” the primary navigation on your site.\n\nDon’t force users to “swipe” through your content: some will, many won’t. Allow for alternative ways of navigation: give users the option to navigate with menus, too. Menus tell users what’s on your site and help them find the information that they need. Users rely on them to go deeper into your site or move between categories. [Without global navigation](http://www.nngroup.com/articles/killing-global-navigation-one-trend-avoid/), it’s harder for users to move around and discover more content.\n\n![Global navigation and horizontal scroll](//s3.amazonaws.com/media.nngroup.com/media/editor/2014/04/23/dennys-global-nav-and-swipe.png)\n\n*Dennys.com: This design offers obvious global navigation in addition to arrows to advance through content. In testing this site, a user never used the arrows to swipe between pages. Instead, he relied entirely on the global navigation and was able to complete all the tasks successfully. Note, too, that the partial visibility of the content on either side of the main panel makes it less jarring when the content moves into focus.*\n\n### 2. Don’t make users guess how much content is left.\n\nUse a scrollbar or pagination to show how much more content there is. It’s always best to show users where they are in your site, so they can better orient themselves. Tell people how much is left, so they can decide how much further to go. Or, in the case of a loop, users want to know when they’ve arrived back at the start.\n\n![Using pagination on filmstrips](//s3.amazonaws.com/media.nngroup.com/media/editor/2014/04/23/amazon-filmstrip-pagination.png)\n\n*Amazon.com: Page numbers and a link to go back to the start of the filmstrip offer useful context for how many options are left and how to quickly jump back to the beginning.*\n\n### 3. Create obvious, visible cues for horizontal swiping.\n\nLet users advance through content on click and with the keyboard. If arrows are only visible on hover (like in the Netflix example below), people might not ever discover that there is more content. For both individual pages and [carousels](http://www.nngroup.com/articles/designing-effective-carousels/), design visible target areas where people can click to advance to new content.\n\n![No arrow until hover](//s3.amazonaws.com/media.nngroup.com/media/editor/2014/04/23/netflix-no-arrow-until-hover.png)\n\n*Netflix.com: In its regular state, there are no visual cues to indicate that more content is available (top). Arrows appear only on hover (bottom). Additionally, to see more content within a category, users must hover over the arrow. When they do so, the strip starts to move; if users want to see more items, they must be careful not to move their mouse away from the arrow area. Not only does this interaction take a lot of effort and sustained attention, but it’s also slower and can cause a dizzying effect that is more nuisance than fun. Clicking to advance the entire set would be much faster.*\n\n## Conclusion\n\nScrolling and “swiping” horizontally on the desktop is a different experience than on touchscreen tablets and mobile devices. This is one more example of why it is important to understand that people use mobile devices, tablets, and desktops differently, and why it’s beneficial to optimize design for different uses. Avoid breaking convention just to stand out, or to solve a multiplatform-development challenge. Instead, evaluate whether or not horizontal scrolling is really appropriate for your users, so you can be sure that your design enhances their experience instead of degrading it.\n\nLearn more about horizontal scrolling, carousels, and filmstrip design, and ways in which you can make them usable in our [Web Page Design course](http://www.nngroup.com/courses/web-page-design/).\n\n## Related Courses\n\n- [#### Web Page UX Design\n\n  Strategically combine content, visuals, and interactive components to design successful web pages\n\n  Interaction](/courses/web-page-design/?lm=horizontal-scrolling&pt=article)\n- [#### Emerging Patterns in Interface Design\n\n  Trending UX patterns and their impact on the total user experience\n\n  Interaction](/courses/emerging-patterns-interface-design/?lm=horizontal-scrolling&pt=article)\n- [#### The Human Mind and Usability\n\n  Use psychology to predict and explain how your customers think and act\n\n  Interaction](/courses/human-mind/?lm=horizontal-scrolling&pt=article)\n\nscrolling,Design Patterns,Interaction Design,Visual Design,Web Usability,web trends\n\n## Related Topics\n\n- Design Patterns\n  [Design Patterns](/topic/design-patterns/)\n- [Interaction Design](/topic/interaction-design/)\n- [Visual Design](/topic/visual-design/)\n- [Web Usability](/topic/web-usability/)\n\n## Learn More:\n\n- [![](https://media.nngroup.com/media/videos/thumbnails/Infinite_Scrolling-_When_to_Use_It_When_to_Avoid_It_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Infinite Scrolling: When to Use It, When to Avoid It\n\n  Tim Neusesser\n  ·\n  4 min](/videos/infinite-scrolling-when/?lm=horizontal-scrolling&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Why_Didnt_People_Scroll_The_Illusion_of_Completeness_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Why Didn't People Scroll? The Illusion of Completeness\n\n  Aurora Harley\n  ·\n  2 min](/videos/illusion-completeness/?lm=horizontal-scrolling&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Do_people_scroll_what_information_foraging_Says_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Do People Scroll? What Information Foraging Says\n\n  Raluca Budiu\n  ·\n  3 min](/videos/scrolling-information-foraging/?lm=horizontal-scrolling&pt=article)\n\n## Related Articles:\n\n- [The Illusion of Completeness: What It Is and How to Avoid It\n\n  Kim Flaherty\n  ·\n  7 min](/articles/illusion-of-completeness/?lm=horizontal-scrolling&pt=article)\n- [Web UX: Study Guide\n\n  Huei-Hsin Wang\n  ·\n  15 min](/articles/web-ux-study-guide/?lm=horizontal-scrolling&pt=article)\n- [AI-Powered Tools for UX Research in 2023: Issues and Limitations\n\n  Feifei Liu and Kate Moran\n  ·\n  10 min](/articles/ai-powered-tools-limitations/?lm=horizontal-scrolling&pt=article)\n- [Infinite Scrolling Is Not for Every Website\n\n  Hoa Loranger\n  ·\n  3 min](/articles/infinite-scrolling/?lm=horizontal-scrolling&pt=article)\n- [Top 10 Application-Design Mistakes\n\n  Jakob Nielsen and Page Laubheimer\n  ·\n  13 min](/articles/top-10-application-design-mistakes/?lm=horizontal-scrolling&pt=article)\n- [How Channels, Devices, and Touchpoints Impact the Customer Journey\n\n  Kim Flaherty\n  ·\n  3 min](/articles/channels-devices-touchpoints/?lm=horizontal-scrolling&pt=article)",
  "tags": [
    "nngroup",
    "usability",
    "research",
    "heuristics"
  ],
  "extracted_at": "2026-02-03T12:44:23.242302+00:00",
  "content_length": 12161,
  "content_hash": "45c0f744f272b487"
}