{
  "id": "nngroup__articles_cards-component_",
  "source_id": "nngroup",
  "source_name": "Nielsen Norman Group Articles",
  "category": "ux_research",
  "url": "https://www.nngroup.com/articles/cards-component/",
  "title": "Cards: UI-Component Definition",
  "content": "8\nCards: UI-Component Definition\nPage Laubheimer\nPage Laubheimer\nNovember 6, 2016\n2016-11-06\nShare\nEmail article\nShare on LinkedIn\nShare on Twitter\nSummary:\nA “card” is a UI design pattern that groups related information in a flexible-size container visually resembling a playing card.\nIn recent years, we’ve seen a lot of interest towards creating modular UI patterns that work well across a variety of screens and window sizes. One such new UI component is the\ncard\n— a snapshot-like display intended to encourage users to click or tap to view more details.\nCard:\nA container for a few short, related pieces of information. It roughly resembles a playing card in size and shape, and is intended as a linked, short representation of a conceptual unit.\nThis wireframed example of a card component features several different types of information: an image, a title, a short summary, a time stamp, a hashtag, and a secondary call-to-action button for social media sharing. The design (with optional rounded corners) visually resembles a playing card; the card has a visible border, is placed on a contrasting background, and uses a slight drop shadow as a signifier that the entire card is clickable. This card also contains two secondary clickable elements (the hashtag #dayhikes and the Share button), separated from the content area by a horizontal line. (Note that this line doesn't undermine the visual grouping of the entire card.)\nCards are often associated with\nflat design 2.0\n: they retain some aspects of the aesthetic of flat design, but reintroduce visual depth as a\nsignifier\nof clickability. Though the basic concept is older, in the last few years, cards have received a lot of attention in the software-design world, with many high-profile sites and companies (e.g., Google’s Material Design, Twitter's card component) embracing them.\nCards have 4 key properties:\n1.\nCards are used for grouping information.\nA card\nchunks\nseveral different (but related) pieces of information into one digestible unit — be it an article on a news website, a product on an ecommerce site, or a post on a social app. A single card will typically include a few different types of media, such as an image, a title, a synopsis, sharing icons, or a call-to-action button — all associated with the same concept.\n2.\nCards present a summary and link to additional details..\nA card is usually short and offers a\nlinked\nentry point\nto further details, rather than the full details themselves. It is intended as a\nhigh–information-scent\noutline used to entice users to click through to further details contained on a separate page.\n3.\nCards resemble physical cards.\nCards use a border around the grouped content, and the background color within the card that differs from background color of the underlying canvas. These visual-design elements create a strong sense that the different bits of information contained within the border are grouped together.\nQuite often, cards use a slight drop shadow to show depth, which is a clickability signifier. For most implementations, clicking or tapping\nanywhere\non the card link to a details page (though some cards, like the one in our previous example, also include some secondary call-to-action buttons or links in addition to the main link available). This larger touch zone substantially improves usability on both touchscreen devices and mouse-based devices (due to\nFitts’ Law\n).\n4.\nCards allow for flexible layouts.\nWhen multiple cards are used together in a layout, they often do not all have the same type of information — some cards might include a text summary, hashtags, or an image whereas other cards on the same page may include totally different details. Cards allow for varying height to accommodate differing amounts or types of content, but typically the width is fixed from one card to the next.\nPinterest's use of cards showcases how cards excel at grouping together heterogenous items, where each card features different types and amounts of information and, thus, occupies a different amount of vertical space. Cards include rich media (the thumbnail image), title, secondary calls-to-action (\nLike\nand\nShare\nbuttons), and attributions. Each card uses visual elements such as background color,border, and shadow to differentiate itself from the background, clearly group the card elements, and indicate clickability. Clicking on a card takes the user to a detail screen for that content. Without the visual style of the card, grouping each item's ingredients together clearly in a way that separates them from other items on the page would require a lot more negative space and would waste valuable screen real estate on mobile phones and tablets.\nIn This Article:\nUI Cards vs. Hypertext Card Model\nPrinciple of Common Regions Creates Visual Groups\nWhen Cards Are Useful\nConclusion\nUI Cards vs. Hypertext Card Model\nSeasoned UX pros may recognize the card concept as being related (both in name and in concept) to the\ncard (or deck-of-cards) model\nof presenting linked information from the dawn of hypertext, in the 1990s. This model refers to splitting content into discrete pages of fixed size and is an alternative to vertical scrolling: navigating through carded content is similar to turning the pages of a book as opposed to unfurling a long paper scroll. This card model saw a revival when the\niPad first came out\n, when many apps were trying to control the look of each page presented to the user. You are probably familiar with the deck-of-cards paradigm from mobile weather apps — most of them employ it for displaying the weather in different cities.\nThe iOS Weather app presents each city's weather forecast in the hypertext deck-of-cards style (rather than the UI-card-component style that is the main subject of this article). Each city is a full-screen\nnode\n, and viewing the weather in other cities is accomplished by swiping to the left or right to see another full-screen\nnode\n, similar to the experience of flipping pages in a book.\nThe contemporary card pattern is based on the same idea of grouping content into discrete, completely visible units with controlled information layout and appearance. However, the contemporary card that this article is focused on is not a full-screen item (as in the older card model), but takes up just a small region of the screen, and contemporary cards are often used in a layout with multiple cards per screen.\nThis goes to remind us two critical things about interface design: 1) everything old is new again, meaning that\nnew design trends are often not so revolutionary after all\n, and may be revived with slight variations, and 2) because history repeats itself,\nusability guidelines and interaction design principles are durable\nand remain relevant for a long time, even in the rapidly innovating world of user-experience design.\nPrinciple of Common Regions Creates Visual Groups\nCards take advantage of one of the common-regions principles in cognitive psychology:multiple items contained together within a boundary are more likely to be perceived as being grouped. This principle\ncan\nsupersede the powerful\nGestalt law of proximity\n(where items placed near each are perceived as grouped), allowing items that are further away to be more explicitly visually grouped. The principle of common regions frees designers from using\nnegative space\nto create explicit connections among several items.\nTop:\nThe law of proximity creates a strong sense of visual grouping among triangles 2 & 3 and 4 & 5, because they are placed close to one another, and further apart from their neighbors 1 & 6. The designer must use negative space (i.e., empty space between unrelated elements) to convey grouping.\nBottom:\nThe common-regions principle trumps the law of proximity: through use of a border and background color (much like the card component uses), the same set of triangles are grouped differently; a strong visual signal is sent that triangles 1 & 2, 3 & 4, and 5 & 6 are grouped, even though the layout is identical with that in the top figure. In the unlikely case that usability testing showed the need for even stronger grouping, each card could be made to have a different background color.\nWhen Cards Are Useful\nCards are better suited when users browse for information than when they search.\nMultiple-card layouts are frequently used instead of\nlist views of content\n. Cards are, however, less appropriate than lists when people search for information for three major reasons, all related to their variable size:\n1.\nCard layouts typically\ndeemphasize\nthe ranking of content. (However, even though they lack the strong hierarchy signals of list views, multicard displays still obey typical page-hierarchy laws: content at the top and on the left of the page is more discoverable and perceived as more important.)\n2.\nCard layouts are less scannable than lists. A standard vertical list view (in which each item occupies a new row in the layout, and may still contain mixed media such as an image, title, summary, and so forth) is more scannable than cards because the positioning of the individual elements is fixed in size and more predictable for the eye. Thus, cards are not appropriate when users search for a specific item from a list or look for a particular piece of content.\n3.\nCards take more space. Because cards are bigger than a line of text, any given screen size can’t show as many cards in a single view as would be possible in a list view. The more things are viewable without scrolling, the less demand is placed on users’\nshort-term memory\n.\nLeft\n: Scanning products in a card-based list is challenging to quickly find basic information such as price, since the layout is not predictably arranged, and a user can't easily anticipate where to look on the page to find that information.\nRight\n: A vertical list easily supports scanning for price from one product to the next, as this information is placed in a predictable location on each item in the list.\nCards are also a poor choice when users need to\ncompare between multiple options\n, since cards often aren't structured in a predictable way from item to item; our eyetracking research revealed that users look back and forth multiple times between items when they compare them, so you should facilitate this process by\nusing a consistent visual treatment of items that will be compared\n.\nA gaze plot of a user's eyetracking session on a card-based layout. The user was asked to find and read a story that looked interesting to her. The flexible-card layout does not clearly indicate a hierarchy of stories in order, so the user looks around back and forth in a semirandom pattern, looking for any compelling information before deciding which story to click on and read further details. Note that the user looks back and forth between the same stories repeatedly, comparing between options before clicking. The irregular layout makes this comparison behavior a more difficult undertaking than a vertical list, in which similar information would be located in predictable, consistent places for each item.\nCards work best for collections of heterogeneous items\n(i.e. not all the content is of the same basic type).\nCards are an excellent choice for dashboard applications and for social or aggregation sites that display a variety of content types at the same time on the same page. In such situations, the card metaphor can help create more obvious differences between items, and each card can accommodate different ingredients, if, for example, not all cards on a page need to include a title, byline, or other specific bit of information.\nSalesforce's dashboard system uses cards effectively to show heterogenous content and media together. Clicking on any card produces a full, detailed report for that item. Items have different sizes and are clearly separated from each other.\nImage attribution\nWhen presenting very homogenous items (such as a list of\nsimilar\nblog posts, products, or news stories), consider using a standard vertical list of items (or, in certain cases where the items are similar and are all from a narrowly defined category,\ngrids of images\n) instead of cards to support scannability and also comparisons among items.\nFor example, placing all the photos in an online photo album on separate cards is not necessary, since they are all of a similar type, are clearly self-contained without the border, background, and shadow, and you don't get\nadditional\ndetails when you click on it (you simply get a larger version of the same image). A gallery of photos is the type of content better\nserved by a regular grid\n.\nConclusion\nCards are a useful UI component for grouping several related pieces of information together for providing a linked entry point to further details on that content. Cards work especially well in contexts where they provide summaries of many different kinds of content, rather than when simply used as a modern-looking replacement for a list of content.\nRelated Courses\nEmerging Patterns in Interface Design\nTrending UX patterns and their impact on the total user experience\nInteraction\nVisual Design,Design Patterns,graphical user interfaces,web trends,gestalt,minimalism\nRelated Topics\nVisual Design\nVisual Design\nDesign Patterns\nLearn More:\nGrids 101\nKelley Gordon\n·\n4 min\nVisual Design Principles in Action\nRachel Krause\n·\n6 min\nWhy 90’s Designs Are Coming Back\nMegan Chan\n·\n4 min\nRelated Articles:\nTesting Visual Design: A Comprehensive Guide\nMegan Chan\n·\n10 min\n5 Principles of Visual Design in UX\nKelley Gordon\n·\n8 min\nAI-Powered Tools for UX Research in 2023: Issues and Limitations\nFeifei Liu and  Kate Moran\n·\n10 min\nThe Risks of Imitating Designs (Even from Successful Companies)\nKathryn Whitenton\n·\n5 min\nWeb UX: Study Guide\nHuei-Hsin Wang\n·\n15 min\nExecuting UX Animations: Duration and Motion Characteristics\nPage Laubheimer\n·\n9 min",
  "content_markdown": "8\n\n# Cards: UI-Component Definition\n\nPage Laubheimer\n\n![](https://media.nngroup.com/media/people/photos/2022-portrait-page-3.jpg.256x256_q75_autocrop_crop-smart_upscale.jpg)\n\nPage Laubheimer\n\nNovember 6, 2016\n2016-11-06\n\n[Share](#)\n\n- [Email article](mailto:?subject=NN/g Article: Cards: UI-Component Definition&body=https://www.nngroup.com/articles/cards-component/)\n- [Share on LinkedIn](http://www.linkedin.com/shareArticle?mini=true&url=http://www.nngroup.com/articles/cards-component/&title=Cards: UI-Component Definition&source=Nielsen%20Norman%20Group)\n- [Share on Twitter](https://twitter.com/intent/tweet?url=http://www.nngroup.com/articles/cards-component/&text=Cards: UI-Component Definition&via=nngroup)\n\nSummary: \nA “card” is a UI design pattern that groups related information in a flexible-size container visually resembling a playing card.\n\nIn recent years, we’ve seen a lot of interest towards creating modular UI patterns that work well across a variety of screens and window sizes. One such new UI component is the **card** — a snapshot-like display intended to encourage users to click or tap to view more details.\n\n> **Card:** A container for a few short, related pieces of information. It roughly resembles a playing card in size and shape, and is intended as a linked, short representation of a conceptual unit.\n\n![Wireframed image of a card component](https://media.nngroup.com/media/editor/2016/10/14/card-wireframe-export-unannotated-v3.png)\n\n*This wireframed example of a card component features several different types of information: an image, a title, a short summary, a time stamp, a hashtag, and a secondary call-to-action button for social media sharing. The design (with optional rounded corners) visually resembles a playing card; the card has a visible border, is placed on a contrasting background, and uses a slight drop shadow as a signifier that the entire card is clickable. This card also contains two secondary clickable elements (the hashtag #dayhikes and the Share button), separated from the content area by a horizontal line. (Note that this line doesn't undermine the visual grouping of the entire card.)*\n\nCards are often associated with [flat design 2.0](https://www.nngroup.com/articles/flat-design/): they retain some aspects of the aesthetic of flat design, but reintroduce visual depth as a [signifier](http://jnd.org/dn.mss/signifiers_not_affordances.html) of clickability. Though the basic concept is older, in the last few years, cards have received a lot of attention in the software-design world, with many high-profile sites and companies (e.g., Google’s Material Design, Twitter's card component) embracing them.\n\nCards have 4 key properties:\n\n**1.** **Cards are used for grouping information.**\n\nA card [chunks](https://www.nngroup.com/articles/chunking/) several different (but related) pieces of information into one digestible unit — be it an article on a news website, a product on an ecommerce site, or a post on a social app. A single card will typically include a few different types of media, such as an image, a title, a synopsis, sharing icons, or a call-to-action button — all associated with the same concept.\n\n**2.** **Cards present a summary and link to additional details..**\n\nA card is usually short and offers a **linked** **entry point** to further details, rather than the full details themselves. It is intended as a [high–information-scent](https://www.nngroup.com/articles/information-scent/) outline used to entice users to click through to further details contained on a separate page.\n\n**3.** **Cards resemble physical cards.**\n\nCards use a border around the grouped content, and the background color within the card that differs from background color of the underlying canvas. These visual-design elements create a strong sense that the different bits of information contained within the border are grouped together.\n\nQuite often, cards use a slight drop shadow to show depth, which is a clickability signifier. For most implementations, clicking or tapping *anywhere* on the card link to a details page (though some cards, like the one in our previous example, also include some secondary call-to-action buttons or links in addition to the main link available). This larger touch zone substantially improves usability on both touchscreen devices and mouse-based devices (due to [Fitts’ Law](http://www.asktog.com/columns/022DesignedToGiveFitts.html)).\n\n**4.** **Cards allow for flexible layouts.**\n\nWhen multiple cards are used together in a layout, they often do not all have the same type of information — some cards might include a text summary, hashtags, or an image whereas other cards on the same page may include totally different details. Cards allow for varying height to accommodate differing amounts or types of content, but typically the width is fixed from one card to the next.\n\n![Pinterest using a card-based layout.](https://media.nngroup.com/media/editor/2016/10/14/pinterest.png)\n\n*Pinterest's use of cards showcases how cards excel at grouping together heterogenous items, where each card features different types and amounts of information and, thus, occupies a different amount of vertical space. Cards include rich media (the thumbnail image), title, secondary calls-to-action (*Like *and*Share *buttons), and attributions. Each card uses visual elements such as background color,border, and shadow to differentiate itself from the background, clearly group the card elements, and indicate clickability. Clicking on a card takes the user to a detail screen for that content. Without the visual style of the card, grouping each item's ingredients together clearly in a way that separates them from other items on the page would require a lot more negative space and would waste valuable screen real estate on mobile phones and tablets.*\n\n## In This Article:\n\n- [UI Cards vs. Hypertext Card Model](#toc-ui-cards-vs-hypertext-card-model-1)\n- [Principle of Common Regions Creates Visual Groups](#toc-principle-of-common-regions-creates-visual-groups-2)\n- [When Cards Are Useful](#toc-when-cards-are-useful-3)\n- [Conclusion](#toc-conclusion-4)\n\n## UI Cards vs. Hypertext Card Model\n\nSeasoned UX pros may recognize the card concept as being related (both in name and in concept) to the [card (or deck-of-cards) model](https://www.nngroup.com/articles/two-basic-hypertext-presentation-models/) of presenting linked information from the dawn of hypertext, in the 1990s. This model refers to splitting content into discrete pages of fixed size and is an alternative to vertical scrolling: navigating through carded content is similar to turning the pages of a book as opposed to unfurling a long paper scroll. This card model saw a revival when the [iPad first came out](https://www.nngroup.com/articles/ipad-usability-first-findings/), when many apps were trying to control the look of each page presented to the user. You are probably familiar with the deck-of-cards paradigm from mobile weather apps — most of them employ it for displaying the weather in different cities.\n\n![iOS weather app uses the deck-of-cards conceptual model](https://media.nngroup.com/media/editor/2016/10/14/iosweather.png)\n\n*The iOS Weather app presents each city's weather forecast in the hypertext deck-of-cards style (rather than the UI-card-component style that is the main subject of this article). Each city is a full-screen* node*, and viewing the weather in other cities is accomplished by swiping to the left or right to see another full-screen* node*, similar to the experience of flipping pages in a book.*\n\nThe contemporary card pattern is based on the same idea of grouping content into discrete, completely visible units with controlled information layout and appearance. However, the contemporary card that this article is focused on is not a full-screen item (as in the older card model), but takes up just a small region of the screen, and contemporary cards are often used in a layout with multiple cards per screen.\n\nThis goes to remind us two critical things about interface design: 1) everything old is new again, meaning that [new design trends are often not so revolutionary after all](https://www.nngroup.com/articles/roots-minimalism-web-design/), and may be revived with slight variations, and 2) because history repeats itself, [usability guidelines and interaction design principles are durable](https://www.nngroup.com/articles/durability-of-usability-guidelines/) and remain relevant for a long time, even in the rapidly innovating world of user-experience design.\n\n## Principle of Common Regions Creates Visual Groups\n\nCards take advantage of one of the common-regions principles in cognitive psychology:multiple items contained together within a boundary are more likely to be perceived as being grouped. This principle *can* supersede the powerful [Gestalt law of proximity](https://www.nngroup.com/articles/closeness-of-actions-and-objects-gui/) (where items placed near each are perceived as grouped), allowing items that are further away to be more explicitly visually grouped. The principle of common regions frees designers from using [negative space](https://www.nngroup.com/articles/form-design-white-space/) to create explicit connections among several items. ![](file://localhost/Users/Page/Library/Group%20Containers/UBF8T346G9.Office/msoclip1/01/clip_image004.png)\n\n![triangles demonstrating the law of proximity](https://media.nngroup.com/media/editor/2016/10/14/law-of-proximity.png)\n\n***Top:**The law of proximity creates a strong sense of visual grouping among triangles 2 & 3 and 4 & 5, because they are placed close to one another, and further apart from their neighbors 1 & 6. The designer must use negative space (i.e., empty space between unrelated elements) to convey grouping.*\n\n![triangles demonstrating the common regions principle](https://media.nngroup.com/media/editor/2016/10/14/common-regions.png)\n\n***Bottom:**The common-regions principle trumps the law of proximity: through use of a border and background color (much like the card component uses), the same set of triangles are grouped differently; a strong visual signal is sent that triangles 1 & 2, 3 & 4, and 5 & 6 are grouped, even though the layout is identical with that in the top figure. In the unlikely case that usability testing showed the need for even stronger grouping, each card could be made to have a different background color.*\n\n## When Cards Are Useful\n\n- **Cards are better suited when users browse for information than when they search.**\n\nMultiple-card layouts are frequently used instead of [list views of content](https://www.nngroup.com/articles/list-entries/). Cards are, however, less appropriate than lists when people search for information for three major reasons, all related to their variable size:\n\n**1.** Card layouts typically **deemphasize** the ranking of content. (However, even though they lack the strong hierarchy signals of list views, multicard displays still obey typical page-hierarchy laws: content at the top and on the left of the page is more discoverable and perceived as more important.)\n\n**2.** Card layouts are less scannable than lists. A standard vertical list view (in which each item occupies a new row in the layout, and may still contain mixed media such as an image, title, summary, and so forth) is more scannable than cards because the positioning of the individual elements is fixed in size and more predictable for the eye. Thus, cards are not appropriate when users search for a specific item from a list or look for a particular piece of content.\n\n**3.** Cards take more space. Because cards are bigger than a line of text, any given screen size can’t show as many cards in a single view as would be possible in a list view. The more things are viewable without scrolling, the less demand is placed on users’ [short-term memory](https://www.nngroup.com/articles/short-term-memory-and-web-usability/).\n\n![a card based layout next to a list based layout](https://media.nngroup.com/media/editor/2016/10/14/card-vs-list-v3.png)\n\n***Left**: Scanning products in a card-based list is challenging to quickly find basic information such as price, since the layout is not predictably arranged, and a user can't easily anticipate where to look on the page to find that information.  \n**Right**: A vertical list easily supports scanning for price from one product to the next, as this information is placed in a predictable location on each item in the list.*\n\nCards are also a poor choice when users need to [compare between multiple options](https://www.nngroup.com/articles/explicit-differences/), since cards often aren't structured in a predictable way from item to item; our eyetracking research revealed that users look back and forth multiple times between items when they compare them, so you should facilitate this process by [using a consistent visual treatment of items that will be compared](https://www.nngroup.com/articles/list-entries/).\n\n![Gaze plot of eye tracking on a card-based layout where users looked back and forth](https://media.nngroup.com/media/editor/2016/10/21/cards-heatmap-comparison.png)\n\n*A gaze plot of a user's eyetracking session on a card-based layout. The user was asked to find and read a story that looked interesting to her. The flexible-card layout does not clearly indicate a hierarchy of stories in order, so the user looks around back and forth in a semirandom pattern, looking for any compelling information before deciding which story to click on and read further details. Note that the user looks back and forth between the same stories repeatedly, comparing between options before clicking. The irregular layout makes this comparison behavior a more difficult undertaking than a vertical list, in which similar information would be located in predictable, consistent places for each item.*\n\n- **Cards work best for collections of heterogeneous items** (i.e. not all the content is of the same basic type).\n\nCards are an excellent choice for dashboard applications and for social or aggregation sites that display a variety of content types at the same time on the same page. In such situations, the card metaphor can help create more obvious differences between items, and each card can accommodate different ingredients, if, for example, not all cards on a page need to include a title, byline, or other specific bit of information.\n\n![Cards used in a dashboard application from Salesforce](https://media.nngroup.com/media/editor/2016/11/08/salesforcedashboard.png)\n\n*Salesforce's dashboard system uses cards effectively to show heterogenous content and media together. Clicking on any card produces a full, detailed report for that item. Items have different sizes and are clearly separated from each other. [Image attribution](http://releasenotes.docs.salesforce.com/en-us/winter16/release-notes/rn_salesforce1_reporting_dashboard_run_read.htm)*\n\nWhen presenting very homogenous items (such as a list of **similar** blog posts, products, or news stories), consider using a standard vertical list of items (or, in certain cases where the items are similar and are all from a narrowly defined category, [grids of images](https://www.nngroup.com/articles/image-vs-list-mobile-navigation/)) instead of cards to support scannability and also comparisons among items.\n\nFor example, placing all the photos in an online photo album on separate cards is not necessary, since they are all of a similar type, are clearly self-contained without the border, background, and shadow, and you don't get *additional* details when you click on it (you simply get a larger version of the same image). A gallery of photos is the type of content better [served by a regular grid](https://www.nngroup.com/articles/image-vs-list-mobile-navigation/).\n\n## Conclusion\n\nCards are a useful UI component for grouping several related pieces of information together for providing a linked entry point to further details on that content. Cards work especially well in contexts where they provide summaries of many different kinds of content, rather than when simply used as a modern-looking replacement for a list of content.\n\n## Related Courses\n\n- [#### Emerging Patterns in Interface Design\n\n  Trending UX patterns and their impact on the total user experience\n\n  Interaction](/courses/emerging-patterns-interface-design/?lm=cards-component&pt=article)\n\nVisual Design,Design Patterns,graphical user interfaces,web trends,gestalt,minimalism\n\n## Related Topics\n\n- Visual Design\n  [Visual Design](/topic/visual-design/)\n- [Design Patterns](/topic/design-patterns/)\n\n## Learn More:\n\n- [![](https://media.nngroup.com/media/videos/thumbnails/Grids_101_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Grids 101\n\n  Kelley Gordon\n  ·\n  4 min](/videos/grids-101/?lm=cards-component&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Visual_Design_Principles_in_Action_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Visual Design Principles in Action\n\n  Rachel Krause\n  ·\n  6 min](/videos/visual-design-principles-in-action/?lm=cards-component&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/maxresdefault_2.webp.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Why 90’s Designs Are Coming Back\n\n  Megan Chan\n  ·\n  4 min](/videos/cyclical-design-trends/?lm=cards-component&pt=article)\n\n## Related Articles:\n\n- [Testing Visual Design: A Comprehensive Guide\n\n  Megan Chan\n  ·\n  10 min](/articles/testing-visual-design/?lm=cards-component&pt=article)\n- [5 Principles of Visual Design in UX\n\n  Kelley Gordon\n  ·\n  8 min](/articles/principles-visual-design/?lm=cards-component&pt=article)\n- [AI-Powered Tools for UX Research in 2023: Issues and Limitations\n\n  Feifei Liu and Kate Moran\n  ·\n  10 min](/articles/ai-powered-tools-limitations/?lm=cards-component&pt=article)\n- [The Risks of Imitating Designs (Even from Successful Companies)\n\n  Kathryn Whitenton\n  ·\n  5 min](/articles/risks-imitating-designs/?lm=cards-component&pt=article)\n- [Web UX: Study Guide\n\n  Huei-Hsin Wang\n  ·\n  15 min](/articles/web-ux-study-guide/?lm=cards-component&pt=article)\n- [Executing UX Animations: Duration and Motion Characteristics\n\n  Page Laubheimer\n  ·\n  9 min](/articles/animation-duration/?lm=cards-component&pt=article)",
  "tags": [
    "nngroup",
    "usability",
    "research",
    "heuristics"
  ],
  "extracted_at": "2026-02-03T12:44:18.628268+00:00",
  "content_length": 13871,
  "content_hash": "bf9bdad8567ec6e7"
}