{
  "id": "nngroup__articles_comparison-tables_",
  "source_id": "nngroup",
  "source_name": "Nielsen Norman Group Articles",
  "category": "ux_research",
  "url": "https://www.nngroup.com/articles/comparison-tables/",
  "title": "Comparison Tables for Products, Services, and Features",
  "content": "11\nComparison Tables for Products, Services, and Features\nKate Moran, Taylor Dykes\nKate Moran\nand\nTaylor Dykes\nFebruary 9, 2024\n2024-02-09\nShare\nEmail article\nShare on LinkedIn\nShare on Twitter\nSummary:\nUse this versatile GUI tool to support users when they need to make a decision that involves considering multiple attributes of a small number of offerings. Consistency in content, scannability, and a simple layout are some of the most important qualities of successful comparison tables.\nComparison is\none of the most critical activities\nusers perform on the web\n. In many cases, it’s a necessary step before your site visitors will perform a desired action, like buying your product, signing up for membership, contacting you, or requesting a quote.\nHowever, this essential information is often distributed across detail pages, forcing users to remember information or open multiple windows or tabs. This is where the\ncomparison table\ncomes in.\nIn This Article:\nDefinition\nWhen You Need a Comparison Table\nWhen You Don’t Need a Comparison Table\nTypes of Comparison Tables\nStatic Comparison Tables\nDynamic Comparison Tables\nBest Practices for Comparison Tables\nThe Golden Rule of Comparison Tables\nDefinition\nComparison table:\nA table that uses columns for products (or services) and rows for the attributes. It allows for quick and easy comparison between each offering’s features and characteristics.\nA basic comparison table in the most common layout: a different column for each product and a different row for each characteristic of the product.\nWhen You Need a Comparison Table\nComparison tables are often misunderstood as tools for ecommerce only. It’s true that the most common instances of comparison tables are for mid-range to expensive consumer goods, especially electronics (think microwaves, fitness trackers, vacuum cleaners, or cars). But, in addition to products,\ncomparison tables are equally well-suited for:\nServices\nMembership levels\nPricing packages\nApp features\nTuition rates\nLocations\nThey can be used to\ncompare similar items from the same organization\nor to\ncompare one organization’s products against those of a competitor\n. The comparison table is a much more versatile tool than it gets credit for.\nTypes of Decision Making: Compensatory vs. Noncompensatory\nWhen people have to choose among many alternatives, it’s hard to compare the pros and cons of each individual alternative. As a result, people engage in\nnoncompensatory decision\nmaking\n— in other words, using one factor as the basis for decision-making.\nFor example, a user looking to buy a new car might filter out all the cars that are more expensive than $20,000, even though some of them are only slightly above their budget. This nonnegotiable filter helps the user restrict the set of results to a reasonable size.\nWhen people have to select among a small set of alternatives (usually under 5–7), they usually engage in\ncompensatory decision\nmaking\n: looking at the individual merits of each item and comparing their advantages and disadvantages according to a number of criteria.\nFor example, a user researching a new laptop might be willing to consider a heavier computer if it has better battery life and computing power.\nFilters and facets\nsupport noncompensatory decision-making.\nIn contrast,\ncompensatory decision making\nis best served by comparison tables\n. They allow users to easily see and compare multiple important attributes at a glance.\nWhen You Don’t Need a Comparison Table\nThere are certainly cases when a comparison table is unnecessary. In addition to the noncompensatory decision situation discussed above, you probably don’t need a comparison table if the items are:\nNot mutually exclusive\nSimple\nCheap or replaceable\nUnique or hard to compare\nOutside of these exceptions, a comparison table’s applications are limited only by your imagination. Any time your users want to choose among similar offerings, it’s an opportunity for a comparison table — especially if multiple factors contribute to the decision.\nNot Mutually Exclusive\nSimilar items are not necessarily mutually exclusive. A shopper may only need to purchase a single microwave or laptop, but that isn’t the case for items like shirts, toys, or lightbulbs. For example, a consumer probably doesn’t need a comparison table to help them choose a dress, because they aren’t limited to one.\n❌\namazon.com: A comparison table of similar dresses isn’t necessary.\n✅\namazon.com: Instead of a comparison table, this Amazon dress product page offered a quick way to add a similar dress to your order.\nSimple Items\nWhen a product or service is very simple, users don’t need to analyze its characteristics. For example, a coffee mug doesn’t have many meaningful, comparable attributes. Someone shopping for a coffee mug online might be interested in the style (and possibly size) but probably won’t want to compare many attributes of several coffee mugs.\nComparison tables tend to be unnecessary for items that are primarily chosen for aesthetics, like furniture, home décor, clothing, or accessories.\nCheap or Replaceable Items\nWhen a product or service is cheap or easily replaceable, users are likely to engage in\nsatisficing\nbehavior and not spend much time analyzing alternatives. People don’t need to compare various rolls of paper towels, for example.\n❌\njetpens.com: People don’t need to compare this many factors for a simple, inexpensive item like a plastic pen.\nUnique, Hard-to-Compare Items\nFinally, products or services that are unique and hard to compare with others aren’t well suited to comparison tables. For example, it’d be hard to come up with a set of attributes to compare works of art.\nTypes of Comparison Tables\nThere are two types of comparison tables:\nStatic comparison tables\ncontain preselected products and are best used for small (under 5 items) product selections.\nDynamic comparison tables\nallow users to decide which items they want to compare and are best for large product selections.\nStatic Comparison Tables\nIf you have a small number of products your users will need to compare, you may want to create prebuilt,\nstatic comparison tables\n.\nFor example, Apple’s most recent release only features three different models of the Apple Watch, so it provides a ready-made comparison table for users trying to decide.\n✅\napple.com: With only 3 models of the most recent Apple Watch available, Apple provided a comparison table that included them all.\nA good rule of thumb is to take this approach if you have 5 offerings or fewer, but we’ll get into limiting the number of compared items later in this article. Static comparison tables usually work well for membership levels or pricing packages.\nWith this kind of comparison table implementation, you’ll be able to control how the information is displayed on the page.\nFor example, you can change the copy to fit the space constraints of one cell. Note, however, that this implementation is not as easily scalable as dynamic comparison tables; You’ll have to update the comparison table if you offer a new product or service.\n✅\napple.com: Ensure users find a static comparison table by including a link to the table in your information architecture alongside your product menu. Apple included a link to its static comparison table in the\nWatch\nsecondary navigation menu, alongside the links to the various Apple Watch models.\nDynamic Comparison Tables\nDynamic tables allow users to select which items they want to see\nin the comparison table. They are appropriate when you offer more than 5 products or services.\nWhile dynamic comparison tables scale well as your set of offerings increases or changes, they are usually implemented using a\nflexible layout\n, and their appearance cannot be as closely controlled as that of static tables.\n✅\ntesla.com:\nTesla’s site allowed users to compare different models of Tesla using a dynamic table.\nSelection of Items in a Dynamic Comparison Table\nTwo popular ways of allowing users to select which items to add to the table include: compare buttons or checkboxes, and direct manipulation of the items of interest.\nCompare\nButtons or Checkboxes\nCompare\nbuttons or checkboxes appear directly on listing pages. With this method, users can select the items they’re interested in, and then move to a dynamically created comparison page.\nCheckmarks (left, homedepot.com) and buttons (right, lowes.com) are the two most common ways of allowing users to select items for an interactive comparison table.\nProduct listing pages tend to be overcrowded, so one major challenge for this implementation is making the\nCompare\nbuttons discoverable without giving them too much space on the page. The safest option is to\ninclude\nCompare\nbuttons as secondary action buttons\n, either at the top and bottom of the page, or beneath all product descriptions.\nDirect Manipulation of Items\nWith this method,\nusers can click or drag the products that they want to add\nto the comparison table. Usually, this action is possible because, like in Garmin’s example below, a special\nCompare\nmode disables the regular meaning of clicking on a product. This can also be achieved by adding a separate\nCompare\npage, seen in the bottom right-hand corner of the example.\n❌\ngarmin.com: Although the grey ghost button faded into the UI and was not easily noticeable, this Garmin example wasn't all bad. It featured a\nCOMPARE\nbutton at the top of its product-listing page. When pressed, it would add the product to a comparison table instead of leading to a detail page.\nOne advantage of this direct-manipulation approach to selection is the opportunity to separate the comparison activity from the product-listing page, keeping that view visually cleaner.\nA separate comparison page (like Fitbit’s) is a good option when you don’t have enough products or offerings to justify a traditional listing page in the first place.\nBest Practices for Comparison Tables\nRegardless of which type of comparison table you choose, follow these best practices to support your users’ decision making.\nUse Comparison Tables for Up to 5 Items\nComparison tables support compensatory decision making, in which people engage only when they have relatively few alternatives to consider. When more than 5 items need to be compared, add other mechanisms such as filters to help users narrow down the larger set of possibilities to 5 or fewer.\nFor static comparison tables,\nerr on the side of simplicity. If you can’t keep a static table down to at most 5 comparable options, reconsider if it should be a static comparison table at all. Depending on the complexity of the information you’re presenting, even 5 options may be too many.\nFor dynamic tables,\nconsider whether the layout will scale gracefully up to 5 items if users have the freedom to select what those 5 items will be. Most dynamic comparison tables accept 3–4 items only. Consider how much text will need to be included for the attributes, and how that will impact layout and readability.\nAlso consider\nthe size of the user’s device or browser.\nYou may need to reduce the number of items to two for presentation on mobile. On the other hand, don’t force users to compare only two items at a time if you have the space to show more.\n❌\nApple’s dynamic comparison table for its Mac computers unnecessarily restricted users to comparing two items, even at very large screen sizes (shown here on a 3008x1692 resolution monitor.)\nWhatever your limit, make sure you clearly communicate it to your users to avoid confusion and errors. And don’t forget to let users remove items from the comparison, as they narrow down their selections.\nBe Consistent\nThe biggest problem with most comparison tables isn’t design, it’s content\n. When attribute information is missing, incomplete, or inconsistent across similar offerings, otherwise handy comparison tables quickly become useless. This is especially problematic for dynamic comparison tables, when you’re dealing with many offerings with slightly different metadata available.\n❌\nbestbuy.com: This comparison table displayed the attributes for 2 different cameras sold by Best Buy. The metadata for the Sony Alpha 7 camera was much richer. It can be challenging to keep the metadata consistent and up to date, especially when companies sell many products from many different manufacturers. However, if the information isn’t complete for all compared products, it might as well not be in a comparison table at all.\n❌\nsmugmug.com: This comparison table detailed the features of SmugMug’s four membership levels, with each column having a different value for the attribute\nAds and spam\n:\nZip, Zero, Zilch,\nand\nNada\n. Comparison-table values aren’t a good place to showcase your site’s personality — it’d be better to leave these values equivalent and not distract users while they scan for differences.\nSupport Scannability\nComparing the pros and cons of different products is a cognitively demanding process. You want to make sure your users can focus on the essentials. An effective way to do this is to\nmake the table easy to scan for differences, similarities, and keywords.\nStick to the standard table layout: options as columns, attributes as rows, with row labels on the left and column labels above. Use consistent text alignment in each column.\n❌\nwilliams-sonoma.com: Williams Sonoma did a good job categorizing pans for this static comparison table. Unfortunately, the horizontal row headers were nonstandard and impeded scannability. The narrow paragraphs under\nDISTINGUISHING FEATURES\nare not scannable or easy to read.\nWhen using text within comparison tables, keep it short. Whenever possible, avoid full sentences.\nColor coding can help as well — either lightly shading the backgrounds of each column, or coloring the text of the cells. Just make sure you’re maintaining enough contrast and not sacrificing readability.\n✅\nFitBit.com used a different color for each column’s checkmarks to help users clearly differentiate between each product’s features. This color-coding approach wouldn’t work quite as well for more complex attribute values that can’t be expressed in checkmarks.\n✅\ntechsmith.com used color-coded columns to show the different features available in its software offerings, as well as which platforms they could be used on.\nIt’s also important to clearly indicate rows so users can easily tell which attribute a cell refers to, especially when using symbols like checkmarks that can’t stand alone. Row borders, row shading, or extra spacing can help keep the rows distinct and separate.\nSticky Column Headers\nEspecially when dealing with long lists of attributes that occupy several screenfuls,\nkeep column headers fixed as users scroll.\nHuman short-term memory is limited, and users will easily forget which column is for which product.\n❌\nadobe.com: Adobe offered a static comparison table to help its customers compare different annual plans.\nUnfortunately, it didn’t have fixed column headers, so users were forced to remember column names or scroll back up the page to check which column was for what.\nMeaningful Attributes\nYour comparison table should include attributes that your users will actually care about. Don’t just throw every piece of metadata you have into the table, because it will make the job harder for users.\nAs much as possible,\ntry to define unfamiliar terms in context\n, and connect vague attributes to something concrete.\nFor example, Anker’s comparison table has attributes that are useful in the context of comparing portable power banks: battery capacity in mAh, charging speed, and weight. What really makes this a good comparison table is the fact that it translates those attributes into things that would be meaningful for the average consumer. The battery capacity is\n3350 mAh,\nwhich is approximately\n1.2 iPhone 6 charges.\nThe size is\n3.5 x 0.9 x 0.9 inches\n— about the size of a tube of lipstick. The weight is\n2.7 oz,\nwhich is similar to an egg’s weight. The average consumer may have trouble imagining what 2.7 oz feels like, but can probably imagine the weight of an egg.\n✅\namazon.com: The manufacturer’s product-comparison table translated technical attributes into language that was understandable by the average consumer.\nAnother effective way to make obscure attributes meaningful is to\ninclude links to more information or in-context tooltips with definitions or clarifying information\n.\n✅\ndropbox.com: The hover-activated tooltip clarified the meaning of the attributes without adding extra text to the page.\nGive Users Control\nEven if you do a good job making the entries scannable or the headers sticky, it can be hard for users to compare products with many attributes, especially when these attributes span several screenfuls. In those situations, users may have to scroll back and forth between different rows as they compare the pros and cons of different products.\nIn order to make the task manageable,\nconsider allowing users to select which attributes they want displayed in the table\n. Collapsible rows are an easy implementation for this feature.\nAlternatively, let users hide the rows for which all offerings are similar, and only show the differences.\n✅\nbestbuy.com: Users could easily identify differences (seen in yellow) between products by selecting the\nHighlight Differences\nswitch on this comparison table.\nFor simple static comparison tables, consider presenting a simplified table with those attributes you expect will be most important to users, but also allow access to a more detailed table.\n✅\nsmugmug.com: For its 3 plan options, SmugMug presented a very simplified “at a glance” comparison table.\nsmugmug.com: The much more detailed full comparison table was available on a different page.\nSimplify the Comparison for Mobile\nSome websites just remove their comparison functionality altogether for small devices. If at all possible,\nyou should try to support some level of comparison on mobile\n, but it’s unlikely that you’ll be able to show more than 2 items at a time in a comparison table. Remember that on smaller screens, fewer rows will be visible at a time and more strain will be placed on the user’s short-term memory. Therefore, following the previous recommendations (especially making entries scannable and giving users control to choose what they want to display) will be even more important on mobile.\nIf a true comparison table on a mobile devices is impractical for your offerings, you might alternatively consider converting the table to tabs or lists for small screens. Just remember that these formats do not support compensatory decision making as well, because users have to remember the attributes for each products in order to weigh pros and cons.\n✅\nshopify.com: One strategy for making comparison tables work on mobile is converting the columns to tabs. This means users can’t do true side-by-side comparison like they can on a full table, but at least they will be able to switch among products more easily than if they had to scroll or switch mobile-browser tabs.\nThe Golden Rule of Comparison Tables\nTo sum up many of the guidelines we’ve listed here:\nAbove all else, do the work for the consumer.\nDon’t slow them down with nonstandard or overly long tables with repeated information; don’t ask them to hold things in their memory; and don’t make them Google terms they aren’t familiar with.\nMake your users’ decisions as easy as possible\n: you’ll be happy, and they’ll be happy.\ncomparison,Psychology and UX,ui elements,Ecommerce,Web Usability\nRelated Topics\nPsychology and UX\nPsychology and UX\nEcommerce\nWeb Usability\nLearn More:\nEnable cookies\nto watch NN/g videos\nComparison Tables: 5 Scenarios When Not to Use Them\nTaylor Dykes\n·\n3 min\nSemantic Differential Scales: Measure User Attitudes with Nuance\nRachel Banawa\n·\n4 min\nTesler’s Law: Shift Complexity to Simplify UX\nLola Famulegun\n·\n3 min\nInattentional Blindness in Interfaces\nMegan Chan\n·\n4 min\nRelated Articles:\nWeb UX: Study Guide\nHuei-Hsin Wang\n·\n15 min\nAccordions on Desktop: When and How to Use\nHuei-Hsin Wang\n·\n10 min\nInteraction Cost\nRaluca Budiu\n·\n7 min\nBeyond Accessibility: Treating Users with Disabilities as People\nJakob Nielsen\n·\n5 min",
  "content_markdown": "11\n\n# Comparison Tables for Products, Services, and Features\n\nKate Moran, Taylor Dykes\n\n![](https://media.nngroup.com/media/people/photos/Kate-Headshot-2022.jpg.256x256_q75_autocrop_crop-smart_upscale.jpg)\n![](https://media.nngroup.com/media/people/photos/IMG_6611_2.JPG.256x256_q75_autocrop_crop-smart_upscale.jpg)\n\n[Kate Moran](/articles/author/kate-moran/) and\n[Taylor Dykes](/articles/author/taylor-dykes/)\n\nFebruary 9, 2024\n2024-02-09\n\n[Share](#)\n\n- [Email article](mailto:?subject=NN/g Article: Comparison Tables for Products, Services, and Features&body=https://www.nngroup.com/articles/comparison-tables/)\n- [Share on LinkedIn](http://www.linkedin.com/shareArticle?mini=true&url=http://www.nngroup.com/articles/comparison-tables/&title=Comparison Tables for Products, Services, and Features&source=Nielsen%20Norman%20Group)\n- [Share on Twitter](https://twitter.com/intent/tweet?url=http://www.nngroup.com/articles/comparison-tables/&text=Comparison Tables for Products, Services, and Features&via=nngroup)\n\nSummary: \nUse this versatile GUI tool to support users when they need to make a decision that involves considering multiple attributes of a small number of offerings. Consistency in content, scannability, and a simple layout are some of the most important qualities of successful comparison tables.\n\n**Comparison is**[one of the most critical activities](https://www.nngroup.com/articles/the-3cs-of-critical-web-use-collect-compare-choose)**users perform on the web**. In many cases, it’s a necessary step before your site visitors will perform a desired action, like buying your product, signing up for membership, contacting you, or requesting a quote.\n\nHowever, this essential information is often distributed across detail pages, forcing users to remember information or open multiple windows or tabs. This is where the **comparison table** comes in.\n\n## In This Article:\n\n- [Definition](#toc-definition-1)\n- [When You Need a Comparison Table](#toc-when-you-need-a-comparison-table-2)\n- [When You Don’t Need a Comparison Table](#toc-when-you-dont-need-a-comparison-table-3)\n- [Types of Comparison Tables](#toc-types-of-comparison-tables-4)\n- [Static Comparison Tables](#toc-static-comparison-tables-5)\n- [Dynamic Comparison Tables](#toc-dynamic-comparison-tables-6)\n- [Best Practices for Comparison Tables](#toc-best-practices-for-comparison-tables-7)\n- [The Golden Rule of Comparison Tables](#toc-the-golden-rule-of-comparison-tables-8)\n\n## Definition\n\n> **Comparison table:** A table that uses columns for products (or services) and rows for the attributes. It allows for quick and easy comparison between each offering’s features and characteristics.\n\n![An example of a basic comparison table.   It is a 3x3 grid. The columns are labeled: Product A, Product B, and Product C. The rows are labeled: Factor 1, Factor 2, Factor 3.   In the boxes of the grid there are Xes and checkmarks labeling which product has which factor. ](https://media.nngroup.com/media/editor/2024/02/02/comparison-table-taylor_comaprison-table1.png)\n\n*A basic comparison table in the most common layout: a different column for each product and a different row for each characteristic of the product.*\n\n## When You Need a Comparison Table\n\nComparison tables are often misunderstood as tools for ecommerce only. It’s true that the most common instances of comparison tables are for mid-range to expensive consumer goods, especially electronics (think microwaves, fitness trackers, vacuum cleaners, or cars). But, in addition to products, **comparison tables are equally well-suited for:**\n\n- **Services**\n- **Membership levels**\n- **Pricing packages**\n- **App features**\n- **Tuition rates**\n- **Locations**\n\nThey can be used to **compare similar items from the same organization** or to **compare one organization’s products against those of a competitor**. The comparison table is a much more versatile tool than it gets credit for.\n\n### Types of Decision Making: Compensatory vs. Noncompensatory\n\nWhen people have to choose among many alternatives, it’s hard to compare the pros and cons of each individual alternative. As a result, people engage in [noncompensatory decision](https://www.nngroup.com/articles/compensatory-noncompensatory-decisions/) **making** — in other words, using one factor as the basis for decision-making.\n\nFor example, a user looking to buy a new car might filter out all the cars that are more expensive than $20,000, even though some of them are only slightly above their budget. This nonnegotiable filter helps the user restrict the set of results to a reasonable size.\n\nWhen people have to select among a small set of alternatives (usually under 5–7), they usually engage in **compensatory decision** **making**: looking at the individual merits of each item and comparing their advantages and disadvantages according to a number of criteria.\n\nFor example, a user researching a new laptop might be willing to consider a heavier computer if it has better battery life and computing power.\n\n[Filters and facets](https://www.nngroup.com/articles/filters-vs-facets/) support noncompensatory decision-making. **In contrast,** [compensatory decision making](https://www.nngroup.com/articles/compensatory-noncompensatory-decisions/) **is best served by comparison tables**. They allow users to easily see and compare multiple important attributes at a glance.\n\n## When You Don’t Need a Comparison Table\n\nThere are certainly cases when a comparison table is unnecessary. In addition to the noncompensatory decision situation discussed above, you probably don’t need a comparison table if the items are:\n\n- Not mutually exclusive\n- Simple\n- Cheap or replaceable\n- Unique or hard to compare\n\nOutside of these exceptions, a comparison table’s applications are limited only by your imagination. Any time your users want to choose among similar offerings, it’s an opportunity for a comparison table — especially if multiple factors contribute to the decision.\n\n### Not Mutually Exclusive\n\nSimilar items are not necessarily mutually exclusive. A shopper may only need to purchase a single microwave or laptop, but that isn’t the case for items like shirts, toys, or lightbulbs. For example, a consumer probably doesn’t need a comparison table to help them choose a dress, because they aren’t limited to one.\n\n![Amazon screenshot of five floral dresses. Below, the dresses are compared by cut, length, sleeve, and design. ](https://media.nngroup.com/media/editor/2024/02/02/screenshot-2023-08-22-at-115042-am.png)\n\n❌ *amazon.com: A comparison table of similar dresses isn’t necessary.*\n\n![Amazon screenshot of two similar dresses. They are labeled \"buy with\" and have the option to add both dresses to the user's cart. ](https://media.nngroup.com/media/editor/2024/02/02/screenshot-2023-08-22-at-115007-am.png)\n\n✅ *amazon.com: Instead of a comparison table, this Amazon dress product page offered a quick way to add a similar dress to your order.*\n\n### Simple Items\n\nWhen a product or service is very simple, users don’t need to analyze its characteristics. For example, a coffee mug doesn’t have many meaningful, comparable attributes. Someone shopping for a coffee mug online might be interested in the style (and possibly size) but probably won’t want to compare many attributes of several coffee mugs.\n\nComparison tables tend to be unnecessary for items that are primarily chosen for aesthetics, like furniture, home décor, clothing, or accessories.\n\n### Cheap or Replaceable Items\n\nWhen a product or service is cheap or easily replaceable, users are likely to engage in [satisficing](https://www.nngroup.com/articles/satisficing/) behavior and not spend much time analyzing alternatives. People don’t need to compare various rolls of paper towels, for example.\n\n![In this screenshot, jetpens.com has a long comparison table comparing three black pens on a variety of different qualities. ](https://media.nngroup.com/media/editor/2024/02/02/compare-products-_-jetpens.png)\n\n❌ *jetpens.com: People don’t need to compare this many factors for a simple, inexpensive item like a plastic pen.*\n\n### Unique, Hard-to-Compare Items\n\nFinally, products or services that are unique and hard to compare with others aren’t well suited to comparison tables. For example, it’d be hard to come up with a set of attributes to compare works of art.\n\n## Types of Comparison Tables\n\nThere are two types of comparison tables:\n\n- **Static comparison tables** contain preselected products and are best used for small (under 5 items) product selections.\n- **Dynamic comparison tables** allow users to decide which items they want to compare and are best for large product selections.\n\n## Static Comparison Tables\n\nIf you have a small number of products your users will need to compare, you may want to create prebuilt, **static comparison tables**.\n\nFor example, Apple’s most recent release only features three different models of the Apple Watch, so it provides a ready-made comparison table for users trying to decide.\n\n![This is a screenshot of a comparison table comparing the three most recent Apple Watches. ](https://media.nngroup.com/media/editor/2024/02/02/apple-watch-compare-models-apple-1.png)\n\n*✅* *apple.com: With only 3 models of the most recent Apple Watch available, Apple provided a comparison table that included them all.*\n\nA good rule of thumb is to take this approach if you have 5 offerings or fewer, but we’ll get into limiting the number of compared items later in this article. Static comparison tables usually work well for membership levels or pricing packages.\n\nWith this kind of comparison table implementation, you’ll be able to control how the information is displayed on the page.\n\nFor example, you can change the copy to fit the space constraints of one cell. Note, however, that this implementation is not as easily scalable as dynamic comparison tables; You’ll have to update the comparison table if you offer a new product or service.\n\n![A screenshot of the Apple navigation menu. It has options for all the Apple Watches and one comparison option, which NN/g has highlighted in blue. ](https://media.nngroup.com/media/editor/2024/02/02/unnamed.png)\n\n*✅* *apple.com: Ensure users find a static comparison table by including a link to the table in your information architecture alongside your product menu. Apple included a link to its static comparison table in the* Watch *secondary navigation menu, alongside the links to the various Apple Watch models.*\n\n## Dynamic Comparison Tables\n\n**Dynamic tables allow users to select which items they want to see** in the comparison table. They are appropriate when you offer more than 5 products or services.\n\nWhile dynamic comparison tables scale well as your set of offerings increases or changes, they are usually implemented using a [flexible layout](https://www.nngroup.com/articles/layout-vs-content/), and their appearance cannot be as closely controlled as that of static tables.\n\n[![ ](https://media.nngroup.com/media/editor/2024/02/06/screenshot-2024-02-06-at-85415-pm.png)](https://media.nngroup.com/media/editor/2024/02/02/compare-_-tesla.mp4)\n\n✅ *tesla.com:**Tesla’s site allowed users to compare different models of Tesla using a dynamic table.*\n\n### **Selection of Items in a Dynamic Comparison Table**\n\nTwo popular ways of allowing users to select which items to add to the table include: compare buttons or checkboxes, and direct manipulation of the items of interest.\n\n#### CompareButtons or Checkboxes\n\n*Compare* buttons or checkboxes appear directly on listing pages. With this method, users can select the items they’re interested in, and then move to a dynamically created comparison page.\n\n![A screenshot of the Home Depot website compared to the Lowes website. Both sites have options to compare selections but one is a button and the other is a checkmark. ](https://media.nngroup.com/media/editor/2024/02/02/paintcompare.png)\n\n*Checkmarks (left, homedepot.com) and buttons (right, lowes.com) are the two most common ways of allowing users to select items for an interactive comparison table.*\n\nProduct listing pages tend to be overcrowded, so one major challenge for this implementation is making the *Compare*buttons discoverable without giving them too much space on the page. The safest option is to **include *Compare* buttons as secondary action buttons**, either at the top and bottom of the page, or beneath all product descriptions.\n\n#### Direct Manipulation of Items\n\nWith this method, **users can click or drag the products that they want to add** to the comparison table. Usually, this action is possible because, like in Garmin’s example below, a special *Compare*mode disables the regular meaning of clicking on a product. This can also be achieved by adding a separate *Compare* page, seen in the bottom right-hand corner of the example.\n\n![A screenshot of Garmin.com showing the compare button at the top of product listings.](https://media.nngroup.com/media/editor/2024/02/02/garmin-marine-radars.png)\n\n❌ *garmin.com: Although the grey ghost button faded into the UI and was not easily noticeable, this Garmin example wasn't all bad. It featured a* COMPARE *button at the top of its product-listing page. When pressed, it would add the product to a comparison table instead of leading to a detail page.*\n\nOne advantage of this direct-manipulation approach to selection is the opportunity to separate the comparison activity from the product-listing page, keeping that view visually cleaner.\n\nA separate comparison page (like Fitbit’s) is a good option when you don’t have enough products or offerings to justify a traditional listing page in the first place.\n\n## Best Practices for Comparison Tables\n\nRegardless of which type of comparison table you choose, follow these best practices to support your users’ decision making.\n\n### Use Comparison Tables for Up to 5 Items\n\nComparison tables support compensatory decision making, in which people engage only when they have relatively few alternatives to consider. When more than 5 items need to be compared, add other mechanisms such as filters to help users narrow down the larger set of possibilities to 5 or fewer.\n\n**For static comparison tables,** err on the side of simplicity. If you can’t keep a static table down to at most 5 comparable options, reconsider if it should be a static comparison table at all. Depending on the complexity of the information you’re presenting, even 5 options may be too many.\n\n**For dynamic tables,** consider whether the layout will scale gracefully up to 5 items if users have the freedom to select what those 5 items will be. Most dynamic comparison tables accept 3–4 items only. Consider how much text will need to be included for the attributes, and how that will impact layout and readability.\n\nAlso consider **the size of the user’s device or browser.** You may need to reduce the number of items to two for presentation on mobile. On the other hand, don’t force users to compare only two items at a time if you have the space to show more.\n\n![A screenshot of the Apple website comparing Mac computers. The comparison table takes up a small portion of the middle of the screen but the rest is white space. ](https://media.nngroup.com/media/editor/2024/02/02/applebigscreenshot.png)\n\n❌ *Apple’s dynamic comparison table for its Mac computers unnecessarily restricted users to comparing two items, even at very large screen sizes (shown here on a 3008x1692 resolution monitor.)*\n\nWhatever your limit, make sure you clearly communicate it to your users to avoid confusion and errors. And don’t forget to let users remove items from the comparison, as they narrow down their selections.\n\n### Be Consistent\n\n**The biggest problem with most comparison tables isn’t design, it’s content**. When attribute information is missing, incomplete, or inconsistent across similar offerings, otherwise handy comparison tables quickly become useless. This is especially problematic for dynamic comparison tables, when you’re dealing with many offerings with slightly different metadata available.\n\n![A screenshot of two cameras in a comparison table. One is missing metadata.](https://media.nngroup.com/media/editor/2024/02/02/compare-best-buy.png)\n\n❌ *bestbuy.com: This comparison table displayed the attributes for 2 different cameras sold by Best Buy. The metadata for the Sony Alpha 7 camera was much richer. It can be challenging to keep the metadata consistent and up to date, especially when companies sell many products from many different manufacturers. However, if the information isn’t complete for all compared products, it might as well not be in a comparison table at all.*\n\n![A screenshot of a comparison table on Smugmug.com. This comparison table is playful with all of the plans having the exact same features. ](https://media.nngroup.com/media/editor/2024/02/02/smugmugzip.png)\n\n❌ *smugmug.com: This comparison table detailed the features of SmugMug’s four membership levels, with each column having a different value for the attribute* Ads and spam*:* Zip, Zero, Zilch, *and* Nada*. Comparison-table values aren’t a good place to showcase your site’s personality — it’d be better to leave these values equivalent and not distract users while they scan for differences.*\n\n### Support Scannability\n\nComparing the pros and cons of different products is a cognitively demanding process. You want to make sure your users can focus on the essentials. An effective way to do this is to **make the table easy to scan for differences, similarities, and keywords.**\n\nStick to the standard table layout: options as columns, attributes as rows, with row labels on the left and column labels above. Use consistent text alignment in each column.\n\n![A long comparison table showing the different features of the All-Clad pan line. ](https://media.nngroup.com/media/editor/2024/02/02/all-clad-cookware-buying-guide-_-williams-sonoma.png)\n\n❌ *williams-sonoma.com: Williams Sonoma did a good job categorizing pans for this static comparison table. Unfortunately, the horizontal row headers were nonstandard and impeded scannability. The narrow paragraphs under* DISTINGUISHING FEATURES *are not scannable or easy to read.*\n\nWhen using text within comparison tables, keep it short. Whenever possible, avoid full sentences.\n\nColor coding can help as well — either lightly shading the backgrounds of each column, or coloring the text of the cells. Just make sure you’re maintaining enough contrast and not sacrificing readability.\n\n![A comparison table of three FitBits. Each FitBit has a different color representing its features in the table. From left to right: navy blue, light blue, and black. ](https://media.nngroup.com/media/editor/2024/02/02/smartwatches-_-shop-fitbit.png)\n\n✅ *FitBit.com used a different color for each column’s checkmarks to help users clearly differentiate between each product’s features. This color-coding approach wouldn’t work quite as well for more complex attribute values that can’t be expressed in checkmarks.*\n\n![This is a comparison table for TechSmith's various software offerings. Each column is a different color to show the distinct offerings. ](https://media.nngroup.com/media/editor/2024/02/02/techsmith.png)\n\n✅ *techsmith.com used color-coded columns to show the different features available in its software offerings, as well as which platforms they could be used on.*\n\nIt’s also important to clearly indicate rows so users can easily tell which attribute a cell refers to, especially when using symbols like checkmarks that can’t stand alone. Row borders, row shading, or extra spacing can help keep the rows distinct and separate.\n\n### Sticky Column Headers\n\nEspecially when dealing with long lists of attributes that occupy several screenfuls, **keep column headers fixed as users scroll.** Human short-term memory is limited, and users will easily forget which column is for which product.\n\n![This is a screenshot of the Adobe comparison table. The screenshot shows the table scrolled slightly lower on the page, obscuring the column headers. ](https://media.nngroup.com/media/editor/2024/02/02/adobe.png)\n\n❌ *adobe.com: Adobe offered a static comparison table to help its customers compare different annual plans.**Unfortunately, it didn’t have fixed column headers, so users were forced to remember column names or scroll back up the page to check which column was for what.*\n\n### Meaningful Attributes\n\nYour comparison table should include attributes that your users will actually care about. Don’t just throw every piece of metadata you have into the table, because it will make the job harder for users.\n\nAs much as possible, **try to define unfamiliar terms in context**, and connect vague attributes to something concrete.\n\nFor example, Anker’s comparison table has attributes that are useful in the context of comparing portable power banks: battery capacity in mAh, charging speed, and weight. What really makes this a good comparison table is the fact that it translates those attributes into things that would be meaningful for the average consumer. The battery capacity is *3350 mAh,* which is approximately *1.2 iPhone 6 charges.* The size is *3.5 x 0.9 x 0.9 inches* — about the size of a tube of lipstick. The weight is *2.7 oz,* which is similar to an egg’s weight. The average consumer may have trouble imagining what 2.7 oz feels like, but can probably imagine the weight of an egg.\n\n![A screenshot of a comparison table of Amazon portable chargers. Under size, each product has its dimensions in inches but also in the size of a similar household product. For example the three chargers from left to right are labeled: lipstick, candybar, and candybar. ](https://media.nngroup.com/media/editor/2024/02/02/amazonsize.png)\n\n✅ *amazon.com: The manufacturer’s product-comparison table translated technical attributes into language that was understandable by the average consumer.*\n\nAnother effective way to make obscure attributes meaningful is to **include links to more information or in-context tooltips with definitions or clarifying information**.\n\n![When hovered over, Dropbox will show a tool tip explaining the features of their signing tool.](https://media.nngroup.com/media/editor/2024/02/02/dropboxtooltip.png)\n\n✅ *dropbox.com: The hover-activated tooltip clarified the meaning of the attributes without adding extra text to the page.*\n\n### Give Users Control\n\nEven if you do a good job making the entries scannable or the headers sticky, it can be hard for users to compare products with many attributes, especially when these attributes span several screenfuls. In those situations, users may have to scroll back and forth between different rows as they compare the pros and cons of different products.\n\nIn order to make the task manageable, **consider allowing users to select which attributes they want displayed in the table**. Collapsible rows are an easy implementation for this feature.\n\nAlternatively, let users hide the rows for which all offerings are similar, and only show the differences.\n\n![Screenshot showing how Bestbuy will highlight differences in their comparison table](https://media.nngroup.com/media/editor/2024/02/02/compare-best-buy-washer.png)\n\n✅ *bestbuy.com: Users could easily identify differences (seen in yellow) between products by selecting the* Highlight Differences *switch on this comparison table.*\n\nFor simple static comparison tables, consider presenting a simplified table with those attributes you expect will be most important to users, but also allow access to a more detailed table.\n\n![This is a screenshot of SmugMug's at-a-glance comparison table. To make it easy to understand, the table only has a few comparison points and the main differences, like price, at the top. ](https://media.nngroup.com/media/editor/2024/02/02/smugmug-prices-plans.png)\n\n✅ *smugmug.com: For its 3 plan options, SmugMug presented a very simplified “at a glance” comparison table.*\n\n![This is the more detailed version of the SmugMug comparison table. Unlike the at-a-glance, this table compares all factors of the plan.](https://media.nngroup.com/media/editor/2024/02/02/smugmug-prices-plans-copy.png)\n\n*smugmug.com: The much more detailed full comparison table was available on a different page.*\n\n### Simplify the Comparison for Mobile\n\nSome websites just remove their comparison functionality altogether for small devices. If at all possible, **you should try to support some level of comparison on mobile**, but it’s unlikely that you’ll be able to show more than 2 items at a time in a comparison table. Remember that on smaller screens, fewer rows will be visible at a time and more strain will be placed on the user’s short-term memory. Therefore, following the previous recommendations (especially making entries scannable and giving users control to choose what they want to display) will be even more important on mobile.\n\nIf a true comparison table on a mobile devices is impractical for your offerings, you might alternatively consider converting the table to tabs or lists for small screens. Just remember that these formats do not support compensatory decision making as well, because users have to remember the attributes for each products in order to weigh pros and cons.\n\n![This is a screenshot of Shopify's mobile comparison table. Instead of showing all the plans on one screen. The user can click tabs at the top to select the plan they want to look at. ](https://media.nngroup.com/media/editor/2024/02/02/shopifymobile.jpeg)\n\n*✅* *shopify.com: One strategy for making comparison tables work on mobile is converting the columns to tabs. This means users can’t do true side-by-side comparison like they can on a full table, but at least they will be able to switch among products more easily than if they had to scroll or switch mobile-browser tabs.*\n\n## The Golden Rule of Comparison Tables\n\nTo sum up many of the guidelines we’ve listed here: **Above all else, do the work for the consumer.** Don’t slow them down with nonstandard or overly long tables with repeated information; don’t ask them to hold things in their memory; and don’t make them Google terms they aren’t familiar with.\n\n**Make your users’ decisions as easy as possible**: you’ll be happy, and they’ll be happy.\n\ncomparison,Psychology and UX,ui elements,Ecommerce,Web Usability\n\n## Related Topics\n\n- Psychology and UX\n  [Psychology and UX](/topic/psychology-and-ux/)\n- [Ecommerce](/topic/e-commerce/)\n- [Web Usability](/topic/web-usability/)\n\n## Learn More:\n\n[![Comparison Tables: 5 Scenarios When Not to Use Them](https://media.nngroup.com/media/videos/thumbnails/Comparison_Tables-_5_Scenarios_When_Not_to_Use_Them_Thumbnail.jpg.1300x728_q75_autocrop_crop-smart_upscale.jpg)](https://www.youtube.com/watch?v=POsaV2YzRr8 \"Comparison Tables: 5 Scenarios When Not to Use Them on YouTube (new window)\")\n\nEnable cookies\n to watch NN/g videos\n\nComparison Tables: 5 Scenarios When Not to Use Them\n\n Taylor Dykes\n·\n3 min\n\n- [![](https://media.nngroup.com/media/videos/thumbnails/Semantic_Differential_Scales-_Measure_User_Attitudes_with_Nuance_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Semantic Differential Scales: Measure User Attitudes with Nuance\n\n  Rachel Banawa\n  ·\n  4 min](/videos/semantic-differential-scales/?lm=comparison-tables&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Teslers_Law-_Shift_Complexity_to_Simplify_UX_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Tesler’s Law: Shift Complexity to Simplify UX\n\n  Lola Famulegun\n  ·\n  3 min](/videos/teslers-law/?lm=comparison-tables&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Inattentional_Blindness_in_Interfaces_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Inattentional Blindness in Interfaces\n\n  Megan Chan\n  ·\n  4 min](/videos/inattentional-blindness-in-interfaces/?lm=comparison-tables&pt=article)\n\n## Related Articles:\n\n- [Web UX: Study Guide\n\n  Huei-Hsin Wang\n  ·\n  15 min](/articles/web-ux-study-guide/?lm=comparison-tables&pt=article)\n- [Accordions on Desktop: When and How to Use\n\n  Huei-Hsin Wang\n  ·\n  10 min](/articles/accordions-on-desktop/?lm=comparison-tables&pt=article)\n- [Interaction Cost\n\n  Raluca Budiu\n  ·\n  7 min](/articles/interaction-cost-definition/?lm=comparison-tables&pt=article)\n- [Beyond Accessibility: Treating Users with Disabilities as People\n\n  Jakob Nielsen\n  ·\n  5 min](/articles/beyond-accessibility-treating-users-with-disabilities-as-people/?lm=comparison-tables&pt=article)",
  "tags": [
    "nngroup",
    "usability",
    "research",
    "heuristics"
  ],
  "extracted_at": "2026-02-03T12:44:59.682383+00:00",
  "content_length": 20158,
  "content_hash": "f466d76dfa696b31"
}