{
  "id": "nngroup__articles_f-shaped-pattern-reading-web-content_",
  "source_id": "nngroup",
  "source_name": "Nielsen Norman Group Articles",
  "category": "ux_research",
  "url": "https://www.nngroup.com/articles/f-shaped-pattern-reading-web-content/",
  "title": "F-Shaped Pattern of Reading on the Web: Misunderstood, But Still Relevant (Even on Mobile)",
  "content": "8\nF-Shaped Pattern of Reading on the Web: Misunderstood, But Still Relevant (Even on Mobile)\nKara Pernice\nKara Pernice\nNovember 12, 2017\n2017-11-12\nShare\nEmail article\nShare on LinkedIn\nShare on Twitter\nSummary:\nEyetracking research shows that people scan webpages and phone screens in various patterns, one of them being the shape of the letter F. Eleven years after discovering this pattern, we revisit what it means today.\nIn This Article:\nIntroduction\nThe F-Shaped Pattern\nThe F-Shaped Pattern Is Not the Only Scanning Pattern\nWhy People Scan in an F-Shaped Pattern\nThe F-Shape Is Bad for Users and Businesses\nThe Best Antidotes to the F-Shaped Pattern\nSummary\nIntroduction\nAmong NN/g’s contributions to the world of UX, perhaps one of the most cited is the\nF-shaped reading pattern\nfor web content, which we identified in 2006. Over the years, many have referred to this research, sometimes correctly, and in many other instances misinterpreting it. In this article, we aim to report on recent research revisiting it and also to clarify some of the misconceptions related to the F-pattern. In particular:\nScanning on the web does not always take the shape of an F. There are other\ncommon scanning patterns\ntoo.\nThe F-pattern is negative for users and businesses.\nGood design can\nprevent F-shape scanning\n.\nThis is one of the first examples of the F-pattern from our studies in the early 2000s. This heatmap aggregates gazes from more than 45 people trying to learn what happened in Galveston Texas in 1900. The top, most read section of the heatmap (represented with the color red) resembles the capital letter “F”.\nThe F-Shaped Pattern\nIn the F-shaped scanning pattern is characterized by many fixations concentrated at the top and the left side of the page. Specifically:\nUsers first read in a\nhorizontal movement\n, usually across the upper part of the content area. This initial element forms the F’s top bar.\nNext, users move down the page a bit and then read across in a\nsecond horizontal\nmovement that typically covers a shorter area than the previous movement. This additional element forms the F’s lower bar.\nFinally, users scan the content’s left side in a\nvertical movement\n. Sometimes this is a slow and systematic scan that appears as a solid stripe on an eyetracking heatmap. Other times users move faster, creating a spottier heatmap. This last element forms the F’s stem.\nThe implications of this pattern are:\nFirst lines\nof text on a page receive more gazes than subsequent lines of text on the same page.\nFirst few words\non the left of each line of text receive more fixations than subsequent words on the same line.\nThus, on the first lines of text, people will scan more words on the right than on the following lines. This scanning pattern\nresembles\nthe shape of the letter F, but it is rarely a\nperfect\nF. For example, in some cases, people may become interested in a paragraph down the page and may fixate on more words, reading toward the right again, so the pattern comes to resemble an E.\nThe F-shaped pattern applies to users’ reading of the\ncontent area\nof the web page. Thus, it describes people’s behavior when they visit a web page and assess its content, not their behavior when they are in a new section of the website and inspect the navigation bars (typically at the top and/or left of the page) to decide where to go next. So, in an F-pattern, the gazes on the left fall on the left part\nof the content area\n, not on the very leftmost part of the full page, if the left column is occupied by a navigation rail.\nOur recent eyetracking research shows that the F-shaped\nscanning\npattern is alive and well in today’s world — both on desktop and on mobile. A typical example of the\nlongevity of UX findings\nwhich depend more on human behavior than on technology.\nTigersinCrisis.com: This heatmap from our new study aggregates data from 47 people as they tried to learn how many Sumatran tigers live in the wild. The red color on this heatmap is an example of the F-shaped pattern — same today as 11 years ago.\nYour browser does not support the video tag.\nThis gaze replay shows a mobile user scanning in the F-pattern as he researches portrait camera lenses. The red hollow circle represents where he is fixating. (In most browsers, hover over the video to display the controls if they're not already visible.)\nYour browser does not support the video tag.\nAnother example of an F-pattern on mobile came from a study participant who was using  http://bacnyc.org to learn where Mikhail Baryshnikov studied dance. The text columns were wider than the screen, so she swiped horizontally as she was reading. (In most browsers, hover over the video to display the controls if they're not already visible.)\nOur recent round of eyetracking research also showed that in right-to-left languages such as Arabic, people read in a flipped F-shaped pattern (as we had predicted but had not seen prior to this research).\nYour browser does not support the video tag.\nThe F-pattern is mirrored in right-to-left languages, such as Arabic, as shown in this gaze replay of a user reading an article about a skeet-shooting competition on an Arabic news site. (In most browsers, hover over the video to display the controls if they're not already visible.)\nThe F-Shaped Pattern Is Not the Only Scanning Pattern\nIn addition to the F-shaped pattern, there are many other possible scanning patterns, including those listed below:\nLayer-cake pattern\noccurs when the eyes scan headings and subheadings and skip the normal text below. A gaze plot or heat map of this behavior will show horizontal lines, reminiscent of a cake with alternating layers of cake and frosting.\nSpotted pattern\nconsists of skipping big chunks of text and scanning as if looking for something specific, such as a\nlink\n,\ndigits\n, a particular word or a set of words with a distinctive shape (such as an address or signature).\nMarking pattern\ninvolves keeping the eyes focused in one place as the mouse scrolls or finger swipes the page, like a dancer fixates on an object to keep balance as she twirls. Marking happens more on mobile than on desktop.\nBypassing pattern\noccurs when people deliberately skip the first words of the line when multiple lines of text in a list start all with the same word(s).\nCommitment pattern\nconsists of fixating on almost everything on the page. If people are highly motivated and interested in content, they will read all the text in a paragraph or even an entire page. (Don’t count on this to happen frequently, though. Assume that most users will be scanning.)\nWhy People Scan in an F-Shaped Pattern\nPeople scan in an F-shape when all of these 3 elements are present:\nA page or a section of a page includes text that has little or no formatting for the web. For example, it has a “wall of text” but no bolding, bullets, or subheadings.\nThe user is trying to be most efficient on that page.\nThe user is not so committed or interested that he is willing to read every word.\nThe last two elements pretty much summarize all web behavior: the vast majority of the web users would rather finish their tasks as fast as possible with the minimum amount of effort; they visit a page because they want to find a quick answer rather than read a dissertation on the topic and educate themselves.\nWhen writers and designers have not taken any steps to direct the user to the most relevant, interesting, or helpful information, users will then find their own path. In the absence of any signals to guide the eye, they will choose the path of minimum effort and will spend most of their fixations close to where they start reading (which is usually the top left most word on a page of text).  It's not that people will always scan the page in the shape of an F. Although years of reading have likely trained people into thinking that more important content comes before less important content, no user really feels that the content has been arranged so the most important things appear in an F shape. The F-pattern is the default pattern when there are no strong cues to attract the eyes towards meaningful information.\nPeople tend to minimize\ninteraction cost\nand maximize the benefit they get from the work they do. For their eyes, this translates to spending few fixations, while still gleaning the information they need; being productive, engaged, and successful with what they take in from those fixations. Economizing on time means fewer fixations — looking at fewer words.\nIn some cases, people will get bored or fatigued as they scan text. Other times, the words they read offer only a weak\ninformation scent\n, which may be enough gratification to continue scanning, but not enough to read more of the text.\nThe F-Shape Is Bad for Users and Businesses\nWhen people scan in an F-shape, they miss big chunks of content based merely on how text flows in a column. The skipped phrases and words are often as important — or even more important — as those words that are read. But users won’t realize this, since by definition they don’t know what they don’t see.\nHistory.com. A study participant’s F-shaped gaze plot, as she was scanning a page containing much prose and very little formatting (Each blue dot signifies a fixation. The lines between the dots represent saccades in which the user is moving the eyes and is virtually blind. These lines help us to follow the fixations more easily. Larger dots represent longer fixations, and the numbers denote the sequence.)\nIn\nresponsive design\n, or any\nliquid-text layout\nfor that matter, text flows differently depending on window size. So, a user who scans in an F-shape on his phone, for example, would not fixate on the same words if he F-scanned the same page on a desktop— just because of the way the content flows in different viewport sizes.\nMake no mistake, the F-shaped scanning pattern is bad for users and businesses: it means that users may skip important content simply because it appears on the right side of the page. Good web formatting reduces the impact of F-scanning. If your pages have big chunks of unformatted text, people will scan it in an F-shape.\nIf scanning in an F-pattern is bad for users, why do they do it so often that it’s their dominant behavior on the web? Because it’s really only “bad” in terms of their ability to get the maximum benefit from their visit to\nyour\nwebsite. However, users don’t aim to maximize the benefits from a single website. They aim to optimize their cost–benefit ratio from their use of the\nweb as a whole\n. Your website is like a grain of sand on the beach in comparison to the entire Internet. To build a nice sand castle — to stay with the metaphor — you can’t waste time searching out particularly smooth grains of sand. You have to scoop up sand by the bucketful. Similarly, users gain value from the web by dipping into multiple websites and spending little effort on each, often using\npage parking\nto keep many sites open concurrently.\nThe Best Antidotes to the F-Shaped Pattern\nDo the work for the users instead of forcing them to exert effort and take bad shortcuts. Prioritize and format text to direct users to what you want them to see, and to what you know they want to see. Some simple tips:\nInclude the most\nimportant points in the first two paragraphs\non the page.\nUse\nheadings\nand subheadings. Ensure they look more important, and are more visible, than normal text so users may distinguish them quickly.\nStart headings and subheadings with the words carrying most information\n: if users see only the first 2 words, they should still get the gist of the following section.\nVisually group small amounts of related content — for instance, by surrounding them with a border or using a different background.\nBold\nimportant words and phrases.\nTake advantage of the different\nformatting of links\n, and ensure that links\ninclude information-bearing words\n(instead of generic “go”, “click here” or “more”). This technique also improves\naccessibility\nfor users who hear links read aloud instead of scanning the content visually.\nUse bullets and numbers to call out items in a\nlist\nor process.\nCut\nunnecessary content\n.\nSummary\nScanning on the web is dictated by:\nUsers’\nmotivation\nGoals they are trying to achieve\nLayout of the page and formatting of text\nPage content\nIt’s hard to control people’s motivation or their goals, but you can optimize content and presentation so that users can find what they need quickly. In particular, use good web-formatting techniques to draw attention to the most important information instead of relying on the arbitrary words that people may fixate on when they scan in an F-shape.\nFor more information about the F-Shaped pattern and other scanning patterns, see our:\nOriginal research from 2006:\nF-Shaped Pattern For Reading Web Content\nReport\nHow People Read on the Web: The Eyetracking Evidence\nRelated Courses\nWriting Compelling Digital Copy\nUse UX writing to shape your content to meet your readers' needs\nInteraction\nMobile User Experience\nEssential UX design principles for small-screen websites and apps\nInteraction\nWriting for the Web,Eyetracking,readability,legibility\nRelated Topics\nWriting for the Web\nWriting for the Web\nEyetracking\nLearn More:\nEnable cookies\nto watch NN/g videos\nF-Pattern in Reading Digital Content\nKara Pernice\n·\n3 min\n4 Tips for Bulleted Lists in Digital Content\nKate Moran\n·\n3 min\nThe Biggest Mistake in Writing for the Web\nKate Moran\n·\n3 min\nWhy Chunking Content is Important\nKate Moran\n·\n2 min\nRelated Articles:\nHorizontal Attention Leans Left\nTherese Fessenden\n·\n5 min\nHow People Read Online: New and Old Findings\nKate Moran\n·\n9 min\nReading Content on Mobile Devices\nKate Moran\n·\n8 min\n5 Formatting Techniques for Long-Form Content\nHuei-Hsin Wang and  Megan Chan\n·\n8 min\nThe Layer-Cake Pattern of Scanning Content on the Web\nKara Pernice\n·\n8 min\nDealing with Technical or Professional Jargon\nKate Moran\n·\n9 min",
  "content_markdown": "8\n\n# F-Shaped Pattern of Reading on the Web: Misunderstood, But Still Relevant (Even on Mobile)\n\nKara Pernice\n\n![](https://media.nngroup.com/media/people/photos/kara-2025.jpg.256x256_q75_autocrop_crop-smart_upscale.jpg)\n\n[Kara Pernice](/articles/author/kara-pernice/)\n\nNovember 12, 2017\n2017-11-12\n\n[Share](#)\n\n- [Email article](mailto:?subject=NN/g Article: F-Shaped Pattern of Reading on the Web: Misunderstood, But Still Relevant (Even on Mobile)&body=https://www.nngroup.com/articles/f-shaped-pattern-reading-web-content/)\n- [Share on LinkedIn](http://www.linkedin.com/shareArticle?mini=true&url=http://www.nngroup.com/articles/f-shaped-pattern-reading-web-content/&title=F-Shaped Pattern of Reading on the Web: Misunderstood, But Still Relevant (Even on Mobile)&source=Nielsen%20Norman%20Group)\n- [Share on Twitter](https://twitter.com/intent/tweet?url=http://www.nngroup.com/articles/f-shaped-pattern-reading-web-content/&text=F-Shaped Pattern of Reading on the Web: Misunderstood, But Still Relevant (Even on Mobile)&via=nngroup)\n\nSummary: \nEyetracking research shows that people scan webpages and phone screens in various patterns, one of them being the shape of the letter F. Eleven years after discovering this pattern, we revisit what it means today.\n\n## In This Article:\n\n- [Introduction](#toc-introduction-1)\n- [The F-Shaped Pattern](#toc-the-f-shaped-pattern-2)\n- [The F-Shaped Pattern Is Not the Only Scanning Pattern](#toc-the-f-shaped-pattern-is-not-the-only-scanning-pattern-3)\n- [Why People Scan in an F-Shaped Pattern](#toc-why-people-scan-in-an-f-shaped-pattern-4)\n- [The F-Shape Is Bad for Users and Businesses](#toc-the-f-shape-is-bad-for-users-and-businesses-5)\n- [The Best Antidotes to the F-Shaped Pattern](#toc-the-best-antidotes-to-the-f-shaped-pattern-6)\n- [Summary](#toc-summary-7)\n\n## Introduction\n\nAmong NN/g’s contributions to the world of UX, perhaps one of the most cited is the [F-shaped reading pattern](https://www.nngroup.com/articles/f-shaped-pattern-reading-web-content-discovered/) for web content, which we identified in 2006. Over the years, many have referred to this research, sometimes correctly, and in many other instances misinterpreting it. In this article, we aim to report on recent research revisiting it and also to clarify some of the misconceptions related to the F-pattern. In particular:\n\n1. Scanning on the web does not always take the shape of an F. There are other [common scanning patterns](https://www.nngroup.com/articles/text-scanning-patterns-eyetracking/) too.\n2. The F-pattern is negative for users and businesses.\n3. Good design can [prevent F-shape scanning](https://www.nngroup.com/articles/layer-cake-pattern-scanning/).\n\n![](https://media.nngroup.com/media/editor/2017/11/08/read_image_1900storm_third_watermark.png)\n\n*This is one of the first examples of the F-pattern from our studies in the early 2000s. This heatmap aggregates gazes from more than 45 people trying to learn what happened in Galveston Texas in 1900. The top, most read section of the heatmap (represented with the color red) resembles the capital letter “F”.*\n\n## The F-Shaped Pattern\n\nIn the F-shaped scanning pattern is characterized by many fixations concentrated at the top and the left side of the page. Specifically:\n\n1. Users first read in a **horizontal movement**, usually across the upper part of the content area. This initial element forms the F’s top bar.\n2. Next, users move down the page a bit and then read across in a **second horizontal** movement that typically covers a shorter area than the previous movement. This additional element forms the F’s lower bar.\n3. Finally, users scan the content’s left side in a **vertical movement**. Sometimes this is a slow and systematic scan that appears as a solid stripe on an eyetracking heatmap. Other times users move faster, creating a spottier heatmap. This last element forms the F’s stem.\n\nThe implications of this pattern are:\n\n- **First lines** of text on a page receive more gazes than subsequent lines of text on the same page.\n- **First few words** on the left of each line of text receive more fixations than subsequent words on the same line.\n\nThus, on the first lines of text, people will scan more words on the right than on the following lines. This scanning pattern *resembles* the shape of the letter F, but it is rarely a *perfect* F. For example, in some cases, people may become interested in a paragraph down the page and may fixate on more words, reading toward the right again, so the pattern comes to resemble an E.\n\nThe F-shaped pattern applies to users’ reading of the **content area** of the web page. Thus, it describes people’s behavior when they visit a web page and assess its content, not their behavior when they are in a new section of the website and inspect the navigation bars (typically at the top and/or left of the page) to decide where to go next. So, in an F-pattern, the gazes on the left fall on the left part *of the content area*, not on the very leftmost part of the full page, if the left column is occupied by a navigation rail.\n\nOur recent eyetracking research shows that the F-shaped [scanning](https://www.nngroup.com/articles/how-users-read-on-the-web/) pattern is alive and well in today’s world — both on desktop and on mobile. A typical example of the [longevity of UX findings](https://www.nngroup.com/articles/usability-guidelines-change/) which depend more on human behavior than on technology.\n\n![](https://media.nngroup.com/media/editor/2017/11/08/tigersincrisis-heat_corrected_cropped_watermark.png)\n\n*TigersinCrisis.com: This heatmap from our new study aggregates data from 47 people as they tried to learn how many Sumatran tigers live in the wild. The red color on this heatmap is an example of the F-shaped pattern — same today as 11 years ago.*\n\n[![Your browser does not support the video tag.](https://media.nngroup.com/media/editor/2017/11/08/camera-lens_blane_poster.png)](https://media.nngroup.com/media/editor/2017/11/08/fpattern_mobile_cam-lens_p10_blane_19april2017_small.mp4)\n\n*This gaze replay shows a mobile user scanning in the F-pattern as he researches portrait camera lenses. The red hollow circle represents where he is fixating. (In most browsers, hover over the video to display the controls if they're not already visible.)*\n\n[![Your browser does not support the video tag.](https://media.nngroup.com/media/editor/2017/11/09/baryshnikov_fpattern_poster.png)](https://media.nngroup.com/media/editor/2017/11/09/fpattern_mobile_mbary_education_p8_mitzi_april192017_smallest3.mp4)\n\n*Another example of an F-pattern on mobile came from a study participant who was using  http://bacnyc.org to learn where Mikhail Baryshnikov studied dance. The text columns were wider than the screen, so she swiped horizontally as she was reading. (In most browsers, hover over the video to display the controls if they're not already visible.)*\n\nOur recent round of eyetracking research also showed that in right-to-left languages such as Arabic, people read in a flipped F-shaped pattern (as we had predicted but had not seen prior to this research).\n\n[![Your browser does not support the video tag.](https://media.nngroup.com/media/editor/2017/11/09/arabic_f-pattern_poster.png)](https://media.nngroup.com/media/editor/2017/11/08/fpattern_dt_read-arabic-news_p509_mohamed_no_sound_small.mp4)\n\n*The F-pattern is mirrored in right-to-left languages, such as Arabic, as shown in this gaze replay of a user reading an article about a skeet-shooting competition on an Arabic news site. (In most browsers, hover over the video to display the controls if they're not already visible.)*\n\n## The F-Shaped Pattern Is Not the Only Scanning Pattern\n\nIn addition to the F-shaped pattern, there are many other possible scanning patterns, including those listed below:\n\n- **Layer-cake pattern** occurs when the eyes scan headings and subheadings and skip the normal text below. A gaze plot or heat map of this behavior will show horizontal lines, reminiscent of a cake with alternating layers of cake and frosting.\n- **Spotted pattern** consists of skipping big chunks of text and scanning as if looking for something specific, such as a [link](https://www.nngroup.com/articles/link-promise/), [digits](https://www.nngroup.com/articles/web-writing-show-numbers-as-numerals/), a particular word or a set of words with a distinctive shape (such as an address or signature).\n- **Marking pattern** involves keeping the eyes focused in one place as the mouse scrolls or finger swipes the page, like a dancer fixates on an object to keep balance as she twirls. Marking happens more on mobile than on desktop.\n- **Bypassing pattern** occurs when people deliberately skip the first words of the line when multiple lines of text in a list start all with the same word(s).\n- **Commitment pattern** consists of fixating on almost everything on the page. If people are highly motivated and interested in content, they will read all the text in a paragraph or even an entire page. (Don’t count on this to happen frequently, though. Assume that most users will be scanning.)\n\n## Why People Scan in an F-Shaped Pattern\n\nPeople scan in an F-shape when all of these 3 elements are present:\n\n1. A page or a section of a page includes text that has little or no formatting for the web. For example, it has a “wall of text” but no bolding, bullets, or subheadings.\n2. The user is trying to be most efficient on that page.\n3. The user is not so committed or interested that he is willing to read every word.\n\nThe last two elements pretty much summarize all web behavior: the vast majority of the web users would rather finish their tasks as fast as possible with the minimum amount of effort; they visit a page because they want to find a quick answer rather than read a dissertation on the topic and educate themselves.\n\nWhen writers and designers have not taken any steps to direct the user to the most relevant, interesting, or helpful information, users will then find their own path. In the absence of any signals to guide the eye, they will choose the path of minimum effort and will spend most of their fixations close to where they start reading (which is usually the top left most word on a page of text).  It's not that people will always scan the page in the shape of an F. Although years of reading have likely trained people into thinking that more important content comes before less important content, no user really feels that the content has been arranged so the most important things appear in an F shape. The F-pattern is the default pattern when there are no strong cues to attract the eyes towards meaningful information.\n\nPeople tend to minimize [interaction cost](https://www.nngroup.com/articles/interaction-cost-definition/) and maximize the benefit they get from the work they do. For their eyes, this translates to spending few fixations, while still gleaning the information they need; being productive, engaged, and successful with what they take in from those fixations. Economizing on time means fewer fixations — looking at fewer words.\n\nIn some cases, people will get bored or fatigued as they scan text. Other times, the words they read offer only a weak [information scent](https://www.nngroup.com/articles/information-scent/), which may be enough gratification to continue scanning, but not enough to read more of the text.\n\n## The F-Shape Is Bad for Users and Businesses\n\nWhen people scan in an F-shape, they miss big chunks of content based merely on how text flows in a column. The skipped phrases and words are often as important — or even more important — as those words that are read. But users won’t realize this, since by definition they don’t know what they don’t see.\n\n![](https://media.nngroup.com/media/editor/2017/11/08/p14_kristine_history911_35secsegment_fpattern_cropped_watermark.png)\n\n*History.com. A study participant’s F-shaped gaze plot, as she was scanning a page containing much prose and very little formatting (Each blue dot signifies a fixation. The lines between the dots represent saccades in which the user is moving the eyes and is virtually blind. These lines help us to follow the fixations more easily. Larger dots represent longer fixations, and the numbers denote the sequence.)*\n\nIn [responsive design](https://www.nngroup.com/articles/responsive-web-design-definition/), or any [liquid-text layout](https://www.nngroup.com/articles/layout-vs-content/) for that matter, text flows differently depending on window size. So, a user who scans in an F-shape on his phone, for example, would not fixate on the same words if he F-scanned the same page on a desktop— just because of the way the content flows in different viewport sizes.\n\nMake no mistake, the F-shaped scanning pattern is bad for users and businesses: it means that users may skip important content simply because it appears on the right side of the page. Good web formatting reduces the impact of F-scanning. If your pages have big chunks of unformatted text, people will scan it in an F-shape.\n\nIf scanning in an F-pattern is bad for users, why do they do it so often that it’s their dominant behavior on the web? Because it’s really only “bad” in terms of their ability to get the maximum benefit from their visit to *your* website. However, users don’t aim to maximize the benefits from a single website. They aim to optimize their cost–benefit ratio from their use of the *web as a whole*. Your website is like a grain of sand on the beach in comparison to the entire Internet. To build a nice sand castle — to stay with the metaphor — you can’t waste time searching out particularly smooth grains of sand. You have to scoop up sand by the bucketful. Similarly, users gain value from the web by dipping into multiple websites and spending little effort on each, often using [page parking](https://www.nngroup.com/articles/multi-tab-page-parking/) to keep many sites open concurrently.\n\n## The Best Antidotes to the F-Shaped Pattern\n\nDo the work for the users instead of forcing them to exert effort and take bad shortcuts. Prioritize and format text to direct users to what you want them to see, and to what you know they want to see. Some simple tips:\n\n1. Include the most [important points in the first two paragraphs](https://www.nngroup.com/articles/website-reading/) on the page.\n2. Use [headings](https://www.nngroup.com/articles/headings-pickup-lines/) and subheadings. Ensure they look more important, and are more visible, than normal text so users may distinguish them quickly.\n3. [Start headings and subheadings with the words carrying most information](https://www.nngroup.com/articles/first-2-words-a-signal-for-scanning/): if users see only the first 2 words, they should still get the gist of the following section.\n4. Visually group small amounts of related content — for instance, by surrounding them with a border or using a different background.\n5. **Bold** important words and phrases.\n6. Take advantage of the different [formatting of links](https://www.nngroup.com/articles/guidelines-for-visualizing-links/), and ensure that links [include information-bearing words](https://www.nngroup.com/articles/writing-links/) (instead of generic “go”, “click here” or “more”). This technique also improves [accessibility](https://www.nngroup.com/reports/usability-guidelines-accessible-web-design/) for users who hear links read aloud instead of scanning the content visually.\n7. Use bullets and numbers to call out items in a [list](https://www.nngroup.com/articles/presenting-bulleted-lists/) or process.\n8. [Cut](https://www.nngroup.com/articles/condense-mobile-content/) [unnecessary content](https://www.nngroup.com/articles/blah-blah-text-keep-cut-or-kill/).\n\n## Summary\n\nScanning on the web is dictated by:\n\n- Users’ [motivation](https://www.nngroup.com/articles/fresh-start-effect/)\n- [Goals they are trying to achieve](https://www.nngroup.com/articles/eyetracking-tasks-efficient-scanning/)\n- Layout of the page and formatting of text\n- Page content\n\nIt’s hard to control people’s motivation or their goals, but you can optimize content and presentation so that users can find what they need quickly. In particular, use good web-formatting techniques to draw attention to the most important information instead of relying on the arbitrary words that people may fixate on when they scan in an F-shape.\n\nFor more information about the F-Shaped pattern and other scanning patterns, see our:\n\n- Original research from 2006: [F-Shaped Pattern For Reading Web Content](https://www.nngroup.com/articles/f-shaped-pattern-reading-web-content-discovered/)\n- Report [How People Read on the Web: The Eyetracking Evidence](https://www.nngroup.com/reports/how-people-read-web-eyetracking-evidence/)\n\n## Related Courses\n\n- [#### Writing Compelling Digital Copy\n\n  Use UX writing to shape your content to meet your readers' needs\n\n  Interaction](/courses/writing/?lm=f-shaped-pattern-reading-web-content&pt=article)\n- [#### Mobile User Experience\n\n  Essential UX design principles for small-screen websites and apps\n\n  Interaction](/courses/usability-mobile-websites-apps/?lm=f-shaped-pattern-reading-web-content&pt=article)\n\nWriting for the Web,Eyetracking,readability,legibility\n\n## Related Topics\n\n- Writing for the Web\n  [Writing for the Web](/topic/writing-web/)\n- [Eyetracking](/topic/eyetracking/)\n\n## Learn More:\n\n[![F-Pattern in Reading Digital Content](https://media.nngroup.com/media/videos/thumbnails/F-Pattern_Thumbnail.jpg.1300x728_q75_autocrop_crop-smart_upscale.jpg)](https://www.youtube.com/watch?v=XU1-Rz2Q7-E \"F-Pattern in Reading Digital Content on YouTube (new window)\")\n\nEnable cookies\n to watch NN/g videos\n\nF-Pattern in Reading Digital Content\n\n Kara Pernice\n·\n3 min\n\n- [![](https://media.nngroup.com/media/videos/thumbnails/4_Tips_for_Bulleted_Lists_in_Digital_Content_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  4 Tips for Bulleted Lists in Digital Content\n\n  Kate Moran\n  ·\n  3 min](/videos/tips-bulleted-lists-digital-content/?lm=f-shaped-pattern-reading-web-content&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/The_Biggest_Mistake_in_Writing_for_the_Web_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  The Biggest Mistake in Writing for the Web\n\n  Kate Moran\n  ·\n  3 min](/videos/biggest-mistake-writing-web/?lm=f-shaped-pattern-reading-web-content&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Why_Chunking_Content_is_Important_Thumbnail_Kate_M.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Why Chunking Content is Important\n\n  Kate Moran\n  ·\n  2 min](/videos/chunking/?lm=f-shaped-pattern-reading-web-content&pt=article)\n\n## Related Articles:\n\n- [Horizontal Attention Leans Left\n\n  Therese Fessenden\n  ·\n  5 min](/articles/horizontal-attention-leans-left/?lm=f-shaped-pattern-reading-web-content&pt=article)\n- [How People Read Online: New and Old Findings\n\n  Kate Moran\n  ·\n  9 min](/articles/how-people-read-online/?lm=f-shaped-pattern-reading-web-content&pt=article)\n- [Reading Content on Mobile Devices\n\n  Kate Moran\n  ·\n  8 min](/articles/mobile-content/?lm=f-shaped-pattern-reading-web-content&pt=article)\n- [5 Formatting Techniques for Long-Form Content\n\n  Huei-Hsin Wang and Megan Chan\n  ·\n  8 min](/articles/formatting-long-form-content/?lm=f-shaped-pattern-reading-web-content&pt=article)\n- [The Layer-Cake Pattern of Scanning Content on the Web\n\n  Kara Pernice\n  ·\n  8 min](/articles/layer-cake-pattern-scanning/?lm=f-shaped-pattern-reading-web-content&pt=article)\n- [Dealing with Technical or Professional Jargon\n\n  Kate Moran\n  ·\n  9 min](/articles/technical-jargon/?lm=f-shaped-pattern-reading-web-content&pt=article)",
  "tags": [
    "nngroup",
    "usability",
    "research",
    "heuristics"
  ],
  "extracted_at": "2026-02-03T12:42:51.580173+00:00",
  "content_length": 13909,
  "content_hash": "5801815ad88df336"
}