{
  "id": "nngroup__articles_hamburger-menus_",
  "source_id": "nngroup",
  "source_name": "Nielsen Norman Group Articles",
  "category": "ux_research",
  "url": "https://www.nngroup.com/articles/hamburger-menus/",
  "title": "Hamburger Menus and Hidden Navigation Hurt UX Metrics",
  "content": "12\nHamburger Menus and Hidden Navigation Hurt UX Metrics\nKara Pernice, Raluca Budiu\nKara Pernice\nand\nRaluca Budiu\nJune 26, 2016\n2016-06-26\nShare\nEmail article\nShare on LinkedIn\nShare on Twitter\nSummary:\nDiscoverability is cut almost in half by hiding a website’s main navigation. Also, task time is longer and perceived task difficulty increases.\nOur quantitative usability testing of hidden menus (such as hamburger icons) and visible menus (such as links across the top of pages) reveals that:\nHidden navigation is less discoverable\nthan visible or partially visible navigation.\nWhen navigation is hidden, users are less likely to use navigation.\nIf people use hidden navigation, they do so later in the task than if it were visible.\nHidden navigation\nprovides a worse user experience than visible\nor partially visible navigation does, in both mobile phones and desktop user interfaces. This finding holds true across multiple UX metrics including users’ assessment of task difficulty, time spent on task, and task success.\nOn desktops, hiding navigation degrades the experience and the navigation discoverability more than it does on the phones.\nHiding the navigation mostly affects content that is not directly accessible through an in-page link.\nIn This Article:\nWhy Study Hidden and Visible Navigation\nMeasures: Navigation Usage, Content Discoverability, Time, Task Difficulty\nNavigation Usage: Hidden Navigation Used Less and Later in the Task\nHidden Navigation Leads to Worse User Experience\nWhy Hidden Navigation Is Less Effective\nNavigation Recommendations\nWhy Study Hidden and Visible Navigation\nResponsive design\nhas\nmany merits\n; however, one of its less fortunate effects has been an excessive popularity of mobile-first designs that translate poorly onto larger desktop screens. To be clear, “mobile-first” itself is not the issue. Rather, the issue is taking sufficiently good mobile designs and porting them to desktops where they do not work as well.\nMobile-first\nshould not equal\nmobile-only.\n(Obviously, there’s a general principle here: if a design technique is intended to span platforms X and Y, then an uncompromising\nX-first\napproach will make Y an afterthought and harm users on Y. To design for X\nand\nY, you need to consider the strengths and needs of both and adapt the two versions of the website accordingly.)\nHidden navigation, such as the hamburger menu, is one of the many patterns inspired by mobile designs. Screen space is a precious commodity on mobile. To meet the challenge of\nprioritizing content\nwhile still making navigation (and other\nchrome\n) accessible, designers commonly rely on hiding the navigation under a menu — often indicated by the infamous hamburger icon. Like a cheap fast food chain, it got designers addicted to its convenience, and now serves millions each day, both on mobile devices and on desktops.\nWhile our qualitative user testing has repeatedly shown that\nnavigation hidden under a drop-down menu is less discoverable on the desktop\n, we wanted to measure the size of this effect in a quantitative study and assess the relative impact of hidden navigation on the desktop versus mobile. To do so, we partnered with\nWhatUsersDo\n(a company specializing in remote usability testing) to run a study with 179 participants who completed tasks on 6 different sites, both on smartphones and desktops. The results of this large study are reported in this article. An additional article includes our\ndetailed research methodology and images of the menus\ntested.\nMeasures: Navigation Usage, Content Discoverability, Time, Task Difficulty\nTo determine the effectiveness and usability of the different menus, we ran usability tests on the desktop and mobile versions of 6 different live websites with different types of navigation designs. Here are the types of navigation that we considered:\nHidden navigation\n: the main navigation links were placed under an icon (such as the hamburger) or button and required an explicit user action to be displayed.\nVisible navigation\n: the main navigation links were shown in a visible navigation bar and could thus be seen by a simple glance without needing any prior action.\nCombo navigation\n: some of the main navigation links were visible and some were hidden under a menu.\nNote that, for mobile devices, we did not fully test the visible-navigation condition. (Visible navigation is less common on mobile devices, and, due to other constraints in our study, we were not able to include this condition.) We tested the hidden and combo navigation conditions on mobile.\nWe wrote 2 simple tasks for each website. Some tasks could be completed without the use of the general site navigation, while other tasks required the use of navigation (or search). Here’s an example of a task:\n“Go to http://www.bbc.com and see if there is any information on nature or wildlife you are interested in. Once you find a particular article that is interesting, please say which one it is.”\nTo measure the effectiveness of these designs, we collected 5 metrics:\nNavigation use: whether participants used the navigation links at all\nTime to navigation: the time from the beginning of the task until the first use of the navigation in that task\nTask difficulty: participants’ assessment of task difficulty\nContent discoverability: whether participants were able to discover the content on the site\nTask time: the time it took people to complete the tasks\nThe first 2 metrics are related to navigation usage, while the last 3 refer to the quality of the user experience.\n(More on different types of UX metrics and how to collect and analyze them in our full-day course\nMeasuring User Experience\n.)\nNavigation Usage: Hidden Navigation Used Less and Later in the Task\nTo quantify the navigation usage, we looked at (1) navigation use: whether navigation was used during a task; and (2) time to navigation: the time from the beginning of the task until the moment when the navigation was used. (We only counted time to navigation if the navigation was used.)\nThese metrics tell us whether the navigation is helpful and also whether it is easy to discover. If the navigation is salient, you’d expect it to be used more and sooner than if it was hard to discover.\nOur tasks did not direct participants to use the navigation, search, page links, or any other interface features. Rather, people could use whatever they wanted in the interface to do the task. We assumed that if navigation is visible and seems helpful to users, they will click it; if not, they will try other things. Thus, we recognize that not clicking a menu can simply reflect that users perceived something else to be a better choice, and not that they did not notice or recognize the menu.\nFor example, on certain pages and tasks, an in-line link may have high\ninformation scent\n— think of looking for a movie on a newspaper site: if the first headline that you see on the page is exactly about that movie, chances are that you’ll pick it without using navigation or search.\nOur results indicate that, across both these measures,\nhidden navigation was significantly less discoverable\nthan visible or combination navigation:\nBoth on mobile and on desktop, people were significantly more likely to use the navigation when all or some of the navigation options were visible\n(that is, in the visible and combo conditions).\nNavigation usage as a function of device type (desktop, mobile) and navigation type (visible, hidden, combo) (We did not test sites with only visible navigation on phones.)\nOn desktop, people used the hidden menus in only 27% of the cases, while they used visible or combo navigation almost twice as much: in 48% and 50% of the cases, respectively.\nOn mobile people used the hidden navigation in 57% of the cases, and the combo navigation in 86% of the cases — 1.5 times more.\nWe ran a mixed-effects logistic regression and found that these differences were statistically significant. This result is not surprising: when (all or some of) the navigation options are visible, they are more salient to users. If nothing else, the screen footprint of visible or combo navigation is larger than that of a menu represented by just an icon or a label, so people will notice it more.\n2.\nPeople were significantly more likely to use the navigation (whether hidden or partially visible) on mobile than on desktop.\nThere are many potential explanations for this finding:\nNavigation on mobile (whether hidden under a menu or partially visible) takes a larger proportion of the screen space than on the desktop, simply because the screen is smaller. Thus, people are more likely to notice it and use it. Indeed, on the desktop we witnessed many sessions where people did not even see the menu icon. Some test participants even said that the sites with hidden navigation didn’t have a menu.\nBecause hidden navigation is more common on mobile than on desktop, people may be more familiar with it and more likely to think of using it.\nMobile pages tend to require more scrolling, have less content\nvisible above the fold\n, and sometimes be slower to load, so people may resort to using a menu instead of looking on the page and exploring whether there is any content that matches their interest. On the desktop, page-load speeds are high and the larger screen offers a better preview of the content of the page. (In other words, the\ninteraction cost\nof accessing a desired piece of information is higher on mobile than on the desktop.)\nTyping is harder and more error prone on mobile, and people may be more likely to prefer\nnavigation instead of searching\n, when the navigation is available.\nOn both desktop and mobile, when the navigation was hidden, it took participants longer to use it than when it was visible or partly visible.\nOur mixed-effects generalized model showed that this result was marginally significant (p < 0.1).\nOn the desktop, it took participants 5–7 seconds more to use the navigation when it was hidden. On mobile, that difference was smaller (about 2 seconds). (We did not test sites with only visible navigation on phones.)\nAlthough the numbers seem to indicate a device effect (that is, that participants were faster to use the hidden navigation on mobile than on desktop) or an interaction (that is, that the impact of hidden navigation was higher on desktop than on mobile), these effects were not statistically significant.\nAn additional few seconds spent may seem petty, and we agree that it will not be the difference between a fine and a terrible user experience. But in those few moments the user may begin to experience frustration and self-doubt. Add on a few more seconds and the user may abandon the task, or at least the menu.\nHidden Navigation Leads to Worse User Experience\nThe other 3 metrics that we collected focused on the quality of the user experience:\nContent discoverability\n. Our tasks were fairly simple and gave users a fair amount of freedom (e.g., “Find a technology article that interests you”), so people were actually able to complete them most of the time. However, given the focus of our study, we used a more nuanced measure of success (content discoverability) that took into account not only whether people completed the task, but also\nhow\nthey completed it. Thus, content discoverability measured whether users were able to find the content they were looking for by using navigation (and not search) in those cases when the content wasn’t directly linked from the homepage.\nTask-difficulty rating\n. At the end of each task, we asked participants to rate how easy or difficult the task was on a scale from 1 to 7, with 1 being easy and 7 being difficult. The task difficulty is a\nsubjective\nmetric; it measures users’ self-reported assessment of the task. It usually reflects their overall experience in using the site, so a high estimated difficulty rating will\nindirectly\nindicate actual difficulty in locating the navigation and navigating through the site.\nTime on task\n. This metric represented the time it took participants to complete the task, whether successfully or not. A menu can add or decrease task time, if it is easy or difficult to find, open, or use, so longer task times also reflect the added interaction cost due to a less usable navigation.\nOur findings show that, across all 3 different metrics,\nhidden navigation significantly decreases user experience both on mobile and on desktop\n.\n1.\nBoth on mobile and desktop, the content discoverability was significantly lower when the navigation was hidden\n.\nThis measure showed a more than 20% drop in discoverability on sites with hidden navigation, compared with sites with visible or combo navigation. In other words, visible or combo navigation made people more likely to complete the task successfully and without relying on search.\nThe content discoverability for hidden navigation was lower than for other types of navigation for both mobile and desktop. (We did not test sites with only visible navigation on phones.) Although content discoverability on mobile tended to be slightly higher than on desktop, this difference was not statistically significant.\nHidden navigation led to significantly higher difficulty ratings than visible or combo navigation\n: the difficulty rating showed a 21% increase in the hidden-navigation condition compared to visible, and 11% increase when compared to combo navigation. This result is consistent with our other findings and strengthened the conclusion that\nhiding navigation makes it harder for users to complete their tasks\n. Visible navigation was ranked as least difficult, most likely because it was easy to discover and users could immediately scan the navigation options and select one of them. The other navigation types hide navigation options and increase the interaction cost.\nTask difficulty, as rated by users, saw a 21% increase in the hidden navigation condition, compared to the visible navigation condition. The increase over the combination condition was only 11%. (These numbers represent aggregated data over both mobile and desktop.) In this chart, lower numbers indicate a better user experience.\nUsers took significantly longer to complete tasks on sites with hidden navigation than they did on sites with visible or combo navigation on both desktop and mobile\n.\nOn the\ndesktop\n, people were at least\n39% slower\nwhen the navigation was hidden (compared with the visible or combo conditions).\nOn\nmobile\npeople were\n15% slower\nwhen the navigation was hidden (compared with the combo condition).\nAverage task times were higher for the hidden-navigation condition both on mobile and on desktop (We did not test sites with only visible navigation on phones.)\nDifferences Between the Desktop and Mobile User Experience\nIn the first section of this article, we reported that mobile users were significantly more likely to use the navigation than desktop users (see Figure 1). Here we discuss desktop–mobile differences related to the user-experience metrics.\nHidden navigation is more likely to reduce content discoverability on desktop than on mobile\n. In other words, when users had to discover content that required the use of navigation, they were more likely to fail on the desktop than on mobile. Moreover, the drop in success was greater when the navigation was hidden. This result can also be explained by desktop users’ increased propensity to use search: search is more salient (most of the time) on desktop and users may be more inclined to use it when a path to the content is not immediately apparent.\nDesktop users were faster than mobile users (when combining all types of navigation)\nOn average, mobile users took 12% more time to complete the tasks. This result is not surprising: due to the small screen and the\nnarrow communication channel\nbetween the user and the device, getting the same content on mobile usually requires more interaction.\nWhy Hidden Navigation Is Less Effective\nWhy does hidden navigation have these effects? Throughout the article, we hinted at several answers:\nLow salience\n: A small icon is harder to notice on a large screen size (and even on a smaller mobile one).\nLow information scent\n: The menu icon or label doesn’t usually tell people what’s inside it, so they have no idea if they’ll find what they need by clicking on it.\nExtra work\n: To figure out what’s inside the menu, people must expand it. That increases the interaction cost for users and makes them less likely to do it, or, if they do it, they may take longer.\nLack of standards\n: Hidden navigation is implemented in different ways by different sites. Some sites use it, some don’t. On mobile, patterns are starting to form, but on desktop there is a lot of variability and inconsistency in the placement and the labeling of hidden navigation.\nLow familiarity\n: Especially on desktops, hiding navigation is not a common pattern and people may not expect to find global navigation under an expandable menu. Some people may also still be unfamiliar with the hamburger icon that is frequently used for such menus. This low familiarity is exacerbated by the lack of standards which reduce long-term learnability (as further discussed in our course on\nThe Human Mind and Usability\n, learning is facilitated by repeated exposure to the same pattern.)\nOf these 5 points against hidden navigation, only the last one might decline in future years. Hypothetically, increased design standardization could also occur (which would also increase familiarity), but our experience observing the web design evolve over the decades doesn’t make us optimistic that strong design standards will emerge anytime soon. The 3 biggest points of low salience, low information scent, and extra work will always be a curse on hidden navigation that will reduce its usability.\nNavigation Recommendations\nWhat are the takeaways of this research for your next design project?\nDesktop\n: There is plenty of screen real estate for displaying navigation options, and we recommend:\nDo not use hidden navigation (such as hamburger icons) in desktop user interfaces.\nInstead display the top-level navigation options, usually across the top of the page or down the left side.\nMobile\n: For phones, there is no hard-and-fast rule. But our general recommendations are:\nIf your site has 4 or fewer top-level navigation links, display them as visible links.\nIf your site has more than 4 top-level navigation links, the only reasonable solution is to hide some of these. We did find that the usability penalty imposed by hidden navigation is very present on mobile, but it is smaller than on the desktop. Thus, we recommend making this design tradeoff because the usability of an expandable navigation menu is far better than that of alternative designs.\nProvide in-page links to important information on your site, or use other methods of\nsupporting the hamburger\n(or some other hidden) menu.\nRemember:\nmobile-first\nis not the same as\nmobile-only\n. Plus, of course, follow the other long-established\nUX guidelines for menu design\n.\nOther Articles Related to the Study This Article was Based on\nMobile First Is NOT Mobile Only\nHidden- and Visible-Navigation Study: Methodology\nHow to Make Navigation (Even a Hamburger) Discoverable on Mobile\nBeyond the Hamburger: How to Make Navigation Discoverable on Desktops\nRelated Courses\nVisual Design Fundamentals\nCreate user interfaces using essential principles, techniques, and methods of visual design\nInteraction\nEmerging Patterns in Interface Design\nTrending UX patterns and their impact on the total user experience\nInteraction\nhamburger,Design Patterns,Mobile & Tablet,Navigation,web trends,icons,menus\nRelated Topics\nDesign Patterns\nDesign Patterns\nMobile & Tablet\nNavigation\nLearn More:\nEnable cookies\nto watch NN/g videos\nHamburger Menus Hurt UX Metrics\nKara Pernice\n·\n6 min\nOverflow Menu Icons\nKate Kaplan\n·\n4 min\nAnatomy of Good Icons\nKelley Gordon\n·\n3 min\nIcon Interpretation vs. Recognizability\nKate Kaplan\n·\n4 min\nRelated Articles:\nMobile First Is NOT Mobile Only\nRaluca Budiu and  Kara Pernice\n·\n10 min\nSupporting Mobile Navigation in Spite of a Hamburger Menu\nAmy Schade\n·\n4 min\nAI-Powered Tools for UX Research in 2023: Issues and Limitations\nFeifei Liu and  Kate Moran\n·\n10 min\nDon’t Use Split Buttons for Navigation Menus\nRaluca Budiu\n·\n9 min\nInformation Architecture: Study Guide\nPage Laubheimer\n·\n5 min\nAccordions on Desktop: When and How to Use\nHuei-Hsin Wang\n·\n10 min",
  "content_markdown": "12\n\n# Hamburger Menus and Hidden Navigation Hurt UX Metrics\n\nKara Pernice, Raluca Budiu\n\n![](https://media.nngroup.com/media/people/photos/kara-2025.jpg.256x256_q75_autocrop_crop-smart_upscale.jpg)\n![](https://media.nngroup.com/media/people/photos/2023-04-portraits-raluca.jpg.256x256_q75_autocrop_crop-smart_upscale.jpg)\n\n[Kara Pernice](/articles/author/kara-pernice/) and\n[Raluca Budiu](/articles/author/raluca-budiu/)\n\nJune 26, 2016\n2016-06-26\n\n[Share](#)\n\n- [Email article](mailto:?subject=NN/g Article: Hamburger Menus and Hidden Navigation Hurt UX Metrics&body=https://www.nngroup.com/articles/hamburger-menus/)\n- [Share on LinkedIn](http://www.linkedin.com/shareArticle?mini=true&url=http://www.nngroup.com/articles/hamburger-menus/&title=Hamburger Menus and Hidden Navigation Hurt UX Metrics&source=Nielsen%20Norman%20Group)\n- [Share on Twitter](https://twitter.com/intent/tweet?url=http://www.nngroup.com/articles/hamburger-menus/&text=Hamburger Menus and Hidden Navigation Hurt UX Metrics&via=nngroup)\n\nSummary: \nDiscoverability is cut almost in half by hiding a website’s main navigation. Also, task time is longer and perceived task difficulty increases.\n\nOur quantitative usability testing of hidden menus (such as hamburger icons) and visible menus (such as links across the top of pages) reveals that:\n\n- **Hidden navigation is less discoverable** than visible or partially visible navigation.\n  - When navigation is hidden, users are less likely to use navigation.\n  - If people use hidden navigation, they do so later in the task than if it were visible.\n\n- **Hidden navigation** **provides a worse user experience than visible** or partially visible navigation does, in both mobile phones and desktop user interfaces. This finding holds true across multiple UX metrics including users’ assessment of task difficulty, time spent on task, and task success.\n- On desktops, hiding navigation degrades the experience and the navigation discoverability more than it does on the phones.\n- Hiding the navigation mostly affects content that is not directly accessible through an in-page link.\n\n## In This Article:\n\n- [Why Study Hidden and Visible Navigation](#toc-why-study-hidden-and-visible-navigation-1)\n- [Measures: Navigation Usage, Content Discoverability, Time, Task Difficulty](#toc-measures-navigation-usage-content-discoverability-time-task-difficulty-2)\n- [Navigation Usage: Hidden Navigation Used Less and Later in the Task](#toc-navigation-usage-hidden-navigation-used-less-and-later-in-the-task-3)\n- [Hidden Navigation Leads to Worse User Experience](#toc-hidden-navigation-leads-to-worse-user-experience-4)\n- [Why Hidden Navigation Is Less Effective](#toc-why-hidden-navigation-is-less-effective-5)\n- [Navigation Recommendations](#toc-navigation-recommendations-6)\n\n## Why Study Hidden and Visible Navigation\n\n[Responsive design](https://www.nngroup.com/articles/responsive-web-design-definition/) has [many merits](https://www.nngroup.com/articles/mobile-usability-update); however, one of its less fortunate effects has been an excessive popularity of mobile-first designs that translate poorly onto larger desktop screens. To be clear, “mobile-first” itself is not the issue. Rather, the issue is taking sufficiently good mobile designs and porting them to desktops where they do not work as well. *Mobile-first* should not equal *mobile-only.*\n\n(Obviously, there’s a general principle here: if a design technique is intended to span platforms X and Y, then an uncompromising *X-first* approach will make Y an afterthought and harm users on Y. To design for X *and* Y, you need to consider the strengths and needs of both and adapt the two versions of the website accordingly.)\n\nHidden navigation, such as the hamburger menu, is one of the many patterns inspired by mobile designs. Screen space is a precious commodity on mobile. To meet the challenge of [prioritizing content](https://www.nngroup.com/articles/content-chrome-ratio) while still making navigation (and other [chrome](https://www.nngroup.com/articles/browser-and-gui-chrome/)) accessible, designers commonly rely on hiding the navigation under a menu — often indicated by the infamous hamburger icon. Like a cheap fast food chain, it got designers addicted to its convenience, and now serves millions each day, both on mobile devices and on desktops.\n\nWhile our qualitative user testing has repeatedly shown that [navigation hidden under a drop-down menu is less discoverable on the desktop](https://www.nngroup.com/articles/killing-global-navigation-one-trend-avoid/), we wanted to measure the size of this effect in a quantitative study and assess the relative impact of hidden navigation on the desktop versus mobile. To do so, we partnered with [WhatUsersDo](http://whatusersdo.com/?utm_campaign=nng_hamburger_1&utm_medium=referral&utm_source=ext_article) (a company specializing in remote usability testing) to run a study with 179 participants who completed tasks on 6 different sites, both on smartphones and desktops. The results of this large study are reported in this article. An additional article includes our [detailed research methodology and images of the menus](https://www.nngroup.com/articles/hidden-navigation-methodology/) tested.\n\n## Measures: Navigation Usage, Content Discoverability, Time, Task Difficulty\n\nTo determine the effectiveness and usability of the different menus, we ran usability tests on the desktop and mobile versions of 6 different live websites with different types of navigation designs. Here are the types of navigation that we considered:\n\n1. **Hidden navigation**: the main navigation links were placed under an icon (such as the hamburger) or button and required an explicit user action to be displayed.\n2. **Visible navigation**: the main navigation links were shown in a visible navigation bar and could thus be seen by a simple glance without needing any prior action.\n3. **Combo navigation**: some of the main navigation links were visible and some were hidden under a menu.\n\nNote that, for mobile devices, we did not fully test the visible-navigation condition. (Visible navigation is less common on mobile devices, and, due to other constraints in our study, we were not able to include this condition.) We tested the hidden and combo navigation conditions on mobile.\n\nWe wrote 2 simple tasks for each website. Some tasks could be completed without the use of the general site navigation, while other tasks required the use of navigation (or search). Here’s an example of a task: *“Go to http://www.bbc.com and see if there is any information on nature or wildlife you are interested in. Once you find a particular article that is interesting, please say which one it is.”*\n\nTo measure the effectiveness of these designs, we collected 5 metrics:\n\n1. Navigation use: whether participants used the navigation links at all\n2. Time to navigation: the time from the beginning of the task until the first use of the navigation in that task\n3. Task difficulty: participants’ assessment of task difficulty\n4. Content discoverability: whether participants were able to discover the content on the site\n5. Task time: the time it took people to complete the tasks\n\nThe first 2 metrics are related to navigation usage, while the last 3 refer to the quality of the user experience.\n\n(More on different types of UX metrics and how to collect and analyze them in our full-day course [Measuring User Experience](https://www.nngroup.com/courses/measuring-ux/).)\n\n## Navigation Usage: Hidden Navigation Used Less and Later in the Task\n\nTo quantify the navigation usage, we looked at (1) navigation use: whether navigation was used during a task; and (2) time to navigation: the time from the beginning of the task until the moment when the navigation was used. (We only counted time to navigation if the navigation was used.)\n\nThese metrics tell us whether the navigation is helpful and also whether it is easy to discover. If the navigation is salient, you’d expect it to be used more and sooner than if it was hard to discover.\n\nOur tasks did not direct participants to use the navigation, search, page links, or any other interface features. Rather, people could use whatever they wanted in the interface to do the task. We assumed that if navigation is visible and seems helpful to users, they will click it; if not, they will try other things. Thus, we recognize that not clicking a menu can simply reflect that users perceived something else to be a better choice, and not that they did not notice or recognize the menu.\n\nFor example, on certain pages and tasks, an in-line link may have high [information scent](https://www.nngroup.com/articles/information-scent/) — think of looking for a movie on a newspaper site: if the first headline that you see on the page is exactly about that movie, chances are that you’ll pick it without using navigation or search.\n\nOur results indicate that, across both these measures, **hidden navigation was significantly less discoverable** than visible or combination navigation:\n\n1. **Both on mobile and on desktop, people were significantly more likely to use the navigation when all or some of the navigation options were visible** (that is, in the visible and combo conditions).\n\n![Bar graph with data as described in the following paragraphs](https://media.nngroup.com/media/editor/2016/06/25/perc-x3.PNG)\n\n*Navigation usage as a function of device type (desktop, mobile) and navigation type (visible, hidden, combo) (We did not test sites with only visible navigation on phones.)*\n\n- On desktop, people used the hidden menus in only 27% of the cases, while they used visible or combo navigation almost twice as much: in 48% and 50% of the cases, respectively.\n- On mobile people used the hidden navigation in 57% of the cases, and the combo navigation in 86% of the cases — 1.5 times more.\n\nWe ran a mixed-effects logistic regression and found that these differences were statistically significant. This result is not surprising: when (all or some of) the navigation options are visible, they are more salient to users. If nothing else, the screen footprint of visible or combo navigation is larger than that of a menu represented by just an icon or a label, so people will notice it more.\n\n2. **People were significantly more likely to use the navigation (whether hidden or partially visible) on mobile than on desktop.**\n\nThere are many potential explanations for this finding:\n\n- Navigation on mobile (whether hidden under a menu or partially visible) takes a larger proportion of the screen space than on the desktop, simply because the screen is smaller. Thus, people are more likely to notice it and use it. Indeed, on the desktop we witnessed many sessions where people did not even see the menu icon. Some test participants even said that the sites with hidden navigation didn’t have a menu.\n- Because hidden navigation is more common on mobile than on desktop, people may be more familiar with it and more likely to think of using it.\n- Mobile pages tend to require more scrolling, have less content [visible above the fold](https://www.nngroup.com/articles/page-fold-manifesto/), and sometimes be slower to load, so people may resort to using a menu instead of looking on the page and exploring whether there is any content that matches their interest. On the desktop, page-load speeds are high and the larger screen offers a better preview of the content of the page. (In other words, the [interaction cost](https://www.nngroup.com/articles/interaction-cost-definition/) of accessing a desired piece of information is higher on mobile than on the desktop.)\n\nTyping is harder and more error prone on mobile, and people may be more likely to prefer [navigation instead of searching](https://www.nngroup.com/articles/search-not-enough/), when the navigation is available.\n\n1. **On both desktop and mobile, when the navigation was hidden, it took participants longer to use it than when it was visible or partly visible.** Our mixed-effects generalized model showed that this result was marginally significant (p < 0.1).\n\n![Bar graph showing time to hidden navigation for desktop taking 31 seconds, versus 23 and 26 seconds for combo and visible navigation. On mobile, times were 26 versus 24 seconds for hidden versus combo navigation.](https://media.nngroup.com/media/editor/2016/06/25/timetonav-x3.PNG)\n\n*On the desktop, it took participants 5–7 seconds more to use the navigation when it was hidden. On mobile, that difference was smaller (about 2 seconds). (We did not test sites with only visible navigation on phones.)*\n\nAlthough the numbers seem to indicate a device effect (that is, that participants were faster to use the hidden navigation on mobile than on desktop) or an interaction (that is, that the impact of hidden navigation was higher on desktop than on mobile), these effects were not statistically significant.\n\nAn additional few seconds spent may seem petty, and we agree that it will not be the difference between a fine and a terrible user experience. But in those few moments the user may begin to experience frustration and self-doubt. Add on a few more seconds and the user may abandon the task, or at least the menu.\n\n## Hidden Navigation Leads to Worse User Experience\n\nThe other 3 metrics that we collected focused on the quality of the user experience:\n\n- **Content discoverability**. Our tasks were fairly simple and gave users a fair amount of freedom (e.g., “Find a technology article that interests you”), so people were actually able to complete them most of the time. However, given the focus of our study, we used a more nuanced measure of success (content discoverability) that took into account not only whether people completed the task, but also *how* they completed it. Thus, content discoverability measured whether users were able to find the content they were looking for by using navigation (and not search) in those cases when the content wasn’t directly linked from the homepage.\n- **Task-difficulty rating**. At the end of each task, we asked participants to rate how easy or difficult the task was on a scale from 1 to 7, with 1 being easy and 7 being difficult. The task difficulty is a *subjective* metric; it measures users’ self-reported assessment of the task. It usually reflects their overall experience in using the site, so a high estimated difficulty rating will *indirectly* indicate actual difficulty in locating the navigation and navigating through the site.\n- **Time on task**. This metric represented the time it took participants to complete the task, whether successfully or not. A menu can add or decrease task time, if it is easy or difficult to find, open, or use, so longer task times also reflect the added interaction cost due to a less usable navigation.\n\nOur findings show that, across all 3 different metrics, **hidden navigation significantly decreases user experience both on mobile and on desktop**.\n\n**1.** **Both on mobile and desktop, the content discoverability was significantly lower when the navigation was hidden**.This measure showed a more than 20% drop in discoverability on sites with hidden navigation, compared with sites with visible or combo navigation. In other words, visible or combo navigation made people more likely to complete the task successfully and without relying on search.\n\n![Bar chart showing discoverability differences between hidden, combo, and visible navigation conditions. Hidden navigation again scored the lowest, with combo again the winner. Details in the text following.](https://media.nngroup.com/media/editor/2016/06/25/discov-x3.PNG)\n\n*The content discoverability for hidden navigation was lower than for other types of navigation for both mobile and desktop. (We did not test sites with only visible navigation on phones.) Although content discoverability on mobile tended to be slightly higher than on desktop, this difference was not statistically significant.*\n\n1. **Hidden navigation led to significantly higher difficulty ratings than visible or combo navigation**: the difficulty rating showed a 21% increase in the hidden-navigation condition compared to visible, and 11% increase when compared to combo navigation. This result is consistent with our other findings and strengthened the conclusion that **hiding navigation makes it harder for users to complete their tasks**. Visible navigation was ranked as least difficult, most likely because it was easy to discover and users could immediately scan the navigation options and select one of them. The other navigation types hide navigation options and increase the interaction cost.\n\n![Bar chart showing task difficulty on a scale of 1 to 7. Hidden 2.6, Combo 2.3, Visible 2.1.](https://media.nngroup.com/media/editor/2016/06/25/difficulty-x3.PNG)\n\n*Task difficulty, as rated by users, saw a 21% increase in the hidden navigation condition, compared to the visible navigation condition. The increase over the combination condition was only 11%. (These numbers represent aggregated data over both mobile and desktop.) In this chart, lower numbers indicate a better user experience.*\n\n1. **Users took significantly longer to complete tasks on sites with hidden navigation than they did on sites with visible or combo navigation on both desktop and mobile**.\n\n- On the **desktop**, people were at least **39% slower** when the navigation was hidden (compared with the visible or combo conditions).\n- On **mobile** people were **15% slower** when the navigation was hidden (compared with the combo condition).\n\n![Bar chart showing hidden navigation is slowest to use compared with the combo or visible navigation on both desktop and mobile. .](https://media.nngroup.com/media/editor/2016/06/25/tasktime-x3.PNG)\n\n*Average task times were higher for the hidden-navigation condition both on mobile and on desktop (We did not test sites with only visible navigation on phones.)*\n\n### Differences Between the Desktop and Mobile User Experience\n\nIn the first section of this article, we reported that mobile users were significantly more likely to use the navigation than desktop users (see Figure 1). Here we discuss desktop–mobile differences related to the user-experience metrics.\n\n1. **Hidden navigation is more likely to reduce content discoverability on desktop than on mobile**. In other words, when users had to discover content that required the use of navigation, they were more likely to fail on the desktop than on mobile. Moreover, the drop in success was greater when the navigation was hidden. This result can also be explained by desktop users’ increased propensity to use search: search is more salient (most of the time) on desktop and users may be more inclined to use it when a path to the content is not immediately apparent.\n2. **Desktop users were faster than mobile users (when combining all types of navigation)** On average, mobile users took 12% more time to complete the tasks. This result is not surprising: due to the small screen and the [narrow communication channel](https://www.nngroup.com/articles/scaling-user-interfaces) between the user and the device, getting the same content on mobile usually requires more interaction.\n\n## Why Hidden Navigation Is Less Effective\n\nWhy does hidden navigation have these effects? Throughout the article, we hinted at several answers:\n\n1. **Low salience**: A small icon is harder to notice on a large screen size (and even on a smaller mobile one).\n2. **Low information scent**: The menu icon or label doesn’t usually tell people what’s inside it, so they have no idea if they’ll find what they need by clicking on it.\n3. **Extra work**: To figure out what’s inside the menu, people must expand it. That increases the interaction cost for users and makes them less likely to do it, or, if they do it, they may take longer.\n4. **Lack of standards**: Hidden navigation is implemented in different ways by different sites. Some sites use it, some don’t. On mobile, patterns are starting to form, but on desktop there is a lot of variability and inconsistency in the placement and the labeling of hidden navigation.\n5. **Low familiarity**: Especially on desktops, hiding navigation is not a common pattern and people may not expect to find global navigation under an expandable menu. Some people may also still be unfamiliar with the hamburger icon that is frequently used for such menus. This low familiarity is exacerbated by the lack of standards which reduce long-term learnability (as further discussed in our course on [The Human Mind and Usability](https://www.nngroup.com/courses/human-mind/), learning is facilitated by repeated exposure to the same pattern.)\n\nOf these 5 points against hidden navigation, only the last one might decline in future years. Hypothetically, increased design standardization could also occur (which would also increase familiarity), but our experience observing the web design evolve over the decades doesn’t make us optimistic that strong design standards will emerge anytime soon. The 3 biggest points of low salience, low information scent, and extra work will always be a curse on hidden navigation that will reduce its usability.\n\n## Navigation Recommendations\n\nWhat are the takeaways of this research for your next design project?\n\n**Desktop**: There is plenty of screen real estate for displaying navigation options, and we recommend:\n\n- Do not use hidden navigation (such as hamburger icons) in desktop user interfaces.\n- Instead display the top-level navigation options, usually across the top of the page or down the left side.\n\n**Mobile**: For phones, there is no hard-and-fast rule. But our general recommendations are:\n\n- If your site has 4 or fewer top-level navigation links, display them as visible links.\n- If your site has more than 4 top-level navigation links, the only reasonable solution is to hide some of these. We did find that the usability penalty imposed by hidden navigation is very present on mobile, but it is smaller than on the desktop. Thus, we recommend making this design tradeoff because the usability of an expandable navigation menu is far better than that of alternative designs.\n- Provide in-page links to important information on your site, or use other methods of [supporting the hamburger](https://www.nngroup.com/articles/support-mobile-navigation/) (or some other hidden) menu.\n\nRemember: [*mobile-first* is not the same as *mobile-only*](https://www.nngroup.com/articles/mobile-first-not-mobile-only/). Plus, of course, follow the other long-established [UX guidelines for menu design](https://www.nngroup.com/articles/menu-design/).\n\n### Other Articles Related to the Study This Article was Based on\n\n- [Mobile First Is NOT Mobile Only](https://www.nngroup.com/articles/mobile-first-not-mobile-only/)\n- [Hidden- and Visible-Navigation Study: Methodology](https://www.nngroup.com/articles/hidden-navigation-methodology/)\n- [How to Make Navigation (Even a Hamburger) Discoverable on Mobile](https://www.nngroup.com/articles/find-navigation-mobile-even-hamburger/)\n- [Beyond the Hamburger: How to Make Navigation Discoverable on Desktops](https://www.nngroup.com/articles/find-navigation-desktop-not-hamburger/)\n\n## Related Courses\n\n- [#### Visual Design Fundamentals\n\n  Create user interfaces using essential principles, techniques, and methods of visual design\n\n  Interaction](/courses/visual-design/?lm=hamburger-menus&pt=article)\n- [#### Emerging Patterns in Interface Design\n\n  Trending UX patterns and their impact on the total user experience\n\n  Interaction](/courses/emerging-patterns-interface-design/?lm=hamburger-menus&pt=article)\n\nhamburger,Design Patterns,Mobile & Tablet,Navigation,web trends,icons,menus\n\n## Related Topics\n\n- Design Patterns\n  [Design Patterns](/topic/design-patterns/)\n- [Mobile & Tablet](/topic/mobile-and-tablet-design/)\n- [Navigation](/topic/navigation/)\n\n## Learn More:\n\n[![Hamburger Menus Hurt UX Metrics](https://media.nngroup.com/media/videos/thumbnails/sddefault_3.jpg.1300x728_q75_autocrop_crop-smart_upscale.jpg)](https://www.youtube.com/watch?v=rdeoPuPzONg \"Hamburger Menus Hurt UX Metrics on YouTube (new window)\")\n\nEnable cookies\n to watch NN/g videos\n\nHamburger Menus Hurt UX Metrics\n\n Kara Pernice\n·\n6 min\n\n- [![](https://media.nngroup.com/media/videos/thumbnails/Overflow_Menu_Icons_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Overflow Menu Icons\n\n  Kate Kaplan\n  ·\n  4 min](/videos/overflow-menu-icons/?lm=hamburger-menus&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Anatomy_of_Good_Icons_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Anatomy of Good Icons\n\n  Kelley Gordon\n  ·\n  3 min](/videos/anatomy-of-good-icons/?lm=hamburger-menus&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Icon_Interpretation_vs_Recognizability_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Icon Interpretation vs. Recognizability\n\n  Kate Kaplan\n  ·\n  4 min](/videos/icon-interpretation-vs-recognizability/?lm=hamburger-menus&pt=article)\n\n## Related Articles:\n\n- [Mobile First Is NOT Mobile Only\n\n  Raluca Budiu and Kara Pernice\n  ·\n  10 min](/articles/mobile-first-not-mobile-only/?lm=hamburger-menus&pt=article)\n- [Supporting Mobile Navigation in Spite of a Hamburger Menu\n\n  Amy Schade\n  ·\n  4 min](/articles/support-mobile-navigation/?lm=hamburger-menus&pt=article)\n- [AI-Powered Tools for UX Research in 2023: Issues and Limitations\n\n  Feifei Liu and Kate Moran\n  ·\n  10 min](/articles/ai-powered-tools-limitations/?lm=hamburger-menus&pt=article)\n- [Don’t Use Split Buttons for Navigation Menus\n\n  Raluca Budiu\n  ·\n  9 min](/articles/split-buttons-navigation/?lm=hamburger-menus&pt=article)\n- [Information Architecture: Study Guide\n\n  Page Laubheimer\n  ·\n  5 min](/articles/ia-study-guide/?lm=hamburger-menus&pt=article)\n- [Accordions on Desktop: When and How to Use\n\n  Huei-Hsin Wang\n  ·\n  10 min](/articles/accordions-on-desktop/?lm=hamburger-menus&pt=article)",
  "tags": [
    "nngroup",
    "usability",
    "research",
    "heuristics"
  ],
  "extracted_at": "2026-02-03T12:43:38.959368+00:00",
  "content_length": 20431,
  "content_hash": "37599b15fee827a7"
}