{
  "id": "nngroup__articles_indicators-validations-notifications_",
  "source_id": "nngroup",
  "source_name": "Nielsen Norman Group Articles",
  "category": "ux_research",
  "url": "https://www.nngroup.com/articles/indicators-validations-notifications/",
  "title": "Indicators, Validations, and Notifications: Pick the Correct Communication Option",
  "content": "9\nIndicators, Validations, and Notifications: Pick the Correct Communication Option\nKim Flaherty\nKim Flaherty\nJanuary 17, 2024\n2024-01-17\nShare\nEmail article\nShare on LinkedIn\nShare on Twitter\nSummary:\nStatus feedback is crucial to the success of any system. Knowing when to use 3 common communication methods is key to supporting users.\nIn interaction design, a system, whether an application, website, or piece of hardware (anything from a\nsmartwatch\nto a\nthermostat\n), should always\nkeep users informed\n, by providing appropriate feedback. Ensuring that the state of the system is always visible is one of the\n10 usability heuristics for interface design\n. Information about system status, such as error messages and notifications of system activity, allows users to fully understand the current context.\nIn This Article:\nCommunicating System Status\nIndicators\nValidations\nNotifications\nPicking the Right Communication Option Is Important\nConclusion\nCommunicating System Status\nThe best way to communicate system status varies depending on several key factors:\nThe\ntype\nof information being communicated\nThe\nurgency\nof the information — how important it is that the user sees it immediately\nWhether the user needs to take\naction\nas a result of the information\nThree common approaches for status communication include validation, notifications, and status indicators. These terms are used sometimes interchangeably in product design, but they stand for different communication methods that should be used in different circumstances. Understanding the differences between them will help you sharpen your feedback to users by choosing the best option for each need.\nIndicators\nAn indicator is a way of making a page element (be it content or part of the user interface)\nstand out to inform the user that there is something special\nabout it that warrants the user’s attention. Often, the indicator will denote that there has been some change to the item represented by that element.\nAlthough, as we’ll see later, indicators are used quite frequently to signal validation errors or notifications, they can also be used on their own.  Indicators are visual cues intended to attract users’ attention to a particular piece of content or UI element that is dynamic in nature.  (If something always looks the same, it’s not an indicator, no matter how flamboyantly it’s designed.)\nThere are at least three possible ways of implementing indicators:\nOftentimes, but not always, indicators are implemented as\nicons\n. Easily\nrecognizable icons\ncan make very effective communication tools.\nTypographical\nvariations can also be used as indicators; examples include the common convention of boldfacing unread email messages or color-coding stock symbols in an investment account if their price has changed substantially.\nThough less common, enlarged\nsize\nor\nanimation\n(e.g., vibration) can also be used to make certain items stand out from the crowd and thus serve as an indicator.\nYelp used a red flame icon indicator in the search results to indicate that Paris Banh Mi is a Hot and New restaurant to try out. This indicator communicated additional information about Paris Banh Mi.\nCharacteristics of indicators:\nIndicators are\ncontextual\n. They are associated with a UI element or with a piece of content, and should be shown in close proximity to that element.\nIndicators are\nconditional\n— they are not always present, but appear or change depending on certain conditions. For example, a stock-performance indicator, such as the one in the American Century example below, may change to indicate if the stock price is increasing or decreasing.  Additionally, the tag indicator in the Yelp example above only appears if there is a deal at that business.\nIndicators are\npassive\n.  They do not require that a user take action, but are used as a communication tool to cue the user to something of note.\nAmerican Century Investments used a conditional indicator to provide information regarding a specific stock’s performance. When the daily change was positive, the indicator was a green arrow pointing up. When the daily change was negative, it showed a red arrow pointing down. The condition of the stock performance impacted the indicator that was shown next to the price.\nIndicators can introduce noise and clutter to your overall interface, and may distract users, so it is important to consider how many (if any) indicators to use in your design.\nConsider the following when deciding if an indicator is appropriate:\nHow important is the information to the user? Is it worth taking up space on the page to inform the user?\nHow often is the information used?\nWould the user expect to see the information?\nWould it be missed if it weren’t provided?\nHow important is it for the application that the user discovers the information?\nValidations\nValidation messages are\nerror messages\nrelated to users’ inputs: they communicate whether the data just entered was incomplete or incorrect. For example, in e-commerce systems, validation messages often involve information such as name, billing address, and credit-card information.\nCobragolf.com provided a validation message that clearly indicated which field was in error.\nCharacteristics of validation:\nA user needs to take action to clear the validation message.\nThe information in the validation message is contextual and applies to a specific user input that has a problem.\nThe way in which validation should be implemented varies based on the unique needs of the form.  However, in general, if the user’s input is incorrect, the system should inform the user by providing an identifiable and clear message that aids in correcting the error. Validation messages should follow the\nguidelines for error messages\nrather than simply identifying the problem, they should tell users how to fix it.  For instance,  don’t  state “Field is blank.” Please enter your street address” is more polite and directs to a solution.\nSince validation is contextual, it can be helpful to use an\nicon indicator\nalong with the validation message to help communicate which input(s) are missing or need corrected.\nBestbuy.com provided a helpful validation message telling users how to fix the problem and also used an icon indicator and a different color to attract users’ attention to the field that needed correction.\nNotifications\nNotifications are informational messages that\nalert the user of general occurrences within a system\n. Unlike validation, notifications may\nnot be directly tied to user input\nor even to the user’s current activity in the system, but they usually inform the user of a change in the system state or of an event that may be of interest. In the case of email, social networks, and mobile-phone applications, notifications can even be delivered while a user is away from the application.\nNotifications can be\ncontextual\n—applying to a specific UI element— or\nglobal\n—applying to the system as a whole.\nUniqlo used a contextual notification on their product detail page to bring attention to a tool that helps users find the right size. This notification does not require the user to take action to interact with the page. You could click the X button to close it, but it eventually disappeared after a period of inactivity.\nCharacteristics of notifications:\nThey are not triggered by users’ immediate actions.\nThey announce an event that has some significance to the user.\nThere are two main types of notifications, which differ based on whether the user is required to act upon the notification:\nAction-required notifications\nalert the user of an event that requires a user action. In this sense, they are similar to validation, but since they were not sparked by the user’s own action, they require a different design.\nAction-required notifications are often urgent and should be intrusive; for instance, they could be implemented as modal popups that interrupt the user, forcing immediate attention and requiring an action to be dismissed.\nThe Mac operating system used a notification to inform users that an accessory device needed to be charged. The user could explicitly dismiss it from the screen, by opting to ignore or clicking anywhere outside of the notification. This is an intrusive notification that requires that the user take action.\nPassive notifications\nare informational; they report a system occurrence that does not require any user action. Many notifications in mobile apps are passive: they usually announce an event of potential interest to the user.\nPassive notifications are typically not urgent and should be less intrusive. A typical implementation of a passive notification may be a badge icon or a small nonmodal popover in a corner of a screen. Passive notifications can easily be missed, since they require no user action. When the information provided by the notification is key to the understanding of the system, an easy-to-ignore passive notification can be problematic.\nAdobe Creative Cloud used a nonintrusive passive notification to inform the user of an available application update. This notification appeared on screen for several seconds before disappearing. The user did not need to take any action on it.\nVisual Comfort and Co used a nonintrusive passive notification at the top of the product detail page to provide feedback that an item was added to the shopping cart. Such notifications sometimes cause issues for e-commerce shoppers who do not notice the message due to its location far away from the user's area of focus at the time (the add-to-cart button, which was further down the page). Users who miss the message may respond by adding an item to the cart multiple times or by disrupting their shopping flow to check the cart to see what items were added. No action was necessary to continue interacting with the page, yet it did persist if not dismissed. With its out-of-the-way placement on the page, persisting on the page was not intrusive to the user.\nOn Mango.com when a user added an item to the cart, a notification appeared in a more intrusive way than Visual Comfort and Co. Taking over a portion of the screen reduces the risk that the user will not see the feedback. This notification was a bit of a hybrid between a passive and action-required notification. It was the direct result of a user action, so it's less important to require the user to take action to acknowledge it. Although it did have buttons to take action, if the user clicked anywhere or continued to interact with the page, the notification dismissed itself.\nNotifications have the design challenge that they are not always the immediate and obvious result of a specific user action. In some instances, the user may be in the middle of doing something different and may not be thinking about the issue raised by the notification. This requires notifications to establish more context and provide users with sufficient background information to understand what the notification is about.\n(In contrast, with a validation, the user has just done the thing that needs to be corrected. Thus, the validation message doesn’t need to educate users about the task at hand. For example, if an e-commerce checkout form has a field for a credit-card expiration date that was left blank, the validation message doesn’t need to say\n“Please provide the expiration date for the credit card you want to have charged $29.90 to pay for the blue sleeveless dress you are in the process of buying on Uniqlo.com.”\nHowever, a notification the following day that the dress has been shipped from the warehouse would need to say more than\n“Your package has shipped.”\n)\nIf a notification is contextual and relates to a specific element in the interface, an icon indicator on the element can communicate where that notification applies and catch the user’s attention.  For instance, an indicator badge on a mobile-app icon shows that the user has received a notification from the corresponding app.\nThe iPhone messaging app created a notification to communicate that a new message was received. Along with the notification, an indicator badge was placed on the messaging-app icon to communicate where the notification applied. To clear the indicator, the user had to view the message.\nMint.com used an indicator together with a notification to communicate that an account needed attention. The warning indicator\n(1)\nappeared in close proximity to the summary of the account that needed attention, while the notification\n(2)\nappeared in the central area of the page with other important information. The actual text in the notification message could have been more helpful, though.\nPicking the Right Communication Option Is Important\nUsing the wrong communication method can have a negative impact on the users’ experience. Let’s refer back to the scenario above where Yelp utilized a green-tag indicator in the search results to indicate that Tea Market had a special deal running. This information is contextual and important to users who have specifically searched for a place to have tea.\nYou may think that an alternative way of alerting users of potential tea deals would be to send them a notification when such a deal has become available. Wrong! A notification sent irrespective of the current user goal would likely be ignored, and may even annoy users because it will disrupt their current task and be irrelevant to their current needs.\n(In general,\nany type of ad tends to be ignored unless it is related to the users’ aims and mindset\n.)\nAlternatively, a toast (a small nonmodal popup that disappears after a few seconds, like the\nNew Stories\none used by the Facebook app), while appropriate for passive notifications, would be a bad way to implement an error message, be it validation or otherwise. In fact, one of our mobile users spent 5 minutes waiting for some content to load only because she hadn’t notice the little error message presented at the bottom of the screen that quickly faded away after 5 seconds.\nAllmodern.com used an action-required notification to communicate that a product was saved as a favorite.  For a user that is saving a lot of items to their favorites, this can be a bothersome and intrusive way of providing feedback. This may be better communicated by showing a passive nonmodal popover in the corner of the screen that can be seen, but doesn’t require the user to take action to clear it.\nConclusion\nRemember the key differences between the three communication methods are:\nIndicators provide supplementary information about a dynamic piece of content or UI element. They are conditional —that is, they may appear or change under specific conditions.\nValidations are tied to a user’s action or input.\nNotifications are focused on system-related events.\nUnderstanding when and how to use each of these feedback tools is important in order to build consistency in the communication to users. By assessing the type of information delivered, we can determine the correct mechanism to use.\nRelated Courses\nApplication Design for Web and Desktop\nComponents, design patterns, workflows, and ways of interacting with complex data\nInteraction\nApplication Design,standards & conventions\nRelated Topics\nApplication Design\nApplication Design\nLearn More:\nIcon Interpretation vs. Recognizability\nKate Kaplan\n·\n4 min\nIs the Floppy Disk Dead?\nKate Kaplan\n·\n4 min\n2-Factor Authentication (2-FA)\nTim Neusesser\n·\n4 min\nRelated Articles:\nTop 10 Application-Design Mistakes\nJakob Nielsen and  Page Laubheimer\n·\n13 min\nOK-Cancel or Cancel-OK? The Trouble With Buttons\nJakob Nielsen\n·\n2 min\nDefeated By a Dialog Box\nJakob Nielsen\n·\n6 min\nCheckboxes vs. Radio Buttons\nJakob Nielsen\n·\n6 min\nApps Within Apps: UX Lessons from WeChat Mini Programs\nFeifei Liu\n·\n9 min\nRadio Buttons: Select One by Default or Leave All Unselected?\nKara Pernice\n·\n12 min",
  "content_markdown": "9\n\n# Indicators, Validations, and Notifications: Pick the Correct Communication Option\n\nKim Flaherty\n\n![](https://media.nngroup.com/media/people/photos/Kim-Headshot-2022.jpg.256x256_q75_autocrop_crop-smart_upscale.jpg)\n\nKim Flaherty\n\nJanuary 17, 2024\n2024-01-17\n\n[Share](#)\n\n- [Email article](mailto:?subject=NN/g Article: Indicators, Validations, and Notifications: Pick the Correct Communication Option&body=https://www.nngroup.com/articles/indicators-validations-notifications/)\n- [Share on LinkedIn](http://www.linkedin.com/shareArticle?mini=true&url=http://www.nngroup.com/articles/indicators-validations-notifications/&title=Indicators, Validations, and Notifications: Pick the Correct Communication Option&source=Nielsen%20Norman%20Group)\n- [Share on Twitter](https://twitter.com/intent/tweet?url=http://www.nngroup.com/articles/indicators-validations-notifications/&text=Indicators, Validations, and Notifications: Pick the Correct Communication Option&via=nngroup)\n\nSummary: \nStatus feedback is crucial to the success of any system. Knowing when to use 3 common communication methods is key to supporting users.\n\nIn interaction design, a system, whether an application, website, or piece of hardware (anything from a [smartwatch](http://www.nngroup.com/articles/smartwatch/) to a [thermostat](http://www.nngroup.com/articles/emotional-design-fail/)), should always **keep users informed**, by providing appropriate feedback. Ensuring that the state of the system is always visible is one of the [10 usability heuristics for interface design](http://www.nngroup.com/articles/ten-usability-heuristics/). Information about system status, such as error messages and notifications of system activity, allows users to fully understand the current context.\n\n## In This Article:\n\n- [Communicating System Status](#toc-communicating-system-status-1)\n- [Indicators](#toc-indicators-2)\n- [Validations](#toc-validations-3)\n- [Notifications](#toc-notifications-4)\n- [Picking the Right Communication Option Is Important](#toc-picking-the-right-communication-option-is-important-5)\n- [Conclusion](#toc-conclusion-6)\n\n## Communicating System Status\n\nThe best way to communicate system status varies depending on several key factors:\n\n- The **type** of information being communicated\n- The **urgency** of the information — how important it is that the user sees it immediately\n- Whether the user needs to take **action** as a result of the information\n\nThree common approaches for status communication include validation, notifications, and status indicators. These terms are used sometimes interchangeably in product design, but they stand for different communication methods that should be used in different circumstances. Understanding the differences between them will help you sharpen your feedback to users by choosing the best option for each need.\n\n![system status comparison chart](https://media.nngroup.com/media/editor/2024/01/24/validation-indicators-notifications-comparison.png)\n\n## Indicators\n\nAn indicator is a way of making a page element (be it content or part of the user interface) **stand out to inform the user that there is something special** about it that warrants the user’s attention. Often, the indicator will denote that there has been some change to the item represented by that element.\n\nAlthough, as we’ll see later, indicators are used quite frequently to signal validation errors or notifications, they can also be used on their own.  Indicators are visual cues intended to attract users’ attention to a particular piece of content or UI element that is dynamic in nature.  (If something always looks the same, it’s not an indicator, no matter how flamboyantly it’s designed.)\n\nThere are at least three possible ways of implementing indicators:\n\n- Oftentimes, but not always, indicators are implemented as **icons**. Easily [recognizable icons](http://www.nngroup.com/articles/icon-usability/) can make very effective communication tools.\n- **Typographical** variations can also be used as indicators; examples include the common convention of boldfacing unread email messages or color-coding stock symbols in an investment account if their price has changed substantially.\n- Though less common, enlarged **size** or **animation** (e.g., vibration) can also be used to make certain items stand out from the crowd and thus serve as an indicator.\n\n![yelp app, hot new restaurant flame icon indicator](https://media.nngroup.com/media/editor/2024/01/17/yelp_new_indicator1.jpg)\n\n*Yelp used a red flame icon indicator in the search results to indicate that Paris Banh Mi is a Hot and New restaurant to try out. This indicator communicated additional information about Paris Banh Mi.*\n\n**Characteristics of indicators:**\n\n- Indicators are **contextual**. They are associated with a UI element or with a piece of content, and should be shown in close proximity to that element.\n- Indicators are **conditional**— they are not always present, but appear or change depending on certain conditions. For example, a stock-performance indicator, such as the one in the American Century example below, may change to indicate if the stock price is increasing or decreasing.  Additionally, the tag indicator in the Yelp example above only appears if there is a deal at that business.\n- Indicators are **passive**.  They do not require that a user take action, but are used as a communication tool to cue the user to something of note.\n\n![Investment stock indicator up arrows](https://media.nngroup.com/media/editor/2024/01/24/american-century-stock-indicators.png)\n\n*American Century Investments used a conditional indicator to provide information regarding a specific stock’s performance. When the daily change was positive, the indicator was a green arrow pointing up. When the daily change was negative, it showed a red arrow pointing down. The condition of the stock performance impacted the indicator that was shown next to the price.*\n\nIndicators can introduce noise and clutter to your overall interface, and may distract users, so it is important to consider how many (if any) indicators to use in your design.\n\nConsider the following when deciding if an indicator is appropriate:\n\n- How important is the information to the user? Is it worth taking up space on the page to inform the user?\n  - How often is the information used?\n  - Would the user expect to see the information?\n  - Would it be missed if it weren’t provided?\n- How important is it for the application that the user discovers the information?\n\n## Validations\n\nValidation messages are **error messages** related to users’ inputs: they communicate whether the data just entered was incomplete or incorrect. For example, in e-commerce systems, validation messages often involve information such as name, billing address, and credit-card information.\n\n![newsletter signup email validation red message](https://media.nngroup.com/media/editor/2024/01/17/cobra-golf-validation1.png)\n\n*Cobragolf.com provided a validation message that clearly indicated which field was in error.*\n\n**Characteristics of validation:**\n\n- A user needs to take action to clear the validation message.\n- The information in the validation message is contextual and applies to a specific user input that has a problem.\n\nThe way in which validation should be implemented varies based on the unique needs of the form.  However, in general, if the user’s input is incorrect, the system should inform the user by providing an identifiable and clear message that aids in correcting the error. Validation messages should follow the [guidelines for error messages](http://www.nngroup.com/articles/error-message-guidelines/) rather than simply identifying the problem, they should tell users how to fix it.  For instance,  don’t  state “Field is blank.” Please enter your street address” is more polite and directs to a solution.\n\nSince validation is contextual, it can be helpful to use an **icon indicator** along with the validation message to help communicate which input(s) are missing or need corrected.\n\n![](//s3.amazonaws.com/media.nngroup.com/media/editor/2015/07/14/bestbuy_validation.png)\n\n*Bestbuy.com provided a helpful validation message telling users how to fix the problem and also used an icon indicator and a different color to attract users’ attention to the field that needed correction.*\n\n## Notifications\n\nNotifications are informational messages that **alert the user of general occurrences within a system**. Unlike validation, notifications may **not be directly tied to user input** or even to the user’s current activity in the system, but they usually inform the user of a change in the system state or of an event that may be of interest. In the case of email, social networks, and mobile-phone applications, notifications can even be delivered while a user is away from the application.\n\nNotifications can be **contextual** —applying to a specific UI element— or **global** —applying to the system as a whole.\n\n![Uniqlo contextual notification about size help tool](https://media.nngroup.com/media/editor/2024/01/17/uniqlo-contextual-notification2.jpg)\n\n*Uniqlo used a contextual notification on their product detail page to bring attention to a tool that helps users find the right size. This notification does not require the user to take action to interact with the page. You could click the X button to close it, but it eventually disappeared after a period of inactivity.*\n\n**Characteristics of notifications:**\n\n- They are not triggered by users’ immediate actions.\n- They announce an event that has some significance to the user.\n\nThere are two main types of notifications, which differ based on whether the user is required to act upon the notification:\n\n- **Action-required notifications** alert the user of an event that requires a user action. In this sense, they are similar to validation, but since they were not sparked by the user’s own action, they require a different design.\n\nAction-required notifications are often urgent and should be intrusive; for instance, they could be implemented as modal popups that interrupt the user, forcing immediate attention and requiring an action to be dismissed.\n\n![mac OS notification](https://media.nngroup.com/media/editor/2024/01/17/mac-notification002.jpeg)\n\n*The Mac operating system used a notification to inform users that an accessory device needed to be charged. The user could explicitly dismiss it from the screen, by opting to ignore or clicking anywhere outside of the notification. This is an intrusive notification that requires that the user take action.*\n\n- **Passive notifications** are informational; they report a system occurrence that does not require any user action. Many notifications in mobile apps are passive: they usually announce an event of potential interest to the user.\n\nPassive notifications are typically not urgent and should be less intrusive. A typical implementation of a passive notification may be a badge icon or a small nonmodal popover in a corner of a screen. Passive notifications can easily be missed, since they require no user action. When the information provided by the notification is key to the understanding of the system, an easy-to-ignore passive notification can be problematic.\n\n![](//s3.amazonaws.com/media.nngroup.com/media/editor/2015/07/14/creativecloud_notification.png)\n\n*Adobe Creative Cloud used a nonintrusive passive notification to inform the user of an available application update. This notification appeared on screen for several seconds before disappearing. The user did not need to take any action on it.*\n\n![Add to cart notification - green banner top of page](https://media.nngroup.com/media/editor/2024/01/17/shopping-cart-notification.jpg)\n\n*Visual Comfort and Co used a nonintrusive passive notification at the top of the product detail page to provide feedback that an item was added to the shopping cart. Such notifications sometimes cause issues for e-commerce shoppers who do not notice the message due to its location far away from the user's area of focus at the time (the add-to-cart button, which was further down the page). Users who miss the message may respond by adding an item to the cart multiple times or by disrupting their shopping flow to check the cart to see what items were added. No action was necessary to continue interacting with the page, yet it did persist if not dismissed. With its out-of-the-way placement on the page, persisting on the page was not intrusive to the user.*\n\n![Intrusive add to cart notification - takes over screen](https://media.nngroup.com/media/editor/2024/01/17/mango-intrusive-cart-notification2.jpg)\n\nOn Mango.com when a user added an item to the cart, a notification appeared in a more intrusive way than Visual Comfort and Co. Taking over a portion of the screen reduces the risk that the user will not see the feedback. This notification was a bit of a hybrid between a passive and action-required notification. It was the direct result of a user action, so it's less important to require the user to take action to acknowledge it. Although it did have buttons to take action, if the user clicked anywhere or continued to interact with the page, the notification dismissed itself.\n\nNotifications have the design challenge that they are not always the immediate and obvious result of a specific user action. In some instances, the user may be in the middle of doing something different and may not be thinking about the issue raised by the notification. This requires notifications to establish more context and provide users with sufficient background information to understand what the notification is about.\n\n(In contrast, with a validation, the user has just done the thing that needs to be corrected. Thus, the validation message doesn’t need to educate users about the task at hand. For example, if an e-commerce checkout form has a field for a credit-card expiration date that was left blank, the validation message doesn’t need to say *“Please provide the expiration date for the credit card you want to have charged $29.90 to pay for the blue sleeveless dress you are in the process of buying on Uniqlo.com.”* However, a notification the following day that the dress has been shipped from the warehouse would need to say more than *“Your package has shipped.”*)\n\nIf a notification is contextual and relates to a specific element in the interface, an icon indicator on the element can communicate where that notification applies and catch the user’s attention.  For instance, an indicator badge on a mobile-app icon shows that the user has received a notification from the corresponding app.\n\n![iphone notifications banners and badge](https://media.nngroup.com/media/editor/2024/01/17/iphone-notifications.jpg)\n\n*The iPhone messaging app created a notification to communicate that a new message was received. Along with the notification, an indicator badge was placed on the messaging-app icon to communicate where the notification applied. To clear the indicator, the user had to view the message.*\n\n![](//s3.amazonaws.com/media.nngroup.com/media/editor/2015/07/14/mint_validation.png)\n\n*Mint.com used an indicator together with a notification to communicate that an account needed attention. The warning indicator* (1) *appeared in close proximity to the summary of the account that needed attention, while the notification* (2) *appeared in the central area of the page with other important information. The actual text in the notification message could have been more helpful, though.*\n\n## Picking the Right Communication Option Is Important\n\nUsing the wrong communication method can have a negative impact on the users’ experience. Let’s refer back to the scenario above where Yelp utilized a green-tag indicator in the search results to indicate that Tea Market had a special deal running. This information is contextual and important to users who have specifically searched for a place to have tea.\n\nYou may think that an alternative way of alerting users of potential tea deals would be to send them a notification when such a deal has become available. Wrong! A notification sent irrespective of the current user goal would likely be ignored, and may even annoy users because it will disrupt their current task and be irrelevant to their current needs.\n\n(In general, [any type of ad tends to be ignored unless it is related to the users’ aims and mindset](http://www.nngroup.com/articles/making-web-advertisements-work/).)\n\nAlternatively, a toast (a small nonmodal popup that disappears after a few seconds, like the *New Stories* one used by the Facebook app), while appropriate for passive notifications, would be a bad way to implement an error message, be it validation or otherwise. In fact, one of our mobile users spent 5 minutes waiting for some content to load only because she hadn’t notice the little error message presented at the bottom of the screen that quickly faded away after 5 seconds.\n\n![](//s3.amazonaws.com/media.nngroup.com/media/editor/2015/07/14/allmodern_notification.png)\n\n*Allmodern.com used an action-required notification to communicate that a product was saved as a favorite.  For a user that is saving a lot of items to their favorites, this can be a bothersome and intrusive way of providing feedback. This may be better communicated by showing a passive nonmodal popover in the corner of the screen that can be seen, but doesn’t require the user to take action to clear it.*\n\n## Conclusion\n\nRemember the key differences between the three communication methods are:\n\n- Indicators provide supplementary information about a dynamic piece of content or UI element. They are conditional —that is, they may appear or change under specific conditions.\n- Validations are tied to a user’s action or input.\n- Notifications are focused on system-related events.\n\nUnderstanding when and how to use each of these feedback tools is important in order to build consistency in the communication to users. By assessing the type of information delivered, we can determine the correct mechanism to use.\n\n## Related Courses\n\n- [#### Application Design for Web and Desktop\n\n  Components, design patterns, workflows, and ways of interacting with complex data\n\n  Interaction](/courses/application-ux/?lm=indicators-validations-notifications&pt=article)\n\nApplication Design,standards & conventions\n\n## Related Topics\n\n- Application Design\n  [Application Design](/topic/applications/)\n\n## Learn More:\n\n- [![](https://media.nngroup.com/media/videos/thumbnails/Icon_Interpretation_vs_Recognizability_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Icon Interpretation vs. Recognizability\n\n  Kate Kaplan\n  ·\n  4 min](/videos/icon-interpretation-vs-recognizability/?lm=indicators-validations-notifications&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Is_the_Floppy_Disk_Dead_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Is the Floppy Disk Dead?\n\n  Kate Kaplan\n  ·\n  4 min](/videos/is-the-floppy-disk-dead/?lm=indicators-validations-notifications&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/2-Factor_Authentication_2-FA_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  2-Factor Authentication (2-FA)\n\n  Tim Neusesser\n  ·\n  4 min](/videos/2-factor-authentication/?lm=indicators-validations-notifications&pt=article)\n\n## Related Articles:\n\n- [Top 10 Application-Design Mistakes\n\n  Jakob Nielsen and Page Laubheimer\n  ·\n  13 min](/articles/top-10-application-design-mistakes/?lm=indicators-validations-notifications&pt=article)\n- [OK-Cancel or Cancel-OK? The Trouble With Buttons\n\n  Jakob Nielsen\n  ·\n  2 min](/articles/ok-cancel-or-cancel-ok/?lm=indicators-validations-notifications&pt=article)\n- [Defeated By a Dialog Box\n\n  Jakob Nielsen\n  ·\n  6 min](/articles/defeated-by-a-dialog-box/?lm=indicators-validations-notifications&pt=article)\n- [Checkboxes vs. Radio Buttons\n\n  Jakob Nielsen\n  ·\n  6 min](/articles/checkboxes-vs-radio-buttons/?lm=indicators-validations-notifications&pt=article)\n- [Apps Within Apps: UX Lessons from WeChat Mini Programs\n\n  Feifei Liu\n  ·\n  9 min](/articles/wechat-mini-programs/?lm=indicators-validations-notifications&pt=article)\n- [Radio Buttons: Select One by Default or Leave All Unselected?\n\n  Kara Pernice\n  ·\n  12 min](/articles/radio-buttons-default-selection/?lm=indicators-validations-notifications&pt=article)",
  "tags": [
    "nngroup",
    "usability",
    "research",
    "heuristics"
  ],
  "extracted_at": "2026-02-03T12:44:03.683726+00:00",
  "content_length": 15819,
  "content_hash": "8f2ac62107229286"
}