{
  "id": "nngroup__articles_recognition-and-recall_",
  "source_id": "nngroup",
  "source_name": "Nielsen Norman Group Articles",
  "category": "ux_research",
  "url": "https://www.nngroup.com/articles/recognition-and-recall/",
  "title": "Memory Recognition and Recall in User Interfaces",
  "content": "8\nMemory Recognition and Recall in User Interfaces\nRaluca Budiu\nRaluca Budiu\nJanuary 15, 2024\n2024-01-15\nShare\nEmail article\nShare on LinkedIn\nShare on Twitter\nSummary:\nRecalling items from scratch is harder than recognizing the correct option in a list of choices because the extra context helps users retrieve information from memory.\nOne of the top\n10 usability heuristics\nadvises to promote recognition over recall in user-interface design. What are recognition and recall and why is recognition better than recall?\nIn This Article:\nTwo Types of Memory Retrieval: Recognition and Recall\nActivation of Content in Memory\nRecognition vs. Recall\nPromote Recognition in User Interfaces\nConclusion\nReference\nTwo Types of Memory Retrieval: Recognition and Recall\nPsychologists like to make the distinction between two types of memory retrieval: recognition versus recall.\nThink of meeting a person on the street. You can often tell quite easily if you have seen her before, but coming up with her name (if the person is familiar) is a lot harder. The first process is\nrecognition\n(you recognize the person as familiar); the second involves\nrecall\n.\nRecognition\nrefers to our ability to “recognize” an event or piece of information as being familiar, while\nrecall\ndesignates the retrieval of related details from memory.\nTo better understand the differences between recognition and recall and why recognition is preferable in user interfaces, we need to take a small excursion into how human memory works.\nActivation of Content in Memory\nOften psychologists think of\nmemory as organized in chunks\n: basic interconnected units. Each chunk can be described by its\nactivation\n: a measure of how easily that chunk can be retrieved from memory.\nFor example, your name is a chunk in memory; it has very high activation — if someone woke you up in the middle of the night and asked you what your name was, you’d be able to produce it fairly quickly. On the other hand, if you had to remember the name of your first-grade teacher, that answer would likely be harder to come up with: its activation is lower.\nThe activation of a chunk is influenced by three factors:\nPractice\n: how many times a chunk has been used in the past\nRecency\n: how recently a chunk has been used\nContext\n: what is present in the person’s focus of attention\nWe briefly review each of these individually.\nPractice\nCommon lore says that practice makes perfect. Indeed, the more you practice a piece of information, the more likely you are to remember it:\na chunk’s activation depends on the amount of practice that it has received.\nThat’s part of the reason why your name is so much more familiar than that of your first-grade teacher: it has received a lot more practice.\nRecency\nBut practice is not the only thing that influences activation:\nrecency\n,\nor how far away in the past you’ve used a chunk, also dictates how well you remember information\n. In other words, something that you’ve used very recently has a higher activation than a piece of information that has not been used for a while (like the name of your first-grade teacher).\nContext\nBesides practice and recency, the third factor that affects activation is\ncontext\n. To understand what that means, we need to take a step back and talk about associations.\nIn the beginning of this section, we said that chunks are interconnected memory units. The connection between two chunks is called\nassociation\n. If I say the word\nParis\nand ask you what words come to mind when you hear it, you may come up with\nFrance\n,\nfood, Eiffel Tower,\nor\nNapoleon.\nAll these words are strongly associated with\nParis\n, and, when\nParis\ngets in the focus of attention (that is, you’ve just heard it or read it), it spreads activation to other chunks associated with it. The most active chunk in your memory is the one selected as your first response; the next most active chunk will be your second response, and so on. (Note that the associations between concepts are highly personal and depend on previous experience: a French person may have different associations with the word\nParis\nthan an American.)\nThe concept of association is tremendously important in psychology: it forms the basis of learning and problem solving. It allows us to have a relevant conversation and it helps us discover new things.\nAssociations are the link between the present (the current context in which we are) and our previous experience and knowledge.\nBut how does context affect the retrieval of information from memory? It’s like\nProust’s madeleine\n: when something in our current environment (the smell and taste of a cookie) is strongly associated with a chunk in our memory, it spreads activation to that chunk and it makes it become more active. The madeleine episode from Proust’s childhood (although buried in the depths of memory and having very low activation in the beginning) suddenly became stronger because of the cue in the current context that spread activation to it.\n(Our training\nThe Human Mind and Usability\ndiscusses the concepts of memory and activation in more detail.)\nRecognition vs. Recall\nThe\ndifference between recognition and recall is the number of cues\nthat help memory retrieval; recall involves fewer cues than recognition.\nAnswering a question such as\nDid Herman Melville write Moby Dick?\ninvolves recognition: you simply have to recognize whether the information provided is correct. If, instead, I asked you\nWho wrote Moby Dick?\nyou would use a process of recall to retrieve the right answer from your memory.\nRecognition is easier than recall because it involves more cues\n: all those cues spread activation to related information in memory, raise the answer’s activation, and make you more likely to pick it. It’s the reason why multiple-choice questions are easier than\nopen-ended questions\n, where the respondent has to come up with an answer.\nIn our everyday life,\nwe often use a combination of recognition and recall to retrieve information from memory\n. Often, we start with a piece of information that is easy to recall to narrow down our choices, and then we go through the resulting choices one by one and recognize the relevant one.\nAn example is how people navigate to a site they’ve visited before. Say you want to go to our site: if you’ve been here a lot, you might recall that it’s called nngroup.com, and get here quickly. But many people would be able to recall only some terms they associate with the site, such as maybe\nusability\n,\nuser\nexperience\n, or\nNielsen\n. Luckily, entering such terms into a major search engine will bring up this website as one of the entries on the first page. This transforms your task into one of scanning the SERP (search-engine results page) and relying on recognition to pick out the desired website from among the other options listed. (In fact, a paper by Eytan Adar, Jaime Teevan, and Susan Dumais showed that this method of retracing the path to a previous page is the preferred method for revisiting content on the web.)\nSearch does require users to generate query terms from scratch — which\nmost people are bad at\n— but from then on, users can rely on recognition while using the search results. This is one of the reasons search engines have become such an essential tool for using the web. Search suggestions are a major advance in search usability because they partly transform the query-generation task from one of recall to one of recognition.\nRecall in User Interfaces\nThe classic example of recall in an interface is logging in. When you log in to a site, you must remember both a username (or email) and a password. You receive very few cues to help you with that memory retrieval: usually, just the site itself. Some people make it easier for themselves by using the same credentials everywhere on the web. Others create a password that is related to the site (e.g.,\namazonpassword\nfor Amazon.com or\nbuyshoes\non zappos.com) so that they increase their ability to recall by making the site a stronger cue. And many others\njust keep their passwords somewhere on their computer\n, in a password manager, or on a piece of paper.\nRecognition in User Interfaces\nA\nmenu\nsystem is the most classic example of a recognition-based user interface: the computer shows you the available commands, and you recognize the one you want.\nSay, for example, that you’re working with a word processor and want to draw a line through a sentence to indicate that it's no longer valid. Before the advent of\ndirect manipulation\nand graphical user interfaces, you would have had to recall the name of this rarely used formatting feature. A difficult and error-prone task. Now, however, you can look at the menu of formatting options and easily recognize the term\nStrikethrough\nas being the one you want.\nPromote Recognition in User Interfaces\nHow do you promote recognition? By\nmaking information and interface functions visible and easily accessible\n.\nAn application or a website usually has two components:\nThe\nchrome\nor\nthe interface\n: namely all the buttons, navigation, and other elements that are there to help the user reach his goal\nThe content\n: the information that users need to achieve their goals\nYou can make both the content and the interface easy to remember\n; both can benefit from designing for recognition rather than recall.\nNext, we look at a few successful and less successful examples of supporting retrieval of information through recognition.\nHistory and Previously Visited Content\nProviding access to the pages recently visited and searches performed in the near past can help users resume tasks that they left incomplete and that may have difficulty recalling. Search engines such as Google and Bing often help users retrace their searches by providing past histories.\nBing.com: The option\nSearch History\nin the menu\nserves to help users remember previous searches.\nAmazon (and many other ecommerce websites) shows users lists of items that they visited recently. These lists help users remember to finish a purchase that they may have started a few days ago. They promote recognition, because users don’t need to remember interesting information that they may have seen in the past or recall what that product might have been called.\nWhen a user goes back to Amazon.com, the personalized homepage includes a list of recently viewed and purchased items\n.\n​Other tools that let users save information in an app or on a website (favorites,\nwish lists\n, shopping lists, etc.) all help with making content easily accessible via recognition.\nVisible, Intuitive Chrome\nCommand-line interfaces are based on recall\n. If you wanted to rename a file called\nmyfile\nin a UNIX system, you would have to type the command\nmv\nmyfile\nyourfile\n. You would need to recall not only that\nmv\nis the command for move, but also the correct order of the arguments.\nWhen direct manipulation and WYSIWYG came around, the idea was to replace some of these commands with actions that would be intuitive, so people would not need to recall anything. The other alternative to command language was based on buttons and menus: the available commands would be visible in the interface and users would be able to select them.\nGestural interfaces\nalso rely heavily on recall because they require users to remember the gestures that they can make in a given context.\nTips\n,\nprogressive disclosure\n, and good gestural signifiers are all cues meant to make the recall of the gesture easier.\nMany mobile apps start with tutorials\nthat explain to users how they are supposed to use the apps. People are supposed to memorize that information and remember it when they need it. That’s not going to happen: tutorials have a lot of information, but they are not rehearsed much and users have little time to establish associations between the information in the tutorial and the actual interface. Instead of showing general tutorials, use contextual tips tailored to the page that the user is visiting. Those will allow the user to recognize which actions they may want to do and how.\nVolvo’s mobile app: The icons do not promote recognition: it’s hard for users to recognize what those buttons might mean. Having a label next to some of these icons would help at least the first few times when the user is using the app.\nConclusion\nHow easily information can be retrieved from memory depends on how often we’ve encountered that information, how recently we’ve used it, and how much it is related to the current context. Richer contexts (like those present when we use recognition rather than recall) make memory retrieval easier. Interfaces that promote recognition give users extra help in remembering information, be it about tasks and items that they had seen before or about interface functionality.\nReference\nEytan Adar, Jaime Teevan, and Susan T. Dumais. 2008. Large scale analysis of web revisitation patterns. In\nProceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08)\n. Association for Computing Machinery, New York, NY, USA, 1197–1206. https://doi.org/10.1145/1357054.1357241​\nFree Downloads\nJakob's Usability Heuristic #6 Poster\n(PDF)\nJakob's Usability Heuristics #6 Poster, A4 Size\n(PDF)\nJakob's Usability Heuristics #6 Poster, Letter Size\n(PDF)\nRelated Courses\nThe Human Mind and Usability\nUse psychology to predict and explain how your customers think and act\nInteraction\nPersuasive and Emotional Design\nCreate delightful experiences that touch, convince, or excite your audience\nInteraction\nUX Basic Training\nFoundational concepts that everyone should know\nInteraction\nmemory,Psychology and UX,Human Computer Interaction,Heuristic Evaluation\nRelated Topics\nPsychology and UX\nPsychology and UX\nHuman Computer Interaction\nHeuristic Evaluation\nLearn More:\nEnable cookies\nto watch NN/g videos\nUsability Heuristic 6: Recognition vs. Recall in User Interfaces\nRaluca Budiu\n·\n3 min\nPrimacy Effect: Put Important Things First\nCaleb Sponheim\n·\n3 min\nShort-Term Memory Limitations Impact User Interface Design\nGarrett Goldfield\n·\n3 min\nWorking Memory and External Memory\nRaluca Budiu\n·\n5 min\nRelated Articles:\nShort-Term Memory and Web Usability\nJakob Nielsen\n·\n4 min\nThe Power Law of Learning: Consistency vs. Innovation in User Interfaces\nRaluca Budiu\n·\n11 min\nPriming and User Interfaces\nRaluca Budiu\n·\n4 min\nThe Peak–End Rule: How Impressions Become Memories\nLexie Kane\n·\n7 min\nWorking Memory and External Memory\nRaluca Budiu\n·\n7 min\nThree Pillars of User Delight\nTherese Fessenden\n·\n8 min",
  "content_markdown": "8\n\n# Memory Recognition and Recall in User Interfaces\n\nRaluca Budiu\n\n![](https://media.nngroup.com/media/people/photos/2023-04-portraits-raluca.jpg.256x256_q75_autocrop_crop-smart_upscale.jpg)\n\n[Raluca Budiu](/articles/author/raluca-budiu/)\n\nJanuary 15, 2024\n2024-01-15\n\n[Share](#)\n\n- [Email article](mailto:?subject=NN/g Article: Memory Recognition and Recall in User Interfaces&body=https://www.nngroup.com/articles/recognition-and-recall/)\n- [Share on LinkedIn](http://www.linkedin.com/shareArticle?mini=true&url=http://www.nngroup.com/articles/recognition-and-recall/&title=Memory Recognition and Recall in User Interfaces&source=Nielsen%20Norman%20Group)\n- [Share on Twitter](https://twitter.com/intent/tweet?url=http://www.nngroup.com/articles/recognition-and-recall/&text=Memory Recognition and Recall in User Interfaces&via=nngroup)\n\nSummary: \nRecalling items from scratch is harder than recognizing the correct option in a list of choices because the extra context helps users retrieve information from memory.\n\nOne of the top [10 usability heuristics](http://www.nngroup.com/articles/ten-usability-heuristics/) advises to promote recognition over recall in user-interface design. What are recognition and recall and why is recognition better than recall?\n\n## In This Article:\n\n- [Two Types of Memory Retrieval: Recognition and Recall](#toc-two-types-of-memory-retrieval-recognition-and-recall-1)\n- [Activation of Content in Memory](#toc-activation-of-content-in-memory-2)\n- [Recognition vs. Recall](#toc-recognition-vs-recall-3)\n- [Promote Recognition in User Interfaces](#toc-promote-recognition-in-user-interfaces-4)\n- [Conclusion](#toc-conclusion-5)\n- [Reference](#toc-reference-6)\n\n## Two Types of Memory Retrieval: Recognition and Recall\n\nPsychologists like to make the distinction between two types of memory retrieval: recognition versus recall.\n\nThink of meeting a person on the street. You can often tell quite easily if you have seen her before, but coming up with her name (if the person is familiar) is a lot harder. The first process is **recognition** (you recognize the person as familiar); the second involves **recall**.\n\n**Recognition** refers to our ability to “recognize” an event or piece of information as being familiar, while **recall** designates the retrieval of related details from memory.\n\nTo better understand the differences between recognition and recall and why recognition is preferable in user interfaces, we need to take a small excursion into how human memory works.\n\n## Activation of Content in Memory\n\nOften psychologists think of **memory as organized in chunks**: basic interconnected units. Each chunk can be described by its **activation**: a measure of how easily that chunk can be retrieved from memory.\n\nFor example, your name is a chunk in memory; it has very high activation — if someone woke you up in the middle of the night and asked you what your name was, you’d be able to produce it fairly quickly. On the other hand, if you had to remember the name of your first-grade teacher, that answer would likely be harder to come up with: its activation is lower.\n\nThe activation of a chunk is influenced by three factors:\n\n- **Practice**: how many times a chunk has been used in the past\n- **Recency**: how recently a chunk has been used\n- **Context**: what is present in the person’s focus of attention\n\nWe briefly review each of these individually.\n\n### **Practice**\n\nCommon lore says that practice makes perfect. Indeed, the more you practice a piece of information, the more likely you are to remember it: **a chunk’s activation depends on the amount of practice that it has received.** That’s part of the reason why your name is so much more familiar than that of your first-grade teacher: it has received a lot more practice.\n\n### **Recency**\n\nBut practice is not the only thing that influences activation: **recency**, **or how far away in the past you’ve used a chunk, also dictates how well you remember information**. In other words, something that you’ve used very recently has a higher activation than a piece of information that has not been used for a while (like the name of your first-grade teacher).\n\n### **Context**\n\nBesides practice and recency, the third factor that affects activation is **context**. To understand what that means, we need to take a step back and talk about associations.\n\nIn the beginning of this section, we said that chunks are interconnected memory units. The connection between two chunks is called **association**. If I say the word *Paris* and ask you what words come to mind when you hear it, you may come up with *France*, *food, Eiffel Tower,* or *Napoleon.* All these words are strongly associated with *Paris*, and, when *Paris* gets in the focus of attention (that is, you’ve just heard it or read it), it spreads activation to other chunks associated with it. The most active chunk in your memory is the one selected as your first response; the next most active chunk will be your second response, and so on. (Note that the associations between concepts are highly personal and depend on previous experience: a French person may have different associations with the word *Paris* than an American.)\n\nThe concept of association is tremendously important in psychology: it forms the basis of learning and problem solving. It allows us to have a relevant conversation and it helps us discover new things. **Associations are the link between the present (the current context in which we are) and our previous experience and knowledge.**\n\nBut how does context affect the retrieval of information from memory? It’s like [Proust’s madeleine](https://en.wikipedia.org/wiki/Madeleine_(cake)): when something in our current environment (the smell and taste of a cookie) is strongly associated with a chunk in our memory, it spreads activation to that chunk and it makes it become more active. The madeleine episode from Proust’s childhood (although buried in the depths of memory and having very low activation in the beginning) suddenly became stronger because of the cue in the current context that spread activation to it.\n\n(Our training [The Human Mind and Usability](http://www.nngroup.com/courses/human-mind/) discusses the concepts of memory and activation in more detail.)\n\n## Recognition vs. Recall\n\nThe **difference between recognition and recall is the number of cues** that help memory retrieval; recall involves fewer cues than recognition.\n\nAnswering a question such as *Did Herman Melville write Moby Dick?* involves recognition: you simply have to recognize whether the information provided is correct. If, instead, I asked you *Who wrote Moby Dick?* you would use a process of recall to retrieve the right answer from your memory.\n\n**Recognition is easier than recall because it involves more cues**: all those cues spread activation to related information in memory, raise the answer’s activation, and make you more likely to pick it. It’s the reason why multiple-choice questions are easier than [open-ended questions](https://www.nngroup.com/articles/open-ended-questions/), where the respondent has to come up with an answer.\n\nIn our everyday life, **we often use a combination of recognition and recall to retrieve information from memory**. Often, we start with a piece of information that is easy to recall to narrow down our choices, and then we go through the resulting choices one by one and recognize the relevant one.\n\nAn example is how people navigate to a site they’ve visited before. Say you want to go to our site: if you’ve been here a lot, you might recall that it’s called nngroup.com, and get here quickly. But many people would be able to recall only some terms they associate with the site, such as maybe *usability*, *user* *experience*, or *Nielsen*. Luckily, entering such terms into a major search engine will bring up this website as one of the entries on the first page. This transforms your task into one of scanning the SERP (search-engine results page) and relying on recognition to pick out the desired website from among the other options listed. (In fact, a paper by Eytan Adar, Jaime Teevan, and Susan Dumais showed that this method of retracing the path to a previous page is the preferred method for revisiting content on the web.)\n\nSearch does require users to generate query terms from scratch — which [most people are bad at](http://www.nngroup.com/articles/incompetent-search-skills/) — but from then on, users can rely on recognition while using the search results. This is one of the reasons search engines have become such an essential tool for using the web. Search suggestions are a major advance in search usability because they partly transform the query-generation task from one of recall to one of recognition.\n\n### **Recall in User Interfaces**\n\nThe classic example of recall in an interface is logging in. When you log in to a site, you must remember both a username (or email) and a password. You receive very few cues to help you with that memory retrieval: usually, just the site itself. Some people make it easier for themselves by using the same credentials everywhere on the web. Others create a password that is related to the site (e.g., *amazonpassword* for Amazon.com or *buyshoes* on zappos.com) so that they increase their ability to recall by making the site a stronger cue. And many others [just keep their passwords somewhere on their computer](http://www.nngroup.com/articles/security-and-human-factors/), in a password manager, or on a piece of paper.\n\n### **Recognition in User Interfaces**\n\nA [menu](https://www.nngroup.com/articles/menu-design/) system is the most classic example of a recognition-based user interface: the computer shows you the available commands, and you recognize the one you want.\n\nSay, for example, that you’re working with a word processor and want to draw a line through a sentence to indicate that it's no longer valid. Before the advent of [direct manipulation](https://www.nngroup.com/articles/direct-manipulation/) and graphical user interfaces, you would have had to recall the name of this rarely used formatting feature. A difficult and error-prone task. Now, however, you can look at the menu of formatting options and easily recognize the term *Strikethrough* as being the one you want.\n\n## **Promote Recognition in User Interfaces**\n\nHow do you promote recognition? By **making information and interface functions visible and easily accessible**.\n\nAn application or a website usually has two components:\n\n- **The [chrome](http://www.nngroup.com/articles/browser-and-gui-chrome/)** or **the interface**: namely all the buttons, navigation, and other elements that are there to help the user reach his goal\n- **The content**: the information that users need to achieve their goals\n\n**You can make both the content and the interface easy to remember**; both can benefit from designing for recognition rather than recall.\n\nNext, we look at a few successful and less successful examples of supporting retrieval of information through recognition.\n\n### History and Previously Visited Content\n\nProviding access to the pages recently visited and searches performed in the near past can help users resume tasks that they left incomplete and that may have difficulty recalling. Search engines such as Google and Bing often help users retrace their searches by providing past histories.\n\n![](https://media.nngroup.com/media/editor/2024/01/15/bing.png)\n\n*Bing.com: The option* Search History *in the menu* *serves to help users remember previous searches.*\n\nAmazon (and many other ecommerce websites) shows users lists of items that they visited recently. These lists help users remember to finish a purchase that they may have started a few days ago. They promote recognition, because users don’t need to remember interesting information that they may have seen in the past or recall what that product might have been called.\n\n![](https://media.nngroup.com/media/editor/2024/01/15/amazon.png)\n\n*When a user goes back to Amazon.com, the personalized homepage includes a list of recently viewed and purchased items*.\n\n​Other tools that let users save information in an app or on a website (favorites, [wish lists](http://www.nngroup.com/articles/wishlists-gift-certificates/), shopping lists, etc.) all help with making content easily accessible via recognition.\n\n### **Visible, Intuitive Chrome**\n\n**Command-line interfaces are based on recall**. If you wanted to rename a file called *myfile* in a UNIX system, you would have to type the command *mv* *myfile* *yourfile*. You would need to recall not only that *mv* is the command for move, but also the correct order of the arguments.\n\nWhen direct manipulation and WYSIWYG came around, the idea was to replace some of these commands with actions that would be intuitive, so people would not need to recall anything. The other alternative to command language was based on buttons and menus: the available commands would be visible in the interface and users would be able to select them.\n\n[Gestural interfaces](http://www.jnd.org/dn.mss/gestural_interfaces_a_step_backwards_in_usability_6.html) also rely heavily on recall because they require users to remember the gestures that they can make in a given context. [Tips](https://www.nngroup.com/articles/onboarding-tutorials/), [progressive disclosure](https://www.nngroup.com/articles/progressive-disclosure/), and good gestural signifiers are all cues meant to make the recall of the gesture easier.\n\n[Many mobile apps start with tutorials](https://www.nngroup.com/articles/mobile-tutorials/) that explain to users how they are supposed to use the apps. People are supposed to memorize that information and remember it when they need it. That’s not going to happen: tutorials have a lot of information, but they are not rehearsed much and users have little time to establish associations between the information in the tutorial and the actual interface. Instead of showing general tutorials, use contextual tips tailored to the page that the user is visiting. Those will allow the user to recognize which actions they may want to do and how.\n\n![](https://media.nngroup.com/media/editor/2024/01/15/img_8617.PNG)\n\n*Volvo’s mobile app: The icons do not promote recognition: it’s hard for users to recognize what those buttons might mean. Having a label next to some of these icons would help at least the first few times when the user is using the app.*\n\n## Conclusion\n\nHow easily information can be retrieved from memory depends on how often we’ve encountered that information, how recently we’ve used it, and how much it is related to the current context. Richer contexts (like those present when we use recognition rather than recall) make memory retrieval easier. Interfaces that promote recognition give users extra help in remembering information, be it about tasks and items that they had seen before or about interface functionality.\n\n## Reference\n\nEytan Adar, Jaime Teevan, and Susan T. Dumais. 2008. Large scale analysis of web revisitation patterns. In *Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08)*. Association for Computing Machinery, New York, NY, USA, 1197–1206. https://doi.org/10.1145/1357054.1357241​\n\n## Free Downloads\n\n- ![](https://media.nngroup.com/static/img/icons/download_24px.svg)\n  [Jakob's Usability Heuristic #6 Poster (PDF)](//media.nngroup.com/media/articles/attachments/Heuristic_6_compressed.pdf)\n- ![](https://media.nngroup.com/static/img/icons/download_24px.svg)\n  [Jakob's Usability Heuristics #6 Poster, A4 Size (PDF)](//media.nngroup.com/media/articles/attachments/Heuristic_6_A4_compressed.pdf)\n- ![](https://media.nngroup.com/static/img/icons/download_24px.svg)\n  [Jakob's Usability Heuristics #6 Poster, Letter Size (PDF)](//media.nngroup.com/media/articles/attachments/Heuristic_6_Letter_compressed.pdf)\n\n## Related Courses\n\n- [#### The Human Mind and Usability\n\n  Use psychology to predict and explain how your customers think and act\n\n  Interaction](/courses/human-mind/?lm=recognition-and-recall&pt=article)\n- [#### Persuasive and Emotional Design\n\n  Create delightful experiences that touch, convince, or excite your audience\n\n  Interaction](/courses/persuasive-emotional-design/?lm=recognition-and-recall&pt=article)\n- [#### UX Basic Training\n\n  Foundational concepts that everyone should know\n\n  Interaction](/courses/ux-basic-training/?lm=recognition-and-recall&pt=article)\n\nmemory,Psychology and UX,Human Computer Interaction,Heuristic Evaluation\n\n## Related Topics\n\n- Psychology and UX\n  [Psychology and UX](/topic/psychology-and-ux/)\n- [Human Computer Interaction](/topic/human-computer-interaction/)\n- [Heuristic Evaluation](/topic/heuristic-evaluation/)\n\n## Learn More:\n\n[![Usability Heuristic 6: Recognition vs. Recall in User Interfaces](https://media.nngroup.com/media/videos/thumbnails/Recognition_Vs_Recall_Thumbnail.jpg.1300x728_q75_autocrop_crop-smart_upscale.jpg)](https://www.youtube.com/watch?v=6glQPp6q4Jc \"Usability Heuristic 6: Recognition vs. Recall in User Interfaces on YouTube (new window)\")\n\nEnable cookies\n to watch NN/g videos\n\nUsability Heuristic 6: Recognition vs. Recall in User Interfaces\n\n Raluca Budiu\n·\n3 min\n\n- [![](https://media.nngroup.com/media/videos/thumbnails/Primacy_Effect.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Primacy Effect: Put Important Things First\n\n  Caleb Sponheim\n  ·\n  3 min](/videos/primacy-effect/?lm=recognition-and-recall&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/ShortTermMemory.jpeg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Short-Term Memory Limitations Impact User Interface Design\n\n  Garrett Goldfield\n  ·\n  3 min](/videos/short-term-memory-ui-design/?lm=recognition-and-recall&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Working_Memory_and_External_Memory_Video_Thumbnail.jpeg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Working Memory and External Memory\n\n  Raluca Budiu\n  ·\n  5 min](/videos/working-memory-external-memory/?lm=recognition-and-recall&pt=article)\n\n## Related Articles:\n\n- [Short-Term Memory and Web Usability\n\n  Jakob Nielsen\n  ·\n  4 min](/articles/short-term-memory-and-web-usability/?lm=recognition-and-recall&pt=article)\n- [The Power Law of Learning: Consistency vs. Innovation in User Interfaces\n\n  Raluca Budiu\n  ·\n  11 min](/articles/power-law-learning/?lm=recognition-and-recall&pt=article)\n- [Priming and User Interfaces\n\n  Raluca Budiu\n  ·\n  4 min](/articles/priming/?lm=recognition-and-recall&pt=article)\n- [The Peak–End Rule: How Impressions Become Memories\n\n  Lexie Kane\n  ·\n  7 min](/articles/peak-end-rule/?lm=recognition-and-recall&pt=article)\n- [Working Memory and External Memory\n\n  Raluca Budiu\n  ·\n  7 min](/articles/working-memory-external-memory/?lm=recognition-and-recall&pt=article)\n- [Three Pillars of User Delight\n\n  Therese Fessenden\n  ·\n  8 min](/articles/pillars-user-delight/?lm=recognition-and-recall&pt=article)",
  "tags": [
    "nngroup",
    "usability",
    "research",
    "heuristics"
  ],
  "extracted_at": "2026-02-03T12:43:00.322089+00:00",
  "content_length": 14467,
  "content_hash": "c3d5587170324dc6"
}