{
  "id": "nngroup__articles_modal-nonmodal-dialog_",
  "source_id": "nngroup",
  "source_name": "Nielsen Norman Group Articles",
  "category": "ux_research",
  "url": "https://www.nngroup.com/articles/modal-nonmodal-dialog/",
  "title": "Modal & Nonmodal Dialogs: When (& When Not) to Use Them",
  "content": "10\nModal & Nonmodal Dialogs: When (& When Not) to Use Them\nTherese Fessenden\nTherese Fessenden\nApril 23, 2017\n2017-04-23\nShare\nEmail article\nShare on LinkedIn\nShare on Twitter\nSummary:\nModal dialogs interrupt users and demand an action. They are appropriate when user’s attention needs to be directed toward important information.\nTo better understand the difference between modal and nonmodal dialogs, let’s look at what the terms “dialog” and “modal,” mean.\nA\ndialog\n(or\ndialogue\n) refers to a conversation between two people. In user interfaces, a dialog is a “conversation” between the system and the user, and often requests information or an action from the user.\nUser-interface\nmodes\nare special states in which the same system has somewhat different user interfaces. Each mode may come with different commands, or the same command (or action) can produce different results depending on the mode of system. In other words, in different modes, the same input will have different results. For example, a computer with Caps Lock turned on is in a special mode: all the letters being typed will be shown as capital letters. Typing a letter has a different effect when the Caps Lock is on versus when it’s off. Or, in Microsoft Word’s Track Changes mode, all previously made edits and comments are visible (whereas in the normal, default mode they are not tracked or displayed).\nWith this understanding of “mode” and “dialog”, we can easily define modal dialogs.\nModal dialog:\nA dialog that appears on top of the main content and moves the system into a special mode requiring user interaction. This dialog disables the main content until the user explicitly interacts with the modal dialog.\nA modal dialog is like my cat, Emma — who meows at 7am every morning to prompt me to feed her. I might be trying to sleep or get ready for the day, but my cat will place herself in front of me, then meow louder and incessantly until I look at her. I have to stop what I am doing to address the cat immediately if I ever hope to finish my task. Sometimes she chooses to do this at 3am while we are sleeping. Should we have guests staying over, it can get annoying and embarrassing. (In defense of my cat, once I feed her, she is very calm and has a sweet and sociable temperament.)\nIn contrast,\nnonmodal\n(or\nmodeless\n) dialogs and windows do not disable the main content: showing the dialog box doesn’t change the functionality of the user interface. The user can continue interacting with the main content (and perhaps even move the window, minimize it, etc.) while the dialog is open. To continue our cat analogy, a nonmodal dialog is like a kitty who patiently sits near the dinner table during a meal, waiting for the off chance that food scraps may fall from the table. When Emma is doing this, I can eat, have a conversation, and enjoy dinner without much interruption. I can choose to either ignore her altogether, or, as my husband likes to do, slip a bite of food to her under the table near the end of the meal. (She is very well-fed, as you might be able to tell.)\nModal dialogs were originally intended to alert users to an error or to some other system state that required immediate user action. In these cases, it was essential for users to be interrupted in order to fix the\nerror\n. Thus, placing the dialog box in the middle of the screen as the focal point of the interface, made it very effective. The big advantage of such modal dialogs was that they attracted users’ attention and allowed them to acknowledge the problem and correct it quickly.\nHowever, this original use has evolved, and now modal dialogs and windows are used persuasively to attract user attention for legitimate or less legitimate reasons.\nIn This Article:\nDisadvantages of Modal Dialogs\nGuidelines for Using Modal Dialogs\nConsider Nonmodal Dialogs Instead\nConclusion\nDisadvantages of Modal Dialogs\nHere are some of the common problems caused by modal dialogs:\nThey require immediate attention.\nModal windows, by their nature, are compulsory and require the user to act immediately. Since the dialogs place the system in a different mode, users cannot continue what they are doing until they acknowledge the dialog.\nThey interrupt the user’s workflow.\nModal dialogs force users away from the tasks they were working on in the first place. Each interruption translates in lost time and effort, not only because users must address the dialog, but also because, once they go back to their original tasks, people will have to spend some time recovering context.\nThey cause users to forget what they were doing.\nOnce the context is switched to a different task, because of the additional\ncognitive load\nimposed by the modal dialog, people may forget some of the details associated with the original task. If that is the case, recovering context for the original task may be even more difficult.\nThey cause the users to create and address an extra goal — to dismiss the dialog.\nWhen the dialog is presented, extra steps are added to the user’s workflow: to read and comprehend the dialog, then make a decision on that dialog. This increase in\ninteraction cost\nis likely to put off users, unless the dialog is well justified and indeed contains important information. We will elaborate more on this point later.\nThey block the content in the background.\nWhen a dialog appears on top of the current window, it can cover important content and remove context. As a result, it may become harder to respond to the dialog when the dialog asks a question related to information that was just obscured.\nBecause of these disadvantages, modal dialogs become problematic when used for noncritical activities.\nGuidelines for Using Modal Dialogs\nWhen is it appropriate to use modal dialogs? Here are a few guidelines to help determine if modal dialogs are truly necessary.\n1. Use modal dialogs for important warnings, as a way to prevent or correct critical errors.\nWhenever there is a chance that users’ work be lost or that an action may have destructive, irreversible consequences, interrupt the users to avoid a disaster.\nTo determine what error is severe enough to warrant a modal dialog, consider the following:\nWould the problem be easier or harder to correct if users’ attention is taken away from the task?\nIt is always good to\nprevent human error before it happens\n, if possible. However, once the error was made, it may be easier to fix it if the error message is presented within the main content instead of in a modal dialog. For example, an error in a form should be reported on the page, next to where it occurred, so that users can refer to the error message while they fix the problem. But informing the user that her computer will be restarted in 10 seconds could be displayed in a modal dialog, to make sure that the user notices the message.\nIs the error irreversible?\nIrreversible errors often result in the loss of information, which can be especially damaging for complex and time-intensive tasks. For example, failing to add an item to a cart might be an unfortunate error for an ecommerce business, but not irreversible to its users should they not notice a subtle notification (they can redo their action if they really wanted the item). On the other hand, overwriting a file or failing to save changes to hundreds of slides are both irreversible actions, and, thus, an interruption is much needed, and often welcomed.\nMicrosoft Powerpoint uses modal dialogs to prevent irreversible errors or unintended user actions, like quitting an application without saving work.\nGoogle Mail desktop app: This modal dialog appears when users forget to attach files after including key phrases like “I have attached” or “Please see attached” in their messages. This dialog prevents user error (and awkward follow-up emails).\n2. Use modal dialogs to request the user to enter information critical to continuing the current process.\nWhen missing information prevents the system from continuing a user-initiated process, a modal dialog can prompt the user for that information.\nEtsy, shown below, uses a modal window to interrupt the user for login information when that user attempts to save an item to a list of favorites.\nEtsy uses modal dialogs whenever a user attempts a task in which further steps are required before continuing. For example, when a user attempts to mark an item as a “favorite,” and the user is not logged in, a dialog appears in order to gain the required information to conduct the desired action.\n3. Modal dialogs can be used to fragment a complex workflow into simpler steps.\nWhen it comes to workflows,\nfaster isn’t always better\n. For time-consuming and mentally (and emotionally) involved tasks, it can be overwhelming to ask for lots of information all at once. In those situations, modal dialogs can be used to break complex information up into simpler, more digestible chunks. Wizards are common instances of such a use of modal dialogs.\nHowever, it’s important to note that a modal with multiple steps will just prolong the amount of time spent away from the main tasks, making it more likely that users will forget what they were doing in the first place. So if you must do multiple-step modals, give users a sense of their progress, so they don’t abandon immediately. That said, if it requires multiple steps to begin with, it probably justifies dedicating a full page to it.\n4. Use modal dialogs to ask for information that, when provided, could significantly lessen users’ work or effort.\nModals can work effectively when the information being requested or presented is relevant or can streamline the completion of the current task.\nIn the case of Zillow.com, a real-estate website, users can browse property listings without having an account or real-estate agent. However, when they attempt to contact an agent for a listing, the site displays a modal dialog asking them whether they already have an agent. This information is not critical to the immediate next step (contacting the listing agent), but it can still be valuable in streamlining future interactions. The dialog uses\nprogressive profiling\nand presents one easy-to-answer question at a time. These questions are low-commitment and focused on relevant details.\nZillow.com asks users for more information after they submit inquiries about a certain listing. It makes sense to ask whether the user has a real-estate agent at this point, because it reduces the chances of redundant conversations with other agents in the future.\nThe key with progressive profiling is that they follow the user’s expectation of the workflow — interruptions only help when they are relevant or helpful to the current task.\n5. Do not use modal dialogs for nonessential information that is not related to the current user flow.\nAs discussed above, modal dialogs have numerous disadvantages and costs to users. In order for these costs to be justified, their relevance to the task and importance should be high. Modal dialogs that are not directly related to users’ goals are perceived as annoying and can diminish\ntrust\nin the company.\nAdditionally, when nonessential information is presented in a high-priority format such as a modal dialog, users will refuse to give attention to further instances of this format. It’s much like in Aesop’s fable, “The Boy Who Cried Wolf”— repeatedly misleading others will make them not give you their trust when you really need it.\nContrary to popular belief, mailing list signups, while critical for generating business leads, are not critical to the user. In a recent web-usability study, we heard visceral disdain for modal dialogs pertaining to email newsletter signups.\nGoodHousekeeping.com goes the extra mile with the modal mailing-list dialog — not only is the background deactivated, but it’s replaced altogether with a full-screen photo, removing all context of where the user is on the website. It also appears within the first 3 seconds after the user first landed on the site’s homepage, giving users no time to glean any value from that page. The dialog demands information that is not essential for users or their workflow and provides almost no context or\nperceived value\n.\nTop: Wayfair uses modal dialogs to request the user to specify a board where this item should be pinned. Another UI element (such as an option within the main content) would be more appropriate for entering this information. Bottom: After the board has been selected, Wayfair uses a modal dialog to ask users to invite friends to their boards — an action that is not essential to users and increases the interaction cost of pinning an item.\n6. Avoid modal dialogs that interrupt high-stake processes such as checkout flows.\nCheckout\nis a high-stakes process for both users and businesses: users want to ensure that the process is seamless, secure, and error-free, and businesses want to ensure the user follows through on their purchasing decision. Modal dialogs, if unwarranted, can distract users at best and erode user confidence at worst.\nAn older version of Walmart.com used a modal dialog to prompt users to log in during checkout. At best, this modal could distract users and launch them into a full-fledged quest to find the Walmart.com password rather than simply completing checkout as a guest. At worst, users may feel that they’re pressured into creating an account — and that alone can influence a purchasing decision. Walmart has since redesigned its website to remove this modal dialog (but the redesign also removed guest checkout completely and now\nrequires users to have an account\nfor checking out — which, to be honest, is just as off-putting).\nWalmart’s modal dialog has the potential of being a dangerous rabbit hole into relevant, but not critical tasks.\n7. Avoid modal dialogs for complex decision making that requires additional sources of information unavailable in the modal.\nModal dialogs should be used for short, direct dialogs with the user. If a modal requires the user to do complex research or consult additional sources of information (potentially blocked by the modal), then it’s not the right UI element for that interaction.\nFrontier Airlines uses a modal dialog to promote an upsell on its basic flights. The dialog requires users to decide on spending more money, but it does not allow them to access additional information necessary for making that decision (e.g., if there are any decent seats left).\nConsider Nonmodal Dialogs Instead\nIn situations where the task is not critical, a nonmodal dialog might be appropriate. Nonmodal dialogs are less offensive than modal ones because they allow users to continue their activity and ignore them if they are irrelevant. However, they can still be disruptive, especially if they obscure important information on the screen or if they require too complex interactions.\nMoreover, some nonmodal dialogs do not translate well across devices and browsers — for example, a nonmodal window in Chrome on a desktop may become a modal one in Safari on an iPhone, such as with Meowbox.com below.\nOn the Meowbox.com desktop site (left), a timed nonmodal dialog for newsletter signups appears in the bottom right corner of the homepage. However, on the mobile rendering of the site (right), the nonmodal window becomes a full-screen modal window, forcing the user to provide input before moving forward. While the desktop version allows easy dismissal of the prompt, the mobile version does not.\nNonmodal windows are useful when users need to quickly switch between modes in order to access certain information. For example, Google Mail uses nonmodal windows as the default method for composing new email messages. Users can continue working with this window open, minimize the composed email without losing it (or optionally, maximize it into a modal window). This separate view allows users to locate older emails or additional information that might be helpful for composing the current email.\nGoogle Mail’s nonmodal windows allow for easy switching between writing and reading information.\nConclusion\nBoth modal and nonmodal dialogs are useful and request or encourage user participation. When it comes to deciding between these two types of dialogs, consider the user context and the workflow. Avoid unnecessarily interrupting users and\ndisrupting their workflows\n. Make it easier for users to solve problems and accomplish their goals. If a company wishes to make sustainable progress toward business goals, user goals must be prioritized during these design decisions.\nWhen it comes to modal dialogs, consider this: no one likes to be interrupted, but if you must, make sure it’s worth the cost.\nRelated Courses\nDesigning Complex Apps for Specialized Domains\nCreate and evaluate applications for advanced decision making, complicated workflows, and complex domains\nInteraction\nApplication Design for Web and Desktop\nComponents, design patterns, workflows, and ways of interacting with complex data\nInteraction\nDesign Patterns,advertising,ui elements,Application Design,workflow\nRelated Topics\nDesign Patterns\nDesign Patterns\nApplication Design\nLearn More:\nCookie Permissions: 5 Common User Types\nSamhita Tankala\n·\n3 min\nCookie Permissions: 6 Design Guidelines\nSamhita Tankala\n·\n5 min\nAccordions: 5 Scenarios to Avoid Them\nHuei-Hsin Wang\n·\n3 min\nRelated Articles:\nOverlay Overload: Competing Popups Are an Increasing Menace\nKate Moran\n·\n6 min\nInclusive Design\nAlita Kendrick\n·\n6 min\nCancel vs Close: Design to Distinguish the Difference\nAurora Harley\n·\n6 min\nWhich UX Deliverables Are Most Commonly Created and Shared?\nPage Laubheimer\n·\n7 min\nWizards: Definition and Design Recommendations\nRaluca Budiu\n·\n10 min\n10 Design Guidelines for Reporting Errors in Forms\nRachel Krause\n·\n6 min",
  "content_markdown": "10\n\n# Modal & Nonmodal Dialogs: When (& When Not) to Use Them\n\nTherese Fessenden\n\n![](https://media.nngroup.com/media/people/photos/Therese-021.jpg.256x256_q75_autocrop_crop-smart_upscale.jpg)\n\n[Therese Fessenden](/articles/author/therese-fessenden/)\n\nApril 23, 2017\n2017-04-23\n\n[Share](#)\n\n- [Email article](mailto:?subject=NN/g Article: Modal & Nonmodal Dialogs: When (& When Not) to Use Them&body=https://www.nngroup.com/articles/modal-nonmodal-dialog/)\n- [Share on LinkedIn](http://www.linkedin.com/shareArticle?mini=true&url=http://www.nngroup.com/articles/modal-nonmodal-dialog/&title=Modal & Nonmodal Dialogs: When (& When Not) to Use Them&source=Nielsen%20Norman%20Group)\n- [Share on Twitter](https://twitter.com/intent/tweet?url=http://www.nngroup.com/articles/modal-nonmodal-dialog/&text=Modal & Nonmodal Dialogs: When (& When Not) to Use Them&via=nngroup)\n\nSummary: \nModal dialogs interrupt users and demand an action. They are appropriate when user’s attention needs to be directed toward important information.\n\nTo better understand the difference between modal and nonmodal dialogs, let’s look at what the terms “dialog” and “modal,” mean.\n\nA **dialog** (or **dialogue**) refers to a conversation between two people. In user interfaces, a dialog is a “conversation” between the system and the user, and often requests information or an action from the user.\n\nUser-interface **modes** are special states in which the same system has somewhat different user interfaces. Each mode may come with different commands, or the same command (or action) can produce different results depending on the mode of system. In other words, in different modes, the same input will have different results. For example, a computer with Caps Lock turned on is in a special mode: all the letters being typed will be shown as capital letters. Typing a letter has a different effect when the Caps Lock is on versus when it’s off. Or, in Microsoft Word’s Track Changes mode, all previously made edits and comments are visible (whereas in the normal, default mode they are not tracked or displayed).\n\nWith this understanding of “mode” and “dialog”, we can easily define modal dialogs.\n\n> **Modal dialog:** A dialog that appears on top of the main content and moves the system into a special mode requiring user interaction. This dialog disables the main content until the user explicitly interacts with the modal dialog.\n\nA modal dialog is like my cat, Emma — who meows at 7am every morning to prompt me to feed her. I might be trying to sleep or get ready for the day, but my cat will place herself in front of me, then meow louder and incessantly until I look at her. I have to stop what I am doing to address the cat immediately if I ever hope to finish my task. Sometimes she chooses to do this at 3am while we are sleeping. Should we have guests staying over, it can get annoying and embarrassing. (In defense of my cat, once I feed her, she is very calm and has a sweet and sociable temperament.)\n\nIn contrast, **nonmodal** (or **modeless**) dialogs and windows do not disable the main content: showing the dialog box doesn’t change the functionality of the user interface. The user can continue interacting with the main content (and perhaps even move the window, minimize it, etc.) while the dialog is open. To continue our cat analogy, a nonmodal dialog is like a kitty who patiently sits near the dinner table during a meal, waiting for the off chance that food scraps may fall from the table. When Emma is doing this, I can eat, have a conversation, and enjoy dinner without much interruption. I can choose to either ignore her altogether, or, as my husband likes to do, slip a bite of food to her under the table near the end of the meal. (She is very well-fed, as you might be able to tell.)\n\nModal dialogs were originally intended to alert users to an error or to some other system state that required immediate user action. In these cases, it was essential for users to be interrupted in order to fix the [error](https://www.nngroup.com/articles/user-mistakes/). Thus, placing the dialog box in the middle of the screen as the focal point of the interface, made it very effective. The big advantage of such modal dialogs was that they attracted users’ attention and allowed them to acknowledge the problem and correct it quickly.\n\nHowever, this original use has evolved, and now modal dialogs and windows are used persuasively to attract user attention for legitimate or less legitimate reasons.\n\n## In This Article:\n\n- [Disadvantages of Modal Dialogs](#toc-disadvantages-of-modal-dialogs-1)\n- [Guidelines for Using Modal Dialogs](#toc-guidelines-for-using-modal-dialogs-2)\n- [Consider Nonmodal Dialogs Instead](#toc-consider-nonmodal-dialogs-instead-3)\n- [Conclusion](#toc-conclusion-4)\n\n## Disadvantages of Modal Dialogs\n\nHere are some of the common problems caused by modal dialogs:\n\n- **They require immediate attention.** Modal windows, by their nature, are compulsory and require the user to act immediately. Since the dialogs place the system in a different mode, users cannot continue what they are doing until they acknowledge the dialog.\n- **They interrupt the user’s workflow.** Modal dialogs force users away from the tasks they were working on in the first place. Each interruption translates in lost time and effort, not only because users must address the dialog, but also because, once they go back to their original tasks, people will have to spend some time recovering context.\n- **They cause users to forget what they were doing.** Once the context is switched to a different task, because of the additional [cognitive load](https://www.nngroup.com/articles/minimize-cognitive-load/) imposed by the modal dialog, people may forget some of the details associated with the original task. If that is the case, recovering context for the original task may be even more difficult.\n- **They cause the users to create and address an extra goal — to dismiss the dialog.** When the dialog is presented, extra steps are added to the user’s workflow: to read and comprehend the dialog, then make a decision on that dialog. This increase in [interaction cost](https://www.nngroup.com/articles/interaction-cost-definition/) is likely to put off users, unless the dialog is well justified and indeed contains important information. We will elaborate more on this point later.\n- **They block the content in the background.** When a dialog appears on top of the current window, it can cover important content and remove context. As a result, it may become harder to respond to the dialog when the dialog asks a question related to information that was just obscured.\n\nBecause of these disadvantages, modal dialogs become problematic when used for noncritical activities.\n\n## Guidelines for Using Modal Dialogs\n\nWhen is it appropriate to use modal dialogs? Here are a few guidelines to help determine if modal dialogs are truly necessary.\n\n### 1. Use modal dialogs for important warnings, as a way to prevent or correct critical errors.\n\nWhenever there is a chance that users’ work be lost or that an action may have destructive, irreversible consequences, interrupt the users to avoid a disaster.\n\nTo determine what error is severe enough to warrant a modal dialog, consider the following:\n\n- **Would the problem be easier or harder to correct if users’ attention is taken away from the task?** It is always good to [prevent human error before it happens](https://www.nngroup.com/articles/slips/), if possible. However, once the error was made, it may be easier to fix it if the error message is presented within the main content instead of in a modal dialog. For example, an error in a form should be reported on the page, next to where it occurred, so that users can refer to the error message while they fix the problem. But informing the user that her computer will be restarted in 10 seconds could be displayed in a modal dialog, to make sure that the user notices the message.\n- **Is the error irreversible?** Irreversible errors often result in the loss of information, which can be especially damaging for complex and time-intensive tasks. For example, failing to add an item to a cart might be an unfortunate error for an ecommerce business, but not irreversible to its users should they not notice a subtle notification (they can redo their action if they really wanted the item). On the other hand, overwriting a file or failing to save changes to hundreds of slides are both irreversible actions, and, thus, an interruption is much needed, and often welcomed.\n\n![Modal Dialog on Microsoft Powerpoint](https://media.nngroup.com/media/editor/2017/03/23/modal-powerpoint-crop.png)\n\n*Microsoft Powerpoint uses modal dialogs to prevent irreversible errors or unintended user actions, like quitting an application without saving work.*\n\n![Modal Dialog on GMail](https://media.nngroup.com/media/editor/2017/03/23/modal-gmail.png)\n\n*Google Mail desktop app: This modal dialog appears when users forget to attach files after including key phrases like “I have attached” or “Please see attached” in their messages. This dialog prevents user error (and awkward follow-up emails).*\n\n### 2. Use modal dialogs to request the user to enter information critical to continuing the current process.\n\nWhen missing information prevents the system from continuing a user-initiated process, a modal dialog can prompt the user for that information.\n\nEtsy, shown below, uses a modal window to interrupt the user for login information when that user attempts to save an item to a list of favorites.\n\n![Modal Dialog on Etsy](https://media.nngroup.com/media/editor/2017/03/23/modal-etsy.png)\n\n*Etsy uses modal dialogs whenever a user attempts a task in which further steps are required before continuing. For example, when a user attempts to mark an item as a “favorite,” and the user is not logged in, a dialog appears in order to gain the required information to conduct the desired action.*\n\n### 3. Modal dialogs can be used to fragment a complex workflow into simpler steps.\n\nWhen it comes to workflows, [faster isn’t always better](https://www.nngroup.com/articles/workflow-expectations/). For time-consuming and mentally (and emotionally) involved tasks, it can be overwhelming to ask for lots of information all at once. In those situations, modal dialogs can be used to break complex information up into simpler, more digestible chunks. Wizards are common instances of such a use of modal dialogs.\n\nHowever, it’s important to note that a modal with multiple steps will just prolong the amount of time spent away from the main tasks, making it more likely that users will forget what they were doing in the first place. So if you must do multiple-step modals, give users a sense of their progress, so they don’t abandon immediately. That said, if it requires multiple steps to begin with, it probably justifies dedicating a full page to it.\n\n### 4. Use modal dialogs to ask for information that, when provided, could significantly lessen users’ work or effort.\n\nModals can work effectively when the information being requested or presented is relevant or can streamline the completion of the current task.\n\nIn the case of Zillow.com, a real-estate website, users can browse property listings without having an account or real-estate agent. However, when they attempt to contact an agent for a listing, the site displays a modal dialog asking them whether they already have an agent. This information is not critical to the immediate next step (contacting the listing agent), but it can still be valuable in streamlining future interactions. The dialog uses [progressive profiling](https://www.nngroup.com/articles/progressive-disclosure/) and presents one easy-to-answer question at a time. These questions are low-commitment and focused on relevant details.\n\n![](https://media.nngroup.com/media/editor/2017/03/23/modal-zillow.png)\n\n*Zillow.com asks users for more information after they submit inquiries about a certain listing. It makes sense to ask whether the user has a real-estate agent at this point, because it reduces the chances of redundant conversations with other agents in the future.*\n\nThe key with progressive profiling is that they follow the user’s expectation of the workflow — interruptions only help when they are relevant or helpful to the current task.\n\n### 5. Do not use modal dialogs for nonessential information that is not related to the current user flow.\n\nAs discussed above, modal dialogs have numerous disadvantages and costs to users. In order for these costs to be justified, their relevance to the task and importance should be high. Modal dialogs that are not directly related to users’ goals are perceived as annoying and can diminish [trust](https://www.nngroup.com/articles/trustworthy-design/) in the company.\n\nAdditionally, when nonessential information is presented in a high-priority format such as a modal dialog, users will refuse to give attention to further instances of this format. It’s much like in Aesop’s fable, “The Boy Who Cried Wolf”— repeatedly misleading others will make them not give you their trust when you really need it.\n\nContrary to popular belief, mailing list signups, while critical for generating business leads, are not critical to the user. In a recent web-usability study, we heard visceral disdain for modal dialogs pertaining to email newsletter signups.\n\n![](https://media.nngroup.com/media/editor/2017/03/23/modal-goodhousekeeping.png)\n\n*GoodHousekeeping.com goes the extra mile with the modal mailing-list dialog — not only is the background deactivated, but it’s replaced altogether with a full-screen photo, removing all context of where the user is on the website. It also appears within the first 3 seconds after the user first landed on the site’s homepage, giving users no time to glean any value from that page. The dialog demands information that is not essential for users or their workflow and provides almost no context or [perceived value](https://www.nngroup.com/articles/perceived-value/).*\n\n![Modal Wayfair](https://media.nngroup.com/media/editor/2017/03/23/modal-wayfair.png)\n\n*Top: Wayfair uses modal dialogs to request the user to specify a board where this item should be pinned. Another UI element (such as an option within the main content) would be more appropriate for entering this information. Bottom: After the board has been selected, Wayfair uses a modal dialog to ask users to invite friends to their boards — an action that is not essential to users and increases the interaction cost of pinning an item.*\n\n### 6. Avoid modal dialogs that interrupt high-stake processes such as checkout flows.\n\n[Checkout](https://www.nngroup.com/reports/ecommerce-ux-shopping-carts-checkout-registration/) is a high-stakes process for both users and businesses: users want to ensure that the process is seamless, secure, and error-free, and businesses want to ensure the user follows through on their purchasing decision. Modal dialogs, if unwarranted, can distract users at best and erode user confidence at worst.\n\nAn older version of Walmart.com used a modal dialog to prompt users to log in during checkout. At best, this modal could distract users and launch them into a full-fledged quest to find the Walmart.com password rather than simply completing checkout as a guest. At worst, users may feel that they’re pressured into creating an account — and that alone can influence a purchasing decision. Walmart has since redesigned its website to remove this modal dialog (but the redesign also removed guest checkout completely and now [requires users to have an account](https://www.nngroup.com/articles/optional-registration/) for checking out — which, to be honest, is just as off-putting).\n\n![Modal Walmart](https://media.nngroup.com/media/editor/2017/03/23/modal-walmart-old-checkout.jpg)\n\n*Walmart’s modal dialog has the potential of being a dangerous rabbit hole into relevant, but not critical tasks.*\n\n### 7. Avoid modal dialogs for complex decision making that requires additional sources of information unavailable in the modal.\n\nModal dialogs should be used for short, direct dialogs with the user. If a modal requires the user to do complex research or consult additional sources of information (potentially blocked by the modal), then it’s not the right UI element for that interaction.\n\n![Modal Frontier](https://media.nngroup.com/media/editor/2017/03/23/modal-frontier.png)\n\n*Frontier Airlines uses a modal dialog to promote an upsell on its basic flights. The dialog requires users to decide on spending more money, but it does not allow them to access additional information necessary for making that decision (e.g., if there are any decent seats left).*\n\n## Consider Nonmodal Dialogs Instead\n\nIn situations where the task is not critical, a nonmodal dialog might be appropriate. Nonmodal dialogs are less offensive than modal ones because they allow users to continue their activity and ignore them if they are irrelevant. However, they can still be disruptive, especially if they obscure important information on the screen or if they require too complex interactions.\n\nMoreover, some nonmodal dialogs do not translate well across devices and browsers — for example, a nonmodal window in Chrome on a desktop may become a modal one in Safari on an iPhone, such as with Meowbox.com below.\n\n![Nonmodal Meowbox](https://media.nngroup.com/media/editor/2017/03/23/meowbox-nonmodal.png)\n\n*On the Meowbox.com desktop site (left), a timed nonmodal dialog for newsletter signups appears in the bottom right corner of the homepage. However, on the mobile rendering of the site (right), the nonmodal window becomes a full-screen modal window, forcing the user to provide input before moving forward. While the desktop version allows easy dismissal of the prompt, the mobile version does not.*\n\nNonmodal windows are useful when users need to quickly switch between modes in order to access certain information. For example, Google Mail uses nonmodal windows as the default method for composing new email messages. Users can continue working with this window open, minimize the composed email without losing it (or optionally, maximize it into a modal window). This separate view allows users to locate older emails or additional information that might be helpful for composing the current email.\n\n![Nonmodal Gmail](https://media.nngroup.com/media/editor/2017/03/23/nonmodal-gmail.png)\n\n*Google Mail’s nonmodal windows allow for easy switching between writing and reading information.*\n\n## Conclusion\n\nBoth modal and nonmodal dialogs are useful and request or encourage user participation. When it comes to deciding between these two types of dialogs, consider the user context and the workflow. Avoid unnecessarily interrupting users and [disrupting their workflows](https://www.nngroup.com/articles/disruptive-workflow-design/). Make it easier for users to solve problems and accomplish their goals. If a company wishes to make sustainable progress toward business goals, user goals must be prioritized during these design decisions.\n\nWhen it comes to modal dialogs, consider this: no one likes to be interrupted, but if you must, make sure it’s worth the cost.\n\n## Related Courses\n\n- [#### Designing Complex Apps for Specialized Domains\n\n  Create and evaluate applications for advanced decision making, complicated workflows, and complex domains\n\n  Interaction](/courses/complex-apps-specialized-domains/?lm=modal-nonmodal-dialog&pt=article)\n- [#### Application Design for Web and Desktop\n\n  Components, design patterns, workflows, and ways of interacting with complex data\n\n  Interaction](/courses/application-ux/?lm=modal-nonmodal-dialog&pt=article)\n\nDesign Patterns,advertising,ui elements,Application Design,workflow\n\n## Related Topics\n\n- Design Patterns\n  [Design Patterns](/topic/design-patterns/)\n- [Application Design](/topic/applications/)\n\n## Learn More:\n\n- [![](https://media.nngroup.com/media/videos/thumbnails/Cookie_Permissions-_5_Common_User_Types_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Cookie Permissions: 5 Common User Types\n\n  Samhita Tankala\n  ·\n  3 min](/videos/cookie-permissions-user-types/?lm=modal-nonmodal-dialog&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Cookie_Permissions-_6_Design_Guidelines_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Cookie Permissions: 6 Design Guidelines\n\n  Samhita Tankala\n  ·\n  5 min](/videos/cookie-permissions-guidelines/?lm=modal-nonmodal-dialog&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Accordions_-_When_to_Avoid_Thumbnail.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Accordions: 5 Scenarios to Avoid Them\n\n  Huei-Hsin Wang\n  ·\n  3 min](/videos/avoid-accordions/?lm=modal-nonmodal-dialog&pt=article)\n\n## Related Articles:\n\n- [Overlay Overload: Competing Popups Are an Increasing Menace\n\n  Kate Moran\n  ·\n  6 min](/articles/overlay-overload/?lm=modal-nonmodal-dialog&pt=article)\n- [Inclusive Design\n\n  Alita Kendrick\n  ·\n  6 min](/articles/inclusive-design/?lm=modal-nonmodal-dialog&pt=article)\n- [Cancel vs Close: Design to Distinguish the Difference\n\n  Aurora Harley\n  ·\n  6 min](/articles/cancel-vs-close/?lm=modal-nonmodal-dialog&pt=article)\n- [Which UX Deliverables Are Most Commonly Created and Shared?\n\n  Page Laubheimer\n  ·\n  7 min](/articles/common-ux-deliverables/?lm=modal-nonmodal-dialog&pt=article)\n- [Wizards: Definition and Design Recommendations\n\n  Raluca Budiu\n  ·\n  10 min](/articles/wizards/?lm=modal-nonmodal-dialog&pt=article)\n- [10 Design Guidelines for Reporting Errors in Forms\n\n  Rachel Krause\n  ·\n  6 min](/articles/errors-forms-design-guidelines/?lm=modal-nonmodal-dialog&pt=article)",
  "tags": [
    "nngroup",
    "usability",
    "research",
    "heuristics"
  ],
  "extracted_at": "2026-02-03T12:43:49.906649+00:00",
  "content_length": 17742,
  "content_hash": "068007b41d24fdd9"
}