{
  "id": "nngroup__articles_layer-cake-pattern-scanning_",
  "source_id": "nngroup",
  "source_name": "Nielsen Norman Group Articles",
  "category": "ux_research",
  "url": "https://www.nngroup.com/articles/layer-cake-pattern-scanning/",
  "title": "The Layer-Cake Pattern of Scanning Content on the Web",
  "content": "8\nThe Layer-Cake Pattern of Scanning Content on the Web\nKara Pernice\nKara Pernice\nAugust 4, 2019\n2019-08-04\nShare\nEmail article\nShare on LinkedIn\nShare on Twitter\nSummary:\nWhen headings and subheadings visually stand out on the page and are descriptive, users engage in an efficient scanning pattern that allows them to quickly find the information that they need.\nPeople don’t usually read every word on a webpage, in an app, or even in an article or text passage. Instead, they often\nscan\n— because their experience with many websites has taught them that\nscanning\ncan deliver almost the same value (that is, amount of information) with significant less time and effort.  (Recall\nthat people are naturally efficient and attempt to put in the least possible work for achieving their goal\n.)\nThe way in which the page is organized visually plays a big role in how people scan its content. If the page layout allows users to quickly identify the essential information that is relevant to their needs, users will save a lot of effort and will be able to accomplish their goals fast. But, if, on the other hand, the layout does not emphasize the important information, people may miss it and they may end up leaving the site.\nThis article focuses on a scanning pattern that occurs when the information on the page is split in clear headings and subheadings.\nDefinition\n: The\nlayer-cake\nscanning pattern consists of fixations made mostly on the page’s headings and subheadings, with deliberate occasional fixations on the (body) text in between. In an eyetracking heatmap or gaze plot, this pattern looks roughly like a set of horizontal stripes and blank spaces between them, resembling a layer cake (with cake on a level, then frosting, then cake, and so on).\nAside from reading every (or almost every) word, the layer-cake pattern is by far the most effective way to scan pages: most of the time, it ensures that users will find the information they are\nlooking for\n(if it is present on the page).\nThis gaze plot shows an example of a layer-cake scanning pattern: most fixations are on the article subheadings. The gaze plot shows the eye movements collected from a study participant while he was reading an article on Techcrunch.com. He scanned to the\nTransit authorities get things done\nsubheading that was visually distinct from the body text and read the text below. He then scanned more subheadings —\nTransit systems have what innovation requires to be successful — a built-in user base with massive scale and There’s an expectation gap.\nThe descriptive subheadings enabled the user to easily skip less-interesting content in the related body text.\nA layer-cake eyetracking heatmap obtained from 9 study participants shows that they fixated mostly on the subheadings (and buttons) on a page on bacnyc.org.\nWe first documented the layer-cake pattern in a study in 2004. In this example from that original study, a user interested in the general topic of dog training (but not in the specific sections of the page) scanned the subheadings on www.dogbreedz.com. The spacing above the subtitles and bolding of the subtitle text made it easy to pick out the subheadings between the chunks of body text.\nIn This Article:\nHow to Create Subheadings that Promote Effective Scanning\nChunk and Label All Pages, Not Just Text: Derivatives of the Layer-Cake Pattern\nLayer-Cake Pattern Versus F-Pattern\nSummary\nHow to Create Subheadings that Promote Effective Scanning\nWe said that the layer cake is one of the most effective and efficient scanning patterns. But people can only engage in this pattern if (1) they can identify the subheadings easily and (2) the subheadings correctly summarize the sections of text associated with them. Let’s examine how designers can create subheadings that support users on both accounts.\nVisual Guidelines for Effective Subheadings\nThere are two elements that are important in the visual design of subheadings:\nMarking subheadings so they visually stand out relative to the rest of the text in a consistent, predictable manner\nClearly indicating which body of text goes with which subheading\nMany visual text effects can be used to make a subheading stand out. For example:\nDifferent color\nLarger\nsize\nDifferent\ntypeface\nEffects\nsuch as bolding, shadowing, or underlining (but use underlining only if the subheading is also a hyperlink)\nCombination of effects\n: a mixture of the above visual treatments\nBe careful to not make the subheadings so absurdly brighter or larger than the body text that they\nlook like promotions or ads\ninstead of page content and cause users to ignore them.\nA page on www.chao.org made subheadings easy to spot because they appeared in a different font than that used for body text. Body text appeared in the Arial-body typeface in a dark-grey color, while subheadings appeared larger than the body text, bold, green, and in the Nunito typeface.\nA page on www.wegmanns.com made subheadings easy to identify by using a different font for body text, subheadings, and 3rd-level subheadings. Body text appeared in Source-Sans-Pro; subheadings appeared in Archivo-Narrow, bold, in a much larger size; and 3rd-levelsub headings appeared also in Archivo-Narrow, but bolded, in the same size as the body text.\nA page on www.edwardjones.com differentiated subheadings from body text in a more subtle way than the previous examples, but still made the subheadings easy to scan to and pick out. The site used the same typeface (ProximaNova) for both body text and subheadings, but subheadings were bold and larger than the body text. These visual treatments are enough to make the subheadings look different from body text.\nWork with visual designers and\nconduct usability testing\nto iterate ideas and derive a good way to present subheadings. And then create a visual-design style guide for all the text on your side, addressing especially how body text, subheadings, page titles, and links should be styled.\nContent Guidelines for Effective Subheadings\nJust like the\nIA\nreflects the information structure of a website, the\nmini-IA\n, which is made up of all the page headings and subheadings, reflects the information structure of a page.  Subheadings make it easy to browse a page in the same way in which the global navigation makes it easy to browse a site. Good subheadings help users determine if a section is worth reading, and good category names help people understand where they should navigate to complete their task.\nContent writers and editors need to provide a clear content hierarchy to users by:\nPrioritizing and ordering the content on the page:\nOrganize text\nso it makes sense to readers.\nBeing concise:\nRemove superfluous content.\nChunking:\nBreak content into\nchunks\n, like paragraphs or lists. Put related content together.\nOnce these things are done, refine the words used in subheadings, so they are most informative when scanned. Make your subheadings:\nDescriptive of\nall\ntopics in the section, and\nonly\ntopics in the section:\nUse words that encompass all the body text associated with the subheading so users have an idea of everything available in the section.\nDescriptive of\nonly\nthose topics in the section:\nBe\nsuccinct\nand describe only concepts and words that appear in the body text associated with the subheading. Don’t make the subheading so broad that it seems to include more than what is in the body text\nLead with some of the most important words\n: Information-bearing words give people the main point of the subheading right away.\nUnderstandable:\nUse clear language so when users scan a heading, they can quickly understand its meaning.\nChunk and Label All Pages, Not Just Text: Derivatives of the Layer-Cake Pattern\nPages with a systematic layout are easy to scan; disorderly and unpredictable pages are not. When the layout consists of one or more text columns (like in the Edward Jones example above), subheadings allow users to quickly determine which text goes with which subheading. However, when the page uses\ncards\nor some other irregular format, it’s important to use the\nGestalt proximity principle\nto signal what subheading or label goes with what body text or section.\nPages with mixed content can still be made scannable by following the same principles as those for text layouts Specifically:\nDetermine like content and place it together.\nVisually distinguish content chunks. Do this with:\na grid or other graphic system that includes borders or colored backgrounds around each chunk (e.g., cards, banners)\na suitable amount of space between chunks\nWhen appropriate, label each content chunk with a clear subheading.\nWhen pages are designed in this way, users often scan in series of mini layer-cake patterns, looking for text that indicates what the section of content is about.\nYears ago www.gateway.com got it right, using whitespace and grey borders to surround sections of text and larger, all-caps text for subheadings.\nShopping for sandals on www.nordstrom.com, the user could easily decipher which text and color swatches were associated with which shoe because of the spacing used. The space above the shoe and the space below worked together to convey to the user that that text above was not associated with the shoe, but the text below was. Such a layout supports quick scanning of the shoe prices, as well as the colors in which the shoe comes — both important tasks in ecommerce.\nA user scanned a page on the Arabic site Super Kora. The grouping of the images and associated text facilitated scanning, allowing the user to quickly identify which content went with which image. Specifically, in the top part of the screenshot, the text associated with the image appeared to its left. On the bottom part of the page, the text associated with the image appeared just below it.\nWhen text fragments above and below an image appear to be about equidistant to that image, it’s harder for users to tell which content is associated with the image. In the gaze plot from a page on The Chicago Tribune’s website, the user looked at an image (top), the text below, then the unrelated image below the text, then backtracked to the text in between and to the top image. The backtracking indicates that the user needed to fixate a few times to decide which image the text went with.\nA different page on the ‘Chicago Tribune’ website offered a mix of text and visuals. The subheadings made it easier for the user to decide which text goes with which image.\nWhile the Staff page on www.bacnyc.org page was organized in chunks of information with subheadings, the visual implementation made it difficult to scan. First, the subheadings and names below them appeared in the same font (same typeface, size, and bold). Second, spacing between the chunks of content was irregular, making the page unpredictable. In the gaze plot, we see the user skipping the subheadings towards the top of the page, but looking at the larger-font subheadings toward the bottom of the page —Board of Directors, Advisory Committee. The user looked at some names but not at others and skipped chunks of content in a seemingly random way.\nLayer-Cake Pattern Versus F-Pattern\nWhile we discovered the F-pattern and the layer-cake pattern at the same time, the\nF-pattern\nis undeservedly the more notorious of the two.  Unlike the F-pattern, which is usually not very effective at extracting the right information from text, the layer-cake pattern can guide users to the right place on a page (provided that the headings are meaningful and representative for the content underneath). Once people have identified a section of interest, they can read it carefully.\nF-Pattern\nLayer-Cake Pattern\nPage characteristics\nColumns of text with little text that stands out (e.g.  subtitles, chunks of content, bullets, bold, underline)\nPages with well-signaled headings and subheadings\nEfficiency\nLow\nHigh\nUser behavior\nThe eyes skip sections of text based completely on how the text flows in a column.\nThe eyes scan directly to headings and may read the related body of text if interesting or relevant to their goal.\nEffects\nPeople inadvertently miss meaningful information and have no knowledge they did so.\nPeople save time by directing their attention to the relevant page sections and skipping the irrelevant ones.\nAn article on www.vogue.com doesn’t have any subheadings, which makes it difficult to scan. Text laid out in this way is often scanned in an F-pattern.\nSummary\nChunking content and assigning clear, descriptive subheadings that stand out from the other text and content on the page increase content usability exponentially because they support the layer-cake scanning pattern, which, unlike its relative, the F-pattern, increases users’ efficiency by allowing them to quickly identify the content that is most relevant to their task.\nFor more information about reading and scanning, see our full research report, “\nHow People Read on the Web: The Eyetracking Evidence\n”.\nRelated Courses\nVisual Design Fundamentals\nCreate user interfaces using essential principles, techniques, and methods of visual design\nInteraction\nEyetracking,readability,Writing for the Web,layout\nRelated Topics\nEyetracking\nEyetracking\nWriting for the Web\nLearn More:\nEnable cookies\nto watch NN/g videos\nF-Pattern in Reading Digital Content\nKara Pernice\n·\n3 min\n4 Things GenAI Needs for Better Content Design\nTaylor Dykes\n·\n7 min\nBanner Blindness: Ad-Like Elements Divert Attention\nKara Pernice\n·\n4 min\nAttention Leans Left on Websites\nTherese Fessenden\n·\n2 min\nRelated Articles:\nExhaustive Review or “I Can’t Believe It’s Not There” Phenomenon: Evidence from Eyetracking\nKara Pernice\n·\n11 min\nBanner Blindness Revisited: Users Dodge Ads on Mobile and Desktop\nKara Pernice\n·\n9 min\nShow Numbers as Numerals When Writing for Online Readers\nJakob Nielsen\n·\n4 min\nF-Shaped Pattern For Reading Web Content (Original Study)\nJakob Nielsen\n·\n3 min\nEyetracking Study of Web Readers\nJakob Nielsen\n·\n5 min\n\"About Us\" Information on Websites\nAnna Kaley and  Jakob Nielsen\n·\n14 min",
  "content_markdown": "8\n\n# The Layer-Cake Pattern of Scanning Content on the Web\n\nKara Pernice\n\n![](https://media.nngroup.com/media/people/photos/kara-2025.jpg.256x256_q75_autocrop_crop-smart_upscale.jpg)\n\n[Kara Pernice](/articles/author/kara-pernice/)\n\nAugust 4, 2019\n2019-08-04\n\n[Share](#)\n\n- [Email article](mailto:?subject=NN/g Article: The Layer-Cake Pattern of Scanning Content on the Web&body=https://www.nngroup.com/articles/layer-cake-pattern-scanning/)\n- [Share on LinkedIn](http://www.linkedin.com/shareArticle?mini=true&url=http://www.nngroup.com/articles/layer-cake-pattern-scanning/&title=The Layer-Cake Pattern of Scanning Content on the Web&source=Nielsen%20Norman%20Group)\n- [Share on Twitter](https://twitter.com/intent/tweet?url=http://www.nngroup.com/articles/layer-cake-pattern-scanning/&text=The Layer-Cake Pattern of Scanning Content on the Web&via=nngroup)\n\nSummary: \nWhen headings and subheadings visually stand out on the page and are descriptive, users engage in an efficient scanning pattern that allows them to quickly find the information that they need.\n\nPeople don’t usually read every word on a webpage, in an app, or even in an article or text passage. Instead, they often [scan](https://www.nngroup.com/articles/why-web-users-scan-instead-reading/) — because their experience with many websites has taught them that [scanning](https://www.nngroup.com/articles/text-scanning-patterns-eyetracking/) can deliver almost the same value (that is, amount of information) with significant less time and effort.  (Recall [that people are naturally efficient and attempt to put in the least possible work for achieving their goal](https://www.nngroup.com/articles/lazy-users/).)\n\nThe way in which the page is organized visually plays a big role in how people scan its content. If the page layout allows users to quickly identify the essential information that is relevant to their needs, users will save a lot of effort and will be able to accomplish their goals fast. But, if, on the other hand, the layout does not emphasize the important information, people may miss it and they may end up leaving the site.\n\nThis article focuses on a scanning pattern that occurs when the information on the page is split in clear headings and subheadings.\n\n**Definition**: The **layer-cake** scanning pattern consists of fixations made mostly on the page’s headings and subheadings, with deliberate occasional fixations on the (body) text in between. In an eyetracking heatmap or gaze plot, this pattern looks roughly like a set of horizontal stripes and blank spaces between them, resembling a layer cake (with cake on a level, then frosting, then cake, and so on).\n\nAside from reading every (or almost every) word, the layer-cake pattern is by far the most effective way to scan pages: most of the time, it ensures that users will find the information they are [looking for](https://www.nngroup.com/articles/exhaustive-review-eyetracking/) (if it is present on the page).\n\n![Subheadings are bold and larger than body text.](https://media.nngroup.com/media/editor/2019/07/19/p13_commit_layercake_cropped_techcrunch-com_watermrkd.png)\n\n*This gaze plot shows an example of a layer-cake scanning pattern: most fixations are on the article subheadings. The gaze plot shows the eye movements collected from a study participant while he was reading an article on Techcrunch.com. He scanned to the*Transit authorities get things done*subheading that was visually distinct from the body text and read the text below. He then scanned more subheadings —*Transit systems have what innovation requires to be successful — a built-in user base with massive scale and There’s an expectation gap. *The descriptive subheadings enabled the user to easily skip less-interesting content in the related body text.*\n\n![An eyetracking heatmap overlays yellow “heat” over the subheadings on the page.](https://media.nngroup.com/media/editor/2019/07/19/bac_layer_cake_130px_cropped_watermrkd.png)\n\n*A layer-cake eyetracking heatmap obtained from 9 study participants shows that they fixated mostly on the subheadings (and buttons) on a page on bacnyc.org.*\n\n![Paragraphs, headings, blue dots on headings.](https://media.nngroup.com/media/editor/2019/07/19/dogbreedz_layercake_watermrkd.png)\n\n*We first documented the layer-cake pattern in a study in 2004. In this example from that original study, a user interested in the general topic of dog training (but not in the specific sections of the page) scanned the subheadings on www.dogbreedz.com. The spacing above the subtitles and bolding of the subtitle text made it easy to pick out the subheadings between the chunks of body text.*\n\n## In This Article:\n\n- [How to Create Subheadings that Promote Effective Scanning](#toc-how-to-create-subheadings-that-promote-effective-scanning-1)\n- [Chunk and Label All Pages, Not Just Text: Derivatives of the Layer-Cake Pattern](#toc-chunk-and-label-all-pages-not-just-text-derivatives-of-the-layer-cake-pattern-2)\n- [Layer-Cake Pattern Versus F-Pattern](#toc-layer-cake-pattern-versus-f-pattern-3)\n- [Summary](#toc-summary-4)\n\n## How to Create Subheadings that Promote Effective Scanning\n\nWe said that the layer cake is one of the most effective and efficient scanning patterns. But people can only engage in this pattern if (1) they can identify the subheadings easily and (2) the subheadings correctly summarize the sections of text associated with them. Let’s examine how designers can create subheadings that support users on both accounts.\n\n### Visual Guidelines for Effective Subheadings\n\nThere are two elements that are important in the visual design of subheadings:\n\n1. Marking subheadings so they visually stand out relative to the rest of the text in a consistent, predictable manner\n2. Clearly indicating which body of text goes with which subheading\n\nMany visual text effects can be used to make a subheading stand out. For example:\n\n- **Different color**\n- [**Larger**](https://www.nngroup.com/articles/glanceable-fonts/) **size**\n- **Different** [**typeface**](https://www.nngroup.com/articles/typography-terms-ux/)\n- **Effects** such as bolding, shadowing, or underlining (but use underlining only if the subheading is also a hyperlink)\n- **Combination of effects**: a mixture of the above visual treatments\n\nBe careful to not make the subheadings so absurdly brighter or larger than the body text that they [look like promotions or ads](https://www.nngroup.com/articles/banner-blindness-old-and-new-findings/) instead of page content and cause users to ignore them.\n\n![](https://media.nngroup.com/media/editor/2019/07/19/choa-org_nunito-subhd_arial-body_1july2019_cropped2.png)\n\n*A page on www.chao.org made subheadings easy to spot because they appeared in a different font than that used for body text. Body text appeared in the Arial-body typeface in a dark-grey color, while subheadings appeared larger than the body text, bold, green, and in the Nunito typeface.*\n\n![](https://media.nngroup.com/media/editor/2019/07/19/wegmans_links-spot_source-sans_pro_normal_archivo-narrow_subhead_1july2019_cropped_cropped_annotated2.png)\n\n*A page on www.wegmanns.com made subheadings easy to identify by using a different font for body text, subheadings, and 3rd-level subheadings. Body text appeared in Source-Sans-Pro; subheadings appeared in Archivo-Narrow, bold, in a much larger size; and 3rd-levelsub headings appeared also in Archivo-Narrow, but bolded, in the same size as the body text.*\n\n![](https://media.nngroup.com/media/editor/2019/07/19/edward-jones_proximanova_body-and-sunheadings_1july2019_cropped.png)\n\n*A page on www.edwardjones.com differentiated subheadings from body text in a more subtle way than the previous examples, but still made the subheadings easy to scan to and pick out. The site used the same typeface (ProximaNova) for both body text and subheadings, but subheadings were bold and larger than the body text. These visual treatments are enough to make the subheadings look different from body text.*\n\nWork with visual designers and [conduct usability testing](https://www.nngroup.com/reports/how-to-conduct-usability-studies/) to iterate ideas and derive a good way to present subheadings. And then create a visual-design style guide for all the text on your side, addressing especially how body text, subheadings, page titles, and links should be styled.\n\n### Content Guidelines for Effective Subheadings\n\nJust like the [IA](https://www.nngroup.com/articles/ia-vs-navigation/) reflects the information structure of a website, the [mini-IA](https://www.nngroup.com/articles/mini-ia-structuring-information/), which is made up of all the page headings and subheadings, reflects the information structure of a page.  Subheadings make it easy to browse a page in the same way in which the global navigation makes it easy to browse a site. Good subheadings help users determine if a section is worth reading, and good category names help people understand where they should navigate to complete their task.\n\nContent writers and editors need to provide a clear content hierarchy to users by:\n\n- **Prioritizing and ordering the content on the page:**  [Organize text](https://www.nngroup.com/articles/inverted-pyramid/) so it makes sense to readers.\n- **Being concise:** Remove superfluous content.\n- **Chunking:** Break content into [chunks](https://www.nngroup.com/articles/chunking/), like paragraphs or lists. Put related content together.\n\nOnce these things are done, refine the words used in subheadings, so they are most informative when scanned. Make your subheadings:\n\n- **Descriptive of *all* topics in the section, and *only* topics in the section:** Use words that encompass all the body text associated with the subheading so users have an idea of everything available in the section.\n- **Descriptive of *only* those topics in the section:** Be [succinct](https://www.nngroup.com/articles/be-succinct-writing-for-the-web/) and describe only concepts and words that appear in the body text associated with the subheading. Don’t make the subheading so broad that it seems to include more than what is in the body text\n- [Lead with some of the most important words](https://www.nngroup.com/articles/first-2-words-a-signal-for-scanning/): Information-bearing words give people the main point of the subheading right away.\n- **Understandable:** Use clear language so when users scan a heading, they can quickly understand its meaning.\n\n## Chunk and Label All Pages, Not Just Text: Derivatives of the Layer-Cake Pattern\n\nPages with a systematic layout are easy to scan; disorderly and unpredictable pages are not. When the layout consists of one or more text columns (like in the Edward Jones example above), subheadings allow users to quickly determine which text goes with which subheading. However, when the page uses [cards](https://www.nngroup.com/articles/cards-component/) or some other irregular format, it’s important to use the [Gestalt proximity principle](https://www.nngroup.com/articles/closeness-of-actions-and-objects-gui/) to signal what subheading or label goes with what body text or section.\n\nPages with mixed content can still be made scannable by following the same principles as those for text layouts Specifically:\n\n1. Determine like content and place it together.\n2. Visually distinguish content chunks. Do this with:\n   1. a grid or other graphic system that includes borders or colored backgrounds around each chunk (e.g., cards, banners)\n   2. a suitable amount of space between chunks\n3. When appropriate, label each content chunk with a clear subheading.\n\nWhen pages are designed in this way, users often scan in series of mini layer-cake patterns, looking for text that indicates what the section of content is about.\n\n![](https://media.nngroup.com/media/editor/2019/07/19/gateway_about_wayne_allclick_watermrked.png)\n\n*Years ago www.gateway.com got it right, using whitespace and grey borders to surround sections of text and larger, all-caps text for subheadings.*\n\n![](https://media.nngroup.com/media/editor/2019/07/19/nordstrom_prod_images_sandals_p99marissa_all_cropped_watermrked.png)\n\n*Shopping for sandals on www.nordstrom.com, the user could easily decipher which text and color swatches were associated with which shoe because of the spacing used. The space above the shoe and the space below worked together to convey to the user that that text above was not associated with the shoe, but the text below was. Such a layout supports quick scanning of the shoe prices, as well as the colors in which the shoe comes — both important tasks in ecommerce.*\n\n![Very little spacing appears between the image and its associated text, where the space between the image and the unassociated text (to the right and below, respectively) is greater. This makes it easy to tell which image and text are related. The gaze plot shows the user looking at an image and its associated text. He did not look at an image and the unrelated text, or text and the unrelated image.](https://media.nngroup.com/media/editor/2019/07/19/p509_arabic_logo_menu_images_chunks_cropped_watermrkd.png)\n\n*A user scanned a page on the Arabic site Super Kora. The grouping of the images and associated text facilitated scanning, allowing the user to quickly identify which content went with which image. Specifically, in the top part of the screenshot, the text associated with the image appeared to its left. On the bottom part of the page, the text associated with the image appeared just below it.*\n\n![](https://media.nngroup.com/media/editor/2019/07/19/chi-tribune_redeye_interest_another-pg_p90lisa_all_cropped-to-spot_watermrkd.png)\n\n*When text fragments above and below an image appear to be about equidistant to that image, it’s harder for users to tell which content is associated with the image. In the gaze plot from a page on The Chicago Tribune’s website, the user looked at an image (top), the text below, then the unrelated image below the text, then backtracked to the text in between and to the top image. The backtracking indicates that the user needed to fixate a few times to decide which image the text went with.*\n\n![](https://media.nngroup.com/media/editor/2019/07/19/chi-tribune_redeye_interest_and_another-pg_p90lisa_layer-cake_all_cropped_watermrkd.png)\n\n*A different page on the ‘Chicago Tribune’ website offered a mix of text and visuals. The subheadings made it easier for the user to decide which text goes with which image.*\n\n![](https://media.nngroup.com/media/editor/2019/07/19/bac_image-and-text-chunks_p20howard_cropped_watermrkd.png)\n\n*While the Staff page on www.bacnyc.org page was organized in chunks of information with subheadings, the visual implementation made it difficult to scan. First, the subheadings and names below them appeared in the same font (same typeface, size, and bold). Second, spacing between the chunks of content was irregular, making the page unpredictable. In the gaze plot, we see the user skipping the subheadings towards the top of the page, but looking at the larger-font subheadings toward the bottom of the page —Board of Directors, Advisory Committee. The user looked at some names but not at others and skipped chunks of content in a seemingly random way.*\n\n## Layer-Cake Pattern Versus F-Pattern\n\nWhile we discovered the F-pattern and the layer-cake pattern at the same time, the [F-pattern](https://www.nngroup.com/articles/f-shaped-pattern-reading-web-content/) is undeservedly the more notorious of the two.  Unlike the F-pattern, which is usually not very effective at extracting the right information from text, the layer-cake pattern can guide users to the right place on a page (provided that the headings are meaningful and representative for the content underneath). Once people have identified a section of interest, they can read it carefully.\n\n|  |  |  |\n| --- | --- | --- |\n|  | **F-Pattern** | **Layer-Cake Pattern** |\n| **Page characteristics** | Columns of text with little text that stands out (e.g.  subtitles, chunks of content, bullets, bold, underline) | Pages with well-signaled headings and subheadings |\n| **Efficiency** | Low | High |\n| **User behavior** | The eyes skip sections of text based completely on how the text flows in a column. | The eyes scan directly to headings and may read the related body of text if interesting or relevant to their goal. |\n| **Effects** | People inadvertently miss meaningful information and have no knowledge they did so. | People save time by directing their attention to the relevant page sections and skipping the irrelevant ones. |\n\n![](https://media.nngroup.com/media/editor/2019/07/19/vogue_savoy_normal_infin-scroll_no-subheads_1july2019_cropped-more2.png)\n\n*An article on www.vogue.com doesn’t have any subheadings, which makes it difficult to scan. Text laid out in this way is often scanned in an F-pattern.*\n\n## Summary\n\nChunking content and assigning clear, descriptive subheadings that stand out from the other text and content on the page increase content usability exponentially because they support the layer-cake scanning pattern, which, unlike its relative, the F-pattern, increases users’ efficiency by allowing them to quickly identify the content that is most relevant to their task.\n\nFor more information about reading and scanning, see our full research report, “[How People Read on the Web: The Eyetracking Evidence](https://www.nngroup.com/reports/how-people-read-web-eyetracking-evidence/)”.\n\n## Related Courses\n\n- [#### Visual Design Fundamentals\n\n  Create user interfaces using essential principles, techniques, and methods of visual design\n\n  Interaction](/courses/visual-design/?lm=layer-cake-pattern-scanning&pt=article)\n\nEyetracking,readability,Writing for the Web,layout\n\n## Related Topics\n\n- Eyetracking\n  [Eyetracking](/topic/eyetracking/)\n- [Writing for the Web](/topic/writing-web/)\n\n## Learn More:\n\n[![F-Pattern in Reading Digital Content](https://media.nngroup.com/media/videos/thumbnails/F-Pattern_Thumbnail.jpg.1300x728_q75_autocrop_crop-smart_upscale.jpg)](https://www.youtube.com/watch?v=XU1-Rz2Q7-E \"F-Pattern in Reading Digital Content on YouTube (new window)\")\n\nEnable cookies\n to watch NN/g videos\n\nF-Pattern in Reading Digital Content\n\n Kara Pernice\n·\n3 min\n\n- [![](https://media.nngroup.com/media/videos/thumbnails/Taylor_4_Things_GenAI_Needs_for_Better_Content_Design.png.650x364_q75_autocrop_crop-smart_upscale.png)\n\n  4 Things GenAI Needs for Better Content Design\n\n  Taylor Dykes\n  ·\n  7 min](/videos/genai-content-design/?lm=layer-cake-pattern-scanning&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Banner_blindness_ad_like_elements_divert_attention_Kara.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Banner Blindness: Ad-Like Elements Divert Attention\n\n  Kara Pernice\n  ·\n  4 min](/videos/banner-blindness/?lm=layer-cake-pattern-scanning&pt=article)\n- [![](https://media.nngroup.com/media/videos/thumbnails/Attention_Leans_Left.jpg.650x364_q75_autocrop_crop-smart_upscale.jpg)\n\n  Attention Leans Left on Websites\n\n  Therese Fessenden\n  ·\n  2 min](/videos/attention-leans-left-websites/?lm=layer-cake-pattern-scanning&pt=article)\n\n## Related Articles:\n\n- [Exhaustive Review or “I Can’t Believe It’s Not There” Phenomenon: Evidence from Eyetracking\n\n  Kara Pernice\n  ·\n  11 min](/articles/exhaustive-review-eyetracking/?lm=layer-cake-pattern-scanning&pt=article)\n- [Banner Blindness Revisited: Users Dodge Ads on Mobile and Desktop\n\n  Kara Pernice\n  ·\n  9 min](/articles/banner-blindness-old-and-new-findings/?lm=layer-cake-pattern-scanning&pt=article)\n- [Show Numbers as Numerals When Writing for Online Readers\n\n  Jakob Nielsen\n  ·\n  4 min](/articles/web-writing-show-numbers-as-numerals/?lm=layer-cake-pattern-scanning&pt=article)\n- [F-Shaped Pattern For Reading Web Content (Original Study)\n\n  Jakob Nielsen\n  ·\n  3 min](/articles/f-shaped-pattern-reading-web-content-discovered/?lm=layer-cake-pattern-scanning&pt=article)\n- [Eyetracking Study of Web Readers\n\n  Jakob Nielsen\n  ·\n  5 min](/articles/eyetracking-study-of-web-readers/?lm=layer-cake-pattern-scanning&pt=article)\n- [\"About Us\" Information on Websites\n\n  Anna Kaley and Jakob Nielsen\n  ·\n  14 min](/articles/about-us-information-on-websites/?lm=layer-cake-pattern-scanning&pt=article)",
  "tags": [
    "nngroup",
    "usability",
    "research",
    "heuristics"
  ],
  "extracted_at": "2026-02-03T12:42:54.029447+00:00",
  "content_length": 14011,
  "content_hash": "880061846072ea69"
}