{
  "id": "a11y-project__checklist_",
  "source_id": "a11y-project",
  "source_name": "The A11Y Project",
  "category": "accessibility",
  "url": "https://www.a11yproject.com/checklist/",
  "title": "Checklist - The A11Y Project",
  "content": "Table of Contents\nThis checklist uses\nThe Web Content Accessibility Guidelines (\nWCAG\n)\nas a reference point. The WCAG is a shared standard for web content accessibility for individuals, organizations, and governments.\nThere are three levels of accessibility compliance in the WCAG, which reflect the priority of support:\nA: Essential\nIf this isn't met, assistive technology may not be able to read, understand, or fully operate the page or view.\nAA: Ideal Support\nRequired for\nmultiple government and public body websites\n. The A11Y Project strives for AA compliance.\nAAA: Specialized Support\nThis is typically reserved for parts of websites and web apps that serve a specialized audience.\nThis checklist targets many, but not all level A and AA concerns. Note that the different levels of WCAG support do not necessarily indicate an increased level of difficulty to implement.\nSuccess criteria\nEach item on this checklist has a corresponding WCAG “success criterion.” Success criterion are the specific, testable rules that power the WCAG, described by a reference number and short title. For example, the rule about text resizing is called\n1.4.4 Resize text\n.\nSome accessibility issues may have multiple success criterion apply to them. We have identified the one most relevant for each checklist item.\nDoes this checklist guarantee my site is accessible?\nNo. However, addressing the issues called out in this checklist will help improve the experience for everyone who uses your site.\nThe issues this checklist prompts you to check for covers a wide range of disability conditions. There is no such thing as “perfect accessibility” or a site being “100% accessible.” You should be wary of companies and services that make such promises. If you need professional accessibility help, use\nprofessional accessibility services\n.\nContent\nContent is the most important part of your site.\nTask: Use plain language and avoid figures of speech, idioms, and complicated metaphors.\nUse plain language and avoid figures of speech, idioms, and complicated metaphors.\n3.1.5 Reading Level\nWrite content at\nan 8th grade reading level\n.\nShare Link\nto checklist item: Use plain language and avoid figures of speech, idioms, and complicated metaphors.\nTask: Make sure that\nbutton\n,\na\n, and\nlabel\nelement content is unique and descriptive.\nMake sure that\nbutton\n,\na\n, and\nlabel\nelement content is unique and descriptive.\n1.3.1 Info and Relationships\nTerms like “click here” and “read more” do not provide any context. Some people navigate using a list of all buttons or links on a page or view. When using this mode, the terms indicate what will happen if navigated to or activated.\nShare Link\nto checklist item: Make sure that\nbutton\n,\na\n, and\nlabel\nelement content is unique and descriptive.\nTask: Use left-aligned text for left-to-right (\nLTR\n) languages, and right-aligned text for right-to-left (\nRTL\n) languages.\nUse left-aligned text for left-to-right (\nLTR\n) languages, and right-aligned text for right-to-left (\nRTL\n) languages.\n1.4.8 Visual Presentation\nCentered-aligned or justified text is difficult to read.\nShare Link\nto checklist item: Use left-aligned text for left-to-right (\nLTR\n) languages, and right-aligned text for right-to-left (\nRTL\n) languages.\nGlobal code\nGlobal code is code that affects your entire website or web app.\nTask: Validate your HTML.\nValidate your HTML.\n4.1.1 Parsing\nValid HTML\nhelps to provide a consistent, expected experience across all browsers and assistive technology.\nShare Link\nto checklist item: Validate your HTML.\nTask: Use a\nlang\nattribute on the\nhtml\nelement.\nUse a\nlang\nattribute on the\nhtml\nelement.\n3.1.1 Language of Page\nThis helps assistive technology such as screen readers to\npronounce content correctly\n.\nShare Link\nto checklist item: Use a\nlang\nattribute on the\nhtml\nelement.\nTask: Provide a unique\ntitle\nfor each page or view.\nProvide a unique\ntitle\nfor each page or view.\n2.4.2 Page Titled\nThe\ntitle\nelement, contained in the document's\nhead\nelement, is often the first piece of information announced by assistive technology. This helps tell people what page or view they are going to start navigating.\nShare Link\nto checklist item: Provide a unique\ntitle\nfor each page or view.\nTask: Ensure that viewport zoom is not disabled.\nEnsure that viewport zoom is not disabled.\n1.4.4 Resize text\nSome people need to increase the size of text to a point where they can read it. Do not stop them from doing this, even for web apps with a native app-like experience. Even native apps should respect Operating System settings for resizing text.\nShare Link\nto checklist item: Ensure that viewport zoom is not disabled.\nTask: Use landmark elements to indicate important content regions.\nUse landmark elements to indicate important content regions.\n4.1.2 Name, Role, Value\nLandmark regions\nhelp communicate the layout and important areas of a page or view, and can allow quick access to these regions. For example, use the\nnav\nelement to wrap a site's navigation, and the\nmain\nelement to contain the primary content of a page.\nShare Link\nto checklist item: Use landmark elements to indicate important content regions.\nTask: Ensure a linear content flow.\nEnsure a linear content flow.\n2.4.3 Focus Order\nRemove\ntabindex\nattribute values that aren't either\n0\nor\n-1\n. Elements that are inherently focusable, such as links or\nbutton\nelements, do not require a\ntabindex\n. Elements that are not inherently focusable should not have a\ntabindex\napplied to them outside of very specific use cases.\nShare Link\nto checklist item: Ensure a linear content flow.\nTask: Avoid using the\nautofocus\nattribute.\nAvoid using the\nautofocus\nattribute.\n2.4.3 Focus Order\nPeople who are blind or who have low vision may be disoriented when focus is moved without their permission. Additionally,\nautofocus\ncan be problematic for people with motor control disabilities, as it may create extra work for them to navigate out from the autofocused area and to other locations on the page/view.\nShare Link\nto checklist item: Avoid using the\nautofocus\nattribute.\nTask: Allow extending session timeouts.\nAllow extending session timeouts.\n2.2.1 Timing Adjustable\nIf you cannot remove session timeouts altogether, then let the person using your site easily turn off, adjust, or extend their session well before it ends.\nShare Link\nto checklist item: Allow extending session timeouts.\nTask: Remove\ntitle\nattribute tooltips.\nRemove\ntitle\nattribute tooltips.\n4.1.2 Name, Role, Value\nThe\ntitle\nattribute has numerous issues\n, and should not be used if the information provided is important for all people to access. An acceptable use for the\ntitle\nattribute would be labeling an\niframe\nelement to indicate what content it contains.\nShare Link\nto checklist item: Remove\ntitle\nattribute tooltips.\nKeyboard\nIt is important that your interface and content can be operated, and navigated by use of a keyboard. Some people cannot use a mouse, or may be using other assistive technologies that may not allow for hovering or precise clicking.\nTask: Make sure there is a visible focus style for interactive elements that are navigated to via keyboard input.\nMake sure there is a visible focus style for interactive elements that are navigated to via keyboard input.\n2.4.7 Focus Visible\nCan a person navigating with a keyboard,\nswitch\n, voice control, or screen reader see where they currently are on the page?\nShare Link\nto checklist item: Make sure there is a visible focus style for interactive elements that are navigated to via keyboard input.\nTask: Check to see that keyboard focus order matches the visual layout.\nCheck to see that keyboard focus order matches the visual layout.\n1.3.2 Meaningful Sequence\nCan a person navigating with a keyboard or screen reader move around the page in a predictable way?\nShare Link\nto checklist item: Check to see that keyboard focus order matches the visual layout.\nTask: Remove invisible focusable elements.\nRemove invisible focusable elements.\n2.4.3 Focus Order\nRemove the ability to focus on elements that are not presently meant to be discoverable. This includes things like inactive drop down menus, off screen navigations, or modals.\nShare Link\nto checklist item: Remove invisible focusable elements.\nImages\nImages are a very common part of most websites. Help make sure they can be enjoyed by all.\nTask: Make sure that all\nimg\nelements have an\nalt\nattribute.\nMake sure that all\nimg\nelements have an\nalt\nattribute.\n1.1.1 Non-text Content\nalt\nattributes (alt text) give a description of an image for people who may not be able to view them. When an\nalt\nattribute isn't present on an image, a screen reader may announce the image's file name and path instead. This fails to communicate the image’s content.\nShare Link\nto checklist item: Make sure that all\nimg\nelements have an\nalt\nattribute.\nTask: Make sure that decorative images use null\nalt\n(empty) attribute values.\nMake sure that decorative images use null\nalt\n(empty) attribute values.\n1.1.1 Non-text Content\nNull\nalt\nattributes are also sometimes known as empty\nalt\nattributes. They are made by including no information between the opening and closing quotes of an\nalt\nattribute. Decorative images do not communicate information that is required to understand the website's overall meaning. Historically they were used for flourishes and\nspacer gif\nimages, but tend to be less relevant for modern websites and web apps.\nShare Link\nto checklist item: Make sure that decorative images use null\nalt\n(empty) attribute values.\nTask: Provide a text alternative for complex images such as charts, graphs, and maps.\nProvide a text alternative for complex images such as charts, graphs, and maps.\n1.1.1 Non-text Content\nIs there a plain text which lists points on the map or sections of a flowchart? Describe all visible information. This includes graph axes, data points and labels, and the overall point the graphic is communicating.\nShare Link\nto checklist item: Provide a text alternative for complex images such as charts, graphs, and maps.\nTask: For images containing text, make sure the alt description includes the image's text.\nFor images containing text, make sure the alt description includes the image's text.\n1.1.1 Non-text Content\nFor example, the FedEx logo should have an alt value of “FedEx.”\nShare Link\nto checklist item: For images containing text, make sure the alt description includes the image's text.\nHeadings\nHeading elements (h1, h2, h3, etc.) help break up the content of the page into related “chunks” of information. They are incredibly important for helping people who use assistive technology to understand the meaning of a page or view.\nTask: Use heading elements to introduce content.\nUse heading elements to introduce content.\n2.4.6 Headings or Labels\nHeading elements construct a document outline, and should not be used for purely visual design.\nShare Link\nto checklist item: Use heading elements to introduce content.\nTask: Use only one\nh1\nelement per page or view.\nUse only one\nh1\nelement per page or view.\n2.4.6 Headings or Labels\nThe\nh1\nelement should be used to communicate the high-level purpose of the page or view. Do not use the\nh1\nelement for a heading that does not change between pages or views (for example, the site's name).\nShare Link\nto checklist item: Use only one\nh1\nelement per page or view.\nTask: Heading elements should be written in a logical sequence.\nHeading elements should be written in a logical sequence.\n2.4.6 Headings or Labels\nThe order of heading elements\nshould descend, based on the “depth” of the content. For example, a\nh4\nelement should not appear on a page before the first\nh3\nelement declaration. A tool such as\nheadingsMap\ncan help you evaluate this.\nShare Link\nto checklist item: Heading elements should be written in a logical sequence.\nTask: Don't skip heading levels.\nDon't skip heading levels.\n2.4.6 Headings or Labels\nFor example, don't jump from a\nh2\nto a\nh4\n, skipping a\nh3\nelement. If heading levels are being skipped for a specific visual treatment, use CSS classes instead.\nShare Link\nto checklist item: Don't skip heading levels.\nLists\nLists elements let people know a collection of items are related and if they are sequential, and how many items are present in the list grouping.\nTask: Use list elements (\nol\n,\nul\n, and\ndl\nelements) for list content.\nUse list elements (\nol\n,\nul\n, and\ndl\nelements) for list content.\n1.3.1 Info and Relationships\nThis may include sections of related content, items visually displayed in a grid-like layout, or sibling a elements.\nShare Link\nto checklist item: Use list elements (\nol\n,\nul\n, and\ndl\nelements) for list content.\nControls\nControls are interactive elements such as links and buttons that let a person navigate to a destination or perform an action.\nTask: Use the\na\nelement for links.\nUse the\na\nelement for links.\n1.3.1 Info and Relationships\nLinks should always have a\nhref\nattribute, even when used in Single Page Applications (\nSPA\ns). Without a\nhref\nattribute, the link will not be properly exposed to assistive technology. An example of this would be a link that uses an\nonclick\nevent, in place of a\nhref\nattribute.\nShare Link\nto checklist item: Use the\na\nelement for links.\nTask: Ensure that links are recognizable as links.\nEnsure that links are recognizable as links.\n1.4.1 Use of Color\nColor alone is not sufficient to indicate the presence of a link. Underlines are a popular and commonly-understood way to communicate the presence of link content.\nShare Link\nto checklist item: Ensure that links are recognizable as links.\nTask: Ensure that controls have\n:focus\nstates.\nEnsure that controls have\n:focus\nstates.\n2.4.7 Focus Visible\nVisible focus styles help people determine which interactive element has keyboard focus. This lets them know that they can perform actions like activating a button or navigating to a link's destination.\nShare Link\nto checklist item: Ensure that controls have\n:focus\nstates.\nTask: Use the\nbutton\nelement for buttons.\nUse the\nbutton\nelement for buttons.\n1.3.1 Info and Relationships\nButtons are used to submit data or perform an on-screen action which does not shift keyboard focus. You can add\ntype=\"button\"\nto a\nbutton\nelement to prevent the browser from attempting to submit form information when activated.\nShare Link\nto checklist item: Use the\nbutton\nelement for buttons.\nTask: Provide a skip link and make sure that it is visible when focused.\nProvide a skip link and make sure that it is visible when focused.\n2.4.1 Bypass Blocks\nA\nskip link\ncan be used to provide quick access to the main content of a page or view. This allows a person to easily bypass globally repeated content such as a website's primary navigation, or persistent search widget.\nShare Link\nto checklist item: Provide a skip link and make sure that it is visible when focused.\nTask: Identify links that open in a new tab or window.\nIdentify links that open in a new tab or window.\nG201: Giving users advanced warning when opening a new window\nIdeally, avoid links that open in a new tab or window. If a link does, ensure the link's behavior will be communicated in a way that is apparent to all users. Doing this will help people understand what will happen before activating the link. While this technique is technically not required for compliance, it is an often-cited area of frustration for many different kinds of assistive technology users.\nShare Link\nto checklist item: Identify links that open in a new tab or window.\nTables\nTables are a structured set of data that help people understand the relationships between different types of information.\nTask: Use the\ntable\nelement to describe tabular data.\nUse the\ntable\nelement to describe tabular data.\n1.3.1 Info and Relationships\nDo you need to display data in rows and columns? Use the\ntable\nelement.\nShare Link\nto checklist item: Use the\ntable\nelement to describe tabular data.\nTask: Use the\nth\nelement for table headers (with appropriate\nscope\nattributes).\nUse the\nth\nelement for table headers (with appropriate\nscope\nattributes).\n4.1.1 Parsing\nDepending on\nhow complex your table is\n, you may also consider using\nscope=\"col\"\nfor column headers, and\nscope=\"row\"\nfor row headers. Many different kinds of assistive technology still use the\nscope\nattribute to help them understand and describe the structure of a table.\nShare Link\nto checklist item: Use the\nth\nelement for table headers (with appropriate\nscope\nattributes).\nTask: Use the\ncaption\nelement to provide a title for the table.\nUse the\ncaption\nelement to provide a title for the table.\n2.4.6 Headings or Labels\nThe table's\ncaption\nshould describe what kind of information the table contains.\nShare Link\nto checklist item: Use the\ncaption\nelement to provide a title for the table.\nForms\nForms allow people to enter information into a site for processing and manipulation. This includes things like sending messages and placing orders.\nTask: All inputs in a form are associated with a corresponding\nlabel\nelement.\nAll inputs in a form are associated with a corresponding\nlabel\nelement.\n3.2.2 On Input\nUse a\nfor\n/\nid\npairing to guarantee the highest level of browser/assistive technology support.\nShare Link\nto checklist item: All inputs in a form are associated with a corresponding\nlabel\nelement.\nTask: Use\nfieldset\nand\nlegend\nelements where appropriate.\nUse\nfieldset\nand\nlegend\nelements where appropriate.\n1.3.1 Info and Relationships\nDoes your form contain multiple sections of related inputs? Use\nfieldset\nto group them, and\nlegend\nto provide a label for what this section is for.\nShare Link\nto checklist item: Use\nfieldset\nand\nlegend\nelements where appropriate.\nTask: Inputs use\nautocomplete\nwhere appropriate.\nInputs use\nautocomplete\nwhere appropriate.\n1.3.5 Identify Input Purpose\nProviding a mechanism\nto help people more quickly, easily, and accurately fill in form fields that ask for common information (for example, name, address, phone number).\nShare Link\nto checklist item: Inputs use\nautocomplete\nwhere appropriate.\nTask: Make sure that form input errors are displayed in list above the form after submission.\nMake sure that form input errors are displayed in list above the form after submission.\n3.3.1 Error Identification\nThis provides a way for assistive technology users to quickly have a high-level understanding of what issues are present in the form. This is especially important for larger forms with many inputs. Make sure that each reported error also has a link to the corresponding field with invalid input.\nShare Link\nto checklist item: Make sure that form input errors are displayed in list above the form after submission.\nTask: Associate input error messaging with the input it corresponds to.\nAssociate input error messaging with the input it corresponds to.\n3.3.1 Error Identification\nTechniques such as\nusing\naria-describedby\nallow people who use assistive technology to more easily understand the difference between the input and the error message associated with it.\nShare Link\nto checklist item: Associate input error messaging with the input it corresponds to.\nTask: Make sure that error, warning, and success states are not visually communicated by just color.\nMake sure that error, warning, and success states are not visually communicated by just color.\n1.4.1 Use of Color\nPeople who are color blind, who have other low vision conditions, or different cultural understandings for color may not see the state change, or understand what kind of feedback the state represents if color is the only indicator.\nShare Link\nto checklist item: Make sure that error, warning, and success states are not visually communicated by just color.\nMedia\nMedia includes content such as pre-recorded and live audio and video.\nTask: Make sure that media does not autoplay.\nMake sure that media does not autoplay.\n1.4.2 Audio Control\nUnexpected video and audio can be distracting and disruptive, especially for certain kinds of cognitive disability such as ADHD. Certain kinds of autoplaying video and animation can be a trigger for vestibular and seizure disorders.\nShare Link\nto checklist item: Make sure that media does not autoplay.\nTask: Ensure that media controls use appropriate markup.\nEnsure that media controls use appropriate markup.\n1.3.1 Info and Relationships\nExamples include making sure an audio mute button has\na pressed toggle state\nwhen active, or that a volume slider uses\n<input type=\"range\">\n.\nShare Link\nto checklist item: Ensure that media controls use appropriate markup.\nTask: Check to see that all media can be paused.\nCheck to see that all media can be paused.\n2.1.1 Keyboard\nProvide a global pause function on any media element. If the device has a keyboard, ensure that pressing the\nSpace\nkey can pause playback. Make sure you also don't interfere with the\nSpace\nkey's ability to scroll the page/view when not focusing on a form control.\nShare Link\nto checklist item: Check to see that all media can be paused.\nVideo\nVideo-specific checks.\nTask: Confirm the presence of captions.\nConfirm the presence of captions.\n1.2.2 Captions\nCaptions allow a person who cannot hear the audio content of a video to still understand its content.\nShare Link\nto checklist item: Confirm the presence of captions.\nTask: Remove seizure triggers.\nRemove seizure triggers.\n2.3.1 Three Flashes or Below Threshold\nCertain kinds of strobing or flashing animations will trigger seizures.\nShare Link\nto checklist item: Remove seizure triggers.\nAudio\nAudio-specific checks.\nTask: Confirm that transcripts are available.\nConfirm that transcripts are available.\n1.1.1 Non-text Content\nTranscripts allow people who cannot hear to still understand the audio content. It also allows people to digest audio content at a pace that is comfortable to them.\nShare Link\nto checklist item: Confirm that transcripts are available.\nAppearance\nHow your website app content looks in any given situation.\nTask: Check your content in specialized browsing modes.\nCheck your content in specialized browsing modes.\n1.4.1 Use of Color\nActivate\nmodes such as Windows High Contrast or Inverted Colors\n. Is your content still legible? Are your icons, borders, links, form fields, and other content still present? Can you distinguish foreground content from the background?\nShare Link\nto checklist item: Check your content in specialized browsing modes.\nTask: Increase text size to 200%.\nIncrease text size to 200%.\n1.4.4 Resize text\nIs the content still readable? Does increasing the text size cause content to overlap?\nShare Link\nto checklist item: Increase text size to 200%.\nTask: Double-check that good proximity between content is maintained.\nDouble-check that good proximity between content is maintained.\n1.3.3 Sensory Characteristics\nUse\nthe straw test\nto ensure people who depend on screen zoom software can still easily discover all content.\nShare Link\nto checklist item: Double-check that good proximity between content is maintained.\nTask: Make sure color isn't the only way information is conveyed.\nMake sure color isn't the only way information is conveyed.\n1.4.1 Use of Color\nCan you still see where links are among body content if everything is grayscale?\nShare Link\nto checklist item: Make sure color isn't the only way information is conveyed.\nTask: Make sure instructions are not visual or audio-only.\nMake sure instructions are not visual or audio-only.\n1.3.3 Sensory Characteristics\nUse a combination of characteristics to write cues, particularly the actual names of sections and elements, rather than just descriptions like location (“on the right”) or audio (“after the tone”).\nShare Link\nto checklist item: Make sure instructions are not visual or audio-only.\nTask: Use a simple, straightforward, and consistent layout.\nUse a simple, straightforward, and consistent layout.\n1.4.10 Reflow\nA complicated layout can be confusing to understand and use.\nShare Link\nto checklist item: Use a simple, straightforward, and consistent layout.\nAnimation\nContent that moves, either on its own, or when triggered by a person activating a control.\nTask: Ensure animations are subtle and do not flash too much.\nEnsure animations are subtle and do not flash too much.\n2.3.1 Three Flashes or Below Threshold\nCertain kinds of strobing or flashing animations will trigger seizures. Others may be distracting and disruptive, especially for certain kinds of cognitive disability such as ADHD.\nShare Link\nto checklist item: Ensure animations are subtle and do not flash too much.\nTask: Provide a mechanism to pause background video.\nProvide a mechanism to pause background video.\n2.2.2 Pause, Stop, Hide\nBackground video can be distracting, especially if content is placed over it.\nShare Link\nto checklist item: Provide a mechanism to pause background video.\nTask: Make sure all animation obeys the\nprefers-reduced-motion\nmedia query.\nMake sure all animation obeys the\nprefers-reduced-motion\nmedia query.\n2.3.3 Animation from Interactions\nRemove animations when the “reduce motion” setting is activated. If an animation is necessary to communicate meaning for a concept, slow its duration down.\nShare Link\nto checklist item: Make sure all animation obeys the\nprefers-reduced-motion\nmedia query.\nColor contrast\nColor contrast\nis how legible colors are when placed next to, and on top of each other.\nTask: Check the contrast for all normal-sized text.\nCheck the contrast for all normal-sized text.\n1.4.3 Contrast\nLevel AA compliance requires a contrast ratio of 4.5:1.\nShare Link\nto checklist item: Check the contrast for all normal-sized text.\nTask: Check the contrast for all large-sized text.\nCheck the contrast for all large-sized text.\n1.4.3 Contrast\nLevel AA compliance requires a contrast ratio of 3:1.\nShare Link\nto checklist item: Check the contrast for all large-sized text.\nTask: Check the contrast for all icons.\nCheck the contrast for all icons.\n1.4.11 Non-text Contrast\nLevel AA compliance requires a contrast ratio of 3.0:1.\nShare Link\nto checklist item: Check the contrast for all icons.\nTask: Check the contrast of borders for input elements (text input, radio buttons, checkboxes, etc.).\nCheck the contrast of borders for input elements (text input, radio buttons, checkboxes, etc.).\n1.4.11 Non-text Contrast\nLevel AA compliance requires a contrast ratio of 3.0:1.\nShare Link\nto checklist item: Check the contrast of borders for input elements (text input, radio buttons, checkboxes, etc.).\nTask: Check text that overlaps images or video.\nCheck text that overlaps images or video.\n1.4.3 Contrast\nIs text still legible?\nShare Link\nto checklist item: Check text that overlaps images or video.\nTask: Check custom\n::selection\ncolors.\nCheck custom\n::selection\ncolors.\n1.4.3 Contrast\nIs the color contrast you set in your\n::selection\nCSS declaration\nsufficient? Otherwise someone may not be able read it if they highlight it.\nShare Link\nto checklist item: Check custom\n::selection\ncolors.\nMobile and touch\nThings to check mobile experiences for.\nTask: Check that the site can be rotated to any orientation.\nCheck that the site can be rotated to any orientation.\n1.3.4 Orientation\nDoes the site only allow portrait orientation?\nShare Link\nto checklist item: Check that the site can be rotated to any orientation.\nTask: Remove horizontal scrolling.\nRemove horizontal scrolling.\n1.4.10 Reflow\nRequiring someone to scroll horizontally can be difficult for some, irritating for all.\nShare Link\nto checklist item: Remove horizontal scrolling.\nTask: Ensure that button and link icons can be activated with ease.\nEnsure that button and link icons can be activated with ease.\n2.5.5 Target Size\nIt's good to make sure things like hamburger menus, social icons, gallery viewers, and other touch controls are usable by a wide range of hand and stylus sizes.\nShare Link\nto checklist item: Ensure that button and link icons can be activated with ease.\nTask: Ensure sufficient space between interactive items in order to provide a scroll area.\nEnsure sufficient space between interactive items in order to provide a scroll area.\n2.4.1 Bypass Blocks\nSome people who experience motor control issues such as\nhand tremors\nmay have a very difficult time scrolling past interactive items which feature zero spacing.\nShare Link\nto checklist item: Ensure sufficient space between interactive items in order to provide a scroll area.\nNext steps\nRemember to periodically check your site to ensure it is still accessible. The A11Y Project also strongly encourages you to verify your testing by\nhiring a professional tester\n.\nFurther reading\nTetraLogical has a good in-depth, yet still\nhigh-level explanation of the\nWCAG\n. Check it out if you want to learn more about its history and principles.",
  "content_markdown": "Table of Contents\n\nThis checklist uses [The Web Content Accessibility Guidelines (WCAG)](https://www.w3.org/WAI/standards-guidelines/wcag/) as a reference point. The WCAG is a shared standard for web content accessibility for individuals, organizations, and governments.\n\nThere are three levels of accessibility compliance in the WCAG, which reflect the priority of support:\n\n![](/img/checklist/wcag-level-a-small.svg)\n\n**A: Essential** If this isn't met, assistive technology may not be able to read, understand, or fully operate the page or view.\n\n![](/img/checklist/wcag-level-aa-small.svg)\n\n**AA: Ideal Support** Required for [multiple government and public body websites](https://www.w3.org/WAI/policies/). The A11Y Project strives for AA compliance.\n\n![](/img/checklist/wcag-level-aaa-small.svg)\n\n**AAA: Specialized Support** This is typically reserved for parts of websites and web apps that serve a specialized audience.\n\nThis checklist targets many, but not all level A and AA concerns. Note that the different levels of WCAG support do not necessarily indicate an increased level of difficulty to implement.\n\n## Success criteria\n\nEach item on this checklist has a corresponding WCAG “success criterion.” Success criterion are the specific, testable rules that power the WCAG, described by a reference number and short title. For example, the rule about text resizing is called [1.4.4 Resize text](https://www.w3.org/WAI/WCAG22/Understanding/resize-text.html).\n\nSome accessibility issues may have multiple success criterion apply to them. We have identified the one most relevant for each checklist item.\n\n## Does this checklist guarantee my site is accessible?\n\nNo. However, addressing the issues called out in this checklist will help improve the experience for everyone who uses your site.\n\nThe issues this checklist prompts you to check for covers a wide range of disability conditions. There is no such thing as “perfect accessibility” or a site being “100% accessible.” You should be wary of companies and services that make such promises. If you need professional accessibility help, use [professional accessibility services](/resources/#professional-help).\n\n---\n\n## Content\n\nContent is the most important part of your site.\n\nTask: Use plain language and avoid figures of speech, idioms, and complicated metaphors.\n\n Use plain language and avoid figures of speech, idioms, and complicated metaphors.\n\n[3.1.5 Reading Level](https://www.w3.org/WAI/WCAG22/Understanding/reading-level.html)\n\nWrite content at [an 8th grade reading level](https://datayze.com/readability-analyzer.php).\n\n[Share Link to checklist item: Use plain language and avoid figures of speech, idioms, and complicated metaphors.](#use-plain-language-and-avoid-figures-of-speech-idioms-and-complicated-metaphors)\n\nTask: Make sure that `button`, `a`, and `label` element content is unique and descriptive.\n\n Make sure that `button`, `a`, and `label` element content is unique and descriptive.\n\n[1.3.1 Info and Relationships](https://www.w3.org/WAI/WCAG22/Understanding/info-and-relationships.html)\n\nTerms like “click here” and “read more” do not provide any context. Some people navigate using a list of all buttons or links on a page or view. When using this mode, the terms indicate what will happen if navigated to or activated.\n\n[Share Link to checklist item: Make sure that `button`, `a`, and `label` element content is unique and descriptive.](#make-sure-that-button-a-and-label-element-content-is-unique-and-descriptive)\n\nTask: Use left-aligned text for left-to-right (LTR) languages, and right-aligned text for right-to-left (RTL) languages.\n\n Use left-aligned text for left-to-right (LTR) languages, and right-aligned text for right-to-left (RTL) languages.\n\n[1.4.8 Visual Presentation](https://www.w3.org/WAI/WCAG22/Understanding/visual-presentation.html)\n\nCentered-aligned or justified text is difficult to read.\n\n[Share Link to checklist item: Use left-aligned text for left-to-right (LTR) languages, and right-aligned text for right-to-left (RTL) languages.](#use-left-aligned-text-for-left-to-right-ltr-languages-and-right-aligned-text-for-right-to-left-rtl-languages)\n\n## Global code\n\nGlobal code is code that affects your entire website or web app.\n\nTask: Validate your HTML.\n\n Validate your HTML.\n\n[4.1.1 Parsing](https://www.w3.org/WAI/WCAG22/Understanding/parsing.html)\n\n[Valid HTML](https://validator.w3.org/nu/) helps to provide a consistent, expected experience across all browsers and assistive technology.\n\n[Share Link to checklist item: Validate your HTML.](#validate-your-html)\n\nTask: Use a `lang` attribute on the `html` element.\n\n Use a `lang` attribute on the `html` element.\n\n[3.1.1 Language of Page](https://www.w3.org/WAI/WCAG22/Understanding/language-of-page.html)\n\nThis helps assistive technology such as screen readers to [pronounce content correctly](https://github.com/FreedomScientific/VFO-standards-support/issues/188).\n\n[Share Link to checklist item: Use a `lang` attribute on the `html` element.](#use-a-lang-attribute-on-the-html-element)\n\nTask: Provide a unique `title` for each page or view.\n\n Provide a unique `title` for each page or view.\n\n[2.4.2 Page Titled](https://www.w3.org/WAI/WCAG22/Understanding/page-titled.html)\n\nThe `title` element, contained in the document's `head` element, is often the first piece of information announced by assistive technology. This helps tell people what page or view they are going to start navigating.\n\n[Share Link to checklist item: Provide a unique `title` for each page or view.](#provide-a-unique-title-for-each-page-or-view)\n\nTask: Ensure that viewport zoom is not disabled.\n\n Ensure that viewport zoom is not disabled.\n\n[1.4.4 Resize text](https://www.w3.org/WAI/WCAG22/Understanding/resize-text.html)\n\nSome people need to increase the size of text to a point where they can read it. Do not stop them from doing this, even for web apps with a native app-like experience. Even native apps should respect Operating System settings for resizing text.\n\n[Share Link to checklist item: Ensure that viewport zoom is not disabled.](#ensure-that-viewport-zoom-is-not-disabled)\n\nTask: Use landmark elements to indicate important content regions.\n\n Use landmark elements to indicate important content regions.\n\n[4.1.2 Name, Role, Value](https://www.w3.org/WAI/WCAG22/Understanding/name-role-value.html)\n\n[Landmark regions](https://www.w3.org/TR/wai-aria-practices/examples/landmarks/HTML5.html) help communicate the layout and important areas of a page or view, and can allow quick access to these regions. For example, use the `nav` element to wrap a site's navigation, and the `main` element to contain the primary content of a page.\n\n[Share Link to checklist item: Use landmark elements to indicate important content regions.](#use-landmark-elements-to-indicate-important-content-regions)\n\nTask: Ensure a linear content flow.\n\n Ensure a linear content flow.\n\n[2.4.3 Focus Order](https://www.w3.org/WAI/WCAG22/Understanding/focus-order.html)\n\nRemove `tabindex` attribute values that aren't either `0` or `-1`. Elements that are inherently focusable, such as links or `button` elements, do not require a `tabindex`. Elements that are not inherently focusable should not have a `tabindex` applied to them outside of very specific use cases.\n\n[Share Link to checklist item: Ensure a linear content flow.](#ensure-a-linear-content-flow)\n\nTask: Avoid using the `autofocus` attribute.\n\n Avoid using the `autofocus` attribute.\n\n[2.4.3 Focus Order](https://www.w3.org/WAI/WCAG22/Understanding/focus-order.html)\n\nPeople who are blind or who have low vision may be disoriented when focus is moved without their permission. Additionally, `autofocus` can be problematic for people with motor control disabilities, as it may create extra work for them to navigate out from the autofocused area and to other locations on the page/view.\n\n[Share Link to checklist item: Avoid using the `autofocus` attribute.](#avoid-using-the-autofocus-attribute)\n\nTask: Allow extending session timeouts.\n\n Allow extending session timeouts.\n\n[2.2.1 Timing Adjustable](https://www.w3.org/WAI/WCAG22/Understanding/timing-adjustable.html)\n\nIf you cannot remove session timeouts altogether, then let the person using your site easily turn off, adjust, or extend their session well before it ends.\n\n[Share Link to checklist item: Allow extending session timeouts.](#allow-extending-session-timeouts)\n\nTask: Remove `title` attribute tooltips.\n\n Remove `title` attribute tooltips.\n\n[4.1.2 Name, Role, Value](https://www.w3.org/WAI/WCAG22/Understanding/name-role-value.html)\n\n[The `title` attribute has numerous issues](https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/title#Accessibility_concerns), and should not be used if the information provided is important for all people to access. An acceptable use for the `title` attribute would be labeling an `iframe` element to indicate what content it contains.\n\n[Share Link to checklist item: Remove `title` attribute tooltips.](#remove-title-attribute-tooltips)\n\n## Keyboard\n\nIt is important that your interface and content can be operated, and navigated by use of a keyboard. Some people cannot use a mouse, or may be using other assistive technologies that may not allow for hovering or precise clicking.\n\nTask: Make sure there is a visible focus style for interactive elements that are navigated to via keyboard input.\n\n Make sure there is a visible focus style for interactive elements that are navigated to via keyboard input.\n\n[2.4.7 Focus Visible](https://www.w3.org/WAI/WCAG22/Understanding/focus-visible.html)\n\nCan a person navigating with a keyboard, [switch](https://axesslab.com/switches/), voice control, or screen reader see where they currently are on the page?\n\n[Share Link to checklist item: Make sure there is a visible focus style for interactive elements that are navigated to via keyboard input.](#make-sure-there-is-a-visible-focus-style-for-interactive-elements-that-are-navigated-to-via-keyboard-input)\n\nTask: Check to see that keyboard focus order matches the visual layout.\n\n Check to see that keyboard focus order matches the visual layout.\n\n[1.3.2 Meaningful Sequence](https://www.w3.org/WAI/WCAG22/Understanding/meaningful-sequence.html)\n\nCan a person navigating with a keyboard or screen reader move around the page in a predictable way?\n\n[Share Link to checklist item: Check to see that keyboard focus order matches the visual layout.](#check-to-see-that-keyboard-focus-order-matches-the-visual-layout)\n\nTask: Remove invisible focusable elements.\n\n Remove invisible focusable elements.\n\n[2.4.3 Focus Order](https://www.w3.org/WAI/WCAG22/Understanding/focus-order.html)\n\nRemove the ability to focus on elements that are not presently meant to be discoverable. This includes things like inactive drop down menus, off screen navigations, or modals.\n\n[Share Link to checklist item: Remove invisible focusable elements.](#remove-invisible-focusable-elements)\n\n## Images\n\nImages are a very common part of most websites. Help make sure they can be enjoyed by all.\n\nTask: Make sure that all `img` elements have an `alt` attribute.\n\n Make sure that all `img` elements have an `alt` attribute.\n\n[1.1.1 Non-text Content](https://www.w3.org/WAI/WCAG22/Understanding/non-text-content.html)\n\n`alt` attributes (alt text) give a description of an image for people who may not be able to view them. When an `alt` attribute isn't present on an image, a screen reader may announce the image's file name and path instead. This fails to communicate the image’s content.\n\n[Share Link to checklist item: Make sure that all `img` elements have an `alt` attribute.](#make-sure-that-all-img-elements-have-an-alt-attribute)\n\nTask: Make sure that decorative images use null `alt` (empty) attribute values.\n\n Make sure that decorative images use null `alt` (empty) attribute values.\n\n[1.1.1 Non-text Content](https://www.w3.org/WAI/WCAG22/Understanding/non-text-content.html)\n\nNull `alt` attributes are also sometimes known as empty `alt` attributes. They are made by including no information between the opening and closing quotes of an `alt` attribute. Decorative images do not communicate information that is required to understand the website's overall meaning. Historically they were used for flourishes and [spacer gif](https://en.wikipedia.org/wiki/Spacer_GIF) images, but tend to be less relevant for modern websites and web apps.\n\n[Share Link to checklist item: Make sure that decorative images use null `alt` (empty) attribute values.](#make-sure-that-decorative-images-use-null-alt-empty-attribute-values)\n\nTask: Provide a text alternative for complex images such as charts, graphs, and maps.\n\n Provide a text alternative for complex images such as charts, graphs, and maps.\n\n[1.1.1 Non-text Content](https://www.w3.org/WAI/WCAG22/Understanding/non-text-content.html)\n\nIs there a plain text which lists points on the map or sections of a flowchart? Describe all visible information. This includes graph axes, data points and labels, and the overall point the graphic is communicating.\n\n[Share Link to checklist item: Provide a text alternative for complex images such as charts, graphs, and maps.](#provide-a-text-alternative-for-complex-images-such-as-charts-graphs-and-maps)\n\nTask: For images containing text, make sure the alt description includes the image's text.\n\n For images containing text, make sure the alt description includes the image's text.\n\n[1.1.1 Non-text Content](https://www.w3.org/WAI/WCAG22/Understanding/non-text-content.html)\n\nFor example, the FedEx logo should have an alt value of “FedEx.”\n\n[Share Link to checklist item: For images containing text, make sure the alt description includes the image's text.](#for-images-containing-text-make-sure-the-alt-description-includes-the-images-text)\n\n## Headings\n\nHeading elements (h1, h2, h3, etc.) help break up the content of the page into related “chunks” of information. They are incredibly important for helping people who use assistive technology to understand the meaning of a page or view.\n\nTask: Use heading elements to introduce content.\n\n Use heading elements to introduce content.\n\n[2.4.6 Headings or Labels](https://www.w3.org/WAI/WCAG22/Understanding/headings-and-labels.html)\n\nHeading elements construct a document outline, and should not be used for purely visual design.\n\n[Share Link to checklist item: Use heading elements to introduce content.](#use-heading-elements-to-introduce-content)\n\nTask: Use only one `h1` element per page or view.\n\n Use only one `h1` element per page or view.\n\n[2.4.6 Headings or Labels](https://www.w3.org/WAI/WCAG22/Understanding/headings-and-labels.html)\n\nThe `h1` element should be used to communicate the high-level purpose of the page or view. Do not use the `h1` element for a heading that does not change between pages or views (for example, the site's name).\n\n[Share Link to checklist item: Use only one `h1` element per page or view.](#use-only-one-h1-element-per-page-or-view)\n\nTask: Heading elements should be written in a logical sequence.\n\n Heading elements should be written in a logical sequence.\n\n[2.4.6 Headings or Labels](https://www.w3.org/WAI/WCAG22/Understanding/headings-and-labels.html)\n\n[The order of heading elements](https://webdesign.tutsplus.com/articles/the-importance-of-heading-levels-for-assistive-technology--cms-31753) should descend, based on the “depth” of the content. For example, a `h4` element should not appear on a page before the first `h3` element declaration. A tool such as [headingsMap](/resources/#headingsmap) can help you evaluate this.\n\n[Share Link to checklist item: Heading elements should be written in a logical sequence.](#heading-elements-should-be-written-in-a-logical-sequence)\n\nTask: Don't skip heading levels.\n\n Don't skip heading levels.\n\n[2.4.6 Headings or Labels](https://www.w3.org/WAI/WCAG22/Understanding/headings-and-labels.html)\n\nFor example, don't jump from a `h2` to a `h4`, skipping a `h3` element. If heading levels are being skipped for a specific visual treatment, use CSS classes instead.\n\n[Share Link to checklist item: Don't skip heading levels.](#dont-skip-heading-levels)\n\n## Lists\n\nLists elements let people know a collection of items are related and if they are sequential, and how many items are present in the list grouping.\n\nTask: Use list elements (`ol`, `ul`, and `dl` elements) for list content.\n\n Use list elements (`ol`, `ul`, and `dl` elements) for list content.\n\n[1.3.1 Info and Relationships](https://www.w3.org/WAI/WCAG22/Understanding/info-and-relationships.html)\n\nThis may include sections of related content, items visually displayed in a grid-like layout, or sibling a elements.\n\n[Share Link to checklist item: Use list elements (`ol`, `ul`, and `dl` elements) for list content.](#use-list-elements-ol-ul-and-dl-elements-for-list-content)\n\n## Controls\n\nControls are interactive elements such as links and buttons that let a person navigate to a destination or perform an action.\n\nTask: Use the `a` element for links.\n\n Use the `a` element for links.\n\n[1.3.1 Info and Relationships](https://www.w3.org/WAI/WCAG22/Understanding/info-and-relationships.html)\n\nLinks should always have a `href` attribute, even when used in Single Page Applications (SPAs). Without a `href` attribute, the link will not be properly exposed to assistive technology. An example of this would be a link that uses an `onclick` event, in place of a `href` attribute.\n\n[Share Link to checklist item: Use the `a` element for links.](#use-the-a-element-for-links)\n\nTask: Ensure that links are recognizable as links.\n\n Ensure that links are recognizable as links.\n\n[1.4.1 Use of Color](https://www.w3.org/WAI/WCAG22/Understanding/use-of-color.html)\n\nColor alone is not sufficient to indicate the presence of a link. Underlines are a popular and commonly-understood way to communicate the presence of link content.\n\n[Share Link to checklist item: Ensure that links are recognizable as links.](#ensure-that-links-are-recognizable-as-links)\n\nTask: Ensure that controls have `:focus` states.\n\n Ensure that controls have `:focus` states.\n\n[2.4.7 Focus Visible](https://www.w3.org/WAI/WCAG22/Understanding/focus-visible.html)\n\nVisible focus styles help people determine which interactive element has keyboard focus. This lets them know that they can perform actions like activating a button or navigating to a link's destination.\n\n[Share Link to checklist item: Ensure that controls have `:focus` states.](#ensure-that-controls-have-focus-states)\n\nTask: Use the `button` element for buttons.\n\n Use the `button` element for buttons.\n\n[1.3.1 Info and Relationships](https://www.w3.org/WAI/WCAG22/Understanding/info-and-relationships.html)\n\nButtons are used to submit data or perform an on-screen action which does not shift keyboard focus. You can add `type=\"button\"` to a `button` element to prevent the browser from attempting to submit form information when activated.\n\n[Share Link to checklist item: Use the `button` element for buttons.](#use-the-button-element-for-buttons)\n\nTask: Provide a skip link and make sure that it is visible when focused.\n\n Provide a skip link and make sure that it is visible when focused.\n\n[2.4.1 Bypass Blocks](https://www.w3.org/WAI/WCAG22/Understanding/bypass-blocks.html)\n\nA [skip link](/posts/skip-nav-links/) can be used to provide quick access to the main content of a page or view. This allows a person to easily bypass globally repeated content such as a website's primary navigation, or persistent search widget.\n\n[Share Link to checklist item: Provide a skip link and make sure that it is visible when focused.](#provide-a-skip-link-and-make-sure-that-it-is-visible-when-focused)\n\nTask: Identify links that open in a new tab or window.\n\n Identify links that open in a new tab or window.\n\n[G201: Giving users advanced warning when opening a new window](https://www.w3.org/WAI/WCAG22/Techniques/general/G201)\n\nIdeally, avoid links that open in a new tab or window. If a link does, ensure the link's behavior will be communicated in a way that is apparent to all users. Doing this will help people understand what will happen before activating the link. While this technique is technically not required for compliance, it is an often-cited area of frustration for many different kinds of assistive technology users.\n\n[Share Link to checklist item: Identify links that open in a new tab or window.](#identify-links-that-open-in-a-new-tab-or-window)\n\n## Tables\n\nTables are a structured set of data that help people understand the relationships between different types of information.\n\nTask: Use the `table` element to describe tabular data.\n\n Use the `table` element to describe tabular data.\n\n[1.3.1 Info and Relationships](https://www.w3.org/WAI/WCAG22/Understanding/info-and-relationships.html)\n\nDo you need to display data in rows and columns? Use the `table` element.\n\n[Share Link to checklist item: Use the `table` element to describe tabular data.](#use-the-table-element-to-describe-tabular-data)\n\nTask: Use the `th` element for table headers (with appropriate `scope` attributes).\n\n Use the `th` element for table headers (with appropriate `scope` attributes).\n\n[4.1.1 Parsing](https://www.w3.org/WAI/WCAG22/Understanding/parsing.html)\n\nDepending on [how complex your table is](https://www.w3.org/WAI/tutorials/tables/), you may also consider using `scope=\"col\"` for column headers, and `scope=\"row\"` for row headers. Many different kinds of assistive technology still use the `scope` attribute to help them understand and describe the structure of a table.\n\n[Share Link to checklist item: Use the `th` element for table headers (with appropriate `scope` attributes).](#use-the-th-element-for-table-headers-with-appropriate-scope-attributes)\n\nTask: Use the `caption` element to provide a title for the table.\n\n Use the `caption` element to provide a title for the table.\n\n[2.4.6 Headings or Labels](https://www.w3.org/WAI/WCAG22/Understanding/headings-and-labels.html)\n\nThe table's `caption` should describe what kind of information the table contains.\n\n[Share Link to checklist item: Use the `caption` element to provide a title for the table.](#use-the-caption-element-to-provide-a-title-for-the-table)\n\n## Forms\n\nForms allow people to enter information into a site for processing and manipulation. This includes things like sending messages and placing orders.\n\nTask: All inputs in a form are associated with a corresponding `label` element.\n\n All inputs in a form are associated with a corresponding `label` element.\n\n[3.2.2 On Input](https://www.w3.org/WAI/WCAG22/Understanding/on-input.html)\n\nUse a `for`/`id` pairing to guarantee the highest level of browser/assistive technology support.\n\n[Share Link to checklist item: All inputs in a form are associated with a corresponding `label` element.](#all-inputs-in-a-form-are-associated-with-a-corresponding-label-element)\n\nTask: Use `fieldset` and `legend` elements where appropriate.\n\n Use `fieldset` and `legend` elements where appropriate.\n\n[1.3.1 Info and Relationships](https://www.w3.org/WAI/WCAG22/Understanding/info-and-relationships.html)\n\nDoes your form contain multiple sections of related inputs? Use `fieldset` to group them, and `legend` to provide a label for what this section is for.\n\n[Share Link to checklist item: Use `fieldset` and `legend` elements where appropriate.](#use-fieldset-and-legend-elements-where-appropriate)\n\nTask: Inputs use `autocomplete` where appropriate.\n\n Inputs use `autocomplete` where appropriate.\n\n[1.3.5 Identify Input Purpose](https://www.w3.org/WAI/WCAG22/Understanding/identify-input-purpose.html)\n\n[Providing a mechanism](https://www.w3.org/TR/html52/sec-forms.html#sec-autofill) to help people more quickly, easily, and accurately fill in form fields that ask for common information (for example, name, address, phone number).\n\n[Share Link to checklist item: Inputs use `autocomplete` where appropriate.](#inputs-use-autocomplete-where-appropriate)\n\nTask: Make sure that form input errors are displayed in list above the form after submission.\n\n Make sure that form input errors are displayed in list above the form after submission.\n\n[3.3.1 Error Identification](https://www.w3.org/WAI/WCAG22/Understanding/error-identification.html)\n\nThis provides a way for assistive technology users to quickly have a high-level understanding of what issues are present in the form. This is especially important for larger forms with many inputs. Make sure that each reported error also has a link to the corresponding field with invalid input.\n\n[Share Link to checklist item: Make sure that form input errors are displayed in list above the form after submission.](#make-sure-that-form-input-errors-are-displayed-in-list-above-the-form-after-submission)\n\nTask: Associate input error messaging with the input it corresponds to.\n\n Associate input error messaging with the input it corresponds to.\n\n[3.3.1 Error Identification](https://www.w3.org/WAI/WCAG22/Understanding/error-identification.html)\n\nTechniques such as [using `aria-describedby`](https://developer.paciellogroup.com/blog/2018/09/describing-aria-describedby/) allow people who use assistive technology to more easily understand the difference between the input and the error message associated with it.\n\n[Share Link to checklist item: Associate input error messaging with the input it corresponds to.](#associate-input-error-messaging-with-the-input-it-corresponds-to)\n\nTask: Make sure that error, warning, and success states are not visually communicated by just color.\n\n Make sure that error, warning, and success states are not visually communicated by just color.\n\n[1.4.1 Use of Color](https://www.w3.org/WAI/WCAG22/Understanding/use-of-color.html)\n\nPeople who are color blind, who have other low vision conditions, or different cultural understandings for color may not see the state change, or understand what kind of feedback the state represents if color is the only indicator.\n\n[Share Link to checklist item: Make sure that error, warning, and success states are not visually communicated by just color.](#make-sure-that-error-warning-and-success-states-are-not-visually-communicated-by-just-color)\n\n## Media\n\nMedia includes content such as pre-recorded and live audio and video.\n\nTask: Make sure that media does not autoplay.\n\n Make sure that media does not autoplay.\n\n[1.4.2 Audio Control](https://www.w3.org/WAI/WCAG22/Understanding/audio-control.html)\n\nUnexpected video and audio can be distracting and disruptive, especially for certain kinds of cognitive disability such as ADHD. Certain kinds of autoplaying video and animation can be a trigger for vestibular and seizure disorders.\n\n[Share Link to checklist item: Make sure that media does not autoplay.](#make-sure-that-media-does-not-autoplay)\n\nTask: Ensure that media controls use appropriate markup.\n\n Ensure that media controls use appropriate markup.\n\n[1.3.1 Info and Relationships](https://www.w3.org/WAI/WCAG22/Understanding/info-and-relationships.html)\n\nExamples include making sure an audio mute button has [a pressed toggle state](https://www.w3.org/WAI/PF/aria/states_and_properties#aria-pressed) when active, or that a volume slider uses `<input type=\"range\">`.\n\n[Share Link to checklist item: Ensure that media controls use appropriate markup.](#ensure-that-media-controls-use-appropriate-markup)\n\nTask: Check to see that all media can be paused.\n\n Check to see that all media can be paused.\n\n[2.1.1 Keyboard](https://www.w3.org/WAI/WCAG22/Understanding/keyboard.html)\n\nProvide a global pause function on any media element. If the device has a keyboard, ensure that pressing the `Space` key can pause playback. Make sure you also don't interfere with the `Space` key's ability to scroll the page/view when not focusing on a form control.\n\n[Share Link to checklist item: Check to see that all media can be paused.](#check-to-see-that-all-media-can-be-paused)\n\n## Video\n\nVideo-specific checks.\n\nTask: Confirm the presence of captions.\n\n Confirm the presence of captions.\n\n[1.2.2 Captions](https://www.w3.org/WAI/WCAG22/Understanding/captions-prerecorded.html)\n\nCaptions allow a person who cannot hear the audio content of a video to still understand its content.\n\n[Share Link to checklist item: Confirm the presence of captions.](#confirm-the-presence-of-captions)\n\nTask: Remove seizure triggers.\n\n Remove seizure triggers.\n\n[2.3.1 Three Flashes or Below Threshold](https://www.w3.org/WAI/WCAG22/Understanding/three-flashes-or-below-threshold.html)\n\nCertain kinds of strobing or flashing animations will trigger seizures.\n\n[Share Link to checklist item: Remove seizure triggers.](#remove-seizure-triggers)\n\n## Audio\n\nAudio-specific checks.\n\nTask: Confirm that transcripts are available.\n\n Confirm that transcripts are available.\n\n[1.1.1 Non-text Content](https://www.w3.org/WAI/WCAG22/Understanding/non-text-content.html)\n\nTranscripts allow people who cannot hear to still understand the audio content. It also allows people to digest audio content at a pace that is comfortable to them.\n\n[Share Link to checklist item: Confirm that transcripts are available.](#confirm-that-transcripts-are-available)\n\n## Appearance\n\nHow your website app content looks in any given situation.\n\nTask: Check your content in specialized browsing modes.\n\n Check your content in specialized browsing modes.\n\n[1.4.1 Use of Color](https://www.w3.org/WAI/WCAG22/Understanding/use-of-color.html)\n\nActivate [modes such as Windows High Contrast or Inverted Colors](/posts/operating-system-and-browser-accessibility-display-modes/). Is your content still legible? Are your icons, borders, links, form fields, and other content still present? Can you distinguish foreground content from the background?\n\n[Share Link to checklist item: Check your content in specialized browsing modes.](#check-your-content-in-specialized-browsing-modes)\n\nTask: Increase text size to 200%.\n\n Increase text size to 200%.\n\n[1.4.4 Resize text](https://www.w3.org/WAI/WCAG22/Understanding/resize-text.html)\n\nIs the content still readable? Does increasing the text size cause content to overlap?\n\n[Share Link to checklist item: Increase text size to 200%.](#increase-text-size-to-200percent)\n\nTask: Double-check that good proximity between content is maintained.\n\n Double-check that good proximity between content is maintained.\n\n[1.3.3 Sensory Characteristics](https://www.w3.org/WAI/WCAG22/Understanding/sensory-characteristics.html)\n\nUse [the straw test](https://scottvinkle.me/blogs/work/proximity-and-zoom) to ensure people who depend on screen zoom software can still easily discover all content.\n\n[Share Link to checklist item: Double-check that good proximity between content is maintained.](#double-check-that-good-proximity-between-content-is-maintained)\n\nTask: Make sure color isn't the only way information is conveyed.\n\n Make sure color isn't the only way information is conveyed.\n\n[1.4.1 Use of Color](https://www.w3.org/WAI/WCAG22/Understanding/use-of-color.html)\n\nCan you still see where links are among body content if everything is grayscale?\n\n[Share Link to checklist item: Make sure color isn't the only way information is conveyed.](#make-sure-color-isnt-the-only-way-information-is-conveyed)\n\nTask: Make sure instructions are not visual or audio-only.\n\n Make sure instructions are not visual or audio-only.\n\n[1.3.3 Sensory Characteristics](https://www.w3.org/WAI/WCAG22/Understanding/sensory-characteristics.html)\n\nUse a combination of characteristics to write cues, particularly the actual names of sections and elements, rather than just descriptions like location (“on the right”) or audio (“after the tone”).\n\n[Share Link to checklist item: Make sure instructions are not visual or audio-only.](#make-sure-instructions-are-not-visual-or-audio-only)\n\nTask: Use a simple, straightforward, and consistent layout.\n\n Use a simple, straightforward, and consistent layout.\n\n[1.4.10 Reflow](https://www.w3.org/WAI/WCAG22/Understanding/reflow.html)\n\nA complicated layout can be confusing to understand and use.\n\n[Share Link to checklist item: Use a simple, straightforward, and consistent layout.](#use-a-simple-straightforward-and-consistent-layout)\n\n## Animation\n\nContent that moves, either on its own, or when triggered by a person activating a control.\n\nTask: Ensure animations are subtle and do not flash too much.\n\n Ensure animations are subtle and do not flash too much.\n\n[2.3.1 Three Flashes or Below Threshold](https://www.w3.org/WAI/WCAG22/Understanding/three-flashes-or-below-threshold.html)\n\nCertain kinds of strobing or flashing animations will trigger seizures. Others may be distracting and disruptive, especially for certain kinds of cognitive disability such as ADHD.\n\n[Share Link to checklist item: Ensure animations are subtle and do not flash too much.](#ensure-animations-are-subtle-and-do-not-flash-too-much)\n\nTask: Provide a mechanism to pause background video.\n\n Provide a mechanism to pause background video.\n\n[2.2.2 Pause, Stop, Hide](https://www.w3.org/WAI/WCAG22/Understanding/pause-stop-hide.html)\n\nBackground video can be distracting, especially if content is placed over it.\n\n[Share Link to checklist item: Provide a mechanism to pause background video.](#provide-a-mechanism-to-pause-background-video)\n\nTask: Make sure all animation obeys the `prefers-reduced-motion` media query.\n\n Make sure all animation obeys the `prefers-reduced-motion` media query.\n\n[2.3.3 Animation from Interactions](https://www.w3.org/WAI/WCAG22/Understanding/animation-from-interactions.html)\n\nRemove animations when the “reduce motion” setting is activated. If an animation is necessary to communicate meaning for a concept, slow its duration down.\n\n[Share Link to checklist item: Make sure all animation obeys the `prefers-reduced-motion` media query.](#make-sure-all-animation-obeys-the-prefers-reduced-motion-media-query)\n\n## Color contrast\n\n[Color contrast](/posts/what-is-color-contrast/) is how legible colors are when placed next to, and on top of each other.\n\nTask: Check the contrast for all normal-sized text.\n\n Check the contrast for all normal-sized text.\n\n[1.4.3 Contrast](https://www.w3.org/WAI/WCAG22/Understanding/contrast-minimum.html)\n\nLevel AA compliance requires a contrast ratio of 4.5:1.\n\n[Share Link to checklist item: Check the contrast for all normal-sized text.](#check-the-contrast-for-all-normal-sized-text)\n\nTask: Check the contrast for all large-sized text.\n\n Check the contrast for all large-sized text.\n\n[1.4.3 Contrast](https://www.w3.org/WAI/WCAG22/Understanding/contrast-minimum.html)\n\nLevel AA compliance requires a contrast ratio of 3:1.\n\n[Share Link to checklist item: Check the contrast for all large-sized text.](#check-the-contrast-for-all-large-sized-text)\n\nTask: Check the contrast for all icons.\n\n Check the contrast for all icons.\n\n[1.4.11 Non-text Contrast](https://www.w3.org/WAI/WCAG22/Understanding/non-text-contrast.html)\n\nLevel AA compliance requires a contrast ratio of 3.0:1.\n\n[Share Link to checklist item: Check the contrast for all icons.](#check-the-contrast-for-all-icons)\n\nTask: Check the contrast of borders for input elements (text input, radio buttons, checkboxes, etc.).\n\n Check the contrast of borders for input elements (text input, radio buttons, checkboxes, etc.).\n\n[1.4.11 Non-text Contrast](https://www.w3.org/WAI/WCAG22/Understanding/non-text-contrast.html)\n\nLevel AA compliance requires a contrast ratio of 3.0:1.\n\n[Share Link to checklist item: Check the contrast of borders for input elements (text input, radio buttons, checkboxes, etc.).](#check-the-contrast-of-borders-for-input-elements-text-input-radio-buttons-checkboxes-etc)\n\nTask: Check text that overlaps images or video.\n\n Check text that overlaps images or video.\n\n[1.4.3 Contrast](https://www.w3.org/WAI/WCAG22/Understanding/contrast-minimum.html)\n\nIs text still legible?\n\n[Share Link to checklist item: Check text that overlaps images or video.](#check-text-that-overlaps-images-or-video)\n\nTask: Check custom `::selection` colors.\n\n Check custom `::selection` colors.\n\n[1.4.3 Contrast](https://www.w3.org/WAI/WCAG22/Understanding/contrast-minimum.html)\n\nIs the color contrast you set in your [`::selection` CSS declaration](https://developer.mozilla.org/en-US/docs/Web/CSS/::selection) sufficient? Otherwise someone may not be able read it if they highlight it.\n\n[Share Link to checklist item: Check custom `::selection` colors.](#check-custom-selection-colors)\n\n## Mobile and touch\n\nThings to check mobile experiences for.\n\nTask: Check that the site can be rotated to any orientation.\n\n Check that the site can be rotated to any orientation.\n\n[1.3.4 Orientation](https://www.w3.org/WAI/WCAG22/Understanding/orientation.html)\n\nDoes the site only allow portrait orientation?\n\n[Share Link to checklist item: Check that the site can be rotated to any orientation.](#check-that-the-site-can-be-rotated-to-any-orientation)\n\nTask: Remove horizontal scrolling.\n\n Remove horizontal scrolling.\n\n[1.4.10 Reflow](https://www.w3.org/WAI/WCAG22/Understanding/reflow.html)\n\nRequiring someone to scroll horizontally can be difficult for some, irritating for all.\n\n[Share Link to checklist item: Remove horizontal scrolling.](#remove-horizontal-scrolling)\n\nTask: Ensure that button and link icons can be activated with ease.\n\n Ensure that button and link icons can be activated with ease.\n\n[2.5.5 Target Size](https://www.w3.org/WAI/WCAG22/Understanding/target-size-enhanced.html)\n\nIt's good to make sure things like hamburger menus, social icons, gallery viewers, and other touch controls are usable by a wide range of hand and stylus sizes.\n\n[Share Link to checklist item: Ensure that button and link icons can be activated with ease.](#ensure-that-button-and-link-icons-can-be-activated-with-ease)\n\nTask: Ensure sufficient space between interactive items in order to provide a scroll area.\n\n Ensure sufficient space between interactive items in order to provide a scroll area.\n\n[2.4.1 Bypass Blocks](https://www.w3.org/WAI/WCAG22/Understanding/bypass-blocks.html)\n\nSome people who experience motor control issues such as [hand tremors](https://axesslab.com/hand-tremors/) may have a very difficult time scrolling past interactive items which feature zero spacing.\n\n[Share Link to checklist item: Ensure sufficient space between interactive items in order to provide a scroll area.](#ensure-sufficient-space-between-interactive-items-in-order-to-provide-a-scroll-area)\n\n## Next steps\n\nRemember to periodically check your site to ensure it is still accessible. The A11Y Project also strongly encourages you to verify your testing by [hiring a professional tester](/resources/#professional-testers).\n\n## Further reading\n\nTetraLogical has a good in-depth, yet still [high-level explanation of the WCAG](https://tetralogical.com/articles/wcag-primer/). Check it out if you want to learn more about its history and principles.",
  "tags": [
    "a11y",
    "accessibility",
    "checklist",
    "community"
  ],
  "extracted_at": "2026-02-03T14:43:58.491742+00:00",
  "content_length": 28619,
  "content_hash": "2d729a1e9ef343c3"
}