{
  "id": "a11y-project__resources_",
  "source_id": "a11y-project",
  "source_name": "The A11Y Project",
  "category": "accessibility",
  "url": "https://www.a11yproject.com/resources/",
  "title": "Resources - The A11Y Project",
  "content": "Table of Contents\nFeatured Resource\nAssistive Technology Glossary\nFable\nA list of assistive technology terms and what they mean.\nMedia\nBooks\nPhysical and eBooks written to discuss different accessibility topics.\nBooks\nAccessibility for Everyone\nLaura Kalbag\nGet sure footing on the path to designing with accessibility.\nBooks\nAdaptive Web Design: Crafting Rich Experiences with Progressive Enhancement\nAaron Gustafson\nBuilding an elegant, functional website requires more than just knowing how to code. In Adaptive Web Design, Second Edition, you’ll learn how to use progressive enhancement to build websites that won’t break, work anywhere, are accessible by anyone—on any device, and are designed to work well into the future.\nBooks\nAgainst Technoableism\nAshley Shew\nA manifesto exploding what we think we know about disability, and arguing that disabled people are the real experts when it comes to technology and disability.\nBooks\nAgile Accessibility Handbook\nDylan Barrell\nFree ebook: A Practical Guide to Accessible Software Development at Scale.\nBooks\nApproachable Accessibility: Planning for Success\nMartine Dowden and Michael Dowden\nUnderstand the realities of modern web accessibility and what considerations should be made to include everyone. This book makes the topic of web accessibility as approachable as possible to help every web professional become an accessibility advocate at their companies, on their projects, and in their communities.\nBooks\nApps For All: Coding Accessible Web Applications\nHeydon Pickering\nWeb accessibility is quite a large topic — far too large to fit into a small book. So, what will this book cover? Though we shall encounter visual design challenges, deal with performance issues, and adopt progressive enhancement — all of which are accessibility concerns — the underlying theme of this book is about making the interactivity of web applications include keyboard and screen reader users.\nBooks\nAppt Accessibility Handbook\nJan Jaap de Groot and Paul van Workum\nThe Appt Foundation is working towards a world where everyone can use apps equally. To make this vision a reality, we have written a handbook. It helps you learn the basics of app accessibility in a straightforward way.\nBooks\nAutomating Inequality\nVirginia Eubanks\nIn Automating Inequality, Virginia Eubanks systematically investigates the impacts of data mining, policy algorithms, and predictive risk models on poor and working-class people in America.\nBooks\nBeyond Accessibility Compliance\nSukriti Chadha\nTake a deep look at accessibility as it applies to mobile and wearables. This book covers topics within the accessibility domain that are rarely covered or understood, despite the fact that nearly half of the world’s population uses smartphones.\nBooks\nBranding and Designing Disability: Reconceptualising Disability Studies\nElizabeth DePoy, Stephen Gilson\nGiven their potential to divide humans into categories and label their worth and value, design and branding can wield immense but currently unharnessed powers of social change. Groups designed as devalued can be undesigned, redesigned and rebranded to seamlessly and equivalently participate in community, work and civic life.\nBooks\nBuilding Access: Universal Design and the Politics of Disability\nAimi Hamraie\nBuilding Access investigates twentieth-century strategies for designing the world with disability in mind.\nBooks\nColor Accessibility Workflows\nGeri Coady\nMake sure accessibility and aesthetics go hand-in-hand with every design.\nBooks\nCrip Theory: Cultural Signs of Queerness and Disability\nRobert McRuer\nA bold and contemporary discourse of the intersection of disability studies and queer studies.\nBooks\nCross-Cultural Design\nSenongo Akpem\nExplore how to create culturally relevant and responsible experiences that reach a truly global audience.\nBooks\nDark and Silent Office: A Digital Accessibility Guidebook for Inclusive Communication in the Workplace\nChange is never easy, but in this case, it’s crucial. Whether you are an employee, manager, HR/DEI leader, or company owner, this guide provides practical and achievable steps to ensure everybody can fulfill their role to the best of their abilities while feeling respected.\nStephanie Warlick\nBooks\nDemystifying Disability\nEmily Ladau\nAn approachable guide to being a thoughtful, informed ally to disabled people, with actionable steps for what to say and do (and what not to do) and how you can help make the world a more inclusive place.\nBooks\nDesign for Cognitive Bias\nDavid Dylan Thomas\nIn Design for Cognitive Bias, David Dylan Thomas lays bare the irrational forces that shape our everyday decisions and, inevitably, inform the experiences we craft. Once we grasp the logic powering these forces, we stand a fighting chance of confronting them, tempering them, and even harnessing them for good.\nBooks\nDesign Meets Disability\nGraham Pullin\nHow design for disabled people and mainstream design could inspire, provoke, and radically change each other.\nBooks\nDesign for Real Life\nEric Meyer, Sara Wachter-Boettcher\nYou can’t know every user, but you can develop inclusive practices to create experiences that support a wider range of people, more of the time.\nBooks\nDesigning with the Body: Somaesthetic Interaction Design\nKristina Höök\nInteraction design that entails a qualitative shift from a symbolic, language-oriented stance to an experiential stance that encompasses the entire design and use cycle.\nBooks\nDesigning with Progressive Enhancement: Building the Web that Works for Everyone\nTodd Parker, Scott Jehl, Maggie Costello Wachs, and Patty Toland\nProgressive enhancement is an approach to web development that aims to deliver the best possible experience to the widest possible audience, and simplifies coding and testing as well. Whether users are viewing your sites on an iPhone, the latest and greatest high-end system, or even hearing them on a screen-reader, their experience should be easy to understand and use, and as fully-featured and functional as possible.\nBooks\nDesigning with Web Standards\nJeffrey Zeldman\nDesigning with Web Standards remains your essential guide to creating sites that load faster, reach more users, and cost less to design and maintain.\nBooks\nDesigning Learning Experiences for Inclusivity and Diversity: Advice for Learning Designers\nKeith Heggart et al\nThe development and implementation of inclusive and diverse learning experiences is a vital consideration for educators in higher education. Increasingly, learning designers play a significant role in this process. This textbook offers postgraduate students a comprehensive guide to designing learning experiences that are accessible, equitable, and inclusive.\nBooks\nDisability Visibility: First-Person Stories from the Twenty-First Century\nAlice Wong\nActivist Alice Wong brings together this urgent, galvanizing collection of contemporary essays by disabled people.\nBooks\nGiving a damn about accessibility\nSheri Byrne-Haber, CPACC.\nA candid and practical handbook for designers.\nBooks\nThe Glossary of Accessibility Design\nVimal Gupta\nA guide to navigating the crucial field of accessibility design with precision and clarity. This comprehensive dictionary comprises over 700 meticulously defined terms, offering a vital resource for designers, developers, policymakers, and anyone dedicated to creating inclusive digital experiences.\nBooks\nInclusify: The Power of Uniqueness and Belonging to Build Innovative Teams\nStefanie K. Johnson\nHow do we find that happy medium where workers can demonstrate their individuality while also feeling they belong?\nBooks\nInclusive Design for a Digital World\nRegine Gilbert\nWhat is inclusive design? It is simple. It means that your product has been created with the intention of being accessible to as many different users as possible.\nBooks\nInclusive Design for Organisations\nJonathan Hassell\nIn this book, award-winning international accessibility thought-leader Jonathan Hassell shows you how to transform your organisation to consistently and cost-efficiently create websites, mobile apps and other digital products that are usable for all of your customers.\nBooks\nInclusion: Diversity, The New Workplace & The Will To Change\nJennifer Brown\nThe Inclusion Dividend provides a framework to tap the bottom line impact that results from an inclusive culture.\nBooks\nThe Inclusion Dividend: Why Investing in Diversity and Inclusion Pays Off\nMason Donovan, Mark Kaplan\nThe Inclusion Dividend provides a framework to tap the bottom line impact that results from an inclusive culture.\nBooks\nInclusive Conversations: Fostering Equity, Empathy, and Belonging across Differences\nMary-Frances Winters\nEffective dialogue across different dimensions of diversity, such as race, gender, age, religion, or sexual orientation, fosters a sense of belonging and inclusion, which in turn leads to greater productivity, performance, and innovation.\nBooks\nInclusive Design Patterns\nHeydon Pickering\nInclusive Design Handbook gets to the bottom of it all: accessibility myths and rules of thumbs, WAI-ARIA roles, content accessibility guidelines, landmark roles, keyboard and touch accessibility, accessible markup and interaction patterns, accessible forms and widgets, multimedia accessibility and inclusive prototyping.\nBooks\nLiving in Information: Responsible Design for Digital Places\nJorge Arango\nWebsites and apps are places where critical parts of our lives happen. We shop, bank, learn, gossip, and select our leaders there. But many of these places weren’t intended to support these activities. Instead, they’re designed to capture your attention and sell it to the highest bidder.\nBooks\nMaking Disability Modern\nBess Williamson, Elizabeth Guffey\nMaking Disability Modern: Design Histories brings together leading scholars from a range of disciplinary and national perspectives to examine how designed objects and spaces contributes to the meanings of ability and disability from the late 18th century to the present day, and in homes, offices, and schools to realms of national and international politics.\nBooks\nMismatch: How Inclusion Shapes Design\nKat Holmes\nHow inclusive methods can build elegant design solutions that work for all.\nBooks\nNo Right to Be Idle: The Invention of Disability\nSarah F. Rose\nDuring the late nineteenth and early twentieth centuries, Americans with all sorts of disabilities came to be labeled as “unproductive citizens.” Before that, disabled people had contributed as they were able in homes, on farms, and in the wage labor market, reflecting the fact that Americans had long viewed productivity as a spectrum that varied by age, gender, and ability.\nBooks\nPractical Web Inclusion & Accessibility\nAshley Firth\nThis book will guide you through a broad range of access needs, the barriers users often face, and provide practical advice on how your sites can help rather than hinder. Going beyond advice tailored solely for developers, this book offers potential improvements for designers, developers, user experience professionals, QA and testers, so that everyone involved in building a website can benefit.\nBooks\nPro HTML5 Accessibility\nJoshue O Connor\nPro HTML5 Accessibility helps designers come to grips with building exciting, accessible and usable web sites and applications with HTML5. The book covers how to use HTML5 in order to serve the needs of people with disabilities and older persons using assistive technology (AT).\nBooks\nSound Is Not Enough: Captioning as Universal Design\nSvetlana Kouznetsova\nDo you have a podcast, video series, or an upcoming live event? Do you want to increase your audience tenfold? We have the solution, and it’s captioning. In her book, Sound Is Not Enough: Captioning as Universal Design, Svetlana Kouznetsova will show you how to capture those new viewers and take your audience to a whole new, and diverse level.\nBooks\nTechnically Wrong\nSara Wachter-Boettcher\nIn Technically Wrong, Sara Wachter-Boettcher demystifies the tech industry, leaving those of us on the other side of the screen better prepared to make informed choices about the services we use—and to demand more from the companies behind them.\nBooks\nUniversal Design for Learning: Principles, Framework, and Practice\nDavid Gordon\nA practical, research-based framework that enables all educators to respond to individual learning differences through the design of inclusive goals, methods, materials, assessments, and environments.\nBooks\nWCAG for Designers: Accessibility Reference Manual\nStacey Swinehart Ganderson\nThis accessibility reference manual is geared toward designers working on digital products.\nBooks\nWe Are Not Users: Dialogues, Diversity, and Design\nEswaran Subrahmanian, Yoram Reich, Sruthi Krishnan\nA call to reclaim and rethink the field of designing as a liberal art where diverse voices come together to shape the material world.\nBooks\nWeb and App Accessibility: Your Roadmap to Digital Inclusion\nJason C. Taylor\nYour Roadmap to Digital Inclusion is made up of four instructive chapters, focused on the resource considerations for each stage of a typical digital accessibility program and how to integrate the disability community across your program.\nBooks\nWeb Accessibility Cookbook\nManuel Matuzovic\nThe Web Accessibility Cookbook provides you with dozens of recipes to help you avoid creating accessibility failures. You'll learn how to build common components, such as main navigation, filters, and dialogs, in an accessible manner. Each recipe not only explains how to build things but also why.\nBooks\nThe Web Accessibility Project: Development and Testing Best Practices\nNarayanan Palani\nBy applying the accessibility best practices covered in this book, developers can help their organizations rise to a whole new level of accessibility adherence, innovation, and inclusive design. They will also see greater work satisfaction in their professional lives and a way to help improve digital accessibility for end users.\nBooks\nWeb Accessibility: Web Standards and Regulatory Compliance\nJim Thatcher and Mark Urban\nThe power of the Web lies in the fact that anyone and everyone can access it, and this should also extend to users with disabilities. Accessibility is about making websites accessible to those with aural, visual, or physical disabilities, or rather, constructing websites that don't exclude these people from accessing the content or services provided.\nBooks\nA Web for Everyone: Designing Accessible User Experiences\nSarah Horton and Whitney Quesenbery\nIf you are in charge of the user experience, development, or strategy for a web site, A Web for Everyone will help you make your site accessible without sacrificing design or innovation. Rooted in universal design principles, this book provides solutions: practical advice and examples of how to create sites that everyone can use.\nBooks\nWhat Can a Body Do? How We Meet the Built World\nSara Hendren\nA fascinating and provocative new way of looking at the things we use and the spaces we inhabit, and a call to imagine a better-designed world for us all.\nBooks\nWhat Every Engineer Should Know About Digital Accessibility\nSarah Horton and David Sloan\nWhat Every Engineer Should Know About Digital Accessibility will prepare readers to integrate digital accessibility into their engineering practices. Readers will learn how to accurately frame accessibility as an engineering challenge so they are able to address the correct problems in the correct way.\nGaming\nResources for computer, console, and mobile gaming.\nGaming\nAccessibility and video games: All ages gaming for people with disabilities\nVerizon\nFor people living with disabilities, accessibility doesn’t just mean how reachable something is — oftentimes, the level of accessibility can define their ability to interact with and participate in certain activities or events, including entertainment.\nGaming\nGaming Accessibility Fundamentals Learning Path\nMicrosoft Xbox\nAn introductory course to accessibility in gaming and how to create inclusive gaming experiences.\nGaming\nCan I Play That?\nA centralized resource for game accessibility reviews and information.\nGaming\nAccessible Games\nAbleGamers\nA resource for accessible player experiences and connecting with gamers with disabilities.\nNewsletters\nGet the latest accessibility-related news delivered to your inbox.\nNewsletters\nAccessible Mobile Apps Weekly\nRobin Kanatzar\nNews from the accessibility community, links to developer tools and frameworks, and more.\nNewsletters\nAccessibility Unlocked\nTetraLogical\nA free six day newsletter series that covers who benefits from accessibility, and how you can start designing, building, measuring, testing, and managing accessibility.\nNewsletters\nAccessibility Weekly\nDavid A. Kennedy\nA weekly dose of web accessibility to help you bring it into your everyday work. Delivered to your inbox each Monday.\nNewsletters\nAxess Lab Newsletter\nAxess Lab\nGet notified when we write new stuff\nNewsletters\nCrip News\nKevin Gotkin\nDisability Thinking Weekday is an email newsletter for disabled people and others interested in disability issues, ideas, and culture.\nNewsletters\nDisability Thinking Weekday\nAndrew Pulrang\nA weekly roundup about disability arts and politics.\nNewsletters\nEqual Entry Newsletter\nEqual Entry\nGet free tips to grow your accessibility knowledge delivered right to the comfort of your own inbox.\nNewsletters\nMicroassist\nMicroassist\nStay up to date on learning and development, training opportunities, and accessibility news.\nNewsletters\nSkip to Content\nHuxley Digital\nYour online accessibility magazine.\nNewsletters\nt12t Accessibility Newsletter\nt12t\nThe goal is to spread news, articles and tips regarding web accessibility. This will be more than a bunch of links in an email, there will be opinions.\nNewsletters\nUniversity of Minnesota Duluth Webdev Newsletter\nLaura L. Carlson\nThe Web Design Update is a plain text email digest dedicated to disseminating news and information about web design and development with emphasis on elements of user experience, accessibility, web standards and more.\nNewsletters\nWCAG of the Day\nGrunet\nIt's like those “Word of the Day” email services, but for the Web Content Accessibility Guidelines (WCAG) instead. Each day it sends out a short summary of a different success criterion.\nNewsletters\nThe WebAIM Newsletter\nWebAIM\nThe WebAIM newsletter is for people that are interested in receiving monthly news and updates on web accessibility issues. The newsletter will include featured articles, monthly tips, resources, and questions from WebAIM's discussion forum.\nPodcasts\nListen to, or read the transcripts of people talking all about accessibility.\nPodcasts\n13 Letters\nBe My Eyes\nThe accessibility podcast.\nPodcasts\n061: Accessibility with Marcy Sutton\nThe Frontside Podcast\nMarcy Sutton is going to be talking with us a little bit about accessibility, both in the large and the small.\nPodcasts\n#A11y Rules Podcast\nNicolas Steenhout\nConversations around web accessibility.\nPodcasts\n#A11y Rules Soundbites\nNicolas Steenhout\nShort discussions with disabled people about the barriers they encounter on the web.\nPodcasts\na11y Cocktail\nFront End Happy Hour\nIn this episode, we have a special guest joining us to talk about digital accessibility, Jennison Asuncion who is a leader in the accessibility community and has a lot of information to help us improve our websites and applications be more accessible for all users.\nPodcasts\nAccessibility a Developer's User Story\nEat Sleep Code\nOn this episode of Eat Sleep Code, guest Elle Waters explains why accessibility is important in software development and what a developer’s responsibilities are when creating a product.\nPodcasts\nAccessibility with Heydon Pickering\nShopTalk\nWe're chatting with Heydon Pickering about accessibility, using pre-built solutions past their best before date, everyone's varying degrees of proficiency, and whether accessibility is becoming second nature to more people.\nPodcasts\nAccessibility with Nicolas Steenhout and Christopher Schmitt\nShopTalk\nWe're talking accessibility with Christopher and Nicolas from Knowbility. Does accessibility transcend the web? Is it discouraging how much work still needs to be done? How do we get people the skills needed to help with accessibility on the web? Should accessibility be a role in house? And is Javascript the enemy of accessibility?\nPodcasts\nAccessibility is not a 'nice to have' – with Derek Featherstone\nThe Big Web Show\nWhy do companies de-prioritize accessibility? Making a digital map accessible to the blind. Pros and cons of the straw test. Why simulating a disability is not the same as working with disabled people.\nPodcasts\nAccessible Podcast\nSteven Aquino and Timothy Buck\nAccessible is a fortnightly—episodes are released twice per month—podcast about accessibility in tech. Topics covered on the show are mostly Apple-centric but will span the tech industry at large where appropriate.\nPodcasts\nBeyond Barriers\nWally\nWally teams up with accessibility experts across the content supply and the disabled community, to understand their insights on accessibility.\nPodcasts\nCommand Z Podcast - Episodio 86: Ivonne Acevedo | Accesibilidad sin barreras (Spanish)\nIvonne Acevedo\nEscucha la importancia del diseño universal en proyectos arquitectónicos.Aprende sobre conceptos básicos de la accesibilidad digitalVisualiza como tú puedes aportar mediante tus diseños la accesibilidad y diversidad que todos necesitamos.\nPodcasts\nCommand Z Podcast - Episodio 77: Paula Goyanes | Accesibilidad & Development (Spanish)\nPaula Goyanes\nEscucha cómo crear diseños accesibles y cómo llevarlos a producción de una manera correcta. Aprende como el diseño y el development trabajan de la mano para crear experiencias accesibles.Conoce como hacer experiencias usables y accesibles incluso para motores de búsqueda y mejorar tu SEO.\nPodcasts\nCommand Z Podcast - Episodio 73: Adriana Mattei Sosa | Diseño Accesible\nAdriana Mattei Sosa\nAprende sobre la diversidad de diseños del bastón, herramienta para personas con impedimento visual. Comprende cómo los diseñadores podemos crear experiencias inclusivas y centradas en el diseño universal. Escucha como la disciplina del diseño resuelve problemas que son desapercibidos ante la falta de educación y empatía hacia la comunidad con discapacidad.\nPodcasts\nDocument Accessibility Unraveled\nChad Chelius and Dax Castro\nJoin Chad Chelius and Dax Castro (CHAX) as they chat about important document accessibility topics, trends and maybe even complain a little now and again.\nPodcasts\nGet Access with Aaron Cannon\nReact Podcast\nThis week, we talk accessibility pitfalls with Aaron Canon.\nPodcasts\nInEx\nMatthew May\nA show about inclusive design.\nPodcasts\nIntro to Accessibility with Stephanie Slattery\nCodeNewbie\nStephanie Slattery explains the 5 categories of disabilities, shows us how to implement suggestions from the Web Content Accessibility Guidelines, and shares why she’s so passionate about accessibility.\nPodcasts\nThe Neurodivergent Woman\nMonique Mitchelson and Michelle Livock\nA podcast for neurodivergent women, covering Autism to ADHD and everything in between. Monique and Michelle aim to educate and inspire women who think differently.\nPodcasts\nPresentable 30: Accessibility is Social Justice\nPresentable\nThis week on the show, we talk to Laura Kalbag about her new book, Accessibility for Everyone. We discuss how digital products have an increasing mandate to be broadly usable by everyone in society, and what we can do to achieve better accessibility in our designs.\nPodcasts\nThisten\nThisten\nThisten is an audio-to-text platform, where transcripts are created and aggregated from podcasts for people to search, reference and discover.\nTalks\nRecorded conference talks.\nTalks\nA11ycasts with Rob Dodson\nYouTube\nThe goal of A11ycasts is to teach developers how accessibility works all the way down at the platform level, while also demonstrating real world accessibility problems and solutions to fix them.\nTalks\nA11YTalks\nYouTube\nYouTube livestreams about accessibility.\nTalks\nAaron Cannon, Blind Web Developer\nVimeo\nLDS Church (2007)\nTalks\nAccessibility in the Age of Components - Ayesha Mazumdar\nYouTube\nReact Boston 2019\nTalks\nAccessibility is My Favorite Part of the Platform\nYouTube\nGoogle I/O (2016)\nTalks\nAccessibility Mythbusting\nVimeo\nWDCNZ (2013)\nTalks\nThe Accessibility Panel\nVimeo\nWDCNZ (2013)\nTalks\nAccessibility Talks\nYouTube\nMonthly online talks about accessibility.\nTalks\nAdvancing Web Accessibility with ChromeVox\nYouTube\nGoogle I/O (2013)\nTalks\nDesigning for Accessibility (Google I/O'19)\nYouTube\nHear from people who are working to make the world an easier place for those with disabilities.\nTalks\nGarbage Pail Components: Marcy Sutton\nYouTube\nClarity (2019)\nTalks\nHTML5 Accessibility (Steve Faulkner)\nVimeo\nParis Web (2013)\nTalks\nHow captions increase ROI and audience for media creators (Svetlana Kouznetsova)\nYouTube\nIf media and event producers want a larger audience, they need to consider making them accessible via high quality same language captions and transcripts. They are good for business and a necessity for millions of people. Auto captions are not the best accessibility practice, especially for professional content. You have the opportunity to learn firsthand from a deaf speaker in the 8-minute video that has English captions and subtitles in multiple languages.\nTalks\nIntroduction to Web Accessibility\nDr. Michele A. Williams\nThis brief introductory video geared towards technology professionals provides a baseline understanding of the topic of Web and digital accessibility: designing, coding, and testing with users with disabilities in mind, including the diverse assistive technology and tools they may be using to engage with their computing devices.\nTalks\nJavaScript and Civil Rights (Marcy Sutton)\nYouTube\nWeb Rebels (2017)\nTalks\nMake Your Widgets Sing With ARIA\nVimeo\nWDCNZ (2013)\nTalks\nMulti-device Accessibility (Alice Boxhall)\nYouTube\nChrome Dev Summit (2013)\nTalks\nPWAs in any context\nYouTube\nProgressive Web App Summit (2016)\nTalks\nThe rock'n'roll guide to ARIA and HTML5\nYouTube\nGenerate Conference (2013)\nTools\nBookmarklets\nSmall “micro apps” that live in your browser that you can activate to manipulate the current page or view.\nBookmarklets\n44x44 Pixel Cursor Bookmarklet\nJared Smith\nA bookmarklet to make it easier to test WCAG’s Target Size and proposed Pointer Target Spacing requirements.\nBookmarklets\nA11y Tools\nIan Lloyd\nA random collection of accessibility-focused tools that you might find at least partially useful.\nBookmarklets\nAkbar\nHao Luo\nA bookmarklet that simulates various types user experiences.\nBookmarklets\nANDI\nThe United States Social Security Administration\nThe Accessible Name and Description Inspector accessibility testing tool.\nBookmarklets\nHTML_CodeSniffer\nSquiz\nCheck that your HTML code conforms to your coding standard.\nBookmarklets\nInaccessible Twitter\nChris Johnson\nCheck how accessible your Twitter media posts are.\nBookmarklets\nNu Markup Validation Service Bookmarklets\nTPGi\nThe W3C Nu Markup Validator checks the markup validity of Web documents, but instead uses the backend from the Validator.nu engine.\nBookmarklets\ntext spacing bookmarklet\nSteve Faulkner\nQuick and dirty testing of WCAG 2.1 Success Criterion 1.4.12 Text Spacing.\nBookmarklets\ntota11y\nKhan Academy\nAn accessibility visualization toolkit.\nBookmarklets\nThe Visual ARIA Bookmarklet\nWhatSock\nVisual ARIA allows engineers, testers, educators, and students to physically observe ARIA usage within web technologies.\nBrowser extensions\nSpecialized tools that augment your browser to augment and enhance your experience.\nBrowser extensions\nAccessibility Insights\nMicrosoft\nSolve accessibility issues before they reach your customers.\nBrowser extensions\nARC Toolkit\nTPGi\nARC Toolkit is a professional-level accessibility testing tool that gives you the power to quickly and efficiently evaluate screens for accessibility and uncover issues related to the WCAG 2.1 Level A and AA guidelines.\nBrowser extensions\nARIA DevTools\nMateusz Zielinski\nEasily spot missing ARIA labels, misused ARIA roles, and incomplete keyboard support in your web applications.\nBrowser extensions\naxe\nDeque\nThe world's leading digital accessibility toolkit - download as a browser extenion or on NPM. Chosen by Microsoft, Google, development and testing teams everywhere.\nBrowser extensions\naxe beta\nDeque\nAutomatically catch tons of accessibility bugs with axe. Catch even more with axe beta.\nBrowser extensions\nChromeVox (Classic)\nGoogle\nThe ChromeVox (Classic) screen reader is an extension to Chrome that brings the speed, versatility, and security of Chrome to visually impaired users.\nBrowser extensions\nColor Blind & Low Vision Simulator\nHomer Gaines\nThis vision simulator allows users to observe how people with colorblindness or low vision may perceive web-based content.\nBrowser extensions\nColor Contrast Analyzer\nNC State IT Accessibility\nAllows you to analyze text color contrast problems on a webpage according to the WCAG 2 text color contrast requirements.\nBrowser extensions\nDark Reader\nDark Reader Ltd.\nThis eye-care extension enables night mode by creating dark themes for websites on the fly. Dark Reader inverts bright colors, making them high contrast and easy to read at night.\nBrowser extensions\nFix Contrast\nFixa11y\nAutomatically fixes contrast issue on websites to a specifix contrast ratio.\nBrowser extensions\nFontonic - Change Fonts\namkhrjee\nChange fonts of any website with your locally installed fonts!\nBrowser extensions\nheadingsMap\nRumoroso\nThe extension generates a documentmap or index of any web document structured with headings (you can access directly to the content by clicking on any of its items), and now, it shows the HTML 5 outline.\nBrowser extensions\nIBM Equal Access Checker\nIBM\nThe IBM Equal Access Accessibility Checker is an open source tool for web developers and auditors that utilizes IBM's accessibility rule engine, which detects accessibility issues for web pages and web applications. The extension integrates into the browser development tools, providing an integrated checking experience, helping users quickly identify the source of accessibility issues and try fixes.\nBrowser extensions\nLandmarks\nMatthew Tylee Atkinson\nAllows you to navigate a web page via WAI-ARIA landmarks, using the keyboard or a pop-up menu.\nBrowser extensions\nMidnight Lizard\nPavel Agarkov\nBrowser extension with custom color schemes for all websites.\nBrowser extensions\nNerdeRegion\nUgurcan (Ugi) Kutluoglu\nNerdeRegion is a developer tools extension for debugging live regions on a Web Page. When activated, it lists all active Aria live regions, and keeps a record of all mutations that has happened on the region.\nBrowser extensions\nNoCoffee\nEitan Isaacson\nNoCoffee can be helpful for understanding the problems faced by people with slight to extreme vision problems.\nBrowser extensions\nNo Target Blank\nMoritz Gießmann\nRemoves target='_blank' attributes from the websites you browse!\nBrowser extensions\nopeninthesametab\nphpied.com\nSome sites annoyingly open links in new tabs. This extension lets you take back control.\nBrowser extensions\nSilktide Accessibility Checker\nSilktide Ltd.\nTest your website against over 200 website accessibility checks with Silktide’s easy to understand accessibility checker.\nBrowser extensions\nSkip to Landmarks and Headings\nNicholas Hoyt\nProvides keyboard access to landmark regions and headings (h1–h6) on a web page.\nBrowser extensions\nSound Pointer\nSimon Miner\nSound Pointer enables you to locate and follow the mouse pointer around your browser window with a sound that changes as you move your mouse.\nBrowser extensions\ntaba11y\nPeter Gould\ntaba11y calculates the tab order of all elements and displays it visually, either by drawing a path or by highlighting the elements.\nBrowser extensions\nText Spacing Editor\nzmrhal.j\nThis extension allows you to set custom values for the following text spacing properties: Line height, letter spacing, word spacing, and paragraph spacing.\nBrowser extensions\nWAVE Evaluation Tool\nWebAIM\nWAVE is a web accessibility evaluation tool developed by WebAIM. It provides visual feedback about the accessibility of your web content by injecting icons and indicators into your page.\nBrowser extensions\nWeb Disability Simulator\nMetamatrix\nThe Web Disability Simulator lets you experience how people with different disabilities or inadequate abilities perceive a web site. Simulate color blindness, low vision, dyslexia and more.\nColors\nThese tools help you create, test for, and maintain accessible color contrast ratios.\nColors\na11y-contrast\nDarek Kay\nA CLI utility to calculate/verify accessible magic numbers for a color palette.\nColors\nAccessible color palette builder\nAtul Varma\nAn Elm-based prototype to help designers build accessible color palettes.\nColors\nColorable\nBrent Jackson\nColor palette combination contrast tester\nColors\nColor Safe\nDonielle Berg and Adrian Rapp\nEmpowering designers with beautiful and accessible color palettes based on WCAG Guidelines of text and background contrast ratios.\nColors\nColors: A11Y Stats\nAdam Morse\nColors.css - A nicer color palette for the web.\nColors\nColor & Contrast\nNate Baldwin\nA comprehensive guide for exploring and learning about the theory, science, and perception of color and contrast.\nColors\nColor Contrast Checker\nJosef Eines\nThis tool tests the contrast of a background color and foreground color for accessibility.\nColors\nColorblind Web Page Filter\ntoptal\nUse the Colorblind Colorlab to select safe colors earlier in the design process.\nColors\nContrast Ratio\nLea Verou\nEasily calculate color contrast ratios. Passing WCAG was never this easy!\nColors\nContrast Tools\nProtean Studio\nTest the contrast of two colors to ensure high readability using both the Advanced Perception of Color Algorithm (APCA) and the classic contrast ratio.\nColors\nHex Naw\nThe Scenery\nHex Naw is a tool that helps designers and developers test entire color systems for contrast and accessibility. Plug in your palette or color system and let Hex Naw do the rest.\nColors\nPika\nSuper High Fives\nAn open-source colour picker app for macOS.\nColors\nTanaguru Contrast-finder\nTanaguru\nFind good constrast for web accessibility between two colors.\nColors\nWe are Colorblind\nTom van Beveren and Kim van den Brink\nMaking the world a better place for the colorblind.\nColors\nWho Can Use\nCorey Ginnivan\nA tool that brings attention and understanding to how color contrast can affect different people with visual impairments.\nDevelopment tools\nTools and resources for helping to develop with an accessible mindset.\nDevelopment tools\nA11y Automation Tracker\nMelanie Sumner\nA more thorough way to track the potential accessibility violations and the automated linters and tests currently available.\nDevelopment tools\nAccessify\nAccessify\nRun a free website performance test and get actionable tips on how to optimize it.\nDevelopment tools\nAccessibility stats experiment\nSarah Higley\nFind accessibility stats by github repository.\nDevelopment tools\nAccessLint\nAccessLint\nAccessLint is a GitHub App that finds accessibility issues in your pull requests.\nDevelopment tools\nAce, by DAISY\nThe DAISY Consortium\nAce, the Accessibility Checker for EPUB, is a tool developed by the DAISY Consortium to assist with the evaluation of accessibility features of EPUB publications.\nDevelopment tools\nally.js\nRodney Rehm\nA JavaScript library to help modern web applications with accessibility concerns by making accessibility simpler.\nDevelopment tools\na11yTools Extension for Safari macOS\nPaul J. Adam\na11yTools is a collection of HTML Web Accessibility Testing Tools in one location in an Extension for Safari used for quick and easy Accessibility testing.\nDevelopment tools\na11yTools iOS - Web Accessibility Testing Tool\nPaul J. Adam\na11yTools is a collection of HTML Web Accessibility Testing Tools in one location on your iPhone and iPad for quick and easy Accessibility testing.\nDevelopment tools\nAccessibility Management Platform (AMP)\nLevel Access\nAMP’s powerful testing engine and work flow, accessible development best practices and extensive training course library allow organizations to quickly and efficiently incorporate accessibility compliance into existing development processes.\nDevelopment tools\nARC\nTPGi\nAutomated testing that looks for machine-detectable accessibility defects within digital content.\nDevelopment tools\naxe-core\nDeque Labs\nAccessibility engine for automated Web UI testing.\nDevelopment tools\nAtom: web-accessibility-checker\nMichael Weber\nWeb Accessibility checker which evaluate some defined WCAG rules instantly during coding or on command.\nDevelopment tools\nAtom: accessibility-snippets\nsilviasusai\nSnippets that include all WAI-ARIA attributes and descriptions, for ease of use in building more accessible web content.\nDevelopment tools\nBe Inclusive\nBe Inclusive\nBe Inclusive is a web app that helps you define, track, and share web accessibility audits.\nDevelopment tools\nBootstrap accessibility plugin\nPayPal\nBootstrap Accessibility Plugin is an extension for the Bootstrap 3 web development framework that makes many of the components of this library accessible for keyboard and screen reader users.\nDevelopment tools\nChart2Music\nA javascript library that makes it easy to generate interactive sonifications, so that you can make your charts, graphs, and other data visualizations accessible to screen reader users.\nDevelopment tools\nGuidepup\nCraig Morten\nScreen reader driver for test automation.\nDevelopment tools\nPa11y\nPa11y\nPa11y is your automated accessibility testing pal.\nDevelopment tools\nPolypane\nPolypane\nPolypane is a cross-platform desktop browser that comes with extensive accessibility tooling: an accessibility checker, 19 different visual impairment simulators, color contrast checking, heading, links and image checking, focus order visualisation, horizontal overflow detection and more, showing improvement suggestions where possible.\nDevelopment tools\nSa11y\nToronto Metropolitan University\nSa11y is an accessibility quality assurance tool that visually highlights common accessibility and usability issues. Geared towards content authors, Sa11y indicates errors or warnings at the source with a simple tooltip on how to fix.\nDevelopment tools\nSublime WAI-ARIA Package\nIndrek Paas\nWAI-ARIA Roles, States and Properties auto-completion for Sublime Text.\nScreen readers\nInformation about screen reading assistive technology.\nScreen readers\nAndroid Accessibility Suite\nGoogle\nAndroid Accessibility Suite is a collection of accessibility services that help you use your Android device eyes-free or with a switch device.\nScreen readers\nAssistiv Labs\nWeston Thayer\nInstantly test how accessible your experience is with the real assistive technologies your disabled users rely on — screen readers, magnifiers, and more — from any computer.\nScreen readers\nJob Access With Speech (JAWS)\nFreedom Scientific\nJAWS is the world's most popular screen reader, developed for computer users whose vision loss prevents them from seeing screen content or navigating with a mouse.\nScreen readers\nNonVisual Desktop Access\nNV Access\nNonVisual Desktop Access (NVDA) is a free, open-source, portable screen reader for Microsoft Windows.\nScreen readers\nOrca\nThe GNOME Project\nOrca is a free and open-source, flexible, extensible screen reader from the GNOME project for individuals who are blind or visually impaired.\nScreen readers\nVoiceOver (iOS)\nApple\nVoiceOver is a gesture-based screen reader that lets you enjoy using iPhone even if you don’t see the screen.\nScreen readers\nVoiceOver (macOS)\nApple\nVoiceOver gives you auditory descriptions of each onscreen element and provides helpful hints along the way.\nVision simulators\nVision simulators can be used to help you get an idea of how a low vision situation may appear.\nVision simulators\nColor Oracle\nBernie Jenny\nColor Oracle takes the guesswork out of designing for color blindness by showing you in real time what people with common color vision impairments will see.\nVision simulators\nContrast\nNothing Magical, Inc.\nA macOS app for quick access to WCAG color contrast ratios\nVision simulators\nColour Contrast Analyser\nTPGi\nThe Colour Contrast Analyser (CCA) helps you determine the legibility of text and the contrast of visual elements, such as graphical controls and visual indicators.\nVision simulators\nSim Daltonism\nMichel Fortin\nSim Daltonism lets you visualize colors as they are perceived with various types of color blindness.\nEducation\nBlogs\nOther accessibility-focused websites to read and learn from.\nBlogs\n#a11y tag on The Practical Dev\nWhere programmers share ideas and help each other grow.\nBlogs\n24 Accessibility\n24 days of digital accessibility gifts during the season of giving and sharing.\nBlogs\n456 Berea Street\nArticles and news on web standards, accessibility, and usability.\nBlogs\na11yTips\nSimple tips on making web content more accessible to all.\nBlogs\nAccessibility Made Easy\nAccessibility Made Easy is a not-for-profit who’s aim is to create a more accessible world. We believe that every person, no matter the ability or environment, should be able to access the same information as everyone else.\nBlogs\nAccessibility Matters\nDocumenting everything through the journey of learning web accessibility.\nBlogs\nAccessible Culture\nPromoting a culture of inclusion through the research and application of web accessibility and standards.\nBlogs\nAccessibility Wins\nShowcasing accessible user interfaces and tools.\nBlogs\nAlicia Jarvis' Inclusive Design Blog\nHi, I’m Alicia. I'm a diversity, equity and inclusion strategist, researcher, and culture consultant based in Toronto.\nBlogs\nLevel Access Blog\nFind out what’s happening in the world of accessible design, Level Access’ team updates, and better practices for an accessible web.\nBlogs\nBlog - Karl Groves\nKarl Groves' web accessibility blog\nBlogs\nInclusive Components\nA blog trying to be a pattern library. All about designing inclusive web interfaces, piece by piece.\nBlogs\nDeque Blog\nStay up to date on all things accessibility\nBlogs\nLow Visionary\nA blog by Robyn Hunt\nBlogs\nTPGi Blog\nA blog about accessibility written by the TPGi's employees.\nBlogs\nWebAIM Blog\nA blog about accessibility written by WebAIM's employees.\nBlogs\nWeb Axe\nBlog and podcast on web accessibility.\nCommunity help\nOther internet groups where you can find accessibility help and support.\nCommunity help\nSearch for 'accessibility' on Accessify.com\nQuestions and Answers by Accessify: Browse through our database of popular questions to find the best answers ever posted by other people.\nCommunity help\nAnybody can be an A11y Slacker\nInformation on the web-a11y Slack group.\nCommunity help\nCivicActions Accessibility Practice Area Site\nAn open project by the CivicActions team to foster more digital inclusion. This site focuses on open source approaches and builds on global best practices, particularly with government IT.\nCommunity help\nEleventy WCAG Reporter\nThis repository lets you create WCAG EM Reports using Eleventy.\nCommunity help\nThe most insightful stories about Web Accessibility – Medium\nContent tagged with 'accessibility'.\nCommunity help\nNewest 'accessibility' Questions - User Experience Stack Exchange\nContent tagged with 'accessibility'.\nCommunity help\nNewest 'accessibility' Questions - Stack Overflow\nContent tagged with 'accessibility'.\nCommunity help\nSearch for 'a11y' on Meetup.com\nFind Meetups so you can do more of what matters to you.\nCommunity help\nWeb Accessibility Guidebook for Developers - Telerik\nWith this article, our goal is to introduce fellow engineers, regardless of level, to web accessibility and share our practical knowledge and best practices.\nCommunity help\nWebAIM Web Accessibility E-mail Discussion List\nThe WebAIM web accessibility mailing list is for anyone interested in discussing web accessibility issues. Individuals from all organizations and specialties are encouraged to join.\nCourses\nClasses you can take to learn all about accessible digital design and development.\nCourses\nAccessibility Courses\nMike Gifford\nCourses, webinars, educational videos, and more, offered in web accessibility.\nCourses\nAccessibility fundamentals\nMicrosoft\nTechnology can empower people to achieve more, help strengthen education opportunities, and make the workplace more inviting and inclusive for people with disabilities.\nCourses\nGet Started with Web Accessibility\nSalesforce Trailhead\nLearn what accessibility is and how to make websites and apps accessible to people with disabilities.\nCourses\nIntroduction To Accessibility Testing\nMinistry of Testing\nLearn with me about what Accessibility is, why it's important to test for and how to get your team started with an Accessibility testing mindset.\nCourses\nIntroduction to Web Accessibility\nedX and the W3C\nGet a strong foundation in digital accessibility to make your websites and apps work well for people with disabilities, meet international standards, and provide a better user experience for everyone.\nCourses\nLearn Accessibility\nweb.dev\nAn evergreen accessibility course and reference to level up your web development.\nCourses\nPractical Accessibility\nSara Soueidan\nA self-paced, get-right-down-to-it online video course for web designers and developers who want to start creating more accessible websites and applications today.\nCourses\nStart Building Accessible Web Applications Today\negghead.io\nThis course will introduce you to accessibility through hands-on, technical examples that are way more effective than reading 10-year-old static web content.\nCourses\nTake 5 - Ethan Marcotte\nAquent Gymnasium\nA series of five 5-minute tutorial videos hosted by Aquent Gymnasium that deal with introductory accessibility topics.\nCourses\nTesting Accessibility\nMarcy Sutton\nA self-paced workshop designed to teach you the principles and effective patterns of accessibility, from design to deployment.\nCourses\nThe A11Y Collective\na11y-collective.com\nThe A11Y Collective is the e-learning platform for anyone who wants to learn more about web accessibility. The courses focus mostly on knowledge and skills that are valuable for web designers, developers, webmasters, product owners and web editors.\nCourses\nThinking about Digital Accessibility: From Ally to Advocate\nH. Robert King\nIn this book, we explore what digital accessibility is, how it is integrated with common functional roles, such as content writer, user experience designer, or engineer, and how it grows as the knowledge and skill of an individual develops, answering the question “how do I get there from here”.\nCourses\nWeb Accessibility by Google\nUdacity\nIn this course you’ll get hands-on experience making web applications accessible.\nDesign and user experience\nInformation for how to create accessible digital designs.\nDesign and user experience\n7 Things Every Designer Needs to Know about Accessibility\nJesse Hausler\nAccessibility enables people with disabilities to perceive, understand, navigate, interact with, and contribute to the web. Imagine a world where developers know everything there is to know about accessibility. You design it and they build it… perfectly. In this world, only the design itself can cause people with disabilities to have trouble using a product.\nDesign and user experience\nA11y Annotation Kit\nStephanie Hagadorn\nWe use this library at Indeed to help designers document accessibility considerations to share with developers when handing off designs.\nDesign and user experience\nAccessible UI Components For The Web\nAddy Osmani\nTo be accessible, UI components need to work across multiple devices with varying screen-sizes and different kinds of input. Moreover, components should be usable by the broadest group of users, including those with disabilities.\nDesign and user experience\nAccessible Usability Scale (AUS)\nFable\nThe Accessible Usability Scale (AUS) is a free tool to measure the usability of a digital product for assistive technology users. Inspired by the System Usability Scale (SUS), the Accessible Usability Scale consists of ten questions administered at the end of a user experience to calculate a score.\nDesign and user experience\nAccessibility guidelines for UX Designers\nAvinash Kaur\nAs a UX designer, it is important to build empathy and celebrate accessibility requirements as a set of design constraints to build a better product.\nDesign and user experience\nChartability\nFizz Studio\nChartability is a set of heuristics (testable questions) for ensuring that data visualizations, systems, and interfaces are accessible.\nDesign and user experience\nA Designer’s Guide to Documenting Accessibility & User Interactions\nStéphanie Walter\nGreat documentation helps teams implement accessibility requirements the right way. I will tell you why, what and how designers can document different aspects of accessibility and user interactions requirements, to build better more inclusive products.\nDesign and user experience\nDisabled And Here\nAffect the Verb\nDisabled And Here is a stock image and interview series celebrating disabled Black, Indigenous, people of color (BIPOC).\nDesign and user experience\nDesigning for accessibility is not that hard\nPablo Stanley\nSeven easy-to-implement guidelines to design a more accessible web.\nDesign and user experience\nEthical Design Guide\nSarah Fossheim\nEthical Design Guide is made to share resources on how to create ethical products that don't cause harm.\nDesign and user experience\nInformation on different types of people for graphic communication, website and information designers including free reusable infographic\nThomas Bohm\nHow can we include as many people as possible when designing graphic communication and information, and how do we not unnecessarily exclude people?\nDesign and user experience\nNeurodiversity Design System\nWill Soward\nThe NDS is a coherent set of standards and principles that combine neurodiversity and user experience design for Learning Management Systems.\nDesign and user experience\nUX Myths\nZoltán Gócza and Zoltán Kollin\nUX Myths collects the most frequent user experience misconceptions and explains why they don't hold true.\nDesign and user experience\nWCAG for designers\nGeri Reid\nHere's a checklist I'm working on to help ensure the products I design comply with the Web Content Accessibility Guidelines (WCAG).\nScreen reader help\nHelp about screen reading assistive technology.\nScreen reader help\nBasic screen reader commands for accessibility testing\nTPGi\nWhen you test your website with a screen reader there are a few basic commands you should know.\nScreen reader help\nHow to start testing screen reader support using VoiceOver\nYakim van Zuijlen\nThis article explains why you should be testing your content with a screen reader. It also gives a visual guide on how to use VoiceOver on macOS\nScreen reader help\nThe Importance Of Manual Accessibility Testing\nSmashing Magazine\nAutomated accessibility tests are a great resource to have, but they can’t automatically make your site accessible. Use them as one step of a larger testing process.\nScreen reader help\nKeyboard Testing Basics\nKnowbility\nKeyboard testing is one of the most efficient, impactful, and easy tasks that any team member can do to find accessibility issues.\nScreen reader help\nTesting with Screen Readers\nWebAIM\nAnswers to common questions.\nTypography\nGood typography is an important part of an accessible digital experience.\nTypography\nDesigning Accessible Content: Typography, Font Styling, and Structure\nEnvato Tuts+\nCreating and designing accessible content means more than just choosing accessible typography. Even with “perfect” font families in place on your website, people with low vision, cognitive, language, and learning disabilities may still struggle to process the text.\nTypography\nFonts don’t matter\nAxess Lab\nIf you’re an art director or font fanatic, you might want to sit down for this. Take a few deep breaths. Go to your happy place. Because I’m going to explain why fonts are overrated and what actually matters for readability.\nTypography\nLetter and symbol misrecognition in highly legible typefaces for general, children, dyslexic, visually impaired and ageing readers\nThomas Bohm\nThis paper identifies easily misrecognised letters and symbols in highly legible typefaces for general, children, dyslexic, visually impaired and ageing readers. It can also be considered as a review of related research in this area.\nSubject matter\nAnimation\nResponsible animation only starts when requested, can be paused, and avoids using known seizure and migraine triggers.\nAnimation\nPhotosensitive Epilepsy Analysis Tool\nUniversity of Maryland Trace Research and Development Center\nThe Trace Center's Photosensitive Epilepsy Analysis Tool (PEAT) is a free, downloadable resource for developers to identify seizure risks in their web content and software.\nEmail\nLearn about how to make your email accessible.\nEmail\naccessible-email.org\naccessible-email.org\nIt is the mission of Accessible-email.org to promote email marketing accessibility and usability.\nEmail\nAccessibility and Inclusion with the World’s Most Popular Communication Tool: Email\n24 Accessibility\nSome best practices on creating more accessible and inclusive email campaigns, routinely ranked as one of the world’s most valuable marketing channels, yet very little work has been done to make it more accessible for under-represented groups.\nEmail\nAccessibility in Email Marketing\nMailChimp\nAccessibility is a term that gets thrown around a lot in web design, but what does it mean for email marketing? It comes down to some simple changes you can make in your content to remove barriers for subscribers with disabilities.\nEmail\nA Beginner’s Guide to Email Accessibility (Checklist + Resources)\nEnvato Tuts+\nThis guide will walk you through a checklist of over thirty improvements you can make to your emails to make sure they’re as accessible as possible.\nEmail\nEmail Accessibility Best Practices\nEmail on Acid\nWe’re passionate about helping email developers and marketers create and send emails that every subscriber can read and understand, regardless of whether they have a visual impairment or disability.\nEmail\nThe Ultimate Guide to Accessible Emails\nLitmus\nIt only takes a few small steps to make your emails more accessible for all of your subscribers. In this post, we’ll discuss what those steps are and how they can make email better for everyone.\nHTML and ARIA\nWell-structured, semantic HTML is the foundation of an accessible web experience. ARIA can help make interactive web experiences accessible.\nHTML and ARIA\na11ysupport.io\nMichael Fairchild\nWill your code work with assistive technologies?\nHTML and ARIA\nAccessible Rich Internet Applications (WAI-ARIA) 1.1\nW3C\nAccessibility of web content requires semantic information about widgets, structures, and behaviors, in order to allow assistive technologies to convey appropriate information to persons with disabilities.\nHTML and ARIA\nHTML5 Accessibility\nSteve Faulkner\nGet the current accessibility support status of HTML5 features across major browsers\nHTML and ARIA\nPeriodic Table of ARIA 1.0 Roles\nDylan Barrell\nARIA 1.0 Roles displayed in the style of the periodic table of elements.\nHTML and ARIA\nWAI-ARIA Authoring Practices 1.1\nW3C\nThis document provides readers with an understanding of how to use WAI-ARIA 1.1 to create accessible rich internet applications.\nHTML and ARIA\nWeb Accessibility Tutorials\nW3C\nThis collection of tutorials shows you how to develop web content that is accessible to people with disabilities, and that provides a better user experience for everyone.\nImages and icons\nImages and icons can help draw a reader in and communicate functionality and abstract concepts.\nImages and icons\nAccessible SVGs\nCSS-Tricks\nScalable Vector Graphic (SVG) is emerging as the preferred graphic format to use on the web today. Are you abandoning the icon font or replacing old pg, gif and png graphics for the well-supported SVG, too? Let’s see how this will impact users of assistive technology (AT) and what is needed in order to ensure a great user experience for everyone.\nImages and icons\nAccessible SVG Icons with Inline Sprites\n24 Accessibility\nMarco Hengstenberg visits the practice of using SVG icons with inline sprites, and how to ensure these icons are accessible.\nImages and icons\nAlternative Text\nWebAIM\nAdding alternative text for images is the first principle of web accessibility. It is also one of the most difficult to properly implement.\nImages and icons\nAlt-texts: The Ultimate Guide\nAxxess Lab\nThis post contains everything you need to know about alt-texts! When to use them and how to perfectly craft them.\nImages and icons\nAn alt Decision Tree\nW3C\nThis decision tree describes how to use the <code>alt</code> attribute of the <code>&lt;img&gt;</code> element in various situations. For some types of images, there are alternative approaches, such as using CSS background images for decorative images or web fonts instead of images of text.\nImages and icons\nAn Alt Text Primer\nKnowbility\nAn image, they say, is worth a thousand words. Unless you can’t perceive images. This is why the alt attribute for images on the web is so important.\nImages and icons\nConsiderations when writing alt text\nScott Vinkle\nFind out what alt text is, why it’s so important, and how to write content for your images.\nImages and icons\nCreating Accessible SVGs\nDeque\nScalable Vector Graphics (SVGs) have been around since 1999, but they have seen a real resurgence in use as design interactions have become more complex and CSS/JavaScript have replaced antiquated animation programs such as Adobe Flash.\nImages and icons\nHow To Describe Images\nPoet Training Tool\nThe Poet Training Tool is a web based image description resource that helps people learn when and how to describe various types of images frequently found in educational books.\nMobile apps\nUnlike websites and web apps, mobile apps need to be installed on the device they're used on. They have some different requirements to ensure they're accessible.\nMobile apps\nAndroid Accessibility by Tutorials\nVictoria Gonda\nLearn to build accessible apps on Android using WCAG through hands-on, step-by-step tutorials.\nMobile apps\niOS Accessibility: Getting Started\nFayyazuddin Syed\nIn this iOS accessibility tutorial, learn how to make apps more accessible using VoiceOver and the Accessibility inspector.\nMobile apps\nMobile A11y\nRob Whitaker\nMobile A11y is a collection of blogs and resources about how we as mobile developers can improve accessibility on mobile devices.\nPDFs\nAdobe's PDF file format needs special considerations to ensure it can work with assistive technology.\nPDFs\nAcceDe PDF Project\nAcceDe\nThe aim of this guide is to provide all the practical information you need to learn how to tag a PDF document.\nPDFs\nCreate and verify PDF accessibility (Acrobat Pro)\nAdobe\nAcrobat tools make it easy to create accessible PDFs and check the accessibility of existing PDFs. You can create PDFs to meet common accessibility standards, such as Web Content Accessibility Guidelines (WCAG) 2.0 and PDF/UA (Universal Access, or ISO 14289).\nPDFs\nPDF Tagging and Reading Order (eight-part series on PDF accessibility)\nCommonLook\nMaking sure that PDFs are accessible to everyone, including those using assistive technologies like screen readers, refreshable braille displays, screen magnifiers, etc., can be a daunting technical process. In this article, we’ll address two basic PDF accessibility concepts – tagging and reading order. Then, in subsequent articles, we’ll address more specific topics in PDF accessibility.\nPDFs\nPDF accessibility introduction\nPragmatic Access\nAlthough web accessibility is most commonly thought of when talking about digital accessibility, document accessibility also plays an important role. Document formats such as Word, PowerPoint, Excel, ePub, and most commonly PDF, are quite common and are usually linked within web pages or sent via email. As such, it’s important to make sure that those documents are accessible as well.\nPDFs\nWebAIM: PDF Accessibility\nWebAIM\nDefining Acrobat PDF accessibility.\nVideo\nVideo is a common experience online. Here is how to it ensure everyone can enjoy it.\nVideo\nVideo accessibility guide for content creators and viewers\nAdobe\nAccessible videos not only help those with disabilities but benefits others who want to engage with your videos. Here's what you need to know to make your videos accessible.\nGroups and organizations\nConferences\nAnnual events about accessibility and inclusion.\nConferences\n#a11yTO Camp\nOpening the doors for a free day of accessibility learning.\nConferences\n#a11yTO Conf\nA curated playlist of talks, focused on digital accessibility.\nConferences\nAbilities Expo\nWhere else can you conquer an all-inclusive climbing wall, show off your skills in adaptive sports, learn moves from pioneers of inclusive dance, find the perfect device to meet your needs and so much more?\nConferences\nACCESS\nACCESS is an annual conference by 3Play Media celebrating video, accessibility, & the people who make it happen.\nConferences\nAssistive Technology Industry Association (ATIA)\nOver the past 22 years, ATIA has been a community gathering for assistive technology practitioners, teachers, parents and caregivers, persons with disabilities and more to learn, network and share on the best in assistive technology.\nConferences\naxe-con Digital Accessibility Conference\nAxe-con is an open and inclusive digital accessibility conference that welcomes developers, designers, business users, and accessibility professionals of all experience levels to a new kind of accessibility conference focused on building, testing, and maintaining accessible digital experiences.\nConferences\nBuilding For Everyone: Expand Your Market With Design Practices From Google’s Product Inclusion Team\nAnnie Jean-Baptiste\nHow can business leaders adapt to our ever-more-diverse world by capturing market share and building more inclusive products for people of color, women and other underrepresented groups? The Product Inclusion Team at Google has developed strategies to do just that.\nConferences\nClosing the Gap\nDiscover how AT can change lives and improve learning!\nConferences\nCSUN Assistive Technology Conference\nKnown as a forum that showcases cutting edge technology and practical solutions that can be utilized to remove the barriers that prevent the full participation of persons with disabilities in educational, workplace and social settings, the conference is the largest of its kind in the world.\nConferences\nThe Digital Accessibility Legal Summit\nWe bring together experts from the fields of accessibility and legal to discuss current trends, and to provide insights that will be helpful to practitioners in their work on digital accessibility.\nConferences\nFuture Date\nFuture Date is a free, volunteer-led, virtual accessibility conference. Our goal is to expose our audience to the pioneering work and lived experiences of disability and accessibility leaders.\nConferences\nGlobal Accessibility Awareness Day\nThe purpose of GAAD is to get everyone talking, thinking and learning about digital access and inclusion, and the more than One Billion people with disabilities/impairments.\nConferences\nInternational Conference on Computers Helping People with Special Needs (ICCHP)\nICCHP is a series of biannual scientific conferences in the field of ICT/AT for people with disabilities.\nConferences\nICT Accessibility Testing Symposium\nThe annual ICT Accessibility Testing Symposium is a place for in-person knowledge sharing in ICT Accessibility Testing research and practice and for professional networking.\nConferences\nInclusive Design 24 (#id24)\nA free 24-hour online event for the global community. It celebrates inclusive design and shares knowledge and ideas from analogue to digital, from design to development, from planners to practitioners, and everything and everyone in between.\nConferences\nJohn Slatin Virtual AccessU\nWhatever your role in digital accessibility, wherever you are on your journey, there is simply no better place to learn and connect to the global community than the annual John Slatin AccessU conference.\nConferences\nM-Enabling\nThe M-Enabling Summit Conference and Showcase is dedicated to promoting accessible and assistive technology for senior citizens and users of all abilities.\nConferences\nMagnify Conference\nThe Magnify Conference was created from a surge of inspiration when seeing so many talented people practicing inclusive design practices daily across the globe.\nConferences\nWeb4All\nThe conference focuses on all aspects of web accessibility. Areas of general interest include, but are not limited to the following: age, cognition, culture, education, emotions, dexterity, disability, diversity, health, hearing, income, infrastructure, language, learning, literacy, mobility, situation, society, and vision.\nEmployment\nResources for finding accessibility jobs.\nEmployment\nA11yjobs.com\nGeorge Hewitt\nA digital accessibility job board.\nEmployment\nApplying for a job with a disability or impairment\nMarlijn van der Bok\nCombatting discrimination when entering the job market\nEmployment\nAccessibility Interview Questions\nScott O'Hara\nThese questions try to act as conversation starters, to gain insight into how someone solves problems, and interprets accessible, inclusive user experiences.\nEmployment\nInvisible Strengths\nInclusive workplaces for everyone\nConnecting disabled jobseekers with supportive work environments, and a diverse pipeline of candidates for employers.\nMeetups\nArea groups dedicated to regularly meeting to discuss accessibility related topics.\nMeetups\nA11YChi/A11Y-Presentations\nChicago, Illinois\nA guide to accessible presentations, for presenters, speakers.\nMeetups\n#a11yTO\nToronto, Canada\n#a11yTO actively promotes digital inclusion for the design and development communities in and around the Greater Toronto Area.\nMeetups\nAccess + Equity\nFlorida, United States\nAccess + Equity is a brand-new series featuring some of the best minds in the field of disability rights and accessibility.\nMeetups\nAccessibility Chicago\nChicago, United States\nAccessibility Twin Cities is designed to connect and support individuals who work in – or are even simply interested in – the field of digital accessibility and accessibility testing for organizations, businesses and government.\nMeetups\nAccessibility Twin Cities\nMinnesota, United States\nA community of digital professionals passionate about making the world more accessible and inclusive.\nMeetups\nA11yPHL - Philly Accessibility Meetup\nPhilladelphia, United States\nThe Philly Accessibility Meetup exists to connect and elevate the local accessibility community.\nMeetups\na11ySD\nSan Diego, CA\nSan Diego Accessibility & Inclusive Design meetup\nMeetups\nA11ySEA\nSeattle, United States\nAccessibility Seattle is dedicated to the simple premise that 'digital inclusion' is fundamental.\nMeetups\nAccessibility Club\nNürnberg, Germany\nThe Accessibility Club gives you the chance to get some real-world experience with assistive technology, deepen your knowledge about web accessibilty and get in touch with like-minded webworkers.\nMeetups\nAccessibility DC\nWashington DC, United States\nAccessibility DC is a monthly meetup once every month and is a chance for people who are interested in Accessibility to get together and share information. Web Developers who are interested in Web Accessibility and Adaptive Technology Users who have a daily experience of accessibility issues are all welcome to attend.\nMeetups\nA11yNYC - Accessibility New York City\nNew York, United States\nOur group exists to advance accessibility and inclusive design. Our goal is to bring together NYC's accessibility community to share ideas, best practices, and our experiences.\nMeetups\nA11yVR - Accessibility Virtual Reality\nTokyo, Japan\nAccessibility VR is a monthly meetup that brings together people interested in accessibility in virtual reality to share ideas, best practices, and our experiences.\nMeetups\nAnnArborA11y\nMichigan, United States\nAccessibility group based in Ann Arbor, Michigan.\nMeetups\naxe-con\nOnline\nFree, virtual digital accessibility conference with tracks for design, develoopers, business leaders, and compliance.\nMeetups\nEventua11y\nOnline, in-person\nCalendar of digital accessibility events.\nMeetups\nBay Area Accessibility and Inclusive Design\nBay Area, United States\nCalling all Bay Area developers, designers, accessibility, usability and any other high-tech professionals who have an interest in digital (web, mobile, etc.) accessibility and users with different disabilities.\nMeetups\nBristol Inclusive Design & Development\nBristol, United Kingdom\nA meetup for anyone involved in digital design and development, accessibility and inclusive design.\nMeetups\nBudapest Accessibility Meetup\nBudapest, Hungary\nA meetup for Hungarian developers and designers.\nMeetups\nBuffalo Accessibility Meetup\nNew York, United States\nThis is a venue for developers, designers, UX professionals, copywriters, QA professionals, and so on, to get together to learn from and share with others everything we can about accessibility and inclusiveness.\nMeetups\nOpen Mcr\nManchester, United Kingdom\nA meetup in Manchester focussing on making digital services accessible and inclusive to everyone.\nMeetups\na11yRTP\nNorth Carolina, United States\nAre you interested in digital accessibility? Join this group of practitioners and inquirers as we explore how to make all aspects of digital life accessible to all people.\nMeetups\nA11y Berlin\nBerlin, Germany\nA11y Meetup Berlin is designed to bring together the accessibility, web performance, and inclusive design community to share and discuss ideas, best practices, and experiences.\nMeetups\nCleveland Accessibility Meetup\nOhio, United States\nAccessibility is for everyone. We seek to increase awareness of digital accessibility, inclusive design, and assistive technologies in Northeast Ohio in a setting of sharing, learning, and networking.\nMeetups\nInclusive Design & Accessibility\nUtrecht, Netherlands\nWe like to come together to talk about inclusive design and accessibility. Be it UX design, UI design, EU law changes, web accessibility, product design, user research, what have you.\nMeetups\nPortland Accessibility and User Experience Meetup\nThe Portland Accessibility and User Experience (PDX A11Y UX) Meetup addresses how to incorporate accessibility and universal design principles into project planning, user research, and UX evaluation.\nOregon, United States\nMeetups\nOZeWAI - Australian Web Adaptability Initiative\nPerth, Australia\nOZeWAI is an association of volunteers working to make the information world more inclusive. It was the first such organisation in Australia and has been a leading initiative in the field for more than 20 years.\nMeetups\nWebA11y.jp\nTokyo, Japan\nMeetups\nA11y Bytes\nAustralia\nA11y Bytes is a dynamic fast-paced evening of lightning talks about digital accessibility and the needs and preferences of users with disabilities, run in multiple cities across Australia.\nMeetups\nMelbourne Web Accessibility and Inclusive Design\nMelbourne, Australia\nBased in Melbourne, Australia, this group is for web practitioners and other professionals who are interested in web accessibility and inclusive design practices.\nMeetups\nSydney Web Accessibility and Inclusive Design\nSydney, Australia\nThis Sydney group is for anyone interested in inclusive research, design and development practices. This includes accessible design and development, user research that involves people with disabilities in a holistic, integrated fashion as well as compliance with international standards such as the Web Content Accessibility Guidelines.\nMeetups\nAccessibility Scotland\nEdinburgh, Scotland\nAccessibility Scotland’s focus is on providing a friendly, affordable, and informative day focused on digital accessibility and inclusion.\nMeetups\nLondon Accessibility Meetup\nLondon, United Kingdom\nWe are the UK's largest accessibility community, a welcoming and friendly group of people focussed on digital products, digital services and the built environment across the public, private and charitable sectors.\nMeetups\na11yMTL meetup - web accessibility & inclusive design\nMontréal, Canada\na11yMTL is a bilingual interest group for anyone passionate about web accessibility, universal design, and digital inclusion.\nMeetups\nrole=drinks\nAmsterdam, Netherlands\nWhat on Earth is a role=drinks? It’s an accessibility meetup! The event features lightning talks by accessibility specialist, time to talk to the speakers and fellow attendees, and more than enough time to grab a drink.\nProfessional help\nWell-respected professional companies who specialize in accessibility.\nProfessional help\nAccessible360\nWe help organizations large and small navigate their path to digital accessibility through live-user audits, training, support and monitoring.\nProfessional help\nDeque Systems\nDeque Systems provides web and mobile accessibility solutions so you can meet compliance goals and help make the web accessible to all users.\nProfessional help\nEqual Entry\nWe help organizations be more inclusive and accessible by providing accessibility audits, training, and consulting.\nProfessional help\nIntopia\nWe help organisations be more inclusive and accessible by providing digital accessibility audits, training, strategy, usability testing, and consulting.\nProfessional help\nKnowbility\nKnowbility is a nonprofit organization with the goal of improving technology access for millions of youth and adults with disabilities all over the world.\nProfessional help\nLevel Access\nLevel Access is a company that provides digital accessibility solutions and services to corporations, government agencies, and educational institutions.\nProfessional help\nSimply Open\nWe work with brands who are listening. They want to make products and services you will love. They understand the value of insight from those who sense, think, move and feel differently.\nProfessional help\nPrime Access Consulting\nVia our inclusive design methodology, we help you design, develop, and produce inclusive experiences. We work across digital and physical spaces, spanning websites, mobile apps, small-to-large capital projects, themed experiences, and much more.\nProfessional help\nTetraLogical\nWe're a company with inclusion at its heart. Our focus is on emerging as well as existing technologies, offering knowledge, experience, strategic, and development services.\nProfessional help\nTPGi\nTPGi – Your Accessibility Partner (WCAG 2.0/508 audits, VPAT, usability and accessible user experience).\nProfessional help\nWebAIM: Web Accessibility In Mind\nOur mission is to empower organizations to make their web content accessible to people with disabilities.\nProfessional help\nWeCo\nWe’re accessibility experts who live with the disabilities you’re trying to accommodate. Let us help you bring real-life accessibility, and legal compliance, to your projects.\nProfessional testers\nIt's important to test your website or web app with disabled people to learn how it actually works.\nProfessional testers\nAccessible360\nWe help organizations large and small navigate their path to digital accessibility through live-user audits, training, support and monitoring.\nProfessional testers\nAccessWorks (by Knowbility)\nAccess Works offers usability and accessibility testing that connects businesses with users with disabilities.\nProfessional testers\nFable Tech Labs\nWeb accessibility testing services to reach your compliance goals faster. Connect with real users online and on-demand, through crowdtesting!\nProfessional testers\nLoop11\nLoop11 is a website user testing tool that enables you to identify navigational and usability issues of any website.\nProfessional testers\nPerkins School For The Blind\nPerkins is so much more than a school. Our services help make the world a better place for people who are blind or visually impaired – from independent evaluations to assess a student's needs and strengths, to our Outreach Short Courses, which offer adventures and opportunities to practice skills to support independence and self-advocacy.\nEverything else\nAdditional resources\nMiscellaneous accessibility-related resources.\nAdditional resources\na11y_styled_form_controls\nScott O'Hara\nA repository of styled and “styled” form control elements and markup patterns, and how they are announced by screen readers.\nAdditional resources\na11y-dialog\nKitty Giraudel\nA very lightweight and flexible accessible modal dialog script.\nAdditional resources\na11y-tabs\nRob Levin\nA lightweight (<1Kb) JavaScript package to facilitate a11y-compliant tabbed interfaces.\nAdditional resources\na11y-webring.club\nEric Bailey\nA webring for digital accessibility practitioners.\nAdditional resources\nAaron Cannon’s Web Accessibility Checklist\nCameron Moll\nPDF accessibility checklist.\nAdditional resources\nThe Accessibility Cheatsheet\nIre Aderinokun\nThe WCAG contain some very useful information, and so I decided to condense the very extensive guidelines and highlight some practical examples of what we can do to implement them and make our websites more accessible.\nAdditional resources\nAccessibility for teams\nPeter van Grieken\nThis is a starter guide for teams about delivering accessible websites. Each person on your team has their own responsibilities, this guide tells you what everybody needs to do.\nAdditional resources\nAccessible Social\nAlexa Heinrich\nAccessible Social is a free resource hub for digital marketers, communication professionals, content creators, everyday social media users, and anyone who wants to learn how to make their content inclusive and accessible for people with disabilities.\nAdditional resources\nAdobe Inclusive Design Workshop\nMatt May\nContent for a full-day workshop on inclusive design, including workbook modules, and exercises.\nAdditional resources\nAssistive Technology Glossary\nFable\nA list of assistive technology terms and what they mean.\nAdditional resources\nCollaborative planning, the forgotten step of accessible development\nDeque\nDescribes an agile development process to faciliate accessibility called Accessibility Behavior Informed Development (a11yBID).\nAdditional resources\nDataviz Accessibility Resources\nGitHub\nA non-exhaustive and in-progress list of people and resources in Accessibility and Data Visualization.\nAdditional resources\nDisability is a spectrum, not a binary\n24 Accessibility\nWhen we look at disability as a spectrum instead of a binary, we can see that a lot more people struggle to use our stuff than we might think. The good news is that making things accessible helps even more people than we might realise.\nAdditional resources\nDisabled And Here Collection\nDisabled and Here\nThis stock collection is a disability-led effort to provide free and inclusive images from our own perspective, with photos and illustrations celebrating disabled Black, Indigenous, people of color (BIPOC).\nAdditional resources\nEmpathy Prompts\nEric Bailey\nPrompts to consider when making things for others to use.\nAdditional resources\nGoogle Accessibility\nGoogle\nEveryone should be able to access and enjoy the web. We’re committed to making that a reality.\nAdditional resources\nList of online accessibility tools\nDMOZ\nThe Directory of the Web.\nAdditional resources\nTips For Online Shopping With Disabilities: A Website Accessibility Guide\nCoupon Follow\nIn-person shopping can be difficult and stressful for disabled people for many reasons, from tall checkout counters to non-navigable spaces, but meanwhile, disabled Americans are more likely to never use the Internet compared to the total population.\nAdditional resources\nHome: Up Your A11y\nSuzanne Aitchison\nTutorials and resources for developers seeking to build accessible web experiences.\nAdditional resources\nVan11y: Accessibility and Vanilla JavaScript - ES2015\nNicolas Hoffmann\nA collection of accessible scripts for rich interfaces elements, built using progressive enhancement and customisable.\nAdditional resources\nWeb Accessibility for Designers (Infographic)\nWebAIM\nOptimal accessibility should start much earlier, as part of the visual design process. We have created an infographic that highlights a few important principles of accessible design.\nAdditional resources\nWeb Fundamentals: Accessibility\nGoogle\nA concise treatment of accessibility principles and practices.\nAdditional resources\nWebAIM: 'Skip Navigation' Links\nWebAIM\nThe main content is not usually the first thing on a web page. Keyboard and screen reader users generally must navigate a long list of navigation links, sub-lists of links, corporate icons, site searches, and other elements before ever arriving at the main content. This is particularly difficult for users with some forms of motor disabilities.\nAdditional resources\nWebAIM’s Hierarchy for Motivating Accessibility Change\nWebAIM\n“When you incent, people optimize for reward. When you inspire, people optimize for purpose.”\nAdditional resources\nAccessibility Articles, Reports, Training Courses, and Online Seminars by Nielsen Norman Group\nNielsen Norman Group\nAll articles tagged with 'accessibility.'\nAdditional resources\nThe a11y Monthly: Does Accessibility slow down the development process?\nYoast\nOne of the complaints I’ve often heard from business owners and managers is that implementing accessibility is hard and slows down the development process. For this reason, sometimes accessibility gets postponed or set aside in the erroneous belief that’s something that can be “added” later. Here, I’d like to share my thoughts on why I think the first statement is misleading.\nAdditional resources\nWriting CSS with Accessibility in Mind\nManuel Matuzovic\nTips on how to improve the accessibility of your web sites and apps with CSS.\nAdditional resources\nA guide to coding accessible developer tools\nThe Increment\nWhen we talk about accessibility in the tech industry, most conversations are centered around the end user. But how accessible are the tools we code for other developers?\nAdditional resources\nInformation On Different Types Of People For Graphic Communication, Website And Information Designers\nUser Design, Illustration and Typesetting, previously Usability Geek\nEvery day we use graphic communication design from reading letters which have come through the post, or the newspaper in the morning, to reading and using information at work, to travelling and navigating in the environment. How can we include as many people as possible when designing graphic communication and information, and how do we not unnecessarily exclude people?\nAdditional resources\nAccessibility for Teams\nU.S. General Services Administration\nA ‘quick-start’ guide for embedding accessibility and inclusive design practices into your team’s workflow.\nAdditional resources\nAccess & Use\nDias GmbH\nAccess & Use shows what it needs to make dynamic elements in websites accessible and usable for all.\nAdditional resources\nAre you accessible? -  A Primer on Web Accessibility\nAmy Dickens\nAccessibility of the world wide web hasn’t always been a number one priority for web developers (much to detriment of internet users). Whilst very few people set out to design a website that is inaccessible, many studies have documented partially or completely inaccessible websites.\nAdditional resources\nmouseless\nSonuscape LLC\nLightning-fast mouse control with the keyboard.\nAdditional resources\nSolid Start\nErik Kroes\nAre you a person that makes digital things for other people? Awesome—because this page is all about making things for people.\nAdditional resources\nWord and PowerPoint Accessibility Evaluation Checklist\nWebAIM\nProvides advice for how to review and repair accessibility issues for Microsoft Office.\nAdditional resources\nThe Web Accessibility Introduction I Wish I Had\nMax Antonucci\nThis post aims to tell you a few key things about accessibility. I can't cover everything, but I can cover: why accessibility matters, how to make a website accessible, and how to test for accessibility.\nSubmit a resource\nWe're always looking for\npeople to help add great accessibility-related resources\n.",
  "content_markdown": "Table of Contents\n\n## Featured Resource\n\n### [Assistive Technology Glossary](https://makeitfable.com/glossary/)\n\nFable\n\nA list of assistive technology terms and what they mean.\n\n## Media\n\n### Books\n\nPhysical and eBooks written to discuss different accessibility topics.\n\nBooks\n\n[#### Accessibility for Everyone](https://abookapart.com/products/accessibility-for-everyone)\n\nLaura Kalbag\n\nGet sure footing on the path to designing with accessibility.\n\nBooks\n\n[#### Adaptive Web Design: Crafting Rich Experiences with Progressive Enhancement](http://a.co/d/7aVobuX)\n\nAaron Gustafson\n\nBuilding an elegant, functional website requires more than just knowing how to code. In Adaptive Web Design, Second Edition, you’ll learn how to use progressive enhancement to build websites that won’t break, work anywhere, are accessible by anyone—on any device, and are designed to work well into the future.\n\nBooks\n\n[#### Against Technoableism](https://wwnorton.com/books/9781324076254)\n\nAshley Shew\n\nA manifesto exploding what we think we know about disability, and arguing that disabled people are the real experts when it comes to technology and disability.\n\nBooks\n\n[#### Agile Accessibility Handbook](https://accessibility.deque.com/agile-accessibility-handbook)\n\nDylan Barrell\n\nFree ebook: A Practical Guide to Accessible Software Development at Scale.\n\nBooks\n\n[#### Approachable Accessibility: Planning for Success](https://link.springer.com/book/10.1007/978-1-4842-4881-2)\n\nMartine Dowden and Michael Dowden\n\nUnderstand the realities of modern web accessibility and what considerations should be made to include everyone. This book makes the topic of web accessibility as approachable as possible to help every web professional become an accessibility advocate at their companies, on their projects, and in their communities.\n\nBooks\n\n[#### Apps For All: Coding Accessible Web Applications](https://shop.smashingmagazine.com/products/apps-for-all)\n\nHeydon Pickering\n\nWeb accessibility is quite a large topic — far too large to fit into a small book. So, what will this book cover? Though we shall encounter visual design challenges, deal with performance issues, and adopt progressive enhancement — all of which are accessibility concerns — the underlying theme of this book is about making the interactivity of web applications include keyboard and screen reader users.\n\nBooks\n\n[#### Appt Accessibility Handbook](.)\n\nJan Jaap de Groot and Paul van Workum\n\nThe Appt Foundation is working towards a world where everyone can use apps equally. To make this vision a reality, we have written a handbook. It helps you learn the basics of app accessibility in a straightforward way.\n\nBooks\n\n[#### Automating Inequality](https://us.macmillan.com/books/9781250074317)\n\nVirginia Eubanks\n\nIn Automating Inequality, Virginia Eubanks systematically investigates the impacts of data mining, policy algorithms, and predictive risk models on poor and working-class people in America.\n\nBooks\n\n[#### Beyond Accessibility Compliance](https://link.springer.com/book/10.1007/978-1-4842-7948-9)\n\nSukriti Chadha\n\nTake a deep look at accessibility as it applies to mobile and wearables. This book covers topics within the accessibility domain that are rarely covered or understood, despite the fact that nearly half of the world’s population uses smartphones.\n\nBooks\n\n[#### Branding and Designing Disability: Reconceptualising Disability Studies](https://www.routledge.com/Branding-and-Designing-Disability-Reconceptualising-Disability-Studies/DePoy-Gilson/p/book/9781138601161)\n\nElizabeth DePoy, Stephen Gilson\n\nGiven their potential to divide humans into categories and label their worth and value, design and branding can wield immense but currently unharnessed powers of social change. Groups designed as devalued can be undesigned, redesigned and rebranded to seamlessly and equivalently participate in community, work and civic life.\n\nBooks\n\n[#### Building Access: Universal Design and the Politics of Disability](https://www.upress.umn.edu/book-division/books/building-access)\n\nAimi Hamraie\n\nBuilding Access investigates twentieth-century strategies for designing the world with disability in mind.\n\nBooks\n\n[#### Color Accessibility Workflows](https://abookapart.com/products/color-accessibility-workflows)\n\nGeri Coady\n\nMake sure accessibility and aesthetics go hand-in-hand with every design.\n\nBooks\n\n[#### Crip Theory: Cultural Signs of Queerness and Disability](https://nyupress.org/9780814757130/crip-theory/)\n\nRobert McRuer\n\nA bold and contemporary discourse of the intersection of disability studies and queer studies.\n\nBooks\n\n[#### Cross-Cultural Design](https://abookapart.com/products/cross-cultural-design)\n\nSenongo Akpem\n\nExplore how to create culturally relevant and responsible experiences that reach a truly global audience.\n\nBooks\n\n[#### Dark and Silent Office: A Digital Accessibility Guidebook for Inclusive Communication in the Workplace](https://www.amazon.com.au/dp/B0D3SB2YX8)\n\nChange is never easy, but in this case, it’s crucial. Whether you are an employee, manager, HR/DEI leader, or company owner, this guide provides practical and achievable steps to ensure everybody can fulfill their role to the best of their abilities while feeling respected.\n\nStephanie Warlick\n\nBooks\n\n[#### Demystifying Disability](https://www.penguinrandomhouse.com/books/646508/demystifying-disability-by-emily-ladau/)\n\nEmily Ladau\n\nAn approachable guide to being a thoughtful, informed ally to disabled people, with actionable steps for what to say and do (and what not to do) and how you can help make the world a more inclusive place.\n\nBooks\n\n[#### Design for Cognitive Bias](https://abookapart.com/products/design-for-cognitive-bias)\n\nDavid Dylan Thomas\n\nIn Design for Cognitive Bias, David Dylan Thomas lays bare the irrational forces that shape our everyday decisions and, inevitably, inform the experiences we craft. Once we grasp the logic powering these forces, we stand a fighting chance of confronting them, tempering them, and even harnessing them for good.\n\nBooks\n\n[#### Design Meets Disability](https://mitpress.mit.edu/books/design-meets-disability)\n\nGraham Pullin\n\nHow design for disabled people and mainstream design could inspire, provoke, and radically change each other.\n\nBooks\n\n[#### Design for Real Life](https://abookapart.com/products/design-for-real-life)\n\nEric Meyer, Sara Wachter-Boettcher\n\nYou can’t know every user, but you can develop inclusive practices to create experiences that support a wider range of people, more of the time.\n\nBooks\n\n[#### Designing with the Body: Somaesthetic Interaction Design](https://mitpress.mit.edu/books/designing-body)\n\nKristina Höök\n\nInteraction design that entails a qualitative shift from a symbolic, language-oriented stance to an experiential stance that encompasses the entire design and use cycle.\n\nBooks\n\n[#### Designing with Progressive Enhancement: Building the Web that Works for Everyone](http://a.co/d/1XaEnBw)\n\nTodd Parker, Scott Jehl, Maggie Costello Wachs, and Patty Toland\n\nProgressive enhancement is an approach to web development that aims to deliver the best possible experience to the widest possible audience, and simplifies coding and testing as well. Whether users are viewing your sites on an iPhone, the latest and greatest high-end system, or even hearing them on a screen-reader, their experience should be easy to understand and use, and as fully-featured and functional as possible.\n\nBooks\n\n[#### Designing with Web Standards](http://a.co/d/f0aNSFO)\n\nJeffrey Zeldman\n\nDesigning with Web Standards remains your essential guide to creating sites that load faster, reach more users, and cost less to design and maintain.\n\nBooks\n\n[#### Designing Learning Experiences for Inclusivity and Diversity: Advice for Learning Designers](https://oercollective.caul.edu.au/designing-learning-experiences/)\n\nKeith Heggart et al\n\nThe development and implementation of inclusive and diverse learning experiences is a vital consideration for educators in higher education. Increasingly, learning designers play a significant role in this process. This textbook offers postgraduate students a comprehensive guide to designing learning experiences that are accessible, equitable, and inclusive.\n\nBooks\n\n[#### Disability Visibility: First-Person Stories from the Twenty-First Century](https://www.penguinrandomhouse.com/books/617802/disability-visibility-by-alice-wong/)\n\nAlice Wong\n\nActivist Alice Wong brings together this urgent, galvanizing collection of contemporary essays by disabled people.\n\nBooks\n\n[#### Giving a damn about accessibility](https://accessibility.uxdesign.cc/)\n\nSheri Byrne-Haber, CPACC.\n\nA candid and practical handbook for designers.\n\nBooks\n\n[#### The Glossary of Accessibility Design](https://www.amazon.com/dp/B0CJLCLV66)\n\nVimal Gupta\n\nA guide to navigating the crucial field of accessibility design with precision and clarity. This comprehensive dictionary comprises over 700 meticulously defined terms, offering a vital resource for designers, developers, policymakers, and anyone dedicated to creating inclusive digital experiences.\n\nBooks\n\n[#### Inclusify: The Power of Uniqueness and Belonging to Build Innovative Teams](https://inclusifybook.com/)\n\nStefanie K. Johnson\n\nHow do we find that happy medium where workers can demonstrate their individuality while also feeling they belong?\n\nBooks\n\n[#### Inclusive Design for a Digital World](https://www.apress.com/gp/book/9781484250150)\n\nRegine Gilbert\n\nWhat is inclusive design? It is simple. It means that your product has been created with the intention of being accessible to as many different users as possible.\n\nBooks\n\n[#### Inclusive Design for Organisations](https://bookshop.org/books/inclusive-design-for-organisations-including-your-missing-20-by-embedding-web-and-mobile-accessibility/9781781333952)\n\nJonathan Hassell\n\nIn this book, award-winning international accessibility thought-leader Jonathan Hassell shows you how to transform your organisation to consistently and cost-efficiently create websites, mobile apps and other digital products that are usable for all of your customers.\n\nBooks\n\n[#### Inclusion: Diversity, The New Workplace & The Will To Change](https://jenniferbrownspeaks.com/jbs-book-inclusion)\n\nJennifer Brown\n\nThe Inclusion Dividend provides a framework to tap the bottom line impact that results from an inclusive culture.\n\nBooks\n\n[#### The Inclusion Dividend: Why Investing in Diversity and Inclusion Pays Off](https://thedagobagroup.com/offerings/publications/the-inclusion-dividend/)\n\nMason Donovan, Mark Kaplan\n\nThe Inclusion Dividend provides a framework to tap the bottom line impact that results from an inclusive culture.\n\nBooks\n\n[#### Inclusive Conversations: Fostering Equity, Empathy, and Belonging across Differences](https://www.amazon.com/Inclusive-Conversations-Fostering-Belonging-Differences/dp/152308880X/)\n\nMary-Frances Winters\n\nEffective dialogue across different dimensions of diversity, such as race, gender, age, religion, or sexual orientation, fosters a sense of belonging and inclusion, which in turn leads to greater productivity, performance, and innovation.\n\nBooks\n\n[#### Inclusive Design Patterns](https://shop.smashingmagazine.com/products/inclusive-design-patterns)\n\nHeydon Pickering\n\nInclusive Design Handbook gets to the bottom of it all: accessibility myths and rules of thumbs, WAI-ARIA roles, content accessibility guidelines, landmark roles, keyboard and touch accessibility, accessible markup and interaction patterns, accessible forms and widgets, multimedia accessibility and inclusive prototyping.\n\nBooks\n\n[#### Living in Information: Responsible Design for Digital Places](https://rosenfeldmedia.com/books/living-in-information/)\n\nJorge Arango\n\nWebsites and apps are places where critical parts of our lives happen. We shop, bank, learn, gossip, and select our leaders there. But many of these places weren’t intended to support these activities. Instead, they’re designed to capture your attention and sell it to the highest bidder.\n\nBooks\n\n[#### Making Disability Modern](https://www.bloomsbury.com/us/making-disability-modern-9781350070448/)\n\nBess Williamson, Elizabeth Guffey\n\nMaking Disability Modern: Design Histories brings together leading scholars from a range of disciplinary and national perspectives to examine how designed objects and spaces contributes to the meanings of ability and disability from the late 18th century to the present day, and in homes, offices, and schools to realms of national and international politics.\n\nBooks\n\n[#### Mismatch: How Inclusion Shapes Design](https://mitpress.mit.edu/books/mismatch)\n\nKat Holmes\n\nHow inclusive methods can build elegant design solutions that work for all.\n\nBooks\n\n[#### No Right to Be Idle: The Invention of Disability](https://muse.jhu.edu/book/49914)\n\nSarah F. Rose\n\nDuring the late nineteenth and early twentieth centuries, Americans with all sorts of disabilities came to be labeled as “unproductive citizens.” Before that, disabled people had contributed as they were able in homes, on farms, and in the wage labor market, reflecting the fact that Americans had long viewed productivity as a spectrum that varied by age, gender, and ability.\n\nBooks\n\n[#### Practical Web Inclusion & Accessibility](https://learna11y.com)\n\nAshley Firth\n\nThis book will guide you through a broad range of access needs, the barriers users often face, and provide practical advice on how your sites can help rather than hinder. Going beyond advice tailored solely for developers, this book offers potential improvements for designers, developers, user experience professionals, QA and testers, so that everyone involved in building a website can benefit.\n\nBooks\n\n[#### Pro HTML5 Accessibility](http://a.co/d/4AX1wPY)\n\nJoshue O Connor\n\nPro HTML5 Accessibility helps designers come to grips with building exciting, accessible and usable web sites and applications with HTML5. The book covers how to use HTML5 in order to serve the needs of people with disabilities and older persons using assistive technology (AT).\n\nBooks\n\n[#### Sound Is Not Enough: Captioning as Universal Design](https://audio-accessibility.com/book/)\n\nSvetlana Kouznetsova\n\nDo you have a podcast, video series, or an upcoming live event? Do you want to increase your audience tenfold? We have the solution, and it’s captioning. In her book, Sound Is Not Enough: Captioning as Universal Design, Svetlana Kouznetsova will show you how to capture those new viewers and take your audience to a whole new, and diverse level.\n\nBooks\n\n[#### Technically Wrong](https://wwnorton.com/books/Technically-Wrong/)\n\nSara Wachter-Boettcher\n\nIn Technically Wrong, Sara Wachter-Boettcher demystifies the tech industry, leaving those of us on the other side of the screen better prepared to make informed choices about the services we use—and to demand more from the companies behind them.\n\nBooks\n\n[#### Universal Design for Learning: Principles, Framework, and Practice](https://publishing.cast.org/catalog/books-products/udl-principles-framework-practice)\n\nDavid Gordon\n\nA practical, research-based framework that enables all educators to respond to individual learning differences through the design of inclusive goals, methods, materials, assessments, and environments.\n\nBooks\n\n[#### WCAG for Designers: Accessibility Reference Manual](https://play.google.com/store/books/details?id=6gAcEQAAQBAJ)\n\nStacey Swinehart Ganderson\n\nThis accessibility reference manual is geared toward designers working on digital products.\n\nBooks\n\n[#### We Are Not Users: Dialogues, Diversity, and Design](https://mitpress.mit.edu/books/we-are-not-users)\n\nEswaran Subrahmanian, Yoram Reich, Sruthi Krishnan\n\nA call to reclaim and rethink the field of designing as a liberal art where diverse voices come together to shape the material world.\n\nBooks\n\n[#### Web and App Accessibility: Your Roadmap to Digital Inclusion](https://info.usablenet.com/web-and-app-accessibility)\n\nJason C. Taylor\n\nYour Roadmap to Digital Inclusion is made up of four instructive chapters, focused on the resource considerations for each stage of a typical digital accessibility program and how to integrate the disability community across your program.\n\nBooks\n\n[#### Web Accessibility Cookbook](https://www.oreilly.com/library/view/web-accessibility-cookbook/9781098145590/)\n\nManuel Matuzovic\n\nThe Web Accessibility Cookbook provides you with dozens of recipes to help you avoid creating accessibility failures. You'll learn how to build common components, such as main navigation, filters, and dialogs, in an accessible manner. Each recipe not only explains how to build things but also why.\n\nBooks\n\n[#### The Web Accessibility Project: Development and Testing Best Practices](https://www.routledge.com/The-Web-Accessibility-Project-Development-and-Testing-Best-Practices/Palani/p/book/9781032202006)\n\nNarayanan Palani\n\nBy applying the accessibility best practices covered in this book, developers can help their organizations rise to a whole new level of accessibility adherence, innovation, and inclusive design. They will also see greater work satisfaction in their professional lives and a way to help improve digital accessibility for end users.\n\nBooks\n\n[#### Web Accessibility: Web Standards and Regulatory Compliance](http://a.co/d/bMguqOv)\n\nJim Thatcher and Mark Urban\n\nThe power of the Web lies in the fact that anyone and everyone can access it, and this should also extend to users with disabilities. Accessibility is about making websites accessible to those with aural, visual, or physical disabilities, or rather, constructing websites that don't exclude these people from accessing the content or services provided.\n\nBooks\n\n[#### A Web for Everyone: Designing Accessible User Experiences](https://rosenfeldmedia.com/books/a-web-for-everyone/)\n\nSarah Horton and Whitney Quesenbery\n\nIf you are in charge of the user experience, development, or strategy for a web site, A Web for Everyone will help you make your site accessible without sacrificing design or innovation. Rooted in universal design principles, this book provides solutions: practical advice and examples of how to create sites that everyone can use.\n\nBooks\n\n[#### What Can a Body Do? How We Meet the Built World](https://www.penguinrandomhouse.com/books/561049/what-can-a-body-do-by-sara-hendren/)\n\nSara Hendren\n\nA fascinating and provocative new way of looking at the things we use and the spaces we inhabit, and a call to imagine a better-designed world for us all.\n\nBooks\n\n[#### What Every Engineer Should Know About Digital Accessibility](https://www.routledge.com/What-Every-Engineer-Should-Know-About-Digital-Accessibility/Horton-Sloan/p/book/9781032263861)\n\nSarah Horton and David Sloan\n\nWhat Every Engineer Should Know About Digital Accessibility will prepare readers to integrate digital accessibility into their engineering practices. Readers will learn how to accurately frame accessibility as an engineering challenge so they are able to address the correct problems in the correct way.\n\n### Gaming\n\nResources for computer, console, and mobile gaming.\n\nGaming\n\n[#### Accessibility and video games: All ages gaming for people with disabilities](https://www.verizon.com/about/blog/video-game-accessibility)\n\nVerizon\n\nFor people living with disabilities, accessibility doesn’t just mean how reachable something is — oftentimes, the level of accessibility can define their ability to interact with and participate in certain activities or events, including entertainment.\n\nGaming\n\n[#### Gaming Accessibility Fundamentals Learning Path](https://docs.microsoft.com/en-us/gaming/accessibility/gaf-info)\n\nMicrosoft Xbox\n\nAn introductory course to accessibility in gaming and how to create inclusive gaming experiences.\n\nGaming\n\n[#### Can I Play That?](https://caniplaythat.com/)\n\nA centralized resource for game accessibility reviews and information.\n\nGaming\n\n[#### Accessible Games](https://accessible.games/)\n\nAbleGamers\n\nA resource for accessible player experiences and connecting with gamers with disabilities.\n\n### Newsletters\n\nGet the latest accessibility-related news delivered to your inbox.\n\nNewsletters\n\n[#### Accessible Mobile Apps Weekly](https://accessible-mobile-apps-weekly.ghost.io/)\n\nRobin Kanatzar\n\nNews from the accessibility community, links to developer tools and frameworks, and more.\n\nNewsletters\n\n[#### Accessibility Unlocked](https://tetralogical.com/newsletters/accessibility-unlocked/)\n\nTetraLogical\n\nA free six day newsletter series that covers who benefits from accessibility, and how you can start designing, building, measuring, testing, and managing accessibility.\n\nNewsletters\n\n[#### Accessibility Weekly](http://a11yweekly.com/)\n\nDavid A. Kennedy\n\nA weekly dose of web accessibility to help you bring it into your everyday work. Delivered to your inbox each Monday.\n\nNewsletters\n\n[#### Axess Lab Newsletter](https://axesslab.com/alt-texts#thanks-for-making-the-web-better)\n\nAxess Lab\n\nGet notified when we write new stuff\n\nNewsletters\n\n[#### Crip News](https://cripnews.substack.com/)\n\nKevin Gotkin\n\nDisability Thinking Weekday is an email newsletter for disabled people and others interested in disability issues, ideas, and culture.\n\nNewsletters\n\n[#### Disability Thinking Weekday](https://disabilitythinking.substack.com/)\n\nAndrew Pulrang\n\nA weekly roundup about disability arts and politics.\n\nNewsletters\n\n[#### Equal Entry Newsletter](https://equalentry.com/newsletter/)\n\nEqual Entry\n\nGet free tips to grow your accessibility knowledge delivered right to the comfort of your own inbox.\n\nNewsletters\n\n[#### Microassist](https://www.microassist.com/about/newsletter-subscriptions/)\n\nMicroassist\n\nStay up to date on learning and development, training opportunities, and accessibility news.\n\nNewsletters\n\n[#### Skip to Content](https://skiptocontent.huxleydigital.co.uk/)\n\nHuxley Digital\n\nYour online accessibility magazine.\n\nNewsletters\n\n[#### t12t Accessibility Newsletter](http://t12t.se/accessibility-newsletter/)\n\nt12t\n\nThe goal is to spread news, articles and tips regarding web accessibility. This will be more than a bunch of links in an email, there will be opinions.\n\nNewsletters\n\n[#### University of Minnesota Duluth Webdev Newsletter](http://www.d.umn.edu/itss/training/online/webdesign/webdev_listserv.html)\n\nLaura L. Carlson\n\nThe Web Design Update is a plain text email digest dedicated to disseminating news and information about web design and development with emphasis on elements of user experience, accessibility, web standards and more.\n\nNewsletters\n\n[#### WCAG of the Day](https://dwcag.org/)\n\nGrunet\n\nIt's like those “Word of the Day” email services, but for the Web Content Accessibility Guidelines (WCAG) instead. Each day it sends out a short summary of a different success criterion.\n\nNewsletters\n\n[#### The WebAIM Newsletter](https://webaim.org/newsletter/)\n\nWebAIM\n\nThe WebAIM newsletter is for people that are interested in receiving monthly news and updates on web accessibility issues. The newsletter will include featured articles, monthly tips, resources, and questions from WebAIM's discussion forum.\n\n### Podcasts\n\nListen to, or read the transcripts of people talking all about accessibility.\n\nPodcasts\n\n[#### 13 Letters](https://www.bemyeyes.com/podcasts-show/13-letters)\n\nBe My Eyes\n\nThe accessibility podcast.\n\nPodcasts\n\n[#### 061: Accessibility with Marcy Sutton](https://frontsidethepodcast.simplecast.fm/episodes/44c5e387/61-accessibility-with-marcy-sutton)\n\nThe Frontside Podcast\n\nMarcy Sutton is going to be talking with us a little bit about accessibility, both in the large and the small.\n\nPodcasts\n\n[#### #A11y Rules Podcast](https://a11yrules.com/)\n\nNicolas Steenhout\n\nConversations around web accessibility.\n\nPodcasts\n\n[#### #A11y Rules Soundbites](https://a11yrules.com/series/a11y-rules-soundbite/)\n\nNicolas Steenhout\n\nShort discussions with disabled people about the barriers they encounter on the web.\n\nPodcasts\n\n[#### a11y Cocktail](https://frontendhappyhour.com/episodes/a11y-cocktail/)\n\nFront End Happy Hour\n\nIn this episode, we have a special guest joining us to talk about digital accessibility, Jennison Asuncion who is a leader in the accessibility community and has a lot of information to help us improve our websites and applications be more accessible for all users.\n\nPodcasts\n\n[#### Accessibility a Developer's User Story](https://www.telerik.com/blogs/accessibility-developers-user-story)\n\nEat Sleep Code\n\nOn this episode of Eat Sleep Code, guest Elle Waters explains why accessibility is important in software development and what a developer’s responsibilities are when creating a product.\n\nPodcasts\n\n[#### Accessibility with Heydon Pickering](https://shoptalkshow.com/episodes/355/)\n\nShopTalk\n\nWe're chatting with Heydon Pickering about accessibility, using pre-built solutions past their best before date, everyone's varying degrees of proficiency, and whether accessibility is becoming second nature to more people.\n\nPodcasts\n\n[#### Accessibility with Nicolas Steenhout and Christopher Schmitt](https://shoptalkshow.com/episodes/367/)\n\nShopTalk\n\nWe're talking accessibility with Christopher and Nicolas from Knowbility. Does accessibility transcend the web? Is it discouraging how much work still needs to be done? How do we get people the skills needed to help with accessibility on the web? Should accessibility be a role in house? And is Javascript the enemy of accessibility?\n\nPodcasts\n\n[#### Accessibility is not a 'nice to have' – with Derek Featherstone](http://5by5.tv/bigwebshow/184)\n\nThe Big Web Show\n\nWhy do companies de-prioritize accessibility? Making a digital map accessible to the blind. Pros and cons of the straw test. Why simulating a disability is not the same as working with disabled people.\n\nPodcasts\n\n[#### Accessible Podcast](https://www.timothybuck.me/accessible-episode-archive)\n\nSteven Aquino and Timothy Buck\n\nAccessible is a fortnightly—episodes are released twice per month—podcast about accessibility in tech. Topics covered on the show are mostly Apple-centric but will span the tech industry at large where appropriate.\n\nPodcasts\n\n[#### Beyond Barriers](https://wallyax.com/beyond-barriers)\n\nWally\n\nWally teams up with accessibility experts across the content supply and the disabled community, to understand their insights on accessibility.\n\nPodcasts\n\n[#### Command Z Podcast - Episodio 86: Ivonne Acevedo | Accesibilidad sin barreras (Spanish)](https://podcasts.apple.com/us/podcast/episodio-86-ivonne-acevedo-accesibilidad-sin-barreras/id1464454956?i=1000514246627)\n\nIvonne Acevedo\n\nEscucha la importancia del diseño universal en proyectos arquitectónicos.Aprende sobre conceptos básicos de la accesibilidad digitalVisualiza como tú puedes aportar mediante tus diseños la accesibilidad y diversidad que todos necesitamos.\n\nPodcasts\n\n[#### Command Z Podcast - Episodio 77: Paula Goyanes | Accesibilidad & Development (Spanish)](https://podcasts.apple.com/us/podcast/episodio-77-paula-goyanes-accesibilidad-development/id1464454956?i=1000505332708)\n\nPaula Goyanes\n\nEscucha cómo crear diseños accesibles y cómo llevarlos a producción de una manera correcta. Aprende como el diseño y el development trabajan de la mano para crear experiencias accesibles.Conoce como hacer experiencias usables y accesibles incluso para motores de búsqueda y mejorar tu SEO.\n\nPodcasts\n\n[#### Command Z Podcast - Episodio 73: Adriana Mattei Sosa | Diseño Accesible](https://podcasts.apple.com/us/podcast/episodio-73-adriana-mattei-sosa-dise%C3%B1o-accesible/id1464454956?i=1000500357583)\n\nAdriana Mattei Sosa\n\nAprende sobre la diversidad de diseños del bastón, herramienta para personas con impedimento visual. Comprende cómo los diseñadores podemos crear experiencias inclusivas y centradas en el diseño universal. Escucha como la disciplina del diseño resuelve problemas que son desapercibidos ante la falta de educación y empatía hacia la comunidad con discapacidad.\n\nPodcasts\n\n[#### Document Accessibility Unraveled](https://www.accessibilitychecklists.com/)\n\nChad Chelius and Dax Castro\n\nJoin Chad Chelius and Dax Castro (CHAX) as they chat about important document accessibility topics, trends and maybe even complain a little now and again.\n\nPodcasts\n\n[#### Get Access with Aaron Cannon](https://reactpodcast.simplecast.fm/54)\n\nReact Podcast\n\nThis week, we talk accessibility pitfalls with Aaron Canon.\n\nPodcasts\n\n[#### InEx](https://inex.show/)\n\nMatthew May\n\nA show about inclusive design.\n\nPodcasts\n\n[#### Intro to Accessibility with Stephanie Slattery](https://www.codenewbie.org/podcast/intro-to-accessibility)\n\nCodeNewbie\n\nStephanie Slattery explains the 5 categories of disabilities, shows us how to implement suggestions from the Web Content Accessibility Guidelines, and shares why she’s so passionate about accessibility.\n\nPodcasts\n\n[#### The Neurodivergent Woman](https://www.ndwomanpod.com/)\n\nMonique Mitchelson and Michelle Livock\n\nA podcast for neurodivergent women, covering Autism to ADHD and everything in between. Monique and Michelle aim to educate and inspire women who think differently.\n\nPodcasts\n\n[#### Presentable 30: Accessibility is Social Justice](https://player.fm/series/presentable/presentable-30-accessibility-is-social-justice)\n\nPresentable\n\nThis week on the show, we talk to Laura Kalbag about her new book, Accessibility for Everyone. We discuss how digital products have an increasing mandate to be broadly usable by everyone in society, and what we can do to achieve better accessibility in our designs.\n\nPodcasts\n\n[#### Thisten](https://thisten.co/)\n\nThisten\n\nThisten is an audio-to-text platform, where transcripts are created and aggregated from podcasts for people to search, reference and discover.\n\n### Talks\n\nRecorded conference talks.\n\nTalks\n\n[#### A11ycasts with Rob Dodson](https://www.youtube.com/playlist?list=PLNYkxOF6rcICWx0C9LVWWVqvHlYJyqw7g)\n\nYouTube\n\nThe goal of A11ycasts is to teach developers how accessibility works all the way down at the platform level, while also demonstrating real world accessibility problems and solutions to fix them.\n\nTalks\n\n[#### A11YTalks](https://www.youtube.com/c/accessibilitytalks)\n\nYouTube\n\nYouTube livestreams about accessibility.\n\nTalks\n\n[#### Aaron Cannon, Blind Web Developer](https://vimeo.com/1157346)\n\nVimeo\n\nLDS Church (2007)\n\nTalks\n\n[#### Accessibility in the Age of Components - Ayesha Mazumdar](https://www.youtube.com/watch?v=U1th3Qs-E_A)\n\nYouTube\n\nReact Boston 2019\n\nTalks\n\n[#### Accessibility is My Favorite Part of the Platform](https://www.youtube.com/watch?v=2qjgxH384Nc)\n\nYouTube\n\nGoogle I/O (2016)\n\nTalks\n\n[#### Accessibility Mythbusting](http://vimeo.com/73913824)\n\nVimeo\n\nWDCNZ (2013)\n\nTalks\n\n[#### The Accessibility Panel](http://vimeo.com/73914110)\n\nVimeo\n\nWDCNZ (2013)\n\nTalks\n\n[#### Accessibility Talks](https://www.youtube.com/c/accessibilitytalks)\n\nYouTube\n\nMonthly online talks about accessibility.\n\nTalks\n\n[#### Advancing Web Accessibility with ChromeVox](https://www.youtube.com/watch?v=YyWu9HB9QtU)\n\nYouTube\n\nGoogle I/O (2013)\n\nTalks\n\n[#### Designing for Accessibility (Google I/O'19)](https://www.youtube.com/watch?v=guXNEcwg6os)\n\nYouTube\n\nHear from people who are working to make the world an easier place for those with disabilities.\n\nTalks\n\n[#### Garbage Pail Components: Marcy Sutton](https://youtu.be/MVzihFS1UQU)\n\nYouTube\n\nClarity (2019)\n\nTalks\n\n[#### HTML5 Accessibility (Steve Faulkner)](http://vimeo.com/77860167)\n\nVimeo\n\nParis Web (2013)\n\nTalks\n\n[#### How captions increase ROI and audience for media creators (Svetlana Kouznetsova)](https://www.youtube.com/watch?v=ngKp9MqUGj8)\n\nYouTube\n\nIf media and event producers want a larger audience, they need to consider making them accessible via high quality same language captions and transcripts. They are good for business and a necessity for millions of people. Auto captions are not the best accessibility practice, especially for professional content. You have the opportunity to learn firsthand from a deaf speaker in the 8-minute video that has English captions and subtitles in multiple languages.\n\nTalks\n\n[#### Introduction to Web Accessibility](https://mawconsultingllc.com/intro-to-web-accessibility/)\n\nDr. Michele A. Williams\n\nThis brief introductory video geared towards technology professionals provides a baseline understanding of the topic of Web and digital accessibility: designing, coding, and testing with users with disabilities in mind, including the diverse assistive technology and tools they may be using to engage with their computing devices.\n\nTalks\n\n[#### JavaScript and Civil Rights (Marcy Sutton)](https://www.youtube.com/watch?v=hUCOA338jwk)\n\nYouTube\n\nWeb Rebels (2017)\n\nTalks\n\n[#### Make Your Widgets Sing With ARIA](http://vimeo.com/73427435)\n\nVimeo\n\nWDCNZ (2013)\n\nTalks\n\n[#### Multi-device Accessibility (Alice Boxhall)](https://www.youtube.com/watch?v=E0ojKLzXoZ4)\n\nYouTube\n\nChrome Dev Summit (2013)\n\nTalks\n\n[#### PWAs in any context](https://www.youtube.com/watch?v=8dr_IUGwsO0)\n\nYouTube\n\nProgressive Web App Summit (2016)\n\nTalks\n\n[#### The rock'n'roll guide to ARIA and HTML5](http://www.youtube.com/watch?v=Fe1behOSjdU&list=PLb_ziuDPiUzZkc077IW3_rDcqX1OC8VbV&index=16)\n\nYouTube\n\nGenerate Conference (2013)\n\n## Tools\n\n### Bookmarklets\n\nSmall “micro apps” that live in your browser that you can activate to manipulate the current page or view.\n\nBookmarklets\n\n[#### 44x44 Pixel Cursor Bookmarklet](https://codepen.io/jared_w_smith/full/vYGXeMy)\n\nJared Smith\n\nA bookmarklet to make it easier to test WCAG’s Target Size and proposed Pointer Target Spacing requirements.\n\nBookmarklets\n\n[#### A11y Tools](https://a11y-tools.com/bookmarklets/)\n\nIan Lloyd\n\nA random collection of accessibility-focused tools that you might find at least partially useful.\n\nBookmarklets\n\n[#### Akbar](https://howlowck.github.io/Akbar/)\n\nHao Luo\n\nA bookmarklet that simulates various types user experiences.\n\nBookmarklets\n\n[#### ANDI](https://www.ssa.gov/accessibility/andi/help/howtouse.html)\n\nThe United States Social Security Administration\n\nThe Accessible Name and Description Inspector accessibility testing tool.\n\nBookmarklets\n\n[#### HTML\\_CodeSniffer](https://squizlabs.github.io/HTML_CodeSniffer/)\n\nSquiz\n\nCheck that your HTML code conforms to your coding standard.\n\nBookmarklets\n\n[#### Inaccessible Twitter](https://defaced.dev/tools/inaccessible-twitter/)\n\nChris Johnson\n\nCheck how accessible your Twitter media posts are.\n\nBookmarklets\n\n[#### Nu Markup Validation Service Bookmarklets](https://developer.paciellogroup.com/blog/2012/06/nu-markup-validation-service-bookmarklets/)\n\nTPGi\n\nThe W3C Nu Markup Validator checks the markup validity of Web documents, but instead uses the backend from the Validator.nu engine.\n\nBookmarklets\n\n[#### text spacing bookmarklet](https://cdpn.io/stevef/debug/YLMqbo)\n\nSteve Faulkner\n\nQuick and dirty testing of WCAG 2.1 Success Criterion 1.4.12 Text Spacing.\n\nBookmarklets\n\n[#### tota11y](http://khan.github.io/tota11y/)\n\nKhan Academy\n\nAn accessibility visualization toolkit.\n\nBookmarklets\n\n[#### The Visual ARIA Bookmarklet](http://whatsock.com/training/matrices/visual-aria.htm)\n\nWhatSock\n\nVisual ARIA allows engineers, testers, educators, and students to physically observe ARIA usage within web technologies.\n\n### Browser extensions\n\nSpecialized tools that augment your browser to augment and enhance your experience.\n\nBrowser extensions\n\n[#### Accessibility Insights](https://accessibilityinsights.io/)\n\nMicrosoft\n\nSolve accessibility issues before they reach your customers.\n\nBrowser extensions\n\n[#### ARC Toolkit](https://www.paciellogroup.com/toolkit/)\n\nTPGi\n\nARC Toolkit is a professional-level accessibility testing tool that gives you the power to quickly and efficiently evaluate screens for accessibility and uncover issues related to the WCAG 2.1 Level A and AA guidelines.\n\nBrowser extensions\n\n[#### ARIA DevTools](https://chromewebstore.google.com/detail/aria-devtools/dneemiigcbbgbdjlcdjjnianlikimpck)\n\nMateusz Zielinski\n\nEasily spot missing ARIA labels, misused ARIA roles, and incomplete keyboard support in your web applications.\n\nBrowser extensions\n\n[#### axe](https://www.deque.com/axe/)\n\nDeque\n\nThe world's leading digital accessibility toolkit - download as a browser extenion or on NPM. Chosen by Microsoft, Google, development and testing teams everywhere.\n\nBrowser extensions\n\n[#### axe beta](https://www.deque.com/axe/beta/)\n\nDeque\n\nAutomatically catch tons of accessibility bugs with axe. Catch even more with axe beta.\n\nBrowser extensions\n\n[#### ChromeVox (Classic)](https://chrome.google.com/webstore/detail/chromevox/kgejglhpjiefppelpmljglcjbhoiplfn)\n\nGoogle\n\nThe ChromeVox (Classic) screen reader is an extension to Chrome that brings the speed, versatility, and security of Chrome to visually impaired users.\n\nBrowser extensions\n\n[#### Color Blind & Low Vision Simulator](https://chromewebstore.google.com/detail/color-blind-low-vision-si/lgflijofdempkdlaknbfmacfidjjhjbb?pli=1)\n\nHomer Gaines\n\nThis vision simulator allows users to observe how people with colorblindness or low vision may perceive web-based content.\n\nBrowser extensions\n\n[#### Color Contrast Analyzer](https://chrome.google.com/webstore/detail/color-contrast-analyzer/dagdlcijhfbmgkjokkjicnnfimlebcll/related)\n\nNC State IT Accessibility\n\nAllows you to analyze text color contrast problems on a webpage according to the WCAG 2 text color contrast requirements.\n\nBrowser extensions\n\n[#### Dark Reader](https://darkreader.org/)\n\nDark Reader Ltd.\n\nThis eye-care extension enables night mode by creating dark themes for websites on the fly. Dark Reader inverts bright colors, making them high contrast and easy to read at night.\n\nBrowser extensions\n\n[#### Fix Contrast](https://fixa11y.com)\n\nFixa11y\n\nAutomatically fixes contrast issue on websites to a specifix contrast ratio.\n\nBrowser extensions\n\n[#### Fontonic - Change Fonts](https://chromewebstore.google.com/detail/hnjlnpipbcbgllcjgbcjfgepmeomdcog)\n\namkhrjee\n\nChange fonts of any website with your locally installed fonts!\n\nBrowser extensions\n\n[#### headingsMap](https://rumoroso.bitbucket.io/)\n\nRumoroso\n\nThe extension generates a documentmap or index of any web document structured with headings (you can access directly to the content by clicking on any of its items), and now, it shows the HTML 5 outline.\n\nBrowser extensions\n\n[#### IBM Equal Access Checker](https://www.ibm.com/able/toolkit/tools/#develop)\n\nIBM\n\nThe IBM Equal Access Accessibility Checker is an open source tool for web developers and auditors that utilizes IBM's accessibility rule engine, which detects accessibility issues for web pages and web applications. The extension integrates into the browser development tools, providing an integrated checking experience, helping users quickly identify the source of accessibility issues and try fixes.\n\nBrowser extensions\n\n[#### Landmarks](https://chrome.google.com/webstore/detail/landmark-navigation-via-k/ddpokpbjopmeeiiolheejjpkonlkklgp)\n\nMatthew Tylee Atkinson\n\nAllows you to navigate a web page via WAI-ARIA landmarks, using the keyboard or a pop-up menu.\n\nBrowser extensions\n\n[#### Midnight Lizard](https://midnight-lizard.org/)\n\nPavel Agarkov\n\nBrowser extension with custom color schemes for all websites.\n\nBrowser extensions\n\n[#### NerdeRegion](https://chromewebstore.google.com/detail/nerderegion/lkcampbojgmgobcfinlkgkodlnlpjieb)\n\nUgurcan (Ugi) Kutluoglu\n\nNerdeRegion is a developer tools extension for debugging live regions on a Web Page. When activated, it lists all active Aria live regions, and keeps a record of all mutations that has happened on the region.\n\nBrowser extensions\n\n[#### NoCoffee](https://addons.mozilla.org/en-US/firefox/addon/nocoffee/)\n\nEitan Isaacson\n\nNoCoffee can be helpful for understanding the problems faced by people with slight to extreme vision problems.\n\nBrowser extensions\n\n[#### No Target Blank](https://addons.mozilla.org/de/firefox/addon/no-target-blank/)\n\nMoritz Gießmann\n\nRemoves target='\\_blank' attributes from the websites you browse!\n\nBrowser extensions\n\n[#### openinthesametab](https://chromewebstore.google.com/detail/openinthesametab/lfpobllhlghoebgfogblmjpaobmoanfg)\n\nphpied.com\n\nSome sites annoyingly open links in new tabs. This extension lets you take back control.\n\nBrowser extensions\n\n[#### Silktide Accessibility Checker](https://chromewebstore.google.com/detail/silktide-accessibility-ch/mpobacholfblmnpnfbiomjkecoojakah)\n\nSilktide Ltd.\n\nTest your website against over 200 website accessibility checks with Silktide’s easy to understand accessibility checker.\n\nBrowser extensions\n\n[#### Skip to Landmarks and Headings](https://chrome.google.com/webstore/detail/skip-to-landmarks-and-hea/fjkpbfcodhflpdildjbmdhhmcoplghgf)\n\nNicholas Hoyt\n\nProvides keyboard access to landmark regions and headings (h1–h6) on a web page.\n\nBrowser extensions\n\n[#### Sound Pointer](https://chrome.google.com/webstore/detail/sound-pointer/ainiiiclibekafehinjoffjppjibgock)\n\nSimon Miner\n\nSound Pointer enables you to locate and follow the mouse pointer around your browser window with a sound that changes as you move your mouse.\n\nBrowser extensions\n\n[#### taba11y](https://chrome.google.com/webstore/detail/taba11y/aocppmckdocdjkphmofnklcjhdidgmga/)\n\nPeter Gould\n\ntaba11y calculates the tab order of all elements and displays it visually, either by drawing a path or by highlighting the elements.\n\nBrowser extensions\n\n[#### Text Spacing Editor](https://chrome.google.com/webstore/detail/text-spacing-editor/amnelgbfbdlfjeaobejkfmjjnmeddaoj/)\n\nzmrhal.j\n\nThis extension allows you to set custom values for the following text spacing properties: Line height, letter spacing, word spacing, and paragraph spacing.\n\nBrowser extensions\n\n[#### WAVE Evaluation Tool](https://chrome.google.com/webstore/detail/wave-evaluation-tool/jbbplnpkjmmeebjpijfedlgcdilocofh)\n\nWebAIM\n\nWAVE is a web accessibility evaluation tool developed by WebAIM. It provides visual feedback about the accessibility of your web content by injecting icons and indicators into your page.\n\nBrowser extensions\n\n[#### Web Disability Simulator](https://chrome.google.com/webstore/detail/web-disability-simulator/olioanlbgbpmdlgjnnampnnlohigkjla/)\n\nMetamatrix\n\nThe Web Disability Simulator lets you experience how people with different disabilities or inadequate abilities perceive a web site. Simulate color blindness, low vision, dyslexia and more.\n\n### Colors\n\nThese tools help you create, test for, and maintain accessible color contrast ratios.\n\nColors\n\n[#### a11y-contrast](https://github.com/darekkay/a11y-contrast)\n\nDarek Kay\n\nA CLI utility to calculate/verify accessible magic numbers for a color palette.\n\nColors\n\n[#### Accessible color palette builder](https://toolness.github.io/accessible-color-matrix/)\n\nAtul Varma\n\nAn Elm-based prototype to help designers build accessible color palettes.\n\nColors\n\n[#### Colorable](https://colorable.jxnblk.com/)\n\nBrent Jackson\n\nColor palette combination contrast tester\n\nColors\n\n[#### Color Safe](http://colorsafe.co/)\n\nDonielle Berg and Adrian Rapp\n\nEmpowering designers with beautiful and accessible color palettes based on WCAG Guidelines of text and background contrast ratios.\n\nColors\n\n[#### Colors: A11Y Stats](http://clrs.cc/a11y/)\n\nAdam Morse\n\nColors.css - A nicer color palette for the web.\n\nColors\n\n[#### Color & Contrast](https://colorandcontrast.com/)\n\nNate Baldwin\n\nA comprehensive guide for exploring and learning about the theory, science, and perception of color and contrast.\n\nColors\n\n[#### Color Contrast Checker](https://www.alarmsystem.no/color-contrast/)\n\nJosef Eines\n\nThis tool tests the contrast of a background color and foreground color for accessibility.\n\nColors\n\n[#### Colorblind Web Page Filter](https://www.toptal.com/designers/colorfilter/)\n\ntoptal\n\nUse the Colorblind Colorlab to select safe colors earlier in the design process.\n\nColors\n\n[#### Contrast Ratio](https://contrast-ratio.com/)\n\nLea Verou\n\nEasily calculate color contrast ratios. Passing WCAG was never this easy!\n\nColors\n\n[#### Contrast Tools](https://contrast.tools)\n\nProtean Studio\n\nTest the contrast of two colors to ensure high readability using both the Advanced Perception of Color Algorithm (APCA) and the classic contrast ratio.\n\nColors\n\n[#### Hex Naw](https://hexnaw.com/)\n\nThe Scenery\n\nHex Naw is a tool that helps designers and developers test entire color systems for contrast and accessibility. Plug in your palette or color system and let Hex Naw do the rest.\n\nColors\n\n[#### Pika](https://superhighfives.com/pika)\n\nSuper High Fives\n\nAn open-source colour picker app for macOS.\n\nColors\n\n[#### Tanaguru Contrast-finder](http://contrast-finder.tanaguru.com/)\n\nTanaguru\n\nFind good constrast for web accessibility between two colors.\n\nColors\n\n[#### We are Colorblind](http://wearecolorblind.com/)\n\nTom van Beveren and Kim van den Brink\n\nMaking the world a better place for the colorblind.\n\nColors\n\n[#### Who Can Use](https://whocanuse.com/)\n\nCorey Ginnivan\n\nA tool that brings attention and understanding to how color contrast can affect different people with visual impairments.\n\n### Development tools\n\nTools and resources for helping to develop with an accessible mindset.\n\nDevelopment tools\n\n[#### A11y Automation Tracker](https://a11y-automation.dev/)\n\nMelanie Sumner\n\nA more thorough way to track the potential accessibility violations and the automated linters and tests currently available.\n\nDevelopment tools\n\n[#### Accessify](https://www.accessify.com/)\n\nAccessify\n\nRun a free website performance test and get actionable tips on how to optimize it.\n\nDevelopment tools\n\n[#### Accessibility stats experiment](https://github-a11y-stats.netlify.app/)\n\nSarah Higley\n\nFind accessibility stats by github repository.\n\nDevelopment tools\n\n[#### AccessLint](https://www.accesslint.com/)\n\nAccessLint\n\nAccessLint is a GitHub App that finds accessibility issues in your pull requests.\n\nDevelopment tools\n\n[#### Ace, by DAISY](https://daisy.github.io/ace/)\n\nThe DAISY Consortium\n\nAce, the Accessibility Checker for EPUB, is a tool developed by the DAISY Consortium to assist with the evaluation of accessibility features of EPUB publications.\n\nDevelopment tools\n\n[#### ally.js](http://allyjs.io/)\n\nRodney Rehm\n\nA JavaScript library to help modern web applications with accessibility concerns by making accessibility simpler.\n\nDevelopment tools\n\n[#### a11yTools Extension for Safari macOS](http://pauljadam.com/extension.html)\n\nPaul J. Adam\n\na11yTools is a collection of HTML Web Accessibility Testing Tools in one location in an Extension for Safari used for quick and easy Accessibility testing.\n\nDevelopment tools\n\n[#### a11yTools iOS - Web Accessibility Testing Tool](http://pauljadam.com/extension.html)\n\nPaul J. Adam\n\na11yTools is a collection of HTML Web Accessibility Testing Tools in one location on your iPhone and iPad for quick and easy Accessibility testing.\n\nDevelopment tools\n\n[#### Accessibility Management Platform (AMP)](https://www.levelaccess.com/solutions/software/amp/)\n\nLevel Access\n\nAMP’s powerful testing engine and work flow, accessible development best practices and extensive training course library allow organizations to quickly and efficiently incorporate accessibility compliance into existing development processes.\n\nDevelopment tools\n\n[#### ARC](https://www.paciellogroup.com/products/accessibility-resource-center-arc/)\n\nTPGi\n\nAutomated testing that looks for machine-detectable accessibility defects within digital content.\n\nDevelopment tools\n\n[#### axe-core](https://github.com/dequelabs/axe-core)\n\nDeque Labs\n\nAccessibility engine for automated Web UI testing.\n\nDevelopment tools\n\n[#### Atom: web-accessibility-checker](https://atom.io/packages/web-accessibility-checker)\n\nMichael Weber\n\nWeb Accessibility checker which evaluate some defined WCAG rules instantly during coding or on command.\n\nDevelopment tools\n\n[#### Atom: accessibility-snippets](https://atom.io/packages/accessible-snippets)\n\nsilviasusai\n\nSnippets that include all WAI-ARIA attributes and descriptions, for ease of use in building more accessible web content.\n\nDevelopment tools\n\n[#### Be Inclusive](https://beinclusive.app/)\n\nBe Inclusive\n\nBe Inclusive is a web app that helps you define, track, and share web accessibility audits.\n\nDevelopment tools\n\n[#### Bootstrap accessibility plugin](https://paypal.github.io/bootstrap-accessibility-plugin/)\n\nPayPal\n\nBootstrap Accessibility Plugin is an extension for the Bootstrap 3 web development framework that makes many of the components of this library accessible for keyboard and screen reader users.\n\nDevelopment tools\n\n[#### Chart2Music](https://www.chart2music.com)\n\nA javascript library that makes it easy to generate interactive sonifications, so that you can make your charts, graphs, and other data visualizations accessible to screen reader users.\n\nDevelopment tools\n\n[#### Guidepup](https://github.com/guidepup/guidepup/)\n\nCraig Morten\n\nScreen reader driver for test automation.\n\nDevelopment tools\n\n[#### Pa11y](http://pa11y.org/)\n\nPa11y\n\nPa11y is your automated accessibility testing pal.\n\nDevelopment tools\n\n[#### Polypane](https://polypane.com/)\n\nPolypane\n\nPolypane is a cross-platform desktop browser that comes with extensive accessibility tooling: an accessibility checker, 19 different visual impairment simulators, color contrast checking, heading, links and image checking, focus order visualisation, horizontal overflow detection and more, showing improvement suggestions where possible.\n\nDevelopment tools\n\n[#### Sa11y](https://sa11y.netlify.app/)\n\nToronto Metropolitan University\n\nSa11y is an accessibility quality assurance tool that visually highlights common accessibility and usability issues. Geared towards content authors, Sa11y indicates errors or warnings at the source with a simple tooltip on how to fix.\n\nDevelopment tools\n\n[#### Sublime WAI-ARIA Package](https://packagecontrol.io/packages/WAI-ARIA)\n\nIndrek Paas\n\nWAI-ARIA Roles, States and Properties auto-completion for Sublime Text.\n\n### Screen readers\n\nInformation about screen reading assistive technology.\n\nScreen readers\n\n[#### Android Accessibility Suite](https://play.google.com/store/apps/details?id=com.google.android.marvin.talkback)\n\nGoogle\n\nAndroid Accessibility Suite is a collection of accessibility services that help you use your Android device eyes-free or with a switch device.\n\nScreen readers\n\n[#### Assistiv Labs](https://assistivlabs.com/)\n\nWeston Thayer\n\nInstantly test how accessible your experience is with the real assistive technologies your disabled users rely on — screen readers, magnifiers, and more — from any computer.\n\nScreen readers\n\n[#### Job Access With Speech (JAWS)](https://www.freedomscientific.com/Products/Blindness/JAWS)\n\nFreedom Scientific\n\nJAWS is the world's most popular screen reader, developed for computer users whose vision loss prevents them from seeing screen content or navigating with a mouse.\n\nScreen readers\n\n[#### NonVisual Desktop Access](https://www.nvaccess.org/)\n\nNV Access\n\nNonVisual Desktop Access (NVDA) is a free, open-source, portable screen reader for Microsoft Windows.\n\nScreen readers\n\n[#### Orca](https://wiki.gnome.org/Projects/Orca)\n\nThe GNOME Project\n\nOrca is a free and open-source, flexible, extensible screen reader from the GNOME project for individuals who are blind or visually impaired.\n\nScreen readers\n\n[#### VoiceOver (iOS)](https://www.apple.com/accessibility/iphone/vision/)\n\nApple\n\nVoiceOver is a gesture-based screen reader that lets you enjoy using iPhone even if you don’t see the screen.\n\nScreen readers\n\n[#### VoiceOver (macOS)](https://www.apple.com/accessibility/mac/vision/)\n\nApple\n\nVoiceOver gives you auditory descriptions of each onscreen element and provides helpful hints along the way.\n\n### Vision simulators\n\nVision simulators can be used to help you get an idea of how a low vision situation may appear.\n\nVision simulators\n\n[#### Color Oracle](http://colororacle.org/)\n\nBernie Jenny\n\nColor Oracle takes the guesswork out of designing for color blindness by showing you in real time what people with common color vision impairments will see.\n\nVision simulators\n\n[#### Contrast](https://usecontrast.com/)\n\nNothing Magical, Inc.\n\nA macOS app for quick access to WCAG color contrast ratios\n\nVision simulators\n\n[#### Colour Contrast Analyser](https://developer.paciellogroup.com/resources/contrastanalyser/)\n\nTPGi\n\nThe Colour Contrast Analyser (CCA) helps you determine the legibility of text and the contrast of visual elements, such as graphical controls and visual indicators.\n\nVision simulators\n\n[#### Sim Daltonism](https://michelf.ca/projects/sim-daltonism/)\n\nMichel Fortin\n\nSim Daltonism lets you visualize colors as they are perceived with various types of color blindness.\n\n## Education\n\n### Blogs\n\nOther accessibility-focused websites to read and learn from.\n\nBlogs\n\n[#### #a11y tag on The Practical Dev](https://dev.to/t/a11y)\n\nWhere programmers share ideas and help each other grow.\n\nBlogs\n\n[#### 24 Accessibility](https://www.24a11y.com/)\n\n24 days of digital accessibility gifts during the season of giving and sharing.\n\nBlogs\n\n[#### 456 Berea Street](https://www.456bereastreet.com/)\n\nArticles and news on web standards, accessibility, and usability.\n\nBlogs\n\n[#### a11yTips](http://dboudreau.tumblr.com/)\n\nSimple tips on making web content more accessible to all.\n\nBlogs\n\n[#### Accessibility Made Easy](https://www.accessibilityeasy.com/blog)\n\nAccessibility Made Easy is a not-for-profit who’s aim is to create a more accessible world. We believe that every person, no matter the ability or environment, should be able to access the same information as everyone else.\n\nBlogs\n\n[#### Accessibility Matters](https://www.a11ymatters.com/)\n\nDocumenting everything through the journey of learning web accessibility.\n\nBlogs\n\n[#### Accessible Culture](http://www.accessibleculture.org/)\n\nPromoting a culture of inclusion through the research and application of web accessibility and standards.\n\nBlogs\n\n[#### Accessibility Wins](https://a11ywins.tumblr.com/)\n\nShowcasing accessible user interfaces and tools.\n\nBlogs\n\n[#### Alicia Jarvis' Inclusive Design Blog](https://www.alicia.design/writing)\n\nHi, I’m Alicia. I'm a diversity, equity and inclusion strategist, researcher, and culture consultant based in Toronto.\n\nBlogs\n\n[#### Level Access Blog](https://www.levelaccess.com/blog/)\n\nFind out what’s happening in the world of accessible design, Level Access’ team updates, and better practices for an accessible web.\n\nBlogs\n\n[#### Blog - Karl Groves](https://karlgroves.com/category/professional/accessibility/)\n\nKarl Groves' web accessibility blog\n\nBlogs\n\n[#### Inclusive Components](https://inclusive-components.design/)\n\nA blog trying to be a pattern library. All about designing inclusive web interfaces, piece by piece.\n\nBlogs\n\n[#### Deque Blog](https://www.deque.com/blog/)\n\nStay up to date on all things accessibility\n\nBlogs\n\n[#### Low Visionary](http://www.lowvisionary.com/)\n\nA blog by Robyn Hunt\n\nBlogs\n\n[#### TPGi Blog](https://developer.paciellogroup.com/blog/)\n\nA blog about accessibility written by the TPGi's employees.\n\nBlogs\n\n[#### WebAIM Blog](https://webaim.org/blog/)\n\nA blog about accessibility written by WebAIM's employees.\n\nBlogs\n\n[#### Web Axe](http://www.webaxe.org/)\n\nBlog and podcast on web accessibility.\n\n### Community help\n\nOther internet groups where you can find accessibility help and support.\n\nCommunity help\n\n[#### Search for 'accessibility' on Accessify.com](http://www.accessify.com/search?q=accessibility)\n\nQuestions and Answers by Accessify: Browse through our database of popular questions to find the best answers ever posted by other people.\n\nCommunity help\n\n[#### Anybody can be an A11y Slacker](https://www.tpgi.com/anybody-can-be-an-a11y-slacker/)\n\nInformation on the web-a11y Slack group.\n\nCommunity help\n\n[#### CivicActions Accessibility Practice Area Site](https://accessibility.civicactions.com/)\n\nAn open project by the CivicActions team to foster more digital inclusion. This site focuses on open source approaches and builds on global best practices, particularly with government IT.\n\nCommunity help\n\n[#### Eleventy WCAG Reporter](https://github.com/hidde/eleventy-wcag-reporter#wcag-reporter)\n\nThis repository lets you create WCAG EM Reports using Eleventy.\n\nCommunity help\n\n[#### The most insightful stories about Web Accessibility – Medium](https://medium.com/tag/web-accessibility)\n\nContent tagged with 'accessibility'.\n\nCommunity help\n\n[#### Newest 'accessibility' Questions - User Experience Stack Exchange](http://ux.stackexchange.com/questions/tagged/accessibility)\n\nContent tagged with 'accessibility'.\n\nCommunity help\n\n[#### Newest 'accessibility' Questions - Stack Overflow](http://stackoverflow.com/questions/tagged/accessibility)\n\nContent tagged with 'accessibility'.\n\nCommunity help\n\n[#### Search for 'a11y' on Meetup.com](http://www.meetup.com/find/?allMeetups=false&keywords=a11y&radius=Infinity&sort=recommended&eventFilter=mysugg)\n\nFind Meetups so you can do more of what matters to you.\n\nCommunity help\n\n[#### Web Accessibility Guidebook for Developers - Telerik](https://www.telerik.com/blogs/web-accessibility-guidebook-for-developers)\n\nWith this article, our goal is to introduce fellow engineers, regardless of level, to web accessibility and share our practical knowledge and best practices.\n\nCommunity help\n\n[#### WebAIM Web Accessibility E-mail Discussion List](http://webaim.org/discussion/)\n\nThe WebAIM web accessibility mailing list is for anyone interested in discussing web accessibility issues. Individuals from all organizations and specialties are encouraged to join.\n\n### Courses\n\nClasses you can take to learn all about accessible digital design and development.\n\nCourses\n\n[#### Accessibility Courses](https://github.com/accessibility/a11y-courses)\n\nMike Gifford\n\nCourses, webinars, educational videos, and more, offered in web accessibility.\n\nCourses\n\n[#### Accessibility fundamentals](https://docs.microsoft.com/en-us/learn/paths/accessibility-fundamentals/)\n\nMicrosoft\n\nTechnology can empower people to achieve more, help strengthen education opportunities, and make the workplace more inviting and inclusive for people with disabilities.\n\nCourses\n\n[#### Get Started with Web Accessibility](https://trailhead.salesforce.com/en/content/learn/trails/get-started-with-web-accessibility)\n\nSalesforce Trailhead\n\nLearn what accessibility is and how to make websites and apps accessible to people with disabilities.\n\nCourses\n\n[#### Introduction To Accessibility Testing](https://www.ministryoftesting.com/dojo/courses/introduction-to-accessibility-testing)\n\nMinistry of Testing\n\nLearn with me about what Accessibility is, why it's important to test for and how to get your team started with an Accessibility testing mindset.\n\nCourses\n\n[#### Introduction to Web Accessibility](https://www.edx.org/course/web-accessibility-introduction)\n\nedX and the W3C\n\nGet a strong foundation in digital accessibility to make your websites and apps work well for people with disabilities, meet international standards, and provide a better user experience for everyone.\n\nCourses\n\n[#### Learn Accessibility](https://web.dev/learn/accessibility/)\n\nweb.dev\n\nAn evergreen accessibility course and reference to level up your web development.\n\nCourses\n\n[#### Practical Accessibility](https://practical-accessibility.today/)\n\nSara Soueidan\n\nA self-paced, get-right-down-to-it online video course for web designers and developers who want to start creating more accessible websites and applications today.\n\nCourses\n\n[#### Start Building Accessible Web Applications Today](https://egghead.io/courses/start-building-accessible-web-applications-today)\n\negghead.io\n\nThis course will introduce you to accessibility through hands-on, technical examples that are way more effective than reading 10-year-old static web content.\n\nCourses\n\n[#### Take 5 - Ethan Marcotte](https://ethanmarcotte.com/wrote/takin-five/)\n\nAquent Gymnasium\n\nA series of five 5-minute tutorial videos hosted by Aquent Gymnasium that deal with introductory accessibility topics.\n\nCourses\n\n[#### Testing Accessibility](https://testingaccessibility.com/)\n\nMarcy Sutton\n\nA self-paced workshop designed to teach you the principles and effective patterns of accessibility, from design to deployment.\n\nCourses\n\n[#### The A11Y Collective](https://a11y-collective.com/)\n\na11y-collective.com\n\nThe A11Y Collective is the e-learning platform for anyone who wants to learn more about web accessibility. The courses focus mostly on knowledge and skills that are valuable for web designers, developers, webmasters, product owners and web editors.\n\nCourses\n\n[#### Thinking about Digital Accessibility: From Ally to Advocate](https://www.everand.com/book/527830515/Thinking-about-Digital-Accessibility-From-Ally-to-Advocate)\n\nH. Robert King\n\nIn this book, we explore what digital accessibility is, how it is integrated with common functional roles, such as content writer, user experience designer, or engineer, and how it grows as the knowledge and skill of an individual develops, answering the question “how do I get there from here”.\n\nCourses\n\n[#### Web Accessibility by Google](https://www.udacity.com/course/web-accessibility--ud891)\n\nUdacity\n\nIn this course you’ll get hands-on experience making web applications accessible.\n\n### Design and user experience\n\nInformation for how to create accessible digital designs.\n\nDesign and user experience\n\n[#### 7 Things Every Designer Needs to Know about Accessibility](https://medium.com/salesforce-ux/7-things-every-designer-needs-to-know-about-accessibility-64f105f0881b)\n\nJesse Hausler\n\nAccessibility enables people with disabilities to perceive, understand, navigate, interact with, and contribute to the web. Imagine a world where developers know everything there is to know about accessibility. You design it and they build it… perfectly. In this world, only the design itself can cause people with disabilities to have trouble using a product.\n\nDesign and user experience\n\n[#### A11y Annotation Kit](https://www.figma.com/community/file/953682768192596304)\n\nStephanie Hagadorn\n\nWe use this library at Indeed to help designers document accessibility considerations to share with developers when handing off designs.\n\nDesign and user experience\n\n[#### Accessible UI Components For The Web](https://medium.com/@addyosmani/accessible-ui-components-for-the-web-39e727101a67)\n\nAddy Osmani\n\nTo be accessible, UI components need to work across multiple devices with varying screen-sizes and different kinds of input. Moreover, components should be usable by the broadest group of users, including those with disabilities.\n\nDesign and user experience\n\n[#### Accessible Usability Scale (AUS)](https://makeitfable.com/accessible-usability-scale/)\n\nFable\n\nThe Accessible Usability Scale (AUS) is a free tool to measure the usability of a digital product for assistive technology users. Inspired by the System Usability Scale (SUS), the Accessible Usability Scale consists of ten questions administered at the end of a user experience to calculate a score.\n\nDesign and user experience\n\n[#### Accessibility guidelines for UX Designers](https://uxdesign.cc/accessibility-guidelines-for-a-ux-designer-c3ba775539be)\n\nAvinash Kaur\n\nAs a UX designer, it is important to build empathy and celebrate accessibility requirements as a set of design constraints to build a better product.\n\nDesign and user experience\n\n[#### Chartability](https://chartability.fizz.studio/)\n\nFizz Studio\n\nChartability is a set of heuristics (testable questions) for ensuring that data visualizations, systems, and interfaces are accessible.\n\nDesign and user experience\n\n[#### A Designer’s Guide to Documenting Accessibility & User Interactions](https://stephaniewalter.design/blog/a-designers-guide-to-documenting-accessibility-user-interactions/)\n\nStéphanie Walter\n\nGreat documentation helps teams implement accessibility requirements the right way. I will tell you why, what and how designers can document different aspects of accessibility and user interactions requirements, to build better more inclusive products.\n\nDesign and user experience\n\n[#### Disabled And Here](https://affecttheverb.com/disabledandhere/)\n\nAffect the Verb\n\nDisabled And Here is a stock image and interview series celebrating disabled Black, Indigenous, people of color (BIPOC).\n\nDesign and user experience\n\n[#### Designing for accessibility is not that hard](https://uxdesign.cc/designing-for-accessibility-is-not-that-hard-c04cc4779d94)\n\nPablo Stanley\n\nSeven easy-to-implement guidelines to design a more accessible web.\n\nDesign and user experience\n\n[#### Ethical Design Guide](https://ethicaldesign.guide/)\n\nSarah Fossheim\n\nEthical Design Guide is made to share resources on how to create ethical products that don't cause harm.\n\nDesign and user experience\n\n[#### Information on different types of people for graphic communication, website and information designers including free reusable infographic](https://medium.com/@user_design/information-on-different-types-of-people-for-graphic-communication-website-and-information-4b6454905bb1)\n\nThomas Bohm\n\nHow can we include as many people as possible when designing graphic communication and information, and how do we not unnecessarily exclude people?\n\nDesign and user experience\n\n[#### Neurodiversity Design System](https://www.neurodiversity.design/)\n\nWill Soward\n\nThe NDS is a coherent set of standards and principles that combine neurodiversity and user experience design for Learning Management Systems.\n\nDesign and user experience\n\n[#### UX Myths](https://uxmyths.com/)\n\nZoltán Gócza and Zoltán Kollin\n\nUX Myths collects the most frequent user experience misconceptions and explains why they don't hold true.\n\nDesign and user experience\n\n[#### WCAG for designers](https://gerireid.com/wcag-for-designers.html)\n\nGeri Reid\n\nHere's a checklist I'm working on to help ensure the products I design comply with the Web Content Accessibility Guidelines (WCAG).\n\n### Screen reader help\n\nHelp about screen reading assistive technology.\n\nScreen reader help\n\n[#### Basic screen reader commands for accessibility testing](https://developer.paciellogroup.com/blog/2015/01/basic-screen-reader-commands-for-accessibility-testing/)\n\nTPGi\n\nWhen you test your website with a screen reader there are a few basic commands you should know.\n\nScreen reader help\n\n[#### How to start testing screen reader support using VoiceOver](https://yakim.nl/articles/voiceover-testing/)\n\nYakim van Zuijlen\n\nThis article explains why you should be testing your content with a screen reader. It also gives a visual guide on how to use VoiceOver on macOS\n\nScreen reader help\n\n[#### The Importance Of Manual Accessibility Testing](https://knowbility.org/blog/2018/keyboard-testing-basics/)\n\nSmashing Magazine\n\nAutomated accessibility tests are a great resource to have, but they can’t automatically make your site accessible. Use them as one step of a larger testing process.\n\nScreen reader help\n\n[#### Keyboard Testing Basics](https://knowbility.org/blog/2018/keyboard-testing-basics/)\n\nKnowbility\n\nKeyboard testing is one of the most efficient, impactful, and easy tasks that any team member can do to find accessibility issues.\n\nScreen reader help\n\n[#### Testing with Screen Readers](https://webaim.org/articles/screenreader_testing/)\n\nWebAIM\n\nAnswers to common questions.\n\n### Typography\n\nGood typography is an important part of an accessible digital experience.\n\nTypography\n\n[#### Designing Accessible Content: Typography, Font Styling, and Structure](https://axesslab.com/fonts-dont-matter/)\n\nEnvato Tuts+\n\nCreating and designing accessible content means more than just choosing accessible typography. Even with “perfect” font families in place on your website, people with low vision, cognitive, language, and learning disabilities may still struggle to process the text.\n\nTypography\n\n[#### Fonts don’t matter](https://axesslab.com/fonts-dont-matter/)\n\nAxess Lab\n\nIf you’re an art director or font fanatic, you might want to sit down for this. Take a few deep breaths. Go to your happy place. Because I’m going to explain why fonts are overrated and what actually matters for readability.\n\nTypography\n\n[#### Letter and symbol misrecognition in highly legible typefaces for general, children, dyslexic, visually impaired and ageing readers](https://typography.guru/journal/letters-symbols-misrecognition/)\n\nThomas Bohm\n\nThis paper identifies easily misrecognised letters and symbols in highly legible typefaces for general, children, dyslexic, visually impaired and ageing readers. It can also be considered as a review of related research in this area.\n\n## Subject matter\n\n### Animation\n\nResponsible animation only starts when requested, can be paused, and avoids using known seizure and migraine triggers.\n\nAnimation\n\n[#### Photosensitive Epilepsy Analysis Tool](https://trace.umd.edu/peat)\n\nUniversity of Maryland Trace Research and Development Center\n\nThe Trace Center's Photosensitive Epilepsy Analysis Tool (PEAT) is a free, downloadable resource for developers to identify seizure risks in their web content and software.\n\n### Email\n\nLearn about how to make your email accessible.\n\nEmail\n\n[#### accessible-email.org](https://www.accessible-email.org/)\n\naccessible-email.org\n\nIt is the mission of Accessible-email.org to promote email marketing accessibility and usability.\n\nEmail\n\n[#### Accessibility and Inclusion with the World’s Most Popular Communication Tool: Email](https://www.24a11y.com/2018/accessibility-and-inclusion-with-email/)\n\n24 Accessibility\n\nSome best practices on creating more accessible and inclusive email campaigns, routinely ranked as one of the world’s most valuable marketing channels, yet very little work has been done to make it more accessible for under-represented groups.\n\nEmail\n\n[#### Accessibility in Email Marketing](https://mailchimp.com/help/accessibility-in-email-marketing/)\n\nMailChimp\n\nAccessibility is a term that gets thrown around a lot in web design, but what does it mean for email marketing? It comes down to some simple changes you can make in your content to remove barriers for subscribers with disabilities.\n\nEmail\n\n[#### A Beginner’s Guide to Email Accessibility (Checklist + Resources)](https://webdesign.tutsplus.com/tutorials/a-beginners-guide-to-email-accessibility--cms-31240)\n\nEnvato Tuts+\n\nThis guide will walk you through a checklist of over thirty improvements you can make to your emails to make sure they’re as accessible as possible.\n\nEmail\n\n[#### Email Accessibility Best Practices](https://www.emailonacid.com/blog/article/email-development/email-accessibilty-in-2017/)\n\nEmail on Acid\n\nWe’re passionate about helping email developers and marketers create and send emails that every subscriber can read and understand, regardless of whether they have a visual impairment or disability.\n\nEmail\n\n[#### The Ultimate Guide to Accessible Emails](https://litmus.com/blog/ultimate-guide-accessible-emails)\n\nLitmus\n\nIt only takes a few small steps to make your emails more accessible for all of your subscribers. In this post, we’ll discuss what those steps are and how they can make email better for everyone.\n\n### HTML and ARIA\n\nWell-structured, semantic HTML is the foundation of an accessible web experience. ARIA can help make interactive web experiences accessible.\n\nHTML and ARIA\n\n[#### a11ysupport.io](https://a11ysupport.io/)\n\nMichael Fairchild\n\nWill your code work with assistive technologies?\n\nHTML and ARIA\n\n[#### Accessible Rich Internet Applications (WAI-ARIA) 1.1](https://www.w3.org/TR/wai-aria/)\n\nW3C\n\nAccessibility of web content requires semantic information about widgets, structures, and behaviors, in order to allow assistive technologies to convey appropriate information to persons with disabilities.\n\nHTML and ARIA\n\n[#### HTML5 Accessibility](http://www.html5accessibility.com/)\n\nSteve Faulkner\n\nGet the current accessibility support status of HTML5 features across major browsers\n\nHTML and ARIA\n\n[#### Periodic Table of ARIA 1.0 Roles](https://dylanb.github.io/periodic-aria-roles.html)\n\nDylan Barrell\n\nARIA 1.0 Roles displayed in the style of the periodic table of elements.\n\nHTML and ARIA\n\n[#### WAI-ARIA Authoring Practices 1.1](https://www.w3.org/TR/wai-aria-practices/)\n\nW3C\n\nThis document provides readers with an understanding of how to use WAI-ARIA 1.1 to create accessible rich internet applications.\n\nHTML and ARIA\n\n[#### Web Accessibility Tutorials](https://www.w3.org/WAI/tutorials/)\n\nW3C\n\nThis collection of tutorials shows you how to develop web content that is accessible to people with disabilities, and that provides a better user experience for everyone.\n\n### Images and icons\n\nImages and icons can help draw a reader in and communicate functionality and abstract concepts.\n\nImages and icons\n\n[#### Accessible SVGs](https://css-tricks.com/accessible-svgs/)\n\nCSS-Tricks\n\nScalable Vector Graphic (SVG) is emerging as the preferred graphic format to use on the web today. Are you abandoning the icon font or replacing old pg, gif and png graphics for the well-supported SVG, too? Let’s see how this will impact users of assistive technology (AT) and what is needed in order to ensure a great user experience for everyone.\n\nImages and icons\n\n[#### Accessible SVG Icons with Inline Sprites](https://www.24a11y.com/2018/accessible-svg-icons-with-inline-sprites/)\n\n24 Accessibility\n\nMarco Hengstenberg visits the practice of using SVG icons with inline sprites, and how to ensure these icons are accessible.\n\nImages and icons\n\n[#### Alternative Text](https://webaim.org/techniques/alttext/)\n\nWebAIM\n\nAdding alternative text for images is the first principle of web accessibility. It is also one of the most difficult to properly implement.\n\nImages and icons\n\n[#### Alt-texts: The Ultimate Guide](https://axesslab.com/alt-texts/)\n\nAxxess Lab\n\nThis post contains everything you need to know about alt-texts! When to use them and how to perfectly craft them.\n\nImages and icons\n\n[#### An alt Decision Tree](https://www.w3.org/WAI/tutorials/images/decision-tree/)\n\nW3C\n\nThis decision tree describes how to use the <code>alt</code> attribute of the <code>&lt;img&gt;</code> element in various situations. For some types of images, there are alternative approaches, such as using CSS background images for decorative images or web fonts instead of images of text.\n\nImages and icons\n\n[#### An Alt Text Primer](https://knowbility.org/blog/2019/an-alt-text-primer/)\n\nKnowbility\n\nAn image, they say, is worth a thousand words. Unless you can’t perceive images. This is why the alt attribute for images on the web is so important.\n\nImages and icons\n\n[#### Considerations when writing alt text](https://ux.shopify.com/considerations-when-writing-alt-text-a9c1985a8204)\n\nScott Vinkle\n\nFind out what alt text is, why it’s so important, and how to write content for your images.\n\nImages and icons\n\n[#### Creating Accessible SVGs](https://www.deque.com/blog/creating-accessible-svgs/)\n\nDeque\n\nScalable Vector Graphics (SVGs) have been around since 1999, but they have seen a real resurgence in use as design interactions have become more complex and CSS/JavaScript have replaced antiquated animation programs such as Adobe Flash.\n\nImages and icons\n\n[#### How To Describe Images](https://poet.diagramcenter.org/how.html)\n\nPoet Training Tool\n\nThe Poet Training Tool is a web based image description resource that helps people learn when and how to describe various types of images frequently found in educational books.\n\n### Mobile apps\n\nUnlike websites and web apps, mobile apps need to be installed on the device they're used on. They have some different requirements to ensure they're accessible.\n\nMobile apps\n\n[#### Android Accessibility by Tutorials](https://www.raywenderlich.com/books/android-accessibility-by-tutorials)\n\nVictoria Gonda\n\nLearn to build accessible apps on Android using WCAG through hands-on, step-by-step tutorials.\n\nMobile apps\n\n[#### iOS Accessibility: Getting Started](https://www.raywenderlich.com/6827616-ios-accessibility-getting-started)\n\nFayyazuddin Syed\n\nIn this iOS accessibility tutorial, learn how to make apps more accessible using VoiceOver and the Accessibility inspector.\n\nMobile apps\n\n[#### Mobile A11y](https://mobilea11y.com/)\n\nRob Whitaker\n\nMobile A11y is a collection of blogs and resources about how we as mobile developers can improve accessibility on mobile devices.\n\n### PDFs\n\nAdobe's PDF file format needs special considerations to ensure it can work with assistive technology.\n\nPDFs\n\n[#### AcceDe PDF Project](https://www.pdf-accessible.com/en/)\n\nAcceDe\n\nThe aim of this guide is to provide all the practical information you need to learn how to tag a PDF document.\n\nPDFs\n\n[#### Create and verify PDF accessibility (Acrobat Pro)](https://helpx.adobe.com/acrobat/using/create-verify-pdf-accessibility.html)\n\nAdobe\n\nAcrobat tools make it easy to create accessible PDFs and check the accessibility of existing PDFs. You can create PDFs to meet common accessibility standards, such as Web Content Accessibility Guidelines (WCAG) 2.0 and PDF/UA (Universal Access, or ISO 14289).\n\nPDFs\n\n[#### PDF Tagging and Reading Order (eight-part series on PDF accessibility)](https://commonlook.com/pdf-tagging-and-reading-order/)\n\nCommonLook\n\nMaking sure that PDFs are accessible to everyone, including those using assistive technologies like screen readers, refreshable braille displays, screen magnifiers, etc., can be a daunting technical process. In this article, we’ll address two basic PDF accessibility concepts – tagging and reading order. Then, in subsequent articles, we’ll address more specific topics in PDF accessibility.\n\nPDFs\n\n[#### PDF accessibility introduction](https://pragmaticaccess.com/articles/2019-05-30-pdf-accessibility-introduction)\n\nPragmatic Access\n\nAlthough web accessibility is most commonly thought of when talking about digital accessibility, document accessibility also plays an important role. Document formats such as Word, PowerPoint, Excel, ePub, and most commonly PDF, are quite common and are usually linked within web pages or sent via email. As such, it’s important to make sure that those documents are accessible as well.\n\nPDFs\n\n[#### WebAIM: PDF Accessibility](https://webaim.org/techniques/acrobat/)\n\nWebAIM\n\nDefining Acrobat PDF accessibility.\n\n### Video\n\nVideo is a common experience online. Here is how to it ensure everyone can enjoy it.\n\nVideo\n\n[#### Video accessibility guide for content creators and viewers](https://blog.adobe.com/en/publish/2021/12/10/video-accessibility-guide-for-content-creators-and-viewers)\n\nAdobe\n\nAccessible videos not only help those with disabilities but benefits others who want to engage with your videos. Here's what you need to know to make your videos accessible.\n\n## Groups and organizations\n\n### Conferences\n\nAnnual events about accessibility and inclusion.\n\nConferences\n\n[#### #a11yTO Camp](https://camp.a11yto.com/)\n\nOpening the doors for a free day of accessibility learning.\n\nConferences\n\n[#### #a11yTO Conf](https://conf.a11yto.com/)\n\nA curated playlist of talks, focused on digital accessibility.\n\nConferences\n\n[#### Abilities Expo](https://www.3playmedia.com/company/access-by-3play/)\n\nWhere else can you conquer an all-inclusive climbing wall, show off your skills in adaptive sports, learn moves from pioneers of inclusive dance, find the perfect device to meet your needs and so much more?\n\nConferences\n\n[#### ACCESS](https://www.3playmedia.com/company/access-by-3play/)\n\nACCESS is an annual conference by 3Play Media celebrating video, accessibility, & the people who make it happen.\n\nConferences\n\n[#### Assistive Technology Industry Association (ATIA)](https://www.atia.org/conference/)\n\nOver the past 22 years, ATIA has been a community gathering for assistive technology practitioners, teachers, parents and caregivers, persons with disabilities and more to learn, network and share on the best in assistive technology.\n\nConferences\n\n[#### axe-con Digital Accessibility Conference](https://www.deque.com/axe-con/)\n\nAxe-con is an open and inclusive digital accessibility conference that welcomes developers, designers, business users, and accessibility professionals of all experience levels to a new kind of accessibility conference focused on building, testing, and maintaining accessible digital experiences.\n\nConferences\n\n[#### Building For Everyone: Expand Your Market With Design Practices From Google’s Product Inclusion Team](https://www.wiley.com/en-au/Building+For+Everyone%3A+Expand+Your+Market+With+Design+Practices+From+Google's+Product+Inclusion+Team-p-9781119646235)\n\nAnnie Jean-Baptiste\n\nHow can business leaders adapt to our ever-more-diverse world by capturing market share and building more inclusive products for people of color, women and other underrepresented groups? The Product Inclusion Team at Google has developed strategies to do just that.\n\nConferences\n\n[#### Closing the Gap](https://www.closingthegap.com/conference/)\n\nDiscover how AT can change lives and improve learning!\n\nConferences\n\n[#### CSUN Assistive Technology Conference](https://www.csun.edu/cod/conference/)\n\nKnown as a forum that showcases cutting edge technology and practical solutions that can be utilized to remove the barriers that prevent the full participation of persons with disabilities in educational, workplace and social settings, the conference is the largest of its kind in the world.\n\nConferences\n\n[#### The Digital Accessibility Legal Summit](https://www.accessibility.legal/)\n\nWe bring together experts from the fields of accessibility and legal to discuss current trends, and to provide insights that will be helpful to practitioners in their work on digital accessibility.\n\nConferences\n\n[#### Future Date](https://afuturedate.herokuapp.com/)\n\nFuture Date is a free, volunteer-led, virtual accessibility conference. Our goal is to expose our audience to the pioneering work and lived experiences of disability and accessibility leaders.\n\nConferences\n\n[#### Global Accessibility Awareness Day](https://globalaccessibilityawarenessday.org/)\n\nThe purpose of GAAD is to get everyone talking, thinking and learning about digital access and inclusion, and the more than One Billion people with disabilities/impairments.\n\nConferences\n\n[#### International Conference on Computers Helping People with Special Needs (ICCHP)](https://www.ictaccessibilitytesting.org/)\n\nICCHP is a series of biannual scientific conferences in the field of ICT/AT for people with disabilities.\n\nConferences\n\n[#### ICT Accessibility Testing Symposium](https://www.ictaccessibilitytesting.org/)\n\nThe annual ICT Accessibility Testing Symposium is a place for in-person knowledge sharing in ICT Accessibility Testing research and practice and for professional networking.\n\nConferences\n\n[#### Inclusive Design 24 (#id24)](https://inclusivedesign24.org/)\n\nA free 24-hour online event for the global community. It celebrates inclusive design and shares knowledge and ideas from analogue to digital, from design to development, from planners to practitioners, and everything and everyone in between.\n\nConferences\n\n[#### John Slatin Virtual AccessU](https://knowbility.org/programs/accessu-2021)\n\nWhatever your role in digital accessibility, wherever you are on your journey, there is simply no better place to learn and connect to the global community than the annual John Slatin AccessU conference.\n\nConferences\n\n[#### M-Enabling](https://m-enabling.com/)\n\nThe M-Enabling Summit Conference and Showcase is dedicated to promoting accessible and assistive technology for senior citizens and users of all abilities.\n\nConferences\n\n[#### Magnify Conference](https://www.magnifyconference.com/)\n\nThe Magnify Conference was created from a surge of inspiration when seeing so many talented people practicing inclusive design practices daily across the globe.\n\nConferences\n\n[#### Web4All](http://www.w4a.info/2021/)\n\nThe conference focuses on all aspects of web accessibility. Areas of general interest include, but are not limited to the following: age, cognition, culture, education, emotions, dexterity, disability, diversity, health, hearing, income, infrastructure, language, learning, literacy, mobility, situation, society, and vision.\n\n### Employment\n\nResources for finding accessibility jobs.\n\nEmployment\n\n[#### A11yjobs.com](https://www.a11yjobs.com/)\n\nGeorge Hewitt\n\nA digital accessibility job board.\n\nEmployment\n\n[#### Applying for a job with a disability or impairment](https://resume.io/blog/applying-for-a-job-with-a-disability)\n\nMarlijn van der Bok\n\nCombatting discrimination when entering the job market\n\nEmployment\n\n[#### Accessibility Interview Questions](https://scottaohara.github.io/accessibility_interview_questions/)\n\nScott O'Hara\n\nThese questions try to act as conversation starters, to gain insight into how someone solves problems, and interprets accessible, inclusive user experiences.\n\nEmployment\n\n[#### Invisible Strengths](https://www.invisiblestrengths.com/)\n\nInclusive workplaces for everyone\n\nConnecting disabled jobseekers with supportive work environments, and a diverse pipeline of candidates for employers.\n\n### Meetups\n\nArea groups dedicated to regularly meeting to discuss accessibility related topics.\n\nMeetups\n\n[#### A11YChi/A11Y-Presentations](https://github.com/A11YChi/A11Y-Presentations)\n\nChicago, Illinois\n\nA guide to accessible presentations, for presenters, speakers.\n\nMeetups\n\n[#### #a11yTO](https://twitter.com/a11yTO)\n\nToronto, Canada\n\n#a11yTO actively promotes digital inclusion for the design and development communities in and around the Greater Toronto Area.\n\nMeetups\n\n[#### Access + Equity](https://www.meetup.com/access-and-equity/)\n\nFlorida, United States\n\nAccess + Equity is a brand-new series featuring some of the best minds in the field of disability rights and accessibility.\n\nMeetups\n\n[#### Accessibility Chicago](https://www.meetup.com/a11ychi/)\n\nChicago, United States\n\nAccessibility Twin Cities is designed to connect and support individuals who work in – or are even simply interested in – the field of digital accessibility and accessibility testing for organizations, businesses and government.\n\nMeetups\n\n[#### Accessibility Twin Cities](https://www.meetup.com/Accessibility-Twin-Cities/)\n\nMinnesota, United States\n\nA community of digital professionals passionate about making the world more accessible and inclusive.\n\nMeetups\n\n[#### A11yPHL - Philly Accessibility Meetup](https://a11yphl.com/events/)\n\nPhilladelphia, United States\n\nThe Philly Accessibility Meetup exists to connect and elevate the local accessibility community.\n\nMeetups\n\n[#### a11ySD](https://a11ysd.com/)\n\nSan Diego, CA\n\nSan Diego Accessibility & Inclusive Design meetup\n\nMeetups\n\n[#### A11ySEA](https://twitter.com/a11ysea)\n\nSeattle, United States\n\nAccessibility Seattle is dedicated to the simple premise that 'digital inclusion' is fundamental.\n\nMeetups\n\n[#### Accessibility Club](https://accessibility-club.org/)\n\nNürnberg, Germany\n\nThe Accessibility Club gives you the chance to get some real-world experience with assistive technology, deepen your knowledge about web accessibilty and get in touch with like-minded webworkers.\n\nMeetups\n\n[#### Accessibility DC](http://www.accessibilitydc.org/)\n\nWashington DC, United States\n\nAccessibility DC is a monthly meetup once every month and is a chance for people who are interested in Accessibility to get together and share information. Web Developers who are interested in Web Accessibility and Adaptive Technology Users who have a daily experience of accessibility issues are all welcome to attend.\n\nMeetups\n\n[#### A11yNYC - Accessibility New York City](https://www.meetup.com/a11ynyc/)\n\nNew York, United States\n\nOur group exists to advance accessibility and inclusive design. Our goal is to bring together NYC's accessibility community to share ideas, best practices, and our experiences.\n\nMeetups\n\n[#### A11yVR - Accessibility Virtual Reality](https://www.meetup.com/a11yvr/)\n\nTokyo, Japan\n\nAccessibility VR is a monthly meetup that brings together people interested in accessibility in virtual reality to share ideas, best practices, and our experiences.\n\nMeetups\n\n[#### AnnArborA11y](https://twitter.com/annarbora11y)\n\nMichigan, United States\n\nAccessibility group based in Ann Arbor, Michigan.\n\nMeetups\n\n[#### axe-con](https://www.deque.com/axe-con/)\n\nOnline\n\nFree, virtual digital accessibility conference with tracks for design, develoopers, business leaders, and compliance.\n\nMeetups\n\n[#### Eventua11y](https://eventua11y.com/)\n\nOnline, in-person\n\nCalendar of digital accessibility events.\n\nMeetups\n\n[#### Bay Area Accessibility and Inclusive Design](https://www.meetup.com/a11ybay/)\n\nBay Area, United States\n\nCalling all Bay Area developers, designers, accessibility, usability and any other high-tech professionals who have an interest in digital (web, mobile, etc.) accessibility and users with different disabilities.\n\nMeetups\n\n[#### Bristol Inclusive Design & Development](https://twitter.com/BrisInclusive)\n\nBristol, United Kingdom\n\nA meetup for anyone involved in digital design and development, accessibility and inclusive design.\n\nMeetups\n\n[#### Budapest Accessibility Meetup](https://www.meetup.com/Budapest-Accessibility-Meetup/)\n\nBudapest, Hungary\n\nA meetup for Hungarian developers and designers.\n\nMeetups\n\n[#### Buffalo Accessibility Meetup](https://www.meetup.com/buffa11y/)\n\nNew York, United States\n\nThis is a venue for developers, designers, UX professionals, copywriters, QA professionals, and so on, to get together to learn from and share with others everything we can about accessibility and inclusiveness.\n\nMeetups\n\n[#### Open Mcr](https://www.eventbrite.com/o/open-mcr-14856364651)\n\nManchester, United Kingdom\n\nA meetup in Manchester focussing on making digital services accessible and inclusive to everyone.\n\nMeetups\n\n[#### a11yRTP](https://www.meetup.com/a11yRTP/)\n\nNorth Carolina, United States\n\nAre you interested in digital accessibility? Join this group of practitioners and inquirers as we explore how to make all aspects of digital life accessible to all people.\n\nMeetups\n\n[#### A11y Berlin](https://a11y-meetup-berlin.de/)\n\nBerlin, Germany\n\nA11y Meetup Berlin is designed to bring together the accessibility, web performance, and inclusive design community to share and discuss ideas, best practices, and experiences.\n\nMeetups\n\n[#### Cleveland Accessibility Meetup](https://www.meetup.com/Cleveland-Accessibility-Meetup/)\n\nOhio, United States\n\nAccessibility is for everyone. We seek to increase awareness of digital accessibility, inclusive design, and assistive technologies in Northeast Ohio in a setting of sharing, learning, and networking.\n\nMeetups\n\n[#### Inclusive Design & Accessibility](https://www.meetup.com/Inclusive-Design-Accessibility/)\n\nUtrecht, Netherlands\n\nWe like to come together to talk about inclusive design and accessibility. Be it UX design, UI design, EU law changes, web accessibility, product design, user research, what have you.\n\nMeetups\n\n[#### Portland Accessibility and User Experience Meetup](https://www.meetup.com/Portland-Accessibility-and-User-Experience-Meetup/)\n\nThe Portland Accessibility and User Experience (PDX A11Y UX) Meetup addresses how to incorporate accessibility and universal design principles into project planning, user research, and UX evaluation.\n\nOregon, United States\n\nMeetups\n\n[#### OZeWAI - Australian Web Adaptability Initiative](https://www.ozewai.org/)\n\nPerth, Australia\n\nOZeWAI is an association of volunteers working to make the information world more inclusive. It was the first such organisation in Australia and has been a leading initiative in the field for more than 20 years.\n\nMeetups\n\n[#### WebA11y.jp](https://weba11y.jp/)\n\nTokyo, Japan\n\nMeetups\n\n[#### A11y Bytes](https://a11ybytes.org/)\n\nAustralia\n\nA11y Bytes is a dynamic fast-paced evening of lightning talks about digital accessibility and the needs and preferences of users with disabilities, run in multiple cities across Australia.\n\nMeetups\n\n[#### Melbourne Web Accessibility and Inclusive Design](https://www.meetup.com/en-AU/Melbourne-Web-Accessibility-Inclusive-Design/)\n\nMelbourne, Australia\n\nBased in Melbourne, Australia, this group is for web practitioners and other professionals who are interested in web accessibility and inclusive design practices.\n\nMeetups\n\n[#### Sydney Web Accessibility and Inclusive Design](https://www.meetup.com/en-AU/Sydney-Web-Accessibility-Inclusive-Design/)\n\nSydney, Australia\n\nThis Sydney group is for anyone interested in inclusive research, design and development practices. This includes accessible design and development, user research that involves people with disabilities in a holistic, integrated fashion as well as compliance with international standards such as the Web Content Accessibility Guidelines.\n\nMeetups\n\n[#### Accessibility Scotland](https://www.meetup.com/a11yScotland-Meetups/)\n\nEdinburgh, Scotland\n\nAccessibility Scotland’s focus is on providing a friendly, affordable, and informative day focused on digital accessibility and inclusion.\n\nMeetups\n\n[#### London Accessibility Meetup](https://www.meetup.com/London-Accessibility-Meetup/)\n\nLondon, United Kingdom\n\nWe are the UK's largest accessibility community, a welcoming and friendly group of people focussed on digital products, digital services and the built environment across the public, private and charitable sectors.\n\nMeetups\n\n[#### a11yMTL meetup - web accessibility & inclusive design](https://www.meetup.com/a11yMTL/)\n\nMontréal, Canada\n\na11yMTL is a bilingual interest group for anyone passionate about web accessibility, universal design, and digital inclusion.\n\nMeetups\n\n[#### role=drinks](https://www.roledrinks.com/)\n\nAmsterdam, Netherlands\n\nWhat on Earth is a role=drinks? It’s an accessibility meetup! The event features lightning talks by accessibility specialist, time to talk to the speakers and fellow attendees, and more than enough time to grab a drink.\n\n### Professional help\n\nWell-respected professional companies who specialize in accessibility.\n\nProfessional help\n\n[#### Accessible360](https://accessible360.com/)\n\nWe help organizations large and small navigate their path to digital accessibility through live-user audits, training, support and monitoring.\n\nProfessional help\n\n[#### Deque Systems](https://www.deque.com/)\n\nDeque Systems provides web and mobile accessibility solutions so you can meet compliance goals and help make the web accessible to all users.\n\nProfessional help\n\n[#### Equal Entry](https://accessible360.com/)\n\nWe help organizations be more inclusive and accessible by providing accessibility audits, training, and consulting.\n\nProfessional help\n\n[#### Intopia](https://intopia.digital/)\n\nWe help organisations be more inclusive and accessible by providing digital accessibility audits, training, strategy, usability testing, and consulting.\n\nProfessional help\n\n[#### Knowbility](https://knowbility.org/)\n\nKnowbility is a nonprofit organization with the goal of improving technology access for millions of youth and adults with disabilities all over the world.\n\nProfessional help\n\n[#### Level Access](https://www.levelaccess.com/)\n\nLevel Access is a company that provides digital accessibility solutions and services to corporations, government agencies, and educational institutions.\n\nProfessional help\n\n[#### Simply Open](https://www.simplyopen.io/)\n\nWe work with brands who are listening. They want to make products and services you will love. They understand the value of insight from those who sense, think, move and feel differently.\n\nProfessional help\n\n[#### Prime Access Consulting](https://www.pac.bz/)\n\nVia our inclusive design methodology, we help you design, develop, and produce inclusive experiences. We work across digital and physical spaces, spanning websites, mobile apps, small-to-large capital projects, themed experiences, and much more.\n\nProfessional help\n\n[#### TetraLogical](https://tetralogical.com/)\n\nWe're a company with inclusion at its heart. Our focus is on emerging as well as existing technologies, offering knowledge, experience, strategic, and development services.\n\nProfessional help\n\n[#### TPGi](https://www.paciellogroup.com/)\n\nTPGi – Your Accessibility Partner (WCAG 2.0/508 audits, VPAT, usability and accessible user experience).\n\nProfessional help\n\n[#### WebAIM: Web Accessibility In Mind](https://webaim.org/)\n\nOur mission is to empower organizations to make their web content accessible to people with disabilities.\n\nProfessional help\n\n[#### WeCo](https://theweco.com/)\n\nWe’re accessibility experts who live with the disabilities you’re trying to accommodate. Let us help you bring real-life accessibility, and legal compliance, to your projects.\n\n### Professional testers\n\nIt's important to test your website or web app with disabled people to learn how it actually works.\n\nProfessional testers\n\n[#### Accessible360](https://accessible360.com/)\n\nWe help organizations large and small navigate their path to digital accessibility through live-user audits, training, support and monitoring.\n\nProfessional testers\n\n[#### AccessWorks (by Knowbility)](https://access-works.com/)\n\nAccess Works offers usability and accessibility testing that connects businesses with users with disabilities.\n\nProfessional testers\n\n[#### Fable Tech Labs](https://www.makeitfable.com/)\n\nWeb accessibility testing services to reach your compliance goals faster. Connect with real users online and on-demand, through crowdtesting!\n\nProfessional testers\n\n[#### Loop11](https://www.loop11.com/)\n\nLoop11 is a website user testing tool that enables you to identify navigational and usability issues of any website.\n\nProfessional testers\n\n[#### Perkins School For The Blind](https://www.perkins.org/services/other)\n\nPerkins is so much more than a school. Our services help make the world a better place for people who are blind or visually impaired – from independent evaluations to assess a student's needs and strengths, to our Outreach Short Courses, which offer adventures and opportunities to practice skills to support independence and self-advocacy.\n\n## Everything else\n\n### Additional resources\n\nMiscellaneous accessibility-related resources.\n\nAdditional resources\n\n[#### a11y\\_styled\\_form\\_controls](https://scottaohara.github.io/a11y_styled_form_controls/)\n\nScott O'Hara\n\nA repository of styled and “styled” form control elements and markup patterns, and how they are announced by screen readers.\n\nAdditional resources\n\n[#### a11y-dialog](https://github.com/KittyGiraudel/a11y-dialog)\n\nKitty Giraudel\n\nA very lightweight and flexible accessible modal dialog script.\n\nAdditional resources\n\n[#### a11y-tabs](https://github.com/agnosticui/a11y-tabs)\n\nRob Levin\n\nA lightweight (<1Kb) JavaScript package to facilitate a11y-compliant tabbed interfaces.\n\nAdditional resources\n\n[#### a11y-webring.club](https://a11y-webring.club/)\n\nEric Bailey\n\nA webring for digital accessibility practitioners.\n\nAdditional resources\n\n[#### Aaron Cannon’s Web Accessibility Checklist](http://cameronmoll.com/archives/2008/06/web_accessibility_checklist/)\n\nCameron Moll\n\nPDF accessibility checklist.\n\nAdditional resources\n\n[#### The Accessibility Cheatsheet](https://bitsofco.de/the-accessibility-cheatsheet/)\n\nIre Aderinokun\n\nThe WCAG contain some very useful information, and so I decided to condense the very extensive guidelines and highlight some practical examples of what we can do to implement them and make our websites more accessible.\n\nAdditional resources\n\n[#### Accessibility for teams](https://accessibility-for-teams.com/)\n\nPeter van Grieken\n\nThis is a starter guide for teams about delivering accessible websites. Each person on your team has their own responsibilities, this guide tells you what everybody needs to do.\n\nAdditional resources\n\n[#### Accessible Social](https://www.accessible-social.com/)\n\nAlexa Heinrich\n\nAccessible Social is a free resource hub for digital marketers, communication professionals, content creators, everyday social media users, and anyone who wants to learn how to make their content inclusive and accessible for people with disabilities.\n\nAdditional resources\n\n[#### Adobe Inclusive Design Workshop](https://github.com/adobe-inclusive-design/id-workshop)\n\nMatt May\n\nContent for a full-day workshop on inclusive design, including workbook modules, and exercises.\n\nAdditional resources\n\n[#### Assistive Technology Glossary](https://makeitfable.com/glossary/)\n\nFable\n\nA list of assistive technology terms and what they mean.\n\nAdditional resources\n\n[#### Collaborative planning, the forgotten step of accessible development](https://www.deque.com/blog/collaborative-planning-the-forgotten-step-of-accessible-development/)\n\nDeque\n\nDescribes an agile development process to faciliate accessibility called Accessibility Behavior Informed Development (a11yBID).\n\nAdditional resources\n\n[#### Dataviz Accessibility Resources](https://github.com/dataviza11y/resources#readme)\n\nGitHub\n\nA non-exhaustive and in-progress list of people and resources in Accessibility and Data Visualization.\n\nAdditional resources\n\n[#### Disability is a spectrum, not a binary](https://www.24a11y.com/2018/disability-is-a-spectrum-not-a-binary/)\n\n24 Accessibility\n\nWhen we look at disability as a spectrum instead of a binary, we can see that a lot more people struggle to use our stuff than we might think. The good news is that making things accessible helps even more people than we might realise.\n\nAdditional resources\n\n[#### Disabled And Here Collection](https://affecttheverb.com/collection/)\n\nDisabled and Here\n\nThis stock collection is a disability-led effort to provide free and inclusive images from our own perspective, with photos and illustrations celebrating disabled Black, Indigenous, people of color (BIPOC).\n\nAdditional resources\n\n[#### Empathy Prompts](https://empathyprompts.net/)\n\nEric Bailey\n\nPrompts to consider when making things for others to use.\n\nAdditional resources\n\n[#### Google Accessibility](https://www.google.com/accessibility/)\n\nGoogle\n\nEveryone should be able to access and enjoy the web. We’re committed to making that a reality.\n\nAdditional resources\n\n[#### List of online accessibility tools](http://dmoztools.net/Computers/Internet/Web_Design_and_Development/Authoring/Online_Tools/Checking_and_Debugging/Accessibility/)\n\nDMOZ\n\nThe Directory of the Web.\n\nAdditional resources\n\n[#### Tips For Online Shopping With Disabilities: A Website Accessibility Guide](https://couponfollow.com/research/online-shopping-with-disabilities)\n\nCoupon Follow\n\nIn-person shopping can be difficult and stressful for disabled people for many reasons, from tall checkout counters to non-navigable spaces, but meanwhile, disabled Americans are more likely to never use the Internet compared to the total population.\n\nAdditional resources\n\n[#### Home: Up Your A11y](https://www.upyoura11y.com/)\n\nSuzanne Aitchison\n\nTutorials and resources for developers seeking to build accessible web experiences.\n\nAdditional resources\n\n[#### Van11y: Accessibility and Vanilla JavaScript - ES2015](https://van11y.net/)\n\nNicolas Hoffmann\n\nA collection of accessible scripts for rich interfaces elements, built using progressive enhancement and customisable.\n\nAdditional resources\n\n[#### Web Accessibility for Designers (Infographic)](https://webaim.org/resources/designers/)\n\nWebAIM\n\nOptimal accessibility should start much earlier, as part of the visual design process. We have created an infographic that highlights a few important principles of accessible design.\n\nAdditional resources\n\n[#### Web Fundamentals: Accessibility](https://developers.google.com/web/fundamentals/accessibility/)\n\nGoogle\n\nA concise treatment of accessibility principles and practices.\n\nAdditional resources\n\n[#### WebAIM: 'Skip Navigation' Links](https://webaim.org/techniques/skipnav/)\n\nWebAIM\n\nThe main content is not usually the first thing on a web page. Keyboard and screen reader users generally must navigate a long list of navigation links, sub-lists of links, corporate icons, site searches, and other elements before ever arriving at the main content. This is particularly difficult for users with some forms of motor disabilities.\n\nAdditional resources\n\n[#### WebAIM’s Hierarchy for Motivating Accessibility Change](https://webaim.org/blog/motivating-accessibility-change/)\n\nWebAIM\n\n“When you incent, people optimize for reward. When you inspire, people optimize for purpose.”\n\nAdditional resources\n\n[#### Accessibility Articles, Reports, Training Courses, and Online Seminars by Nielsen Norman Group](https://www.nngroup.com/topic/accessibility/)\n\nNielsen Norman Group\n\nAll articles tagged with 'accessibility.'\n\nAdditional resources\n\n[#### The a11y Monthly: Does Accessibility slow down the development process?](https://yoast.com/developer-blog/accessibility-slow-down-development-process/)\n\nYoast\n\nOne of the complaints I’ve often heard from business owners and managers is that implementing accessibility is hard and slows down the development process. For this reason, sometimes accessibility gets postponed or set aside in the erroneous belief that’s something that can be “added” later. Here, I’d like to share my thoughts on why I think the first statement is misleading.\n\nAdditional resources\n\n[#### Writing CSS with Accessibility in Mind](https://medium.com/@matuzo/writing-css-with-accessibility-in-mind-8514a0007939)\n\nManuel Matuzovic\n\nTips on how to improve the accessibility of your web sites and apps with CSS.\n\nAdditional resources\n\n[#### A guide to coding accessible developer tools](https://increment.com/development/a-guide-to-coding-accessible-developer-tools/)\n\nThe Increment\n\nWhen we talk about accessibility in the tech industry, most conversations are centered around the end user. But how accessible are the tools we code for other developers?\n\nAdditional resources\n\n[#### Information On Different Types Of People For Graphic Communication, Website And Information Designers](https://medium.com/@user_design/information-on-different-types-of-people-for-graphic-communication-website-and-information-4b6454905bb1)\n\nUser Design, Illustration and Typesetting, previously Usability Geek\n\nEvery day we use graphic communication design from reading letters which have come through the post, or the newspaper in the morning, to reading and using information at work, to travelling and navigating in the environment. How can we include as many people as possible when designing graphic communication and information, and how do we not unnecessarily exclude people?\n\nAdditional resources\n\n[#### Accessibility for Teams](https://accessibility.digital.gov/)\n\nU.S. General Services Administration\n\nA ‘quick-start’ guide for embedding accessibility and inclusive design practices into your team’s workflow.\n\nAdditional resources\n\n[#### Access & Use](https://accessuse.eu/en/)\n\nDias GmbH\n\nAccess & Use shows what it needs to make dynamic elements in websites accessible and usable for all.\n\nAdditional resources\n\n[#### Are you accessible? -  A Primer on Web Accessibility](https://medium.com/samsung-internet-dev/are-you-accessible-a-primer-on-web-accessibility-7b2ab0ceffe8)\n\nAmy Dickens\n\nAccessibility of the world wide web hasn’t always been a number one priority for web developers (much to detriment of internet users). Whilst very few people set out to design a website that is inaccessible, many studies have documented partially or completely inaccessible websites.\n\nAdditional resources\n\n[#### mouseless](https://mouseless.click/)\n\nSonuscape LLC\n\nLightning-fast mouse control with the keyboard.\n\nAdditional resources\n\n[#### Solid Start](https://www.solidstart.info/)\n\nErik Kroes\n\nAre you a person that makes digital things for other people? Awesome—because this page is all about making things for people.\n\nAdditional resources\n\n[#### Word and PowerPoint Accessibility Evaluation Checklist](https://webaim.org/resources/evaloffice/)\n\nWebAIM\n\nProvides advice for how to review and repair accessibility issues for Microsoft Office.\n\nAdditional resources\n\n[#### The Web Accessibility Introduction I Wish I Had](https://dev.to/maxwell_dev/the-web-accessibility-introduction-i-wish-i-had-4ope)\n\nMax Antonucci\n\nThis post aims to tell you a few key things about accessibility. I can't cover everything, but I can cover: why accessibility matters, how to make a website accessible, and how to test for accessibility.\n\n### Submit a resource\n\nWe're always looking for [people to help add great accessibility-related resources](/contribute/).",
  "tags": [
    "a11y",
    "accessibility",
    "checklist",
    "community"
  ],
  "extracted_at": "2026-02-03T14:44:00.265353+00:00",
  "content_length": 84140,
  "content_hash": "36b702e2957903f9"
}