{
  "id": "carbon-design__components_button_usage_",
  "source_id": "carbon-design",
  "source_name": "IBM Carbon Design System",
  "category": "design_systems",
  "url": "https://carbondesignsystem.com/components/button/usage/",
  "title": "Button",
  "content": "Button\nButtons are used to initialize an action. Button labels express what action will\noccur when the user interacts with it.\nNote:\nSome of the examples we discuss here include fluid (full-span) and\nhanging buttons which are not available for production use. This guidance\nreflects our current understanding of these topics and we are working towards\nreleasing this work in a future version of Carbon.\nLive demo\nOverview\nFormatting\nContent\nUniversal behaviors\nPrimary button\nSecondary button\nTertiary button\nGhost button\nDanger button\nModifiers\nRelated\nReferences\nFeedback\nLive demo\nTheme selector\nWhite\nVariant selector\nDefault\nThis live demo contains only a preview of functionality and styles available for this component. View the\nfull demo\non Storybook for additional information such as its version, controls, and API documentation.\nAccessibility testing status\nFor every latest release, Carbon runs tests on all components to meet the\naccessibility requirements\n. These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\nDefault state\nTested\nAdvanced states\nTested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nOverview\nButtons are clickable elements that are used to trigger actions. They\ncommunicate calls to action to the user and allow users to interact with pages\nin a variety of ways. Button labels express what action will occur when the user\ninteracts with it.\nWhen to use\nUse buttons to communicate actions users can take and to allow users to interact\nwith the page. Each page should have only one primary button. Any remaining\ncalls to action should be represented as lower emphasis buttons.\nWhen not to use\nDo not use buttons as navigational elements. Instead, use\nlinks\nwhen the\ndesired action is to take the user to a new page.\nVariants\nEach button variant has a particular function and its design signals that\nfunction to the user. It is, therefore, very important that the different\nvariants are implemented consistently across products to convey the correct\nactions.\nVariant\nPurpose\nPrimary\nFor the principal call to action on the page. Primary buttons should only appear once per screen (not including the application header, modal dialog, or side panel).\nSecondary\nFor secondary actions on each page. Secondary buttons can only be used in conjunction with a primary button. As part of a pair, the secondary button’s function is to perform the negative action of the set, such as “Cancel” or “Back”. Do not use a secondary button in isolation and do not use a secondary button for a positive action.\nTertiary\nFor less prominent, and sometimes independent, actions. Tertiary buttons can be used in isolation or paired with a primary button when there are multiple calls to action. Tertiary buttons can also be used for sub-tasks on a page where a primary button for the main and final action is present.\nGhost\nFor the least pronounced actions; often used in conjunction with a primary button. In a situation such as a progress flow, a ghost button may be paired with a primary and secondary button set, where the primary button is for forward action, the secondary button is for “Back”, and the ghost button is for “Cancel”.\nDanger\nFor actions that could have destructive effects on the user’s data (for example, delete or remove). Danger button has three styles: primary, tertiary, and ghost.\nFormatting\nAnatomy\nA button’s label communicates the action that is performed when the user\ninteracts with it. In an icon only button, that has no label, the icon must\naccurately represent what the button does.\nIn a Carbon button, the label is always left-aligned, not center-aligned. The\nicons in a button with a label is right-aligned but in an icon only button, the\nicon is centered.\nAnatomy of buttons\n1. Button\nA. Label\nB. Container\nC. Icon (optional)\n3. Ghost button\nA. Label\nC. Icon (optional)\n2. Tertiary button\nA. Label\nB. Container\nC. Icon (optional)\n4. Icon button\nB. Container\nC. Icon\nButton sizes\nThe button is available in seven different sizes:\nextra small\n,\nsmall\n,\nmedium\n,\nlarge (productive)\n,\nlarge (expressive)\n,\nextra large\n, and\n2XL\n. The table below adds more context around the use case for each size.\nFor guidance on button heights, see\nSize\non\nthe Style tab.\nWe do not recommend mixing different button sizes in #button-groups.\nButton size\nUse case\nExtra small\nUse when vertical space is limited or in areas with a confined layout.\nSmall\nUse when buttons are paired with 32px small sized input fields.\nMedium\nUse when buttons are paired with 40px medium sized input fields.\nLarge (productive)\nThis is the most common button size in software products. Pairs with 14px body copy.\nLarge (expressive)\nThe larger expressive type size within this button provides balance when paired with 16px body copy. Used by the IBM.com team in website banners.\nExtra large\nUse when buttons bleed to the edge of a larger component, like in the context of modals, side panel and narrow tearsheets.\n2XL\nUse when buttons bleed to the edge of a full-screen component, like in the context of large tearsheets.\nSizes of buttons in relation to its usage.\nEmphasis\nYou don’t necessarily need to use the buttons in the order that their labels\nimply. Although secondary buttons have less visual prominence because they are\nless saturated than their primary counterparts, they are still tonally heavy. If\nyour layout requires multiple actions—as is the case with some toolbars, data\nlists and dashboards—low emphasis buttons (tertiary or ghost) may be a better\nchoice.\nThe most important thing is to establish a visual hierarchy between the buttons\nin your UI. Keep these best practices in mind.\nA single, high-emphasis button\nAs a general rule, a layout should contain a single high-emphasis button that\nmakes it clear that other buttons have less importance in the hierarchy. This\nhigh-emphasis button commands the most attention.\nMultiple button emphasis\nA high-emphasis button can be accompanied by medium- and low-emphasis buttons\nthat perform less important actions. Keep in mind that you should only group\ntogether calls to action that have a relationship to one another.\nDo use high-emphasis and medium-emphasis buttons in a button group.\nDo not use two high-emphasis buttons in a button group.\nAlignment\nAlignment refers to whether the buttons are aligned to the right or the left of\na window, container, or layout. Buttons are unique, more so than any other\ncomponent, in that their alignment depends on where they appear and whether or\nnot they’re contained within another component.\nAs a general rule, on full-page designs, the primary button is on the left side\nof the page. When the browser window is large and the user is scrolling to read,\nit’s best to have the primary button where the user’s attention has been focused\nall along. Whereas in wizards, where a user is progressing through a series of\nsteps or dialog windows, the primary action traditionally sits at the bottom\nright. Buttons within components such as notifications, search fields, and data\ntables are also right-aligned.\nIn some cases a button group—or even a single button in the case of a side panel\nor small tile—may span the entire width of a window or container. Typical nested\nbutton locations include:\nBanner calls to action\nDialog windows\nWizards\nForms\nCards\nToolbars\nAlignment of buttons across various layouts.\nAlignment\nUse case\nLeft-justified\nBanner call to actions, in-page forms, and nested buttons in components like tiles.\nRight-justified\nInline notifications, inline field buttons and data tables, progressive forms, wizards, and single-button dialogs.\nFull-span\nDialogs, side panel, and small tiles; currently Carbon does not offer a way to implement full-span buttons in code, without an override as mentioned\nhere\n, they max out at 320px.\nFixed width button\nButton alignment is also closely related to whether the button is treated as a\nfixed or a fluid element within a layout. When we say “fixed,” there is a fixed\npadding of 16px to the left and a 64px padding to the right of the button label.\nThe button label determines the button’s width. Refer to the\nStyle tab\nfor more guidance.\nExample of a fixed width primary button in a layout.\nHanging versus non-hanging button alignment\nHanging button alignment is when the button label is aligned to the grid rather\nthan the container. This alignment should be used to group sections between\ncomponents and buttons that directly affect each other.\nNon-hanging button alignment is when the button container is aligned to the\ngrid. These rules apply to buttons with a visible container. For buttons that\ndon’t have a visible container in the default state, such as ghost button and\ndanger ghost button, refer to\nghost button\nalignment.\nExample of a fixed width button’s hanging alignment.\nExample of a fixed width button’s non-hanging alignment.\nFluid width button\nThere is a hybrid scenario where a floating primary, secondary, or tertiary\nbutton can span a designated number of columns on the responsive column grid,\ngiving it a fluid width. These are called “fluid width buttons.”\nFluid width buttons are always preferable to fixed width default buttons in a\nlayout. When possible, set the button container’s relative position to the\nresponsive layout grid and match the button width to the width of other elements\non the page. Ideally, when using groups of related buttons (not including ghost\nbuttons unless in a tearsheet or modal), they should all be the same width. See\nbutton groups below for more detailed information.\nExample of a fluid width primary button matching the width of a card in a\nlayout.\nButton groups\nButton groups are a useful way of aligning buttons that have a relationship.\nGroup the buttons logically into sets based on usage and importance. Too many\ncalls to action will overwhelm and confuse users so they should be avoided.\nAs mentioned in the\nEmphasis section\n, you don’t necessarily need to\nuse the buttons in the order that their labels imply. Either a secondary or a\ntertiary button can be used in conjunction with a primary button. In fact, due\nto the visual weight of the secondary button, it’s recommended to use tertiary\nor ghost buttons in layouts with more than three calls to action.\nExample of button groups in a UI.\nButton groups versus menu buttons\nButton groups should be used when there are either two or three actions that a\nuser needs to consider. Any more than three actions should be grouped\nmeaningfully using\nmenu buttons\n, to reduce\nthe amount of space these actions take up on a page. Alternatively, for\ninterfaces that need many common actions or functions, consider using a\ntoolbar\n.\nDo use menu buttons to group meaningful actions being applied to the same data.\nDo not use many individual buttons applying to the same data.\nButton width in button groups\nWhen using groups of related buttons (not including ghost buttons), they should\nall be the same width. The width of all the buttons is usually determined by the\nlongest button label.\nNote: We recommend following this guidance for both the toolbar and the batch\nactions toolbar as well.\nExample of button width in button groups.\nDo apply the same width to all buttons in a group, even if they don’t bleed.\nDo not make buttons in a group different widths.\nHanging versus non-hanging fluid width button group alignment\nThis can be achieved in one of two ways, both of which are acceptable. The first\napproach involves using the\nnarrow gutter mode\n.\nIn this situation, each button would be set individually on the column grid.\nNote: Carbon developers are working on the narrow gutter mode, currently\nleft-hanging buttons can only be achieved with an override.\nSome products don’t want to hang their buttons into the gutter, but still want a\n16px distance between buttons. This can be achieved while maintaining same-width\nbuttons by treating the button group as a single object (rather than two\nseparate entities) on the grid. Each button will essentially span 50% of its\ncontainer with a programmatic 16px gutter between them.\nExample of hanging buttons in a button group.\nThe button group is treated as one element on the grid to achieve a 16px gutter between the two, without the gutter hang.\nFluid button groups\nWhen we say “fluid,” we mean that the button becomes a part of a larger,\ncompound component by bleeding to two or more edges of its container. Rather\nthan defining the fluid button in columns or mini units, its width is defined as\na percentage (often 50%) of the container’s width.\nWithin the layout of a page, primary, secondary, or tertiary variants of buttons\ncan have fluid widths. In more contained spaces, like in tearsheets or modals, a\nghost button can have a fluid width when paired with other buttons in a group.\nAlso, as a general rule, fluid buttons are never left-aligned in a layout or a\ncontainer—they’re either right-aligned or span the full width of the container.\nLogin screen using a fluid input field and a fluid button.\nDo bleed ghost button hovers when they are paired with other fluid buttons.\nDo not use a tertiary button in a fluid application.\nFluid button border\nThere is a 1px border between all fluid buttons that use the\n$button-separator\nCopy to clipboard\ntoken for borders. This feature adds a 3:1 distinction between the two\ninteractive UI elements. The border is a recommended feature to improve\naccessibility. Refer to the\nStyle tab\nfor more guidance.\nExample of $button-separator token border between fluid buttons.\nHorizontally arranged groups\nWhen using multiple buttons, the position of the primary button adheres to the\nalignment guidance\nabove. To sum up, a primary button will be\nleft-aligned and positioned to the left of the secondary/tertiary button on\nfull-page designs. The primary button will be right-aligned and appear to the\nright of the secondary/tertiary button within wizards and dialog windows.\nNote:\nThis guidance has changed. Previously we advocated maintaining the\nprimary button position to the right of the secondary button when the button\ngroup was left-aligned. After talking to teams and doing more research, we’ve\nrevised our position.\nVertically stacked button groups\nTypical product landing pages have buttons side by side. However vertical button\ngroups are also common in products, to save real estate in narrow columns and\noccasionally side panels.\nThese stacked buttons can act as fluid buttons bleeding into the side panel, or\nthey can have a 16px spacing surrounding the side panel. The 16px spacing allows\nthe use of a tertiary button in the vertically stacked button group. In these\ninstances, the primary button is always on top and the secondary or tertiary\nbutton is below.\nNote: Experimenting with stacked fluid buttons would require an override to the\nexisting code.\nButton group combinations\nButton groups can consist of different button variants depending on the product\nuse case. We recommend the following combination of button groups.\nButton groups with a primary button\nNumber of buttons\nRecommended combinations\n2\nPrimary and secondary button\nPrimary and tertiary button\nPrimary and ghost button\nPrimary and danger tertiary button\nDanger primary and secondary button\nDanger primary and ghost button\n3\nPrimary, secondary, and tertiary button\nPrimary, secondary, and ghost button\nPrimary and 2 secondary buttons\nPrimary and 2 tertiary buttons\nPrimary, tertiary, and danger tertiary\nButton groups without a primary button\nNumber of buttons\nRecommended combinations\n2\n2 Tertiary buttons\nTertiary and ghost button\n2 Ghost buttons\n3\n3 Tertiary buttons\n2 Tertiary and 1 danger tertiary button\nButton group combinations to avoid\nButton groups can consist of different button variants depending on the product\nuse case. We recommend avoiding the following combination of button groups.\nDo not use two high-emphasis buttons in a button group.\nDo not use two high-emphasis buttons in a button group.\nDo not use the secondary button in conjunction with non-primary buttons.\nDo not use tertiary and danger tertiary buttons together.\nDo not use primary and danger ghost buttons together.\nDo not use tertiary and danger ghost buttons together.\nContent\nMain elements\nButton label\nA button’s label is the most important element on a button, as it communicates\nthe action that will be performed when the user interacts with it. Buttons need\nto be clear and predictable.\nButton labels should clearly indicate the action of the button. To provide\nenough context, use the {verb} + {noun} content formula on\nbuttons except in the case of common actions like “Done”, “Close”, “Cancel”,\n“Add”, or “Delete”.\nThere are exceptions to this rule for situations in which button length could\ncause problems in compact UIs or negatively impact translation, but the\n{verb} + {noun} formula is still best practice.\nBy default Carbon uses sentence case for all button labels.\nFor consistency, see Carbon’s\ncontent guidelines\nfor a list of\nrecommended action labels.\nDo use the {verb} + {noun} content formula in buttons whenever possible.\nDo not use only a noun as a button label.\nLabel alignment\nDo left-align the label in a button, even if the button is wide.\nDo not center align the label in a button, even if the button is wide.\nInternationalization (RTL)\nFor right-to-left (RTL) languages, the entire button is mirrored horizontally.\nThe label is right-aligned and the icon is left-aligned.\nPrimary button without and with RTL.\nOverflow content\nWhen the button’s label is too long to fit within the available space of the\nbutton, the label should overflow and wrap to the second line. We do not\nrecommend truncating a button label.\nAs mentioned above, it is best practice to keep button label succinct and follow\nthe {verb} + {noun} content formula.\nDo wrap the button label to a second line if there’s overflow content.\nDo not truncate the label of a button if there’s insufficient space inside the button.\nFurther guidance\nFor further content guidance, see Carbon’s\ncontent guidelines\n.\nUniversal behaviors\nPrimary button focus\nThe primary button is the default action. When dialogs appear, the primary\nbutton typically takes focus. On a form, if focus is on a component that is not\nactionable with the\nEnter\nCopy to clipboard\nkey, pressing\nEnter\nCopy to clipboard\nwill activate the primary\nbutton.\nPrimary button takes default focus when there’s no other actionable component\nin a dialog.\nStates\nThe default and interactive states of buttons should follow the\nbutton\nStyle\ntab guidelines.\nInteractions\nMouse\nUsers can trigger a button by clicking anywhere within the button container.\nMouse interaction for button.\nKeyboard\nUsers can trigger a button by pressing\nEnter\nCopy to clipboard\nor\nSpace\nCopy to clipboard\nwhile the button has\nfocus. For additional keyboard interactions, see the\nAccessibility\ntab.\nLoading\nButtons can have\ninline loading\nthat provides visual feedback that the action is in process. The button would be\ndisabled when inline loading is in progress.\nInline loading in the context of a button.\nPrimary button\nPrimary button is used for the principal call to action on the page. Primary\nbutton should only appear once per screen (the only exceptions are temporary\nflows with primary actions). Primary button helps give the user focus and gives\nthem context behind the expected next step.\nPrimary button in the context of a product UI.\nTemporary flows with primary action\nThere may be times when there is a primary button on a page, but through\ninteraction with the page content, another flow may be launched that has its own\nprimary button. Temporarily, there may be two primary buttons on a page.\nIn this case, a user has triggered something with an intention to focus on\nanother flow, therefore temporarily having two primary buttons on a page is\nacceptable. This is the only scenario where having two primary actions on a page\nis advised.\nA temporary user flow where a data table with primary action has an open side\npanel with its own primary action.\nBest practices\nNot every page needs a primary button\nSometimes the primary purpose of the page is to interact with other components\nor read over content, rather than to trigger an action. In this case, use\ntertiary and ghost buttons for these supporting actions or experiences.\nThe primary intent of this page is to present content, with actions like\nfiltering and editing represented by tertiary and ghost buttons.\nSecondary button\nAs mentioned in the\nemphasis section\n,  secondary buttons are\ntonally heavy but have less visual prominence than their primary counterparts\ndue to their lower saturation. As a result, secondary buttons are intended to be\nused in conjunction with a primary button. When used in a pair, the secondary\nbutton executes the set’s negative action, like “Cancel” or “Back.”\nSecondary button in the context of a product UI.\nSecondary buttons should not be used in isolation or for a positive/primary\naction. See\nbutton groups\nfor more guidance on how to use\nsecondary buttons.\nDo use the secondary button in conjunction with the primary button.\nDo not use the secondary button in isolation or for a positive/primary action.\nTertiary button\nTertiary buttons have less prominence than a primary button and slightly more\nprominence than a ghost button. Tertiary buttons work well on their own or as\npart of a button group.\nTertiary button in the context of a product UI.\nTertiary buttons should stay aligned with the content of the page. Always make\nsure the tertiary button has adequate padding on all sides. As mentioned in the\nfluid button guidance\n, tertiary buttons should not be used in\nfluid arrangements.\nDo align the tertiary button with the rest of the content.\nDo not use a tertiary button in a fluid arrangement.\nBest practices\nTertiary buttons for page headers\nIt is challenging to use a primary button in the header of a page because the\ncontent beneath the header is probably going to have a primary action, or will\nin a future release. Even if the the button in the page header is not styled as\na primary button, it has significant prominence due to its hierarchical\nplacement at the top.. Therefore, it is advised to use a tertiary button for\npage headers.\nIf it is determined that the button in the page header, across all tabs, should\nbe primary, ensure none of the content below the header contain another primary\naction.\nDo use a tertiary button in the page header if there is a primary button in the content section.\nDo not use a primary button in the page header and the content section.\nTertiary buttons in button groups\nIn\nbutton groups\n, where there is one primary and two other\nactions with shared importance, consider using tertiary buttons.\nExample of tertiary buttons used in button groups.\nTertiary buttons in empty states\nFor empty states that appear on pages that already have the primary action\ndefined, a tertiary button is the ideal solution to launch a new task flow.\nExample of a tertiary button used with empty state content.\nGhost button\nGhost buttons have the least prominence among the button variants. Ghost buttons\nare more subtle, making them ideal for supplementary actions. They work best\nwhen they are flush against a container or horizontally grouped with other\nelements.\nGhost button in the context of a product UI.\nAligning ghost buttons\nGhost buttons work well when aligned to a corner of a container. The general\nrule for vertically aligning a ghost button with other content is to ensure its\nlabel aligns with the text elsewhere on the page.\nDo align the ghost button label with the rest of the content.\nDo not align the edge of the ghost button with the rest of the content, even if it looks partially aligned.\nGhost buttons can be useful for small supplementary actions in side panels. In\nthis context, extending the width of the ghost button to the full width of the\ncontainer makes this treatment seem intentional. Aligning to the full width of a\ncontainer is only recommended when the containers are smaller in size such as a\nside panel of 480px (medium) and below.\nDo extend the ghost button to the full width of the side panel.\nDo not leave a ghost button hanging halfway within the side panel.\nGhost buttons can also be aligned horizontally and inline with other components\non the page.\nExample of a ghost button aligned horizontally and inline with a component.\nBest practices\nGhost buttons for data table actions\nButtons in the table toolbar are often depicted as a primary button, but this\nmight not always be the case. Use a ghost button instead if there is another\nbutton on the page that requires primary styling.\nA ghost button represents the data table’s primary action to avoid conflict\nwith the primary button in the page header.\nGhost buttons in productive cards\nIn dashboards with multiple productive cards, ghost buttons work well as they\ndraw less attention than a tertiary button. For a ghost button to appear aligned\nin vertical arrangements within a container, it is recommended that it touches\nat least two edges of the container.\nSee\nthe\ncards component\nfor more details.\nExample of a ghost button used in cards.\nGhost button used as a cancel action\nGhost buttons work well as a cancel button in progressive flows, as they draw\nless attention; users have to purposefully find and click the button to cancel.\nIn tearsheets, the buttons are fluid, which wouldn’t be a suitable application\nfor a tertiary button.\nExample of ghost button used in a modal.\nDanger button\nDanger button is used for actions that could have destructive effects, such as\n“Delete”, “Remove”, or “Stop”.\nThe danger button has three different styles:\nprimary\n,\ntertiary\n, and\nghost\n. Determining\nwhich danger button style to use will depend on the level of emphasis you want\nto give to the destructive action. Destructive actions that are a required or\nprimary step in a workflow should use the primary danger button style. However,\nif a destructive action is just one of several actions a user could choose from,\nthen a lower emphasis style like the tertiary danger button or the ghost danger\nbutton may be more appropriate.\nDanger button in the context of a product UI.\nDo use a tertiary danger button for lower emphasis destructive actions.\nDo use a ghost danger button for lower emphasis destructive actions.\nModifiers\nButton with icon\nIcons can be placed next to labels to clarify an action and call attention to a\nbutton. However, icons should be used sparingly, as overuse can create visual\nnoise and make an experience less usable. If you use a button with an icon in\none part of your UI it does not mean that you need to add icons to all other\nbuttons.\nUse a 16px icon within buttons; use a 20px icon within the large expressive\nbuttons.\nIcons are distinguished by their solid shape and knocked-out details.\nIcons should always appear to the right of the label.\nIcons used in buttons must be directly related to the action that the user is\ntaking.\nIcons must match the color value of the label within a button.\nDo place the icon on the right side of the button after the label.\nDo not place the icon to the left of the label on the button.\nDo use 8px spacing between the label and the icon in a ghost button.\nDo not leave too much space between the label and the icon in a ghost button.\nUniversal actions with well-established icons\nWhen deciding whether to add an icon to a button, it’s important to consider how\nrecognizable the icon is and whether, in other contexts, a similar icon may be\nused for a different meaning. We want to avoid the same icon being used for\ncompletely different actions.\nFor this reason, we have defined a set of universal actions suitable for adding\nan icon alongside the button label. These have clearly defined and widely\nrecognized icons within IBM Software and beyond.\nIcons that are not in this list can be used in buttons, as long as the icon\nclearly conveys the intended action. To determine the expected use of an icon,\ncheck its name in the\nCarbon icon library\n.\nName of action\nAssociated icon\nName in icon library\nCreate/Add\nAdd\nEdit\nEdit\nCopy\nCopy\nDelete\nTrash can\nRemove\nSubtract alt\nExport\nExport\nUpload\nUpload\nDownload\nDownload\nPlay/Start\nPlay\nPause\nPause\nStop\nStop outline\nRefresh\nRestart\nDo you think a universal action with a clearly defined icon is missing? Let us\nknow\nhere\n.\nDo not use a defined icon to represent a different universal action\nUsing icons in the above list for other actions can confuse the expected outcome\nand experience.\nDo use a defined icon to represent a universal action.\nDo not use an icon for an action that would not be associated with it.\nLaunch icon\nThe launch icon should be used on any call to action that launches the user into\nanother tab (whether the content of the new tab is part of the same product or\nan entirely separate web resource). Buttons and links requiring the launch icon\nare often found in the UI left navigation area, side panel, cards, and modals.\nThe target destination of the launch action should be made clear to the user\nthrough the button or link label and the surrounding context.\nFor IBMers only:\nSee the\nnavigation labels\nof our content guide.\nExample of a tertiary button with icon indicating that clicking the button\nwould launch a new page.\nBe consistent with icon usage for buttons in a button group\nUsing icons in button groups is optional. We recommend showing an icon for each\nbutton in a button group or showing no icons for consistency. A benefit of\npairing an icon with a button label is that it visually describes its action and\ndirects more attention to it. However, in some cases, using too many buttons\nwith icons in a group can create unwanted noise in the UI and tend to\novercomplicate a simple experience.\nOnly use icons in button groups for the universal actions listed in the table\nabove or for other actions where a particular icon is commonly paired and\nassociated.\nDo follow a consistent approach across button groups when introducing icons.\nDo follow a consistent approach across button groups when introducing icons.\nDo not introduce icons only for a few buttons in a button group.\nDo not introduce icons only for a few buttons in a button group.\nUse the default variation for all icons\nThe Carbon library contains filled variants of a few icons. Since not every icon\nhas this variation, we advise using the default option for all icons (the only\nexception is status icons, which have their own defined icon to use). Default\nicons are named after their action.\nDo use the default icon which is “Play”.\nDo not use the filled icon variations.\nIcon only buttons\nIcon only buttons allow users to take actions, and make choices, with a single\ntap. Icon buttons can take the form of a primary, secondary, tertiary, or ghost\nvariant but most commonly will be styled as primary or ghost buttons.\nIcon only buttons should be used sparingly. “For most situations, users learn\ncorrect interpretations better with text alone than with icons alone.” —\nWiedenbeck, S (1999). For this reason, using icon only buttons is recommended\nfor the following use cases:\nThe icon must be standardized and recognizable without label or must represent\nan action with a strong visual attribute, such as a pin icon for a pinning\naction.\nThere is insufficient space and multiple actions, therefore a toolbar using\nicon buttons is required. See\nthe\ntoolbar component\nfor more details.\nExample of an icon only ghost button in a toolbar showing a tooltip on hover.\nTooltips for icon only buttons\nRegardless of how recognizable an icon may or may not be, or whether that action\nlies within the universal actions list, a tooltip is always required with text\nexplaining what the icon button would do if clicked.\nExample of an icon only ghost button showing a tooltip on hover.\nColors of icon only ghost buttons\nCarbon builds type, color, and spacing tokens into its components, improving the\nease of component usage. Do not change the color token for icon only ghost\nbuttons. The same applies for specifications across components. Learn more about\nicon only ghost button colors in the\nStyle\ntab.\nDo use the system’s defined color for ghost icon only buttons.\nDo not change the color for ghost icon only buttons.\nDanger buttons cannot be used in an icon only form\nDanger can be a critical action and should be applied to a button that holds\nhigher emphasis along with a visual label. As mentioned in\nthe\ndanger button guidance\n,  it is best to use a danger button\nin a primary, tertiary, or ghost button form.\nDo use a visual label in a danger button for a destructive action.\nDo not use a danger button in an icon only form for a destructive action.\nRelated\nButton labels\nFixed button bars\nForm pattern\nIcons\nLink component\nMenu buttons\nModal component\nReferences\nMehmet Goktürk,\nThe Glossary of Human Computer Interaction, Chapter 37\n(The Interaction Design Foundation)\nJakob Nielsen,\nOK-Cancel or Cancel-OK? The Trouble With Buttons\n(Nielsen Norman Group, 2008)\nArtem Syzonenko\nButtons on the web: placement and order\n(UX Collective, 2019)\nWiedenbeck, S (1999). The use of icons and labels in an end-user application\nprogram: An empirical study of learning and retention. Behavior & Information\nTechnology, 18(2), p68–82\nFeedback\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\nGitHub\n.\nEdit this page on GitHub\nPrevious\nComponents: Breadcrumb\nNext\nButton: Style",
  "content_markdown": "# Button\n\nButtons are used to initialize an action. Button labels express what action will\noccur when the user interacts with it.\n\n**Note:** Some of the examples we discuss here include fluid (full-span) and\nhanging buttons which are not available for production use. This guidance\nreflects our current understanding of these topics and we are working towards\nreleasing this work in a future version of Carbon.\n\n- [Live demo](#live-demo)\n- [Overview](#overview)\n- [Formatting](#formatting)\n- [Content](#content)\n- [Universal behaviors](#universal-behaviors)\n- [Primary button](#primary-button)\n- [Secondary button](#secondary-button)\n- [Tertiary button](#tertiary-button)\n- [Ghost button](#ghost-button)\n- [Danger button](#danger-button)\n- [Modifiers](#modifiers)\n- [Related](#related)\n- [References](#references)\n- [Feedback](#feedback)\n\n## Live demo\n\nTheme selector\n\nWhite\n\n---\n\nVariant selector\n\nDefault\n\n---\n\nThis live demo contains only a preview of functionality and styles available for this component. View the [full demo](https://react.carbondesignsystem.com/?path=/story/components-button--default&globals=theme:white) on Storybook for additional information such as its version, controls, and API documentation.\n\n### Accessibility testing status For every latest release, Carbon runs tests on all components to meet the [accessibility requirements](https://www.ibm.com/able/requirements/requirements/). These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n## Overview\n\nButtons are clickable elements that are used to trigger actions. They\ncommunicate calls to action to the user and allow users to interact with pages\nin a variety of ways. Button labels express what action will occur when the user\ninteracts with it.\n\n#### When to use\n\nUse buttons to communicate actions users can take and to allow users to interact\nwith the page. Each page should have only one primary button. Any remaining\ncalls to action should be represented as lower emphasis buttons.\n\n#### When not to use\n\nDo not use buttons as navigational elements. Instead, use\n[links](https://www.carbondesignsystem.com/components/link/usage) when the\ndesired action is to take the user to a new page.\n\n### Variants\n\nEach button variant has a particular function and its design signals that\nfunction to the user. It is, therefore, very important that the different\nvariants are implemented consistently across products to convey the correct\nactions.\n\n| Variant | Purpose |\n| --- | --- |\n| [Primary](#primary-button) | For the principal call to action on the page. Primary buttons should only appear once per screen (not including the application header, modal dialog, or side panel). |\n| [Secondary](#secondary-button) | For secondary actions on each page. Secondary buttons can only be used in conjunction with a primary button. As part of a pair, the secondary button’s function is to perform the negative action of the set, such as “Cancel” or “Back”. Do not use a secondary button in isolation and do not use a secondary button for a positive action. |\n| [Tertiary](#tertiary-button) | For less prominent, and sometimes independent, actions. Tertiary buttons can be used in isolation or paired with a primary button when there are multiple calls to action. Tertiary buttons can also be used for sub-tasks on a page where a primary button for the main and final action is present. |\n| [Ghost](#ghost-button) | For the least pronounced actions; often used in conjunction with a primary button. In a situation such as a progress flow, a ghost button may be paired with a primary and secondary button set, where the primary button is for forward action, the secondary button is for “Back”, and the ghost button is for “Cancel”. |\n| [Danger](#danger-button) | For actions that could have destructive effects on the user’s data (for example, delete or remove). Danger button has three styles: primary, tertiary, and ghost. |\n\n## Formatting\n\n### Anatomy\n\nA button’s label communicates the action that is performed when the user\ninteracts with it. In an icon only button, that has no label, the icon must\naccurately represent what the button does.\n\nIn a Carbon button, the label is always left-aligned, not center-aligned. The\nicons in a button with a label is right-aligned but in an icon only button, the\nicon is centered.\n\n![Button anatomy](/static/1b27abfd7556144883e3c671402c95eb/3cbba/button_usage_2.png)\n\nAnatomy of buttons\n\n#### 1. Button\n\nA. Label   \n B. Container   \n C. Icon (optional)\n\n#### 3. Ghost button\n\nA. Label   \n C. Icon (optional)\n\n#### 2. Tertiary button\n\nA. Label   \n B. Container   \n C. Icon (optional)\n\n#### 4. Icon button\n\nB. Container   \n C. Icon\n\n### Button sizes\n\nThe button is available in seven different sizes: **extra small**, **small**,\n**medium**, **large (productive)**, **large (expressive)**, **extra large**, and\n**2XL**. The table below adds more context around the use case for each size.\nFor guidance on button heights, see [Size](/components/button/style/#size) on\nthe Style tab.\n\nWe do not recommend mixing different button sizes in #button-groups.\n\n| Button size | Use case |\n| --- | --- |\n| Extra small | Use when vertical space is limited or in areas with a confined layout. |\n| Small | Use when buttons are paired with 32px small sized input fields. |\n| Medium | Use when buttons are paired with 40px medium sized input fields. |\n| Large (productive) | This is the most common button size in software products. Pairs with 14px body copy. |\n| Large (expressive) | The larger expressive type size within this button provides balance when paired with 16px body copy. Used by the IBM.com team in website banners. |\n| Extra large | Use when buttons bleed to the edge of a larger component, like in the context of modals, side panel and narrow tearsheets. |\n| 2XL | Use when buttons bleed to the edge of a full-screen component, like in the context of large tearsheets. |\n\n![Button sizes](/static/66187b8b313bafed629f67032e87ccb6/3cbba/button_usage_3.png)\n\nSizes of buttons in relation to its usage.\n\n### Emphasis\n\nYou don’t necessarily need to use the buttons in the order that their labels\nimply. Although secondary buttons have less visual prominence because they are\nless saturated than their primary counterparts, they are still tonally heavy. If\nyour layout requires multiple actions—as is the case with some toolbars, data\nlists and dashboards—low emphasis buttons (tertiary or ghost) may be a better\nchoice.\n\nThe most important thing is to establish a visual hierarchy between the buttons\nin your UI. Keep these best practices in mind.\n\n#### A single, high-emphasis button\n\nAs a general rule, a layout should contain a single high-emphasis button that\nmakes it clear that other buttons have less importance in the hierarchy. This\nhigh-emphasis button commands the most attention.\n\n#### Multiple button emphasis\n\nA high-emphasis button can be accompanied by medium- and low-emphasis buttons\nthat perform less important actions. Keep in mind that you should only group\ntogether calls to action that have a relationship to one another.\n\n![Do use high-emphasis and medium-emphasis buttons in a button group.](/static/d7252bafc6f3f6d6ef95e368993a31a5/a5df1/button_usage_8.png)\n\nDo use high-emphasis and medium-emphasis buttons in a button group.\n\n![Do not use two high-emphasis buttons in a button group.](/static/fded80d07f1616a2dbd5dd896be70f7b/a5df1/button_usage_9.png)\n\nDo not use two high-emphasis buttons in a button group.\n\n### Alignment\n\nAlignment refers to whether the buttons are aligned to the right or the left of\na window, container, or layout. Buttons are unique, more so than any other\ncomponent, in that their alignment depends on where they appear and whether or\nnot they’re contained within another component.\n\nAs a general rule, on full-page designs, the primary button is on the left side\nof the page. When the browser window is large and the user is scrolling to read,\nit’s best to have the primary button where the user’s attention has been focused\nall along. Whereas in wizards, where a user is progressing through a series of\nsteps or dialog windows, the primary action traditionally sits at the bottom\nright. Buttons within components such as notifications, search fields, and data\ntables are also right-aligned.\n\nIn some cases a button group—or even a single button in the case of a side panel\nor small tile—may span the entire width of a window or container. Typical nested\nbutton locations include:\n\n- Banner calls to action\n- Dialog windows\n- Wizards\n- Forms\n- Cards\n- Toolbars\n\n![Primary button context](/static/7ba0382c0f40976a7927ddcec2e9c623/3cbba/button_usage_10.png)\n\nAlignment of buttons across various layouts.\n\n| Alignment | Use case |\n| --- | --- |\n| Left-justified | Banner call to actions, in-page forms, and nested buttons in components like tiles. |\n| Right-justified | Inline notifications, inline field buttons and data tables, progressive forms, wizards, and single-button dialogs. |\n| Full-span | Dialogs, side panel, and small tiles; currently Carbon does not offer a way to implement full-span buttons in code, without an override as mentioned [here](https://github.com/carbon-design-system/carbon/blob/66c14c2d2631a868703073a6cfabf1fd03a0b9e7/packages/styles/scss/components/button/_mixins.scss#L56), they max out at 320px. |\n\n#### Fixed width button\n\nButton alignment is also closely related to whether the button is treated as a\nfixed or a fluid element within a layout. When we say “fixed,” there is a fixed\npadding of 16px to the left and a 64px padding to the right of the button label.\nThe button label determines the button’s width. Refer to the\n[Style tab](/components/button/style#button-structure) for more guidance.\n\n![Example of a fixed width primary button in a layout.](/static/9b9e0e26088f8c3490884b34c71857c4/3cbba/button_usage_bg_1.png)\n\nExample of a fixed width primary button in a layout.\n\n#### Hanging versus non-hanging button alignment\n\nHanging button alignment is when the button label is aligned to the grid rather\nthan the container. This alignment should be used to group sections between\ncomponents and buttons that directly affect each other.\n\nNon-hanging button alignment is when the button container is aligned to the\ngrid. These rules apply to buttons with a visible container. For buttons that\ndon’t have a visible container in the default state, such as ghost button and\ndanger ghost button, refer to\n[ghost button](/components/button/usage/#ghost-button) alignment.\n\n![Example of a fixed width button’s hanging alignment.](/static/f3bbeba31be95f8aa53db0ac855a0e25/a5df1/button_usage_bg_2.png)\n\nExample of a fixed width button’s hanging alignment.\n\n![Example of a fixed width button’s non-hanging alignment.](/static/e57d396d003094cc0250a31f618cdcac/a5df1/button_usage_bg_3.png)\n\nExample of a fixed width button’s non-hanging alignment.\n\n#### Fluid width button\n\nThere is a hybrid scenario where a floating primary, secondary, or tertiary\nbutton can span a designated number of columns on the responsive column grid,\ngiving it a fluid width. These are called “fluid width buttons.”\n\nFluid width buttons are always preferable to fixed width default buttons in a\nlayout. When possible, set the button container’s relative position to the\nresponsive layout grid and match the button width to the width of other elements\non the page. Ideally, when using groups of related buttons (not including ghost\nbuttons unless in a tearsheet or modal), they should all be the same width. See\nbutton groups below for more detailed information.\n\n![Example of a fluid width primary button matching the width of a card in a layout.](/static/c802d07ce53a128d1dcd3b90e5562da0/3cbba/button_usage_bg_4.png)\n\nExample of a fluid width primary button matching the width of a card in a\nlayout.\n\n### Button groups\n\nButton groups are a useful way of aligning buttons that have a relationship.\nGroup the buttons logically into sets based on usage and importance. Too many\ncalls to action will overwhelm and confuse users so they should be avoided.\n\nAs mentioned in the [Emphasis section](#emphasis), you don’t necessarily need to\nuse the buttons in the order that their labels imply. Either a secondary or a\ntertiary button can be used in conjunction with a primary button. In fact, due\nto the visual weight of the secondary button, it’s recommended to use tertiary\nor ghost buttons in layouts with more than three calls to action.\n\n![Example of button groups in a UI.](/static/1f9e981a53484200a07fae2ef96417e1/3cbba/button_usage_bg_5.png)\n\nExample of button groups in a UI.\n\n#### Button groups versus menu buttons\n\nButton groups should be used when there are either two or three actions that a\nuser needs to consider. Any more than three actions should be grouped\nmeaningfully using [menu buttons](/components/menu-buttons/usage/), to reduce\nthe amount of space these actions take up on a page. Alternatively, for\ninterfaces that need many common actions or functions, consider using a\n[toolbar](https://pages.github.ibm.com/carbon/ibm-products/components/toolbar/usage/).\n\n![Do use menu buttons to group meaningful actions being applied to the same data.](/static/c2aa4e28aa7a6b625b1430016b95d256/6e9cd/button_usage_bg_6.png)\n\nDo use menu buttons to group meaningful actions being applied to the same data.\n\n![Do not use many individual buttons applying to the same data.](/static/099c1c7a89b2c30d692bc16a4a1578d3/6e9cd/button_usage_bg_7.png)\n\nDo not use many individual buttons applying to the same data.\n\n#### Button width in button groups\n\nWhen using groups of related buttons (not including ghost buttons), they should\nall be the same width. The width of all the buttons is usually determined by the\nlongest button label.\n\n*Note: We recommend following this guidance for both the toolbar and the batch\nactions toolbar as well.*\n\n![Example of button width in button groups.](/static/420ddb4ec7cb31d419b633ab6e467f35/3cbba/button_usage_bg_8.png)\n\nExample of button width in button groups.\n\n![Do apply the same width to all buttons in a group, even if they don’t bleed.](/static/567bbe81e6afacaea3f4cb22388be5d6/a5df1/button_usage_bg_9.png)\n\nDo apply the same width to all buttons in a group, even if they don’t bleed.\n\n![Do not make buttons in a group different widths.](/static/c969ff343c5b7d3d0b7efb5bac42586c/a5df1/button_usage_bg_10.png)\n\nDo not make buttons in a group different widths.\n\n#### Hanging versus non-hanging fluid width button group alignment\n\nThis can be achieved in one of two ways, both of which are acceptable. The first\napproach involves using the\n[narrow gutter mode](https://carbondesignsystem.com/elements/2x-grid/usage/#gutter-modes).\nIn this situation, each button would be set individually on the column grid.\n\n*Note: Carbon developers are working on the narrow gutter mode, currently\nleft-hanging buttons can only be achieved with an override.*\n\nSome products don’t want to hang their buttons into the gutter, but still want a\n16px distance between buttons. This can be achieved while maintaining same-width\nbuttons by treating the button group as a single object (rather than two\nseparate entities) on the grid. Each button will essentially span 50% of its\ncontainer with a programmatic 16px gutter between them.\n\n![Example of hanging buttons in a button group.](/static/5612787209267871af699b79b984ae23/6e9cd/button_usage_bg_11.png)\n\nExample of hanging buttons in a button group.\n\n![The button group is treated as one element on the grid to achieve a 16px gutter between the two, without the gutter hang.](/static/51f109ddd7700302daecf0dcb370162e/6e9cd/button_usage_bg_12.png)\n\nThe button group is treated as one element on the grid to achieve a 16px gutter between the two, without the gutter hang.\n\n#### Fluid button groups\n\nWhen we say “fluid,” we mean that the button becomes a part of a larger,\ncompound component by bleeding to two or more edges of its container. Rather\nthan defining the fluid button in columns or mini units, its width is defined as\na percentage (often 50%) of the container’s width.\n\nWithin the layout of a page, primary, secondary, or tertiary variants of buttons\ncan have fluid widths. In more contained spaces, like in tearsheets or modals, a\nghost button can have a fluid width when paired with other buttons in a group.\nAlso, as a general rule, fluid buttons are never left-aligned in a layout or a\ncontainer—they’re either right-aligned or span the full width of the container.\n\n![Login screen using a fluid input field and a fluid button.](/static/ef7ef467268c97d47789f3584e7facd1/3cbba/button_usage_11.png)\n\nLogin screen using a fluid input field and a fluid button.\n\n![Do bleed ghost button hovers when they are paired with other fluid buttons.](/static/253b82b2f8b1846a09008dbd87bbe396/a5df1/button_usage_12.png)\n\nDo bleed ghost button hovers when they are paired with other fluid buttons.\n\n![Do not use a tertiary button in a fluid application.](/static/aa40a40baa862d4baf1a8b0783c4d026/a5df1/button_usage_13.png)\n\nDo not use a tertiary button in a fluid application.\n\n#### Fluid button border\n\nThere is a 1px border between all fluid buttons that use the\n\n```\n$button-separator\n```\n\nCopy to clipboard\n\ntoken for borders. This feature adds a 3:1 distinction between the two\ninteractive UI elements. The border is a recommended feature to improve\naccessibility. Refer to the\n[Style tab](/components/button/style#button-groups-structure) for more guidance.\n\n![Example of $button-separator token border between fluid buttons.](/static/339353ed8e87283ea49049afd54584db/3cbba/button_usage_14.png)\n\nExample of $button-separator token border between fluid buttons.\n\n#### Horizontally arranged groups\n\nWhen using multiple buttons, the position of the primary button adheres to the\n[alignment guidance](#alignment) above. To sum up, a primary button will be\nleft-aligned and positioned to the left of the secondary/tertiary button on\nfull-page designs. The primary button will be right-aligned and appear to the\nright of the secondary/tertiary button within wizards and dialog windows.\n\n**Note:** This guidance has changed. Previously we advocated maintaining the\nprimary button position to the right of the secondary button when the button\ngroup was left-aligned. After talking to teams and doing more research, we’ve\nrevised our position.\n\n![Button groups in context](/static/ad75c608c362d5d13c5aa025f4b98f6d/3cbba/button_usage_23.png)\n\n#### Vertically stacked button groups\n\nTypical product landing pages have buttons side by side. However vertical button\ngroups are also common in products, to save real estate in narrow columns and\noccasionally side panels.\n\nThese stacked buttons can act as fluid buttons bleeding into the side panel, or\nthey can have a 16px spacing surrounding the side panel. The 16px spacing allows\nthe use of a tertiary button in the vertically stacked button group. In these\ninstances, the primary button is always on top and the secondary or tertiary\nbutton is below.\n\n*Note: Experimenting with stacked fluid buttons would require an override to the\nexisting code.*\n\n![Fluid and default stacked button group examples](/static/cdc5cc07091ff4be5cd2628bc1706529/3cbba/button_usage_24.png)\n\n#### Button group combinations\n\nButton groups can consist of different button variants depending on the product\nuse case. We recommend the following combination of button groups.\n\nButton groups with a primary button\n\n| Number of buttons | Recommended combinations |\n| --- | --- |\n| 2 | - Primary and secondary button - Primary and tertiary button - Primary and ghost button - Primary and danger tertiary button - Danger primary and secondary button - Danger primary and ghost button |\n| 3 | - Primary, secondary, and tertiary button - Primary, secondary, and ghost button - Primary and 2 secondary buttons - Primary and 2 tertiary buttons - Primary, tertiary, and danger tertiary |\n\nButton groups without a primary button\n\n| Number of buttons | Recommended combinations |\n| --- | --- |\n| 2 | - 2 Tertiary buttons - Tertiary and ghost button - 2 Ghost buttons |\n| 3 | - 3 Tertiary buttons - 2 Tertiary and 1 danger tertiary button |\n\n#### Button group combinations to avoid\n\nButton groups can consist of different button variants depending on the product\nuse case. We recommend avoiding the following combination of button groups.\n\n![Do not use two high-emphasis buttons in a button group.](/static/fded80d07f1616a2dbd5dd896be70f7b/a5df1/button_usage_bg_14.png)\n\nDo not use two high-emphasis buttons in a button group.\n\n![Do not use two high-emphasis buttons in a button group.](/static/6e1bd59b5a00b17cc5f6309ae199fc5f/a5df1/button_usage_bg_13.png)\n\nDo not use two high-emphasis buttons in a button group.\n\n![Do not use the secondary button in conjunction with non-primary buttons.](/static/f4285874ee5b5a871e8f6f65e907a7e8/a5df1/button_usage_bg_16.png)\n\nDo not use the secondary button in conjunction with non-primary buttons.\n\n![Do not use tertiary and danger tertiary buttons together.](/static/f90b46b9ab29295e31742e2b5f7fd79f/a5df1/button_usage_bg_18.png)\n\nDo not use tertiary and danger tertiary buttons together.\n\n![Do not use primary and danger ghost buttons together.](/static/2abc48e50980f566a0b232e5709fd09d/a5df1/button_usage_bg_15.png)\n\nDo not use primary and danger ghost buttons together.\n\n![Do not use tertiary and danger ghost buttons together.](/static/9139aad3079b08403a786315c5dffee2/a5df1/button_usage_bg_17.png)\n\nDo not use tertiary and danger ghost buttons together.\n\n## Content\n\n### Main elements\n\n#### Button label\n\nA button’s label is the most important element on a button, as it communicates\nthe action that will be performed when the user interacts with it. Buttons need\nto be clear and predictable.\n\nButton labels should clearly indicate the action of the button. To provide\nenough context, use the {verb} + {noun} content formula on\nbuttons except in the case of common actions like “Done”, “Close”, “Cancel”,\n“Add”, or “Delete”.\n\nThere are exceptions to this rule for situations in which button length could\ncause problems in compact UIs or negatively impact translation, but the\n{verb} + {noun} formula is still best practice.\n\nBy default Carbon uses sentence case for all button labels.\n\nFor consistency, see Carbon’s\n[content guidelines](/guidelines/content/action-labels) for a list of\nrecommended action labels.\n\n![Do use the verb + noun content formula in buttons whenever possible.](/static/b1168579e269d14034c2ea75e9237975/a5df1/button_usage_26.png)\n\nDo use the {verb} + {noun} content formula in buttons whenever possible.\n\n![Do not use only a noun as a button label.](/static/e8f60f26377317f55f5a2845a8aa1cd5/a5df1/button_usage_27.png)\n\nDo not use only a noun as a button label.\n\nLabel alignment\n\n![Do left-align the label in a button, even if the button is wide.](/static/f033c8c492b327d4662a696c13c0083e/a5df1/button_usage_5.png)\n\nDo left-align the label in a button, even if the button is wide.\n\n![Do not center align the label in a button, even if the button is wide.](/static/da5bb4f00a9488c5b9efb0876518e2a9/a5df1/button_usage_6.png)\n\nDo not center align the label in a button, even if the button is wide.\n\n#### Internationalization (RTL)\n\nFor right-to-left (RTL) languages, the entire button is mirrored horizontally.\nThe label is right-aligned and the icon is left-aligned.\n\n![Primary button without and with RTL.](/static/3826efdcc0068728103d1e0171c7c283/3cbba/button-usage-RTL.png)\n\nPrimary button without and with RTL.\n\n### Overflow content\n\nWhen the button’s label is too long to fit within the available space of the\nbutton, the label should overflow and wrap to the second line. We do not\nrecommend truncating a button label.\n\nAs mentioned above, it is best practice to keep button label succinct and follow\nthe {verb} + {noun} content formula.\n\n![Do wrap the button label to a second line if there’s overflow content.](/static/f4bae65a4da706a34e42ed03ac4b86d4/a5df1/button_usage_overflow_1.png)\n\nDo wrap the button label to a second line if there’s overflow content.\n\n![Do not truncate the label of a button if there’s insufficient space inside the button.](/static/c805fc20709de8442663047831b0a62f/a5df1/button_usage_overflow_2.png)\n\nDo not truncate the label of a button if there’s insufficient space inside the button.\n\n### Further guidance\n\nFor further content guidance, see Carbon’s\n[content guidelines](https://carbondesignsystem.com/guidelines/content/overview/).\n\n## Universal behaviors\n\n### Primary button focus\n\nThe primary button is the default action. When dialogs appear, the primary\nbutton typically takes focus. On a form, if focus is on a component that is not\nactionable with the\n\n```\nEnter\n```\n\nCopy to clipboard\n\nkey, pressing\n\n```\nEnter\n```\n\nCopy to clipboard\n\nwill activate the primary\nbutton.\n\n![Primary button takes default focus when there’s no other actionable component in a dialog.](/static/4fc124a726d6336b1ef4de737dff5b37/3cbba/button_usage_ub_focus.png)\n\nPrimary button takes default focus when there’s no other actionable component\nin a dialog.\n\n### States\n\nThe default and interactive states of buttons should follow the\nbutton [Style](/components/button/style#color) tab guidelines.\n\n### Interactions\n\n#### Mouse\n\nUsers can trigger a button by clicking anywhere within the button container.\n\n![Mouse interaction for button.](/static/d95ca554d84aba10719ec77f57de25ba/3cbba/button_usage_ub_interaction.png)\n\nMouse interaction for button.\n\n#### Keyboard\n\nUsers can trigger a button by pressing\n\n```\nEnter\n```\n\nCopy to clipboard\n\nor\n\n```\nSpace\n```\n\nCopy to clipboard\n\nwhile the button has\nfocus. For additional keyboard interactions, see the\n[Accessibility](/components/button/accessibility) tab.\n\n### Loading\n\nButtons can have\n[inline loading](https://carbondesignsystem.com/components/inline-loading/usage/)\nthat provides visual feedback that the action is in process. The button would be\ndisabled when inline loading is in progress.\n\n![Inline loading in the context of a button.](/915fb05bd80aec9c1ecc3f2570397900/button-usage-ub-inline-loading.gif)\n\n![Inline loading in the context of a button.](images/button_usage_ub_loading_4.png)\n\nInline loading in the context of a button.\n\n## Primary button\n\nPrimary button is used for the principal call to action on the page. Primary\nbutton should only appear once per screen (the only exceptions are temporary\nflows with primary actions). Primary button helps give the user focus and gives\nthem context behind the expected next step.\n\n![Primary button in the context of a product UI.](/static/fadee354c639a9d7ab573e87b62cf1f2/3cbba/button_usage_primary_1.png)\n\nPrimary button in the context of a product UI.\n\n#### Temporary flows with primary action\n\nThere may be times when there is a primary button on a page, but through\ninteraction with the page content, another flow may be launched that has its own\nprimary button. Temporarily, there may be two primary buttons on a page.\n\nIn this case, a user has triggered something with an intention to focus on\nanother flow, therefore temporarily having two primary buttons on a page is\nacceptable. This is the only scenario where having two primary actions on a page\nis advised.\n\n![A temporary user flow where a data table with primary action has an open side panel with its own primary action.](/static/470fe154edb3fdbc6ff34a737e0d8d82/3cbba/button_usage_primary_2.png)\n\nA temporary user flow where a data table with primary action has an open side\npanel with its own primary action.\n\n### Best practices\n\n#### Not every page needs a primary button\n\nSometimes the primary purpose of the page is to interact with other components\nor read over content, rather than to trigger an action. In this case, use\ntertiary and ghost buttons for these supporting actions or experiences.\n\n![The primary intent of this page is to present content, with actions like filtering and editing represented by tertiary and ghost buttons.](/static/5b18c8f335d65ca01b8a1bfea28cc3c9/3cbba/button_usage_primary_3.png)\n\nThe primary intent of this page is to present content, with actions like\nfiltering and editing represented by tertiary and ghost buttons.\n\n## Secondary button\n\nAs mentioned in the [emphasis section](#emphasis),  secondary buttons are\ntonally heavy but have less visual prominence than their primary counterparts\ndue to their lower saturation. As a result, secondary buttons are intended to be\nused in conjunction with a primary button. When used in a pair, the secondary\nbutton executes the set’s negative action, like “Cancel” or “Back.”\n\n![Secondary button in the context of a product UI.](/static/3727fda794e423ba7755fad8aaf86cdb/3cbba/button_usage_secondary_1.png)\n\nSecondary button in the context of a product UI.\n\nSecondary buttons should not be used in isolation or for a positive/primary\naction. See [button groups](#button-groups) for more guidance on how to use\nsecondary buttons.\n\n![Do use the secondary button in conjunction with the primary button.](/static/d7252bafc6f3f6d6ef95e368993a31a5/a5df1/button_usage_secondary_2.png)\n\nDo use the secondary button in conjunction with the primary button.\n\n![Do not use the secondary button in isolation or for a positive/primary action.](/static/0ef10f29fda2c840e813718eeae92f26/a5df1/button_usage_secondary_3.png)\n\nDo not use the secondary button in isolation or for a positive/primary action.\n\n## Tertiary button\n\nTertiary buttons have less prominence than a primary button and slightly more\nprominence than a ghost button. Tertiary buttons work well on their own or as\npart of a button group.\n\n![Tertiary button in the context of a product UI.](/static/1dc0332dfa86b34243e2bf198af68278/3cbba/button_usage_tertiary_1.png)\n\nTertiary button in the context of a product UI.\n\nTertiary buttons should stay aligned with the content of the page. Always make\nsure the tertiary button has adequate padding on all sides. As mentioned in the\n[fluid button guidance](#alignment), tertiary buttons should not be used in\nfluid arrangements.\n\n![Do align the tertiary button with the rest of the content.](/static/07b9ed406f76365ebbb2fc2d9de003c9/a5df1/button_usage_tertiary_2.png)\n\nDo align the tertiary button with the rest of the content.\n\n![Do not use a tertiary button in a fluid arrangement.](/static/7bf758d779f8599509dca590ef5eff5d/a5df1/button_usage_tertiary_3.png)\n\nDo not use a tertiary button in a fluid arrangement.\n\n### Best practices\n\n#### Tertiary buttons for page headers\n\nIt is challenging to use a primary button in the header of a page because the\ncontent beneath the header is probably going to have a primary action, or will\nin a future release. Even if the the button in the page header is not styled as\na primary button, it has significant prominence due to its hierarchical\nplacement at the top.. Therefore, it is advised to use a tertiary button for\npage headers.\n\nIf it is determined that the button in the page header, across all tabs, should\nbe primary, ensure none of the content below the header contain another primary\naction.\n\n![Do use a tertiary button in the page header if there is a primary button in the content section.](/static/fc9f3739626ff80399bca137bc0eb567/a5df1/button_usage_tertiary_4.png)\n\nDo use a tertiary button in the page header if there is a primary button in the content section.\n\n![Do not use a primary button in the page header and the content section.](/static/fa31ed46cb6d048fb18a80a924c0d752/a5df1/button_usage_tertiary_5.png)\n\nDo not use a primary button in the page header and the content section.\n\n#### Tertiary buttons in button groups\n\nIn [button groups](#button-groups), where there is one primary and two other\nactions with shared importance, consider using tertiary buttons.\n\n![Example of tertiary buttons used in button groups.](/static/d00282110703398ae82f6403711fa55c/3cbba/button_usage_tertiary_6.png)\n\nExample of tertiary buttons used in button groups.\n\n#### Tertiary buttons in empty states\n\nFor empty states that appear on pages that already have the primary action\ndefined, a tertiary button is the ideal solution to launch a new task flow.\n\n![Example of a tertiary button used with empty state content.](/static/93a57fa2c4adb09463798ae8448c5e7f/3cbba/button_usage_tertiary_7.png)\n\nExample of a tertiary button used with empty state content.\n\n## Ghost button\n\nGhost buttons have the least prominence among the button variants. Ghost buttons\nare more subtle, making them ideal for supplementary actions. They work best\nwhen they are flush against a container or horizontally grouped with other\nelements.\n\n![Ghost button in the context of a product UI.](/static/5ef8cff6045e54f017ee5d50fbdc0975/3cbba/button_usage_ghost_1.png)\n\nGhost button in the context of a product UI.\n\n#### Aligning ghost buttons\n\nGhost buttons work well when aligned to a corner of a container. The general\nrule for vertically aligning a ghost button with other content is to ensure its\nlabel aligns with the text elsewhere on the page.\n\n![Do align the ghost button label with the rest of the content.](/static/7e33ac37ca8a6a2ffebd3a990e7a2d93/a5df1/button_usage_ghost_2.png)\n\nDo align the ghost button label with the rest of the content.\n\n![Do not align the edge of the ghost button with the rest of the content, even if it looks partially aligned.](/static/a630a142a4623682e1bac6c70965743b/a5df1/button_usage_ghost_3.png)\n\nDo not align the edge of the ghost button with the rest of the content, even if it looks partially aligned.\n\nGhost buttons can be useful for small supplementary actions in side panels. In\nthis context, extending the width of the ghost button to the full width of the\ncontainer makes this treatment seem intentional. Aligning to the full width of a\ncontainer is only recommended when the containers are smaller in size such as a\nside panel of 480px (medium) and below.\n\n![Do extend the ghost button to the full width of the side panel.](/static/455c726d8217536bf9e751ddd98272bc/a5df1/button_usage_ghost_4.png)\n\nDo extend the ghost button to the full width of the side panel.\n\n![Do not leave a ghost button hanging halfway within the side panel.](/static/54c48f85bb4416fc3737b81f3607908b/a5df1/button_usage_ghost_5.png)\n\nDo not leave a ghost button hanging halfway within the side panel.\n\nGhost buttons can also be aligned horizontally and inline with other components\non the page.\n\n![Example of a ghost button aligned horizontally and inline with a component.](/static/485e450b1206a9b3a732d2f17d476162/3cbba/button_usage_ghost_6.png)\n\nExample of a ghost button aligned horizontally and inline with a component.\n\n### Best practices\n\n#### Ghost buttons for data table actions\n\nButtons in the table toolbar are often depicted as a primary button, but this\nmight not always be the case. Use a ghost button instead if there is another\nbutton on the page that requires primary styling.\n\n![A ghost button represents the data table's primary action to avoid conflict with the primary button in the page header.](/static/d4faec396cee58d0e0c6ab6090fe120f/3cbba/button_usage_ghost_7.png)\n\nA ghost button represents the data table’s primary action to avoid conflict\nwith the primary button in the page header.\n\n#### Ghost buttons in productive cards\n\nIn dashboards with multiple productive cards, ghost buttons work well as they\ndraw less attention than a tertiary button. For a ghost button to appear aligned\nin vertical arrangements within a container, it is recommended that it touches\nat least two edges of the container.\n\nSee\nthe [cards component](https://pages.github.ibm.com/carbon/ibm-products/components/card/overview/)\nfor more details.\n\n![Example of a ghost button used in cards.](/static/9e8572bf7e4ae2823777a091d277274d/3cbba/button_usage_ghost_8.png)\n\nExample of a ghost button used in cards.\n\n#### Ghost button used as a cancel action\n\nGhost buttons work well as a cancel button in progressive flows, as they draw\nless attention; users have to purposefully find and click the button to cancel.\nIn tearsheets, the buttons are fluid, which wouldn’t be a suitable application\nfor a tertiary button.\n\n![Example of ghost button used in a modal.](/static/0b8878b60687e237bb8deb14df7517fe/3cbba/button_usage_ghost_9.png)\n\nExample of ghost button used in a modal.\n\n## Danger button\n\nDanger button is used for actions that could have destructive effects, such as\n“Delete”, “Remove”, or “Stop”.\n\nThe danger button has three different styles:\n[primary](/components/button/style#danger-primary-button-color.mdx),\n[tertiary](/components/button/style#danger-tertiary-button-color.mdx), and\n[ghost](/components/button/style#danger-ghost-button-color.mdx). Determining\nwhich danger button style to use will depend on the level of emphasis you want\nto give to the destructive action. Destructive actions that are a required or\nprimary step in a workflow should use the primary danger button style. However,\nif a destructive action is just one of several actions a user could choose from,\nthen a lower emphasis style like the tertiary danger button or the ghost danger\nbutton may be more appropriate.\n\n![Danger button in the context of a product UI.](/static/94218fba9d78e0809c2f37fa9a352e72/3cbba/button_usage_danger_primary.png)\n\nDanger button in the context of a product UI.\n\n![Do use a tertiary danger button for lower emphasis destructive actions.](/static/9f483ccbd68610c073eee2ca0fc0054d/a5df1/button_usage_danger_tertiary.png)\n\nDo use a tertiary danger button for lower emphasis destructive actions.\n\n![Do use a ghost danger button for lower emphasis destructive actions.](/static/b81924c26f3f1629e352ee4a1cd18ea0/a5df1/button_usage_danger_ghost.png)\n\nDo use a ghost danger button for lower emphasis destructive actions.\n\n## Modifiers\n\n### Button with icon\n\nIcons can be placed next to labels to clarify an action and call attention to a\nbutton. However, icons should be used sparingly, as overuse can create visual\nnoise and make an experience less usable. If you use a button with an icon in\none part of your UI it does not mean that you need to add icons to all other\nbuttons.\n\n- Use a 16px icon within buttons; use a 20px icon within the large expressive\n  buttons.\n- Icons are distinguished by their solid shape and knocked-out details.\n- Icons should always appear to the right of the label.\n- Icons used in buttons must be directly related to the action that the user is\n  taking.\n- Icons must match the color value of the label within a button.\n\n![Do place the icon on the right side of the button after the label](/static/10fbad387d09e8aecaa1e22fd7c291ee/a5df1/button_usage_button_with_icon_1.png)\n\nDo place the icon on the right side of the button after the label.\n\n![Do not place the icon to the left of the label on the button.](/static/b215337ea08b46266a7c4214e620f0c1/a5df1/button_usage_button_with_icon_2.png)\n\nDo not place the icon to the left of the label on the button.\n\n![Do use 8px spacing between the label and the icon in a ghost button.](/static/4d6bce6f1aba2f89bd87b58da974dddb/a5df1/button_usage_button_with_icon_3.png)\n\nDo use 8px spacing between the label and the icon in a ghost button.\n\n![Do not leave too much space between the label and the icon in a ghost button.](/static/7b45eaa0173fdf02b41c89f140c1eb0d/a5df1/button_usage_button_with_icon_4.png)\n\nDo not leave too much space between the label and the icon in a ghost button.\n\n#### Universal actions with well-established icons\n\nWhen deciding whether to add an icon to a button, it’s important to consider how\nrecognizable the icon is and whether, in other contexts, a similar icon may be\nused for a different meaning. We want to avoid the same icon being used for\ncompletely different actions.\n\nFor this reason, we have defined a set of universal actions suitable for adding\nan icon alongside the button label. These have clearly defined and widely\nrecognized icons within IBM Software and beyond.\n\nIcons that are not in this list can be used in buttons, as long as the icon\nclearly conveys the intended action. To determine the expected use of an icon,\ncheck its name in the\n[Carbon icon library](https://carbondesignsystem.com/elements/icons/library/).\n\n| Name of action | Associated icon | Name in icon library |\n| --- | --- | --- |\n| Create/Add |  | Add |\n| Edit |  | Edit |\n| Copy |  | Copy |\n| Delete |  | Trash can |\n| Remove |  | Subtract alt |\n| Export |  | Export |\n| Upload |  | Upload |\n| Download |  | Download |\n| Play/Start |  | Play |\n| Pause |  | Pause |\n| Stop |  | Stop outline |\n| Refresh |  | Restart |\n\nDo you think a universal action with a clearly defined icon is missing? Let us\nknow [here](https://github.com/carbon-design-system/carbon/issues/new/choose).\n\n#### Do not use a defined icon to represent a different universal action\n\nUsing icons in the above list for other actions can confuse the expected outcome\nand experience.\n\n![Do use a defined icon to represent a universal action.](/static/bf0e895c33ebd565260c35d2f4252042/a5df1/button_usage_button_with_icon_5.png)\n\nDo use a defined icon to represent a universal action.\n\n![Do not use an icon for an action that would not be associated with it.](/static/e9199ffb792fd572a7693dbeadbd410a/a5df1/button_usage_button_with_icon_6.png)\n\nDo not use an icon for an action that would not be associated with it.\n\n#### Launch icon\n\nThe launch icon should be used on any call to action that launches the user into\nanother tab (whether the content of the new tab is part of the same product or\nan entirely separate web resource). Buttons and links requiring the launch icon\nare often found in the UI left navigation area, side panel, cards, and modals.\nThe target destination of the launch action should be made clear to the user\nthrough the button or link label and the surrounding context.\n\n*For IBMers only:* See the\n[navigation labels](https://pages.github.ibm.com/carbon/ibm-products/guidelines/content/navigation-labels/)\nof our content guide.\n\n![Example of a tertiary button with icon indicating that clicking the button would launch a new page.](/static/d013054885568387821223c301b0d971/3cbba/button_usage_button_with_icon_7.png)\n\nExample of a tertiary button with icon indicating that clicking the button\nwould launch a new page.\n\n#### Be consistent with icon usage for buttons in a button group\n\nUsing icons in button groups is optional. We recommend showing an icon for each\nbutton in a button group or showing no icons for consistency. A benefit of\npairing an icon with a button label is that it visually describes its action and\ndirects more attention to it. However, in some cases, using too many buttons\nwith icons in a group can create unwanted noise in the UI and tend to\novercomplicate a simple experience.\n\nOnly use icons in button groups for the universal actions listed in the table\nabove or for other actions where a particular icon is commonly paired and\nassociated.\n\n![Do follow a consistent approach across button groups when introducing icons.](/static/74f1a4d3453ae9cab6c4a24b04eddd63/a5df1/button_usage_button_with_icon_8.png)\n\nDo follow a consistent approach across button groups when introducing icons.\n\n![Do follow a consistent approach across button groups when introducing icons.](/static/3ff9a2a475145e6ee8322e76f23d63b1/a5df1/button_usage_button_with_icon_9.png)\n\nDo follow a consistent approach across button groups when introducing icons.\n\n![Do not introduce icons only for a few buttons in a button group.](/static/e5bea5ed8e528f2ec1ee1f7bc7cc0296/a5df1/button_usage_button_with_icon_10.png)\n\nDo not introduce icons only for a few buttons in a button group.\n\n![Do not introduce icons only for a few buttons in a button group.](/static/86bdaa676ed25a755832fd3c7cb6c1d0/a5df1/button_usage_button_with_icon_11.png)\n\nDo not introduce icons only for a few buttons in a button group.\n\n#### Use the default variation for all icons\n\nThe Carbon library contains filled variants of a few icons. Since not every icon\nhas this variation, we advise using the default option for all icons (the only\nexception is status icons, which have their own defined icon to use). Default\nicons are named after their action.\n\n![Do use the default icon which is “Play”.](/static/520ccc8744a1fb2611d55949e78c6ae2/a5df1/button_usage_button_with_icon_12.png)\n\nDo use the default icon which is “Play”.\n\n![Do not use the filled icon variations.](/static/87306f7dd5a3bc885f12bf51c7351185/a5df1/button_usage_button_with_icon_13.png)\n\nDo not use the filled icon variations.\n\n### Icon only buttons\n\nIcon only buttons allow users to take actions, and make choices, with a single\ntap. Icon buttons can take the form of a primary, secondary, tertiary, or ghost\nvariant but most commonly will be styled as primary or ghost buttons.\n\nIcon only buttons should be used sparingly. “For most situations, users learn\ncorrect interpretations better with text alone than with icons alone.” —\nWiedenbeck, S (1999). For this reason, using icon only buttons is recommended\nfor the following use cases:\n\n- The icon must be standardized and recognizable without label or must represent\n  an action with a strong visual attribute, such as a pin icon for a pinning\n  action.\n- There is insufficient space and multiple actions, therefore a toolbar using\n  icon buttons is required. See\n  the [toolbar component](https://pages.github.ibm.com/carbon/ibm-products/components/toolbar/usage/)\n  for more details.\n\n![Example of an icon only ghost button in a toolbar showing a tooltip on hover.](/static/c5d9562e5693be3999de84979dbe31ad/3cbba/button_usage_icon_only_button_1.png)\n\nExample of an icon only ghost button in a toolbar showing a tooltip on hover.\n\n#### Tooltips for icon only buttons\n\nRegardless of how recognizable an icon may or may not be, or whether that action\nlies within the universal actions list, a tooltip is always required with text\nexplaining what the icon button would do if clicked.\n\n![Example of an icon only ghost button showing a tooltip on hover.](/static/99ba9629ac679e45d46a3f479f1d5c79/3cbba/button_usage_icon_only_button_2.png)\n\nExample of an icon only ghost button showing a tooltip on hover.\n\n#### Colors of icon only ghost buttons\n\nCarbon builds type, color, and spacing tokens into its components, improving the\nease of component usage. Do not change the color token for icon only ghost\nbuttons. The same applies for specifications across components. Learn more about\nicon only ghost button colors in the\n[Style](/components/button/style#ghost-button-color.mdx) tab.\n\n![Do use the system’s defined color for ghost icon only buttons.](/static/15f51899020813bf65a3f4c382bc2e4f/a5df1/button_usage_icon_only_button_3.png)\n\nDo use the system’s defined color for ghost icon only buttons.\n\n![Do not change the color for ghost icon only buttons.](/static/26fe18866343a01dbc2c427077bc0d2d/a5df1/button_usage_icon_only_button_4.png)\n\nDo not change the color for ghost icon only buttons.\n\n#### Danger buttons cannot be used in an icon only form\n\nDanger can be a critical action and should be applied to a button that holds\nhigher emphasis along with a visual label. As mentioned in\nthe [danger button guidance](#danger-button),  it is best to use a danger button\nin a primary, tertiary, or ghost button form.\n\n![Do use a visual label in a danger button for a destructive action.](/static/c5b03b8a3ceca37dad6399dce1c63de2/a5df1/button_usage_icon_only_button_5.png)\n\nDo use a visual label in a danger button for a destructive action.\n\n![Do not use a danger button in an icon only form for a destructive action.](/static/72447f2d6d01a7bdbbe24f453b0b76d3/a5df1/button_usage_icon_only_button_6.png)\n\nDo not use a danger button in an icon only form for a destructive action.\n\n## Related\n\n- [Button labels](https://pages.github.ibm.com/carbon/ibm-products/guidelines/content/button-labels/)\n- [Fixed button bars](https://pages.github.ibm.com/carbon/ibm-products/patterns/fixed-button-bars/usage/)\n- [Form pattern](/patterns/forms-pattern)\n- [Icons](https://carbondesignsystem.com/elements/icons/library/)\n- [Link component](/components/link/usage)\n- [Menu buttons](https://carbondesignsystem.com/components/menu-buttons/usage/)\n- [Modal component](/components/modal/usage)\n\n## References\n\n- Mehmet Goktürk,\n  [*The Glossary of Human Computer Interaction, Chapter 37*](https://www.interaction-design.org/literature/book/the-glossary-of-human-computer-interaction/fitts-s-law)\n  (The Interaction Design Foundation)\n- Jakob Nielsen,\n  [*OK-Cancel or Cancel-OK? The Trouble With Buttons*](https://www.nngroup.com/articles/ok-cancel-or-cancel-ok/)\n  (Nielsen Norman Group, 2008)\n- Artem Syzonenko\n  [*Buttons on the web: placement and order*](https://uxdesign.cc/buttons-placement-and-order-bb1c4abadfcb)\n  (UX Collective, 2019)\n- Wiedenbeck, S (1999). The use of icons and labels in an end-user application\n  program: An empirical study of learning and retention. Behavior & Information\n  Technology, 18(2), p68–82\n\n## Feedback\n\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\n[GitHub](https://github.com/carbon-design-system/carbon-website/issues/new?assignees=&labels=feedback&template=feedback.md).\n\n[Edit this page on GitHub](https://github.com/carbon-design-system/carbon-website/edit/main/src/pages/components/button/usage.mdx)\n\n[Previous\n\nComponents: Breadcrumb](/components/breadcrumb/usage/)\n\n[Next\n\nButton: Style](/components/button/style/)",
  "tags": [
    "ibm",
    "carbon",
    "design-system",
    "enterprise"
  ],
  "extracted_at": "2026-02-03T14:18:59.705633+00:00",
  "content_length": 33413,
  "content_hash": "1ea593816fc41d56"
}