{
  "id": "carbon-design__components_data-table_usage_",
  "source_id": "carbon-design",
  "source_name": "IBM Carbon Design System",
  "category": "design_systems",
  "url": "https://carbondesignsystem.com/components/data-table/usage/",
  "title": "Data table",
  "content": "Data table\nData tables are used to organize and display data efficiently. The data table\ncomponent allows for customization with additional functionality, as needed by\nyour product’s users.\nData table\nwith AI label\nis now stable. This addition changes the visual appearance of the component and\nintroduces an AI explainability feature when AI is present in the component. See\nthe\nAI presence\nsection for more\ndetails.\nLive demo\nOverview\nFormatting\nContent\nVariants\nUniversal behaviors\nModifiers\nAI presence\nRelated\nFeedback\nLive demo\nTheme selector\nWhite\nVariant selector\nBasic\nThis live demo contains only a preview of functionality and styles available for this component. View the\nfull demo\non Storybook for additional information such as its version, controls, and API documentation.\nAccessibility testing status\nFor every latest release, Carbon runs tests on all components to meet the\naccessibility requirements\n. These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\nDefault state\nTested\nAdvanced states\nTested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nOverview\nThe data table’s features are ideal for organizing and displaying data in a UI.\nThe column headers can sort data in ascending or descending order, rows can be\nexpanded to progressively disclose information, and single or batch actions can\nbe taken on rows.\nThe data table toolbar gives a location for primary buttons, search, filtering,\ntable display settings, and other utilities.\nWhen to use\nTo organize and display data.\nIf your user must navigate to a specific piece of data to complete a task.\nDisplaying all of a user’s resources.\nWhen not to use\nWhen a more complex display of the data or interactions are required.\nAs a replacement for a spreadsheet application.\nVariants\nVariant\nPurpose\nDefault\nThe basic data table has only the header and table element rows. It is available in five row sizes.\nWith selection\nThe selection variant enables users to select individual rows in a data table. Selection options include a single-select radio button option and a multi-select checkbox option. Users can perform a single action or batch actions against selected items.\nWith expansion\nThe expandable variant helps present large amounts of data in a small space. Users can expand and collapse row panels to reveal and hide additional information.\nFormatting\nAnatomy\nTitle and description\n: contains the data table title and an optional\ndescription.\nToolbar\n: global data table controls including search and table settings.\nColumn header\n: title for the row header with the optional sorting\nbehavior.\nTable row\n: can be configured to show different types of data. Rows can be\nselectable, expandable, and modified to show alternating zebra stripe\nbackground colors.\nPagination table bar\n: an optional component that lets a user navigate\ndata as pages when the amount of data it too large to be shown at once.\nSizing\nThe data table is available in five different row sizes: extra large, large,\nmedium, small, extra small.\nThe column header row\n.cds--data-table thead\nCopy to clipboard\nshould always match the row size\nof the table. Extra large row heights are only recommended if your data is\nexpected to have 2 lines of content in a single row.\nDo use the same row height for the table and header rows.\nDon’t mix row heights for the table and header rows.\nTwo heights are available to be paired with the row heights of the data table.\nThe tall toolbar should only be paired with the large and extra large row\nheights and the small toolbar should only be used with the small and extra small\nrow heights.\nA small toolbar on a short data table and a tall toolbar on a normal data\ntable\nPlacement\nData tables should be placed in a page’s main content area and given plenty of\nspace to display data without truncation. Avoid placing data tables inside data\ntables or smaller containers where the information can feel cramped or needs\ntruncation.\nThe data table can be placed on the grid following the three different\ngutter modes\noutlined in the 2x grid\nguidelines. Although, the data table can share horizontal space with other\ncomponents and content, consider giving your data table the most width on the\npage to help your user view dense data.\nThese three examples show the data table on the wide (default), narrow, and\ncondensed gutter modes. Note the different type alignments and gutter sizes.\nWide gutter mode\nThe wide gutter mode is the default and gives the most breathing room between\nthe data table and the other components or content.\nData table on a wide (default) grid\nNarrow gutter mode\nUsing the data table on a narrow grid will hang the component into the gutter\nand create a desirable type alignment between the the data table’s title and\nother type on the page.\nData table on a narrow grid\nCondensed gutter mode\nThe data table can be used on a condensed grid, but care should be taken to\navoid any unintentional relationships with other UI elements. Use a hybrid grid\nor a dissimilar background color to avoid the components blending in to each\nother.\nData table on a condensed grid\nContent\nMain elements\nData table title and description\nThe table title should make it clear to the user what this the data has in\ncommon and what purpose it serves in the UI.\nA description can be added under the title to provide more information about\nthe data or its source.\nA data table’s title and description should use\nsentence-case capitalization.\nColumn titles\nColumn titles should stick to one or two words that describe the data in that\ncolumn.\nIn cases where a column title is too long, wrap the text to two lines and then\ntruncate the rest of the text. The full text should be shown in a tooltip on\nhover.\nColumn titles should use\nsentence-case capitalization.\nPrimary button\nA data table using a primary action should follow the guidance for\nprimary button\nusage and\naction labels.\nFor further content guidance, see Carbon’s\ncontent guidelines\n.\nVariants\nExpandable\nThe expandable data table helps present large amounts of data in a small space.\nUse the expanded section for supplementary information or data that needs\nadditional query time. When the content in the expanded area feels cramped,\nconsider taking the user to a dedicated page, side panel, or data table to view\nthe information and complete tasks.\nBatch expansion\nWhen appropriate, a batch expansion feature can be added to the table column\nheader to allow the user to open all collapsed sections simultaneously. However,\nthe expand-all chevron is not shown by default in the expandable data table\nvariant. Keeping detailed information in the expanded section saves user loading\ntime by postponing some data queries until needed. Expanding all rows at once\nwill typically negate this advantage of the expandable table.\nSelectable\nBy default, the selectable variant allows users to select more than one row in a\ndata table simultaneously. To select a row, the user must select the checkbox\nassociated with the row. The user can select all rows at once by selecting the\ncheckbox in the column header. Checkboxes in the rows have only two states,\nchecked and unchecked. However, the check all checkbox in the column header has\nthree states, check, unchecked, and indeterminate.\nActions applied to the chosen selected items are found in the default\ntable toolbar\nor\nbatch action mode\n.\nRadio selection\nThe data table also supports a single-select radio button control, limiting the\nuser to selecting only one row at a time. The radio button is placed in the\nfirst column on the left side. Single actions applied to the chosen radio item\nare often placed on the right side of the table toolbar area. They can manifest\nas primary, ghost, or icon-only buttons.\nExpandable + selectable\nData tables can be configured to have both expandable and selectable features.\nThe expandable icon always appears first and to the left of the selection icon.\nUniversal behaviors\nInteractions\nThe data table’s toolbar and rows follow interaction conventions that are found\nin other Carbon components. Buttons, checkboxes, radio buttons, overflow menus,\nsearch, and expanding elements are used in the data table, and all behave\naccording to their guidelines.\nMouse\nUsers can trigger an action or function in the table by clicking the associated\nbutton or component. Each action or function has its own distinct click target.\nSee the\nAccessibility\ntab for more\ninformation.\nHighlighted target areas for data table mouse interactions\nHover\nThe data table’s row hover state should always be enabled as it can help the\nuser visually scan the columns of data in a row even if the row is not\ninteractive.\nPagination\nPagination divides a data table into separate pages. Simple pagination indicates\nthe current page in view and offers controls to go to the previous or next page.\nAdvanced pagination is accompanied by an option that enables the user to change\nthe number of items per page and to jump to a specific page number. The\npagination component is always placed at the bottom of the data table. For more\ninformation, see the\npagination\ncomponent.\nSimple (top) and advanced (bottom) pagination configurations\nTable toolbar\nThe table toolbar is reserved for global table actions such as table settings,\ncomplex filters, exporting, or editing table data. Actions in the toolbar can\nuse primary, ghost, or icon-only buttons. Include up to five actions within the\ntable toolbar. More actions can be made available through an overflow menu,\ncombo button, or similar components.\nSearching\nCollapsed search\nA search field can be triggered through an icon button in the data table\ntoolbar. By default search follows the\nactive search\npattern. The search is\nclosed by default, and placed below the table title.\nOpen search\nThe search field can appear always open on a data table. The field is placed on\nthe left side of the table under the table title and stretches until it meets\nthe actions on the right.\nSorting\nColumns can be sorted in ascending or descending order. Sorting controls are\nlocated in the column headers and indicated with an arrow icon on hover and when\na column is sorted.\nA sorted data table has three states: unsorted (\narrows\nCopy to clipboard\n), sorted-up\n(\narrow--up\nCopy to clipboard\n) or sorted-down (\narrow--down\nCopy to clipboard\n). The icon indicates the current\nsorted state and is shown only when the sorting is activated. Only the sorted\ncolumn displays an icon, and unsorted icons are only visible on hover. You can\nsee a demo of sorting in\nCarbon’s\nReact Storybook\n.\nBatch actions\nUsers can perform batch actions on one or more items within a table. Once an\nitem from the table is selected, the batch action bar appears at the top of the\ntable, presenting a set of possible actions to apply to all select items. This\nfeature can increase user efficiency compared to the effort of repetitively\nperforming the same inline action across multiple table items. When batch mode\nis active, single action icons and overflow menus on the row should be disabled.\nTo exit the batch action mode, the user can select the cancel button on the far\nright of the bar or deselect all items.\nInline actions\nInline actions are functions that might be performed on a specific table row.\nEach row is accompanied by\nan\noverflow menu\nthat\ncontains actions that are related specifically to that row.\nWhen the overflow menu contains fewer than three options, keep the actions\ninline as icon buttons instead. This approach reduces a click and makes\navailable actions visible at a glance.\nOverflow menu\nBy default, the overflow menu icons are persistent on each row. Having the\noverflow menus always visible signals to the user actions can be taken on the\ntable rows. Alternatively, a product team may use the\noverflowMenuOnHover\nCopy to clipboard\nprop\nto only show the overflow menu on hover and focus to reduce the visual clutter\nof an overflow menu on every row.\nFor mobile and touch devices the data table will detect if the user agent\nsupports hover-over and persist the overflow menus even if the\noverflowMenuOnHover\nCopy to clipboard\nprop is enabled.\nPersistent overflow (left), on hover (right).\nLoading\nIf extra load time is expected to display information, use skeleton states\ninstead of spinners.\nExpanding all rows with skeleton states\nModifiers\nAlternating row color\nThe data table can use a zebra stripes modifier to style the table rows with\nalternating colors to make scanning horizontal information easier for the user.\nAI presence\nData table has a modification that takes on the AI visual styling when AI is\npresent in the table. The AI variants of a data table function the same as the\nnormal variants except for the addition of the AI label, which is both a visual\nindicator and the trigger for the explainability popover. Where the AI label\ngoes inside of a data table depends on which parts of the data are AI generated.\nFor more information on designing for AI, see the\nCarbon for AI\nguidelines.\nEntire table\nWhen the entire data table is styled for AI, it indicates to the user that AI is\npresent in all aspects of the data table.\nExample of a data table generated by AI.\nIndividual cells\nIf only some data table cells have content generated by AI, then those cells\nhave an in-line AI label next to them. These cells do not get any AI layering.\nExample of a data table cell generated by AI represented by the in-line AI\nlabel.\nRows and columns\nIf content belonging to only a row or column of the data table is generated by\nAI, then only those respective row/s and column/s should receive the AI presence\nstyling along with the AI label, not the entire data table.\nExample of a data table column generated by AI.\nLight mode\nDark mode\nRelated\nCommunity extensions\nCarbon for IBM Product\nThis content is accessible to IBMers only.\nData table extensions\nData table on Cloud\nData spreadsheet\nSimilar components\nThe following components are additional ways to organize and navigate data.\nAccordion\nList\nPagination\nStructured list\nFeedback\nHelp us improve this pattern by providing feedback, asking questions, and\nleaving any other comments on\nGitHub\n.\nEdit this page on GitHub\nPrevious\nComponents: Content switcher\nNext\nData table: Style",
  "content_markdown": "# Data table\n\nData tables are used to organize and display data efficiently. The data table\ncomponent allows for customization with additional functionality, as needed by\nyour product’s users.\n\nData table\n[with AI label](https://react.carbondesignsystem.com/?path=/docs/components-datatable-withailabel--overview)\nis now stable. This addition changes the visual appearance of the component and\nintroduces an AI explainability feature when AI is present in the component. See\nthe [AI presence](/components/data-table/usage/#ai-presence) section for more\ndetails.\n\n- [Live demo](#live-demo)\n- [Overview](#overview)\n- [Formatting](#formatting)\n- [Content](#content)\n- [Variants](#variants)\n- [Universal behaviors](#universal-behaviors)\n- [Modifiers](#modifiers)\n- [AI presence](#ai-presence)\n- [Related](#related)\n- [Feedback](#feedback)\n\n## Live demo\n\nTheme selector\n\nWhite\n\n---\n\nVariant selector\n\nBasic\n\n---\n\nThis live demo contains only a preview of functionality and styles available for this component. View the [full demo](https://react.carbondesignsystem.com/?path=/story/components-datatable-basic--default&globals=theme:white) on Storybook for additional information such as its version, controls, and API documentation.\n\n### Accessibility testing status For every latest release, Carbon runs tests on all components to meet the [accessibility requirements](https://www.ibm.com/able/requirements/requirements/). These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n## Overview\n\nThe data table’s features are ideal for organizing and displaying data in a UI.\nThe column headers can sort data in ascending or descending order, rows can be\nexpanded to progressively disclose information, and single or batch actions can\nbe taken on rows.\n\nThe data table toolbar gives a location for primary buttons, search, filtering,\ntable display settings, and other utilities.\n\n### When to use\n\n- To organize and display data.\n- If your user must navigate to a specific piece of data to complete a task.\n- Displaying all of a user’s resources.\n\n### When not to use\n\n- When a more complex display of the data or interactions are required.\n- As a replacement for a spreadsheet application.\n\n### Variants\n\n| Variant | Purpose |\n| --- | --- |\n| *Default* | The basic data table has only the header and table element rows. It is available in five row sizes. |\n| *With selection* | The selection variant enables users to select individual rows in a data table. Selection options include a single-select radio button option and a multi-select checkbox option. Users can perform a single action or batch actions against selected items. |\n| *With expansion* | The expandable variant helps present large amounts of data in a small space. Users can expand and collapse row panels to reveal and hide additional information. |\n\n## Formatting\n\n### Anatomy\n\n![data table anatomy](/static/b6071484f2ee4105120300c14cdf48b8/3cbba/datatable-anatomy.png)\n\n1. **Title and description**: contains the data table title and an optional\n   description.\n2. **Toolbar**: global data table controls including search and table settings.\n3. **Column header**: title for the row header with the optional sorting\n   behavior.\n4. **Table row**: can be configured to show different types of data. Rows can be\n   selectable, expandable, and modified to show alternating zebra stripe\n   background colors.\n5. **Pagination table bar**: an optional component that lets a user navigate\n   data as pages when the amount of data it too large to be shown at once.\n\n### Sizing\n\nThe data table is available in five different row sizes: extra large, large,\nmedium, small, extra small.\n\n![data table size](/static/ffc4abf614330d0c3b6ec4c05eeb4222/3cbba/datatable-sizes.png)\n\nThe column header row\n\n```\n.cds--data-table thead\n```\n\nCopy to clipboard\n\n should always match the row size\nof the table. Extra large row heights are only recommended if your data is\nexpected to have 2 lines of content in a single row.\n\n![Do: Do use the same row height for the table and header rows.](/static/c5a8c543b4ec7d2e7c7d5505a824c8af/a5df1/datatable-header-size-do.png)\n\nDo use the same row height for the table and header rows.\n\n![Don’t: mix row heights for the table and header rows.](/static/f4ca1b5c9179b95fb4f82e607dff0764/a5df1/datatable-header-size-dont.png)\n\nDon’t mix row heights for the table and header rows.\n\nTwo heights are available to be paired with the row heights of the data table.\nThe tall toolbar should only be paired with the large and extra large row\nheights and the small toolbar should only be used with the small and extra small\nrow heights.\n\n![data table toolbar size](/static/f7bde46dcf34b10f4ae30289a8d2212e/3cbba/datatable-toolbar-sizes.png)\n\nA small toolbar on a short data table and a tall toolbar on a normal data\ntable\n\n### Placement\n\nData tables should be placed in a page’s main content area and given plenty of\nspace to display data without truncation. Avoid placing data tables inside data\ntables or smaller containers where the information can feel cramped or needs\ntruncation.\n\nThe data table can be placed on the grid following the three different\n[gutter modes](/elements/2x-grid/usage/#gutter-modes) outlined in the 2x grid\nguidelines. Although, the data table can share horizontal space with other\ncomponents and content, consider giving your data table the most width on the\npage to help your user view dense data.\n\nThese three examples show the data table on the wide (default), narrow, and\ncondensed gutter modes. Note the different type alignments and gutter sizes.\n\n#### Wide gutter mode\n\nThe wide gutter mode is the default and gives the most breathing room between\nthe data table and the other components or content.\n\n![data table wide ](/static/3e619e4f10589131206b0daeede76f9b/3cbba/datatable-alignment-wide.png)\n\nData table on a wide (default) grid\n\n#### Narrow gutter mode\n\nUsing the data table on a narrow grid will hang the component into the gutter\nand create a desirable type alignment between the the data table’s title and\nother type on the page.\n\n![data table narrow ](/static/cbfed1ecd9df872c9befc1ce7cf208af/3cbba/datatable-alignment-narrow.png)\n\nData table on a narrow grid\n\n#### Condensed gutter mode\n\nThe data table can be used on a condensed grid, but care should be taken to\navoid any unintentional relationships with other UI elements. Use a hybrid grid\nor a dissimilar background color to avoid the components blending in to each\nother.\n\n![data table condensed ](/static/2dae8ef970a25d5d14e4cd8fab1166bd/3cbba/datatable-alignment-condensed.png)\n\nData table on a condensed grid\n\n## Content\n\n### Main elements\n\n#### Data table title and description\n\n- The table title should make it clear to the user what this the data has in\n  common and what purpose it serves in the UI.\n- A description can be added under the title to provide more information about\n  the data or its source.\n- A data table’s title and description should use\n  [sentence-case capitalization.](/guidelines/content/writing-style#use-sentence-case-capitalization)\n\n#### Column titles\n\n- Column titles should stick to one or two words that describe the data in that\n  column.\n- In cases where a column title is too long, wrap the text to two lines and then\n  truncate the rest of the text. The full text should be shown in a tooltip on\n  hover.\n- Column titles should use\n  [sentence-case capitalization.](/guidelines/content/writing-style#use-sentence-case-capitalization)\n\n#### Primary button\n\n- A data table using a primary action should follow the guidance for\n  [primary button](/components/button/usage#labels) usage and\n  [action labels.](/guidelines/content/action-labels)\n\nFor further content guidance, see Carbon’s\n[content guidelines](/guidelines/content/overview).\n\n## Variants\n\n### Expandable\n\nThe expandable data table helps present large amounts of data in a small space.\nUse the expanded section for supplementary information or data that needs\nadditional query time. When the content in the expanded area feels cramped,\nconsider taking the user to a dedicated page, side panel, or data table to view\nthe information and complete tasks.\n\n![Example of data table with row expansion](/static/e44072ad2d673d1994c3bc5f2e587782/3cbba/datatable-expand.png)\n\n#### Batch expansion\n\nWhen appropriate, a batch expansion feature can be added to the table column\nheader to allow the user to open all collapsed sections simultaneously. However,\nthe expand-all chevron is not shown by default in the expandable data table\nvariant. Keeping detailed information in the expanded section saves user loading\ntime by postponing some data queries until needed. Expanding all rows at once\nwill typically negate this advantage of the expandable table.\n\n![Example of data table with batch expansion](/static/1f57998898773937e2c19749a0e328a3/3cbba/datatable-expand-all.png)\n\n### Selectable\n\nBy default, the selectable variant allows users to select more than one row in a\ndata table simultaneously. To select a row, the user must select the checkbox\nassociated with the row. The user can select all rows at once by selecting the\ncheckbox in the column header. Checkboxes in the rows have only two states,\nchecked and unchecked. However, the check all checkbox in the column header has\nthree states, check, unchecked, and indeterminate.\n\nActions applied to the chosen selected items are found in the default\n[table toolbar](/components/data-table/usage/#table-toolbar) or\n[batch action mode](/components/data-table/usage/#batch-actions).\n\n![Example of a data table with selection](/static/83fbe0dfc3527c608a1821d5b8215d17/3cbba/datatable-multi-select.png)\n\n#### Radio selection\n\nThe data table also supports a single-select radio button control, limiting the\nuser to selecting only one row at a time. The radio button is placed in the\nfirst column on the left side. Single actions applied to the chosen radio item\nare often placed on the right side of the table toolbar area. They can manifest\nas primary, ghost, or icon-only buttons.\n\n![Example of a data table with radio select](/static/14a5d3d7397cd4bd05d2723b08cc2091/3cbba/datatable-radio-select.png)\n\n### Expandable + selectable\n\nData tables can be configured to have both expandable and selectable features.\nThe expandable icon always appears first and to the left of the selection icon.\n\n![Example of a data table with expansion and selection](/static/87248e2b7b582aa4b35e269e9de8ae5f/3cbba/datatable-expandable%2Bselectable.png)\n\n## Universal behaviors\n\n### Interactions\n\nThe data table’s toolbar and rows follow interaction conventions that are found\nin other Carbon components. Buttons, checkboxes, radio buttons, overflow menus,\nsearch, and expanding elements are used in the data table, and all behave\naccording to their guidelines.\n\n#### Mouse\n\nUsers can trigger an action or function in the table by clicking the associated\nbutton or component. Each action or function has its own distinct click target.\nSee the [Accessibility](/components/data-table/accessibility/) tab for more\ninformation.\n\n![data table target areas](/static/c77b2c9a87c1242bc7015d649a67be5e/3cbba/datatable-target.png)\n\nHighlighted target areas for data table mouse interactions\n\n#### Hover\n\nThe data table’s row hover state should always be enabled as it can help the\nuser visually scan the columns of data in a row even if the row is not\ninteractive.\n\n![data table row hover](/static/69f96dc65a162564e04b9744668012db/3cbba/datatable-hover.png)\n\n### Pagination\n\nPagination divides a data table into separate pages. Simple pagination indicates\nthe current page in view and offers controls to go to the previous or next page.\nAdvanced pagination is accompanied by an option that enables the user to change\nthe number of items per page and to jump to a specific page number. The\npagination component is always placed at the bottom of the data table. For more\ninformation, see the [pagination](/components/pagination/usage) component.\n\n![data table target areas](/static/44b58fb2cb460031e1924570b382d0e8/3cbba/datatable-pagination.png)\n\nSimple (top) and advanced (bottom) pagination configurations\n\n### Table toolbar\n\nThe table toolbar is reserved for global table actions such as table settings,\ncomplex filters, exporting, or editing table data. Actions in the toolbar can\nuse primary, ghost, or icon-only buttons. Include up to five actions within the\ntable toolbar. More actions can be made available through an overflow menu,\ncombo button, or similar components.\n\n![data table sorting in descending order](/static/84fcf923ff190efa0a4042784070e2c5/3cbba/datatable-toolbar.png)\n\n### Searching\n\n#### Collapsed search\n\nA search field can be triggered through an icon button in the data table\ntoolbar. By default search follows the\n[active search](/patterns/search-pattern/#active-search) pattern. The search is\nclosed by default, and placed below the table title.\n\n![data table search](/367c2012cfaf349e352afda4284645ea/datatable_search.gif)\n\n![data table search](/static/a054bceba780d4868c7f9e62aba8a886/39971/data-table-usage-search.png)\n\n#### Open search\n\nThe search field can appear always open on a data table. The field is placed on\nthe left side of the table under the table title and stretches until it meets\nthe actions on the right.\n\n![data table search](/static/024362d0a17013a47591dbdebe24937d/3cbba/datatable-search-2-b.png)\n\n### Sorting\n\nColumns can be sorted in ascending or descending order. Sorting controls are\nlocated in the column headers and indicated with an arrow icon on hover and when\na column is sorted.\n\nA sorted data table has three states: unsorted (\n\n```\narrows\n```\n\nCopy to clipboard\n\n), sorted-up\n(\n\n```\narrow--up\n```\n\nCopy to clipboard\n\n) or sorted-down (\n\n```\narrow--down\n```\n\nCopy to clipboard\n\n). The icon indicates the current\nsorted state and is shown only when the sorting is activated. Only the sorted\ncolumn displays an icon, and unsorted icons are only visible on hover. You can\nsee a demo of sorting in\nCarbon’s [React Storybook](https://react.carbondesignsystem.com/?path=/story/components-datatable-sorting--default).\n\n![data table unsorted](/static/af4f61fd7d49deacfd4a1a77fcc76010/3cbba/datatable-sorting.png)\n\n### Batch actions\n\nUsers can perform batch actions on one or more items within a table. Once an\nitem from the table is selected, the batch action bar appears at the top of the\ntable, presenting a set of possible actions to apply to all select items. This\nfeature can increase user efficiency compared to the effort of repetitively\nperforming the same inline action across multiple table items. When batch mode\nis active, single action icons and overflow menus on the row should be disabled.\n\nTo exit the batch action mode, the user can select the cancel button on the far\nright of the bar or deselect all items.\n\n![data table multi select](/static/867580b6e4fb44d5069976087f158a43/3cbba/datatable-batch-action.png)\n\n### Inline actions\n\nInline actions are functions that might be performed on a specific table row.\nEach row is accompanied by\nan [overflow menu](https://www.carbondesignsystem.com/components/overflow-menu/code) that\ncontains actions that are related specifically to that row.\n\nWhen the overflow menu contains fewer than three options, keep the actions\ninline as icon buttons instead. This approach reduces a click and makes\navailable actions visible at a glance.\n\n![data table inline actions](/static/d56a14347151ed1c68cdd4d44bad2df2/3cbba/datatable-inline-actions.png)\n\n### Overflow menu\n\nBy default, the overflow menu icons are persistent on each row. Having the\noverflow menus always visible signals to the user actions can be taken on the\ntable rows. Alternatively, a product team may use the\n\n```\noverflowMenuOnHover\n```\n\nCopy to clipboard\n\nprop\nto only show the overflow menu on hover and focus to reduce the visual clutter\nof an overflow menu on every row.\n\nFor mobile and touch devices the data table will detect if the user agent\nsupports hover-over and persist the overflow menus even if the\n\n```\noverflowMenuOnHover\n```\n\nCopy to clipboard\n\nprop is enabled.\n\n![data table inline actions](/static/1e6d9611178cbe787ae894090387ccb6/3cbba/datatable-persistent-hover.png)\n\nPersistent overflow (left), on hover (right).\n\n### Loading\n\nIf extra load time is expected to display information, use skeleton states\ninstead of spinners.\n\n![data table in expanded and collapsed state](/static/43207e90a42993511a8fb8dbf5b1fae3/3cbba/datatable-skeleton.png)\n\nExpanding all rows with skeleton states\n\n## Modifiers\n\n### Alternating row color\n\nThe data table can use a zebra stripes modifier to style the table rows with\nalternating colors to make scanning horizontal information easier for the user.\n\n![data table with zebra stripes](/static/e6f43c88ce1bc671fe9f914568f9dc2f/3cbba/datatable-zebra.png)\n\n## AI presence\n\nData table has a modification that takes on the AI visual styling when AI is\npresent in the table. The AI variants of a data table function the same as the\nnormal variants except for the addition of the AI label, which is both a visual\nindicator and the trigger for the explainability popover. Where the AI label\ngoes inside of a data table depends on which parts of the data are AI generated.\n\nFor more information on designing for AI, see the\n[Carbon for AI](/guidelines/carbon-for-ai/) guidelines.\n\n#### Entire table\n\nWhen the entire data table is styled for AI, it indicates to the user that AI is\npresent in all aspects of the data table.\n\n![Example of a data table generated by AI](/static/e89a6ca012b7ee35e7a397b877e7367e/3cbba/usage-ai-presence-datatable.png)\n\nExample of a data table generated by AI.\n\n#### Individual cells\n\nIf only some data table cells have content generated by AI, then those cells\nhave an in-line AI label next to them. These cells do not get any AI layering.\n\n![Example of a data table cell generated by AI represented by the in-line AI label](/static/67123aacf036f9581a8a24e962032c0c/3cbba/usage-ai-presence-inline-datatable.png)\n\nExample of a data table cell generated by AI represented by the in-line AI\nlabel.\n\n#### Rows and columns\n\nIf content belonging to only a row or column of the data table is generated by\nAI, then only those respective row/s and column/s should receive the AI presence\nstyling along with the AI label, not the entire data table.\n\n![Example of a data table column generated by AI](/static/52e75aba7e50da8e404b1b87ff617c35/3cbba/usage-ai-presence-datatable-column-ai.png)\n\nExample of a data table column generated by AI.\n\n- Light mode\n- Dark mode\n\n![Light mode example of data table rows generated by AI](/static/0bb70d7a0e1af479626f9d79d9ccf35f/3cbba/usage-ai-presence-datatable-row-ai-l.png)\n\n![Dark mode example of data table rows generated by AI](/static/2bdcddee31fa909e2bd8560ebb2980dd/3cbba/usage-ai-presence-datatable-row-ai-d.png)\n\n## Related\n\n### Community extensions\n\n#### Carbon for IBM Product\n\n*This content is accessible to IBMers only.*\n\n- [Data table extensions](https://pages.github.ibm.com/cdai-design/pal/components/data-table/overview)\n- [Data table on Cloud](https://pages.github.ibm.com/cdai-design/cloud-pal/components/data-table/usage/)\n- [Data spreadsheet](https://pages.github.ibm.com/cdai-design/pal/components/data-spreadsheet/usage/)\n\n### Similar components\n\nThe following components are additional ways to organize and navigate data.\n\n- [Accordion](/components/accordion/code/)\n- [List](/components/list/code/)\n- [Pagination](/components/pagination/code/)\n- [Structured list](/components/structured-list/code/)\n\n## Feedback\n\nHelp us improve this pattern by providing feedback, asking questions, and\nleaving any other comments on\n[GitHub](https://github.com/carbon-design-system/carbon-website/issues/new?assignees=&labels=feedback&template=feedback.md).\n\n[Edit this page on GitHub](https://github.com/carbon-design-system/carbon-website/edit/main/src/pages/components/data-table/usage.mdx)\n\n[Previous\n\nComponents: Content switcher](/components/content-switcher/usage/)\n\n[Next\n\nData table: Style](/components/data-table/style/)",
  "tags": [
    "ibm",
    "carbon",
    "design-system",
    "enterprise"
  ],
  "extracted_at": "2026-02-03T14:19:06.809983+00:00",
  "content_length": 14264,
  "content_hash": "c92b4e2fedf2130c"
}