{
  "id": "carbon-design__components_date-picker_usage_",
  "source_id": "carbon-design",
  "source_name": "IBM Carbon Design System",
  "category": "design_systems",
  "url": "https://carbondesignsystem.com/components/date-picker/usage/",
  "title": "Date picker",
  "content": "Date picker\nDate and time pickers allow users to select a single instance or range of dates\nand times.\nDate picker\nwith AI label\nis now stable. This addition changes the visual appearance of the component and\nintroduces an AI explainability feature when AI is present in the component. See\nthe\nAI presence\nsection for more\ndetails.\nLive demo\nOverview\nFormatting\nContent\nUniversal behaviors\nSimple date input\nCalendar pickers\nTime pickers\nAI presence\nRelated\nFeedback\nLive demo\nTheme selector\nWhite\nVariant selector\nRange with calendar\nThis live demo contains only a preview of functionality and styles available for this component. View the\nfull demo\non Storybook for additional information such as its version, controls, and API documentation.\nAccessibility testing status\nFor every latest release, Carbon runs tests on all components to meet the\naccessibility requirements\n. These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\nVariant\nDate picker\nDefault state\nTested\nAdvanced states\nPartially tested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nDefault state\nNot tested\nAdvanced states\nNot tested\nScreen reader\nNot available\nKeyboard navigation\nNot available\nOverview\nDate pickers allow users to select past, present, or future dates. The kind of\ndate you are requesting from the user will determine which date picker (simple\nor calendar) is best to use. A time picker helps users select a specific time.\nYou can customize the time picker’s format depending on location or need.\nWhen to use\nWhen asking the user for an exact, approximate, or memorable date or time.\nFor scheduling tasks.\nVariants\nVariant\nPurpose\nSimple date input\nUse if the date can be remembered by the user easily, such as a date of birth, and they don’t need a calendar to anticipate the dates. It consists only of input fields.\nCalendar picker\nUse a calendar picker (single or range) when the user needs to know a date’s relationship to other days or when a date could be variable. The user can view and pick dates from a calendar widget or manually type them in the text field.\nTime picker\nUse when asking the user to input a specific time.\nFormatting\nAnatomy of date pickers\nDefault\nFluid\nAnatomy of a simple date input and a single date calendar picker.\nLabel\n: Instructs the user what to do with the control.\nDate field\n: A text input field where the user can manually type in the\ndate.\nDate format\n: Format instructions should appear as helper text below the\nfield or inline with the label.\nIcon\n:\ncalendar\nCopy to clipboard\nicon indicates the calendar menu is available.\nCalendar\n: The menu where a date may be selected.\nMonth and year controls\n: Allows the user to navigate through past and\nfuture time frames.\nPrevious and next month controls\n: Allows the user to move forward or\nbackward one month at a time.\nWeek day\n: Days of the week.\nDay\n: Days in the month, see\ncalendar variants\nfor\nspecific day styles.\nAnatomy of a time picker\nDefault\nFluid\nLabel\n: Instructs the user what to do with the control.\nHour and minute field\n: A text input field where the user types the hours\nand minutes of the desired time.\nAM/PM selector\n: A select control that allows the user to choose time\nperiod.\nTimezone selector\n: A select control that allows the user to set the\nassociated time zone.\nStyling\nThere are two styles of date picker inputs, default and fluid. They share the\nsame functionality but look visually different, influencing where to use them.\nStyle\nAppearance\nUse case\nDefault\nA traditional style where the label is positioned outside and above the input field.\nUse when white space is needed between input components or in productive moments where space is at a premium, and smaller components are needed.\nFluid\nAn alternative style where the label is placed inside of the input field and is stacked inline with the user input text.\nUse in expressive moments, fluid forms, contained spaces, or attached to complex components, like a toolbar.\nSizes\nDefault input heights\nThe default input fields for date and time picker come in three height sizes:\nsmall (32px), medium (40px), and large (48px). The calendar menu in the date\npicker is a fixed height and width and does not change with the input size.\nDefault size\nHeight (px/rem)\nUse case\nSmall (sm)\n32 / 2\nUse when space is constricted or when placing a dropdown in a form that is long and complex.\nMedium (md)\n40 / 2.5\nThis is the default size and the most commonly used size. When in doubt, use the medium size.\nLarge (lg)\n48 / 3\nUse when there is a lot of space to work with. This size is typically used in simple forms or when a dropdown is placed by itself on a page, for example as a filter.\nFluid input heights\nThere is only one fluid input height and it is visually larger than the default\nheights. The input is a set height of 64px except when a warning or error\nmessage has been added to the bottom.\nAlignment\nBy default, the pickers have set widths. If you are placing the picker inline\nwith other inputs, such as in a form, then the widths can be adjusted to match\nthe other inputs. The picker can either increase or decrease in width as needed.\nIf you adjust the size, be aware that pickers have minimum widths and the date\ncontent should never horizontally scroll or overflow.\nAligning the calendar menu\nThe calendar itself will always remain a set width and is not adjustable. It\nshould always be aligned to the left edge of its assigned text field.\nContent\nMain elements\nLabel\nBoth date and time pickers must be accompanied with labels.\nThe labels should be clear and descriptive.\nRange inputs should be being properly labeled with a start and end label.\nDate format\nWhen using a simple date input, include the date format in parentheses inline\nwith the label or as helper text below the label.\nWhen using the calendar picker, the date format will be automated if the user\nselects from the calendar menu.\nOnly including the date format as placeholder text inside the field is\nproblematic because it will disappear from view once the user begins typing.\nExample suggesting the proper date format in helper text on the left or in a\nlabel on the right.\nThe date format can be displayed differently depending on your location. For\nexample, some countries use the format month/day/year, while others may change\nthe order to year-month-day and can use dashes instead of slashes. The date\npicker utilizes\nflatpickr\n, which accepts\ndateFormat\nCopy to clipboard\nand\nlocale\nCopy to clipboard\nprops that allow you to change how the date is\ndisplayed and lets you change the language of the calendar. Localizing static\ndates in the same UI is also recommended if you choose to localize your date\nentries.\nExample of formatting dates with American English format on the left and\nInternational Standard format on the right.\nTime format\nBoth the 12-hour and 24-hour time systems are allowed.\nIf using the 12-hour format it must be accompanied by an AM/PM selection.\nUse uppercase letters and no periods for the abbreviations AM and PM.\nSpecific times should specify a timezone.\nFurther guidance\nFor further content guidance, see Carbon’s\ncontent guidelines\n.\nUniversal behaviors\nThe behaviors listed in this section are universal across all of the variants.\nFor behaviors that are unique to each variant, see each of the component variant\nsections below.\nStates\nDate picker and calendar menu\nThe date picker input is a\ntext input\nand has\nthe same interactive state and behaviors. Only date pickers with calendars will\nhave the calendar icon present in the right side of the input field. See the\nstyle tab\nfor more details.\nFor calendar menu states, see the\ncalendar variants\nsection.\nTime picker\nThe time picker is a combination of a\ntext input\nand\nselect inputs\nand has the same interactive state\nand behaviors. See the\nstyle tab\nfor more details.\nState\nWhen to use\nEnabled\nWhen the date or time picker is live, but a user is not directly interacting with it. This is commonly referred to as the default or normal state of the component.\nHover\nWhen a user’s mouse cursor is hovering over the field.\nFocus\nWhen a user tabs to or clicks into the input, the field becomes focused, indicating the user has successfully navigated to the component.\nOpen\nThe open state is specifically for the calendar menu. When the calendar menu is open, the user can navigate within the menu to select a single date or a range of dates.\nError\nWhen the required field for a text input in the date or time picker component has not been filled in or when a select in the time picker component does not have a selection. It can also be triggered due to a system error. This state requires a user response before data can be submitted or saved.\nWarning\nWhen you need to call the user’s attention to an exception condition. The condition might not be an error but can cause problems if not resolved.\nDisabled\nWhen the user cannot interact with a component and all interactive functions have been removed. Unlike read-only states, disabled states are not focusable, are not read by screen readers, and do not need to pass visual contrast, making them inaccessible if they need to be interpreted.\nSkeleton\nUse on an initial page load to indicate that the date picker or time picker has not yet fully loaded.\nRead-only\nWhen the user can review but not modify the component. This state removes all interactive functions like the disabled state but can still be focusable, accessible by screen readers, and passes visual contrast for readability.\nValidation\nInvalid fields should be clearly marked. In pickers with more than one field,\nthe invalid state should only be set on the individual factor that is triggering\nthe error so the user can clearly understand which to address.\nInternationalization\nInternationalization, also referred to as globalization, refers to software\nadapting to different languages, regional peculiarities, and technical\nrequirements of a target locale without additional code changes. This means that\nif the location is known, then formatting of a date or time can automatically\nchange to the acceptable local format. You should always try to design for\ninternationalization.\nSimple date input\nThe simple date input provides the user with only a text field in which they can\nmanually input a date. It allows dates to be entered without adding unnecessary\ninteractions that come with the calendar menu or a dropdown.\nThe simple date input can include\nmonth/year\nor\nmonth/day/year.\nThe\nformatting may be localized and rearranged in sequence of appearance.\nWhen to use\nUse for memorable dates\nSimple date inputs are typically used when the date is known by the user, such\nas a date of birth or credit card expiration.\nUse for approximate dates\nSimple date inputs are best for when asking the user for an approximate date\ninstead of an exact date, especially in regards to past dates. For example, when\nwas asking a user when a purchase was made they will most likely easily recall\nthe month and year (November 2019) versus the specific date (November 22, 2019).\nCalendar pickers\nCalendar pickers default to showing today’s date when opened and only one month\nis shown at a time. Calendar pickers allow users to navigate through months and\nyears, however they work best when used for recent or near future dates. If a\nuser needs to input a far distant or future date consider having the calendar\ndefault open to a more convenient day.\nKeep in mind that some users may find calendar pickers difficult to use. There\nshould always be a simple way to enter dates in a text field when using calendar\npickers.\nUse for scheduling\nUse a calendar picker when the user needs to know a date’s relation to other\ndays such as the day of the week it falls on or its proximity to today. They are\noptimal for scheduling tasks.\nCalendar variants\nSingle date picker\nIn a single date picker a user has the option to either manually input a date in\nthe text field or select one specific date from the menu calendar. It requires a\nday, month, and year to be selected.\nToday’s date\nHover\nDay in month\nSelected day\nDay in next/previous month\nDate range picker\nThe date range picker functions much like the single date picker but instead of\nchoosing just one date the user can choose a\nstart\nCopy to clipboard\nand\nend\nCopy to clipboard\ndate. For each\ndate in the range, users have the option to manually enter the date in a text\nfield or select the date in the calendar. Each point requires a day, month, and\nyear to be selected.\nDay in month\nToday\nSelected start date\nDay in range\nEnd date hover and focus\nDay in next/previous month\nCalendar behaviors\nOpening the calendar\nThe calendar can be opened in two ways:\nClicking the\ncalendar\nCopy to clipboard\nicon on the far right of the field opens the calendar\nmenu.\nWhen the text field receives focus the calendar menu also appears and remains\nopen until a date is selected or the focus is removed from the picker.\nSelecting a date\nA date can be selected by:\nManually entering a date in the text input field.\nClicking on a date in the calendar menu.\nNavigating to a date by using the\nArrow\nCopy to clipboard\nkeys and then pressing\nEnter\nCopy to clipboard\n.\nNext and previous month\nA user can navigate between the months in a year by:\nClicking on\nchevron\nCopy to clipboard\nicons at the top left and right of the calendar.\nUsing the\nArrow\nCopy to clipboard\nkeys to move through the into the next or previous month.\nSelecting a year\nBy default the current date and year appears in the calendar. To navigate to\nanother year the user can do one of the following:\nManually typing the year in the date text field.\nClicking the up and down arrows that appear when you focus or hover on the\nyear input in the calendar.\nSelecting then typing into the year input.\nClosing the calendar\nThe calendar can be closed in one of the following ways:\nSelecting a single date or the end date in a range. This will automatically\nclose it.\nClicking anywhere outside of the calendar menu.\nRemoving focus from the picker.\nPressing\nEsc\nCopy to clipboard\n.\nSelecting a range\nThere are several ways in which a range can be selected:\nManually type the start and end dates in the text field.\nOnce the calendar is open the first date you click becomes the start date and\nsecond date you click becomes the end date.\nNavigating to the start date by using the\nArrow\nCopy to clipboard\nkeys and pressing\nEnter\nCopy to clipboard\n.\nThen continue using the\nArrow\nCopy to clipboard\nkeys to navigate to a second date and press\nEnter\nCopy to clipboard\nagain.\nMin and max dates\nIn order to constrain the possible selectable dates in a calendar, a min and max\ndate may be set. Once set, only the dates that fall within the min/max range\nwill be selectable with the dates outside of the range being disabled.\nUse min and max dates to help prevent user error. If a user cannot select dates\nin the past when scheduling, then set a min date to today.\nThe dates before today are out of range and disabled.\nTime pickers\nTime pickers provide the user with a text field in which they can input the hour\nand minutes. Additionally, they can be accompanied by an AM/PM and a time zone\ncontrol, both styled as selects.\nThe time field format should include the hour and minutes, for example 11:30. It\nmay be localized to accommodate the 12-hour or 24-hour format.\nUse for scheduling\nUse the time picker when a specific time needs to be scheduled, such as planning\na meeting time.\nAI presence\nDate picker has a modification that takes on the AI visual styling when the AI\nlabel is present in the input. The AI variant functions the same as the normal\nversion except with the addition of the AI label which is both a visual\nindicator and the trigger for the explainability popover.\nFor more information on designing for AI, see the\nCarbon for AI\nguidelines.\nDefault\nFluid\nRevert to AI\nA date picker can toggle between the AI variant and the non-AI variant depending\non the user’s interaction. If the user manually overrides the AI-suggested\ncontent then the input will change from the AI variant to the non-AI variant.\nOnce edited, the user should still be able to switch back to the initially AI\ngenerated content via a revert to AI button.\nDefault\nFluid\nRelated\nAsking for relative times and dates\nAnother common use case not accounted for in the above pickers is setting a time\nor date relative to today or now, such as with a reminder. For example, setting\nan install to begin now, in one hour, or tonight. This variant of picker can\nmade by using the standard\nselect\ncomponent.\nUsing individual inputs\nAnother acceptable form of a date experience would be using individual inputs\nfor each factor. Using an individual field for each factor of a date can help\nreduce formatting errors. This is especially beneficial when localization cannot\nbe used to reformat dates.\nInstead of having one input for an exact date (month/day/year), you could have\nthree separate inputs and a clear label for each.\nFeedback\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\nGitHub\n.\nEdit this page on GitHub\nPrevious\nComponents: Data table\nNext\nDate picker: Style",
  "content_markdown": "# Date picker\n\nDate and time pickers allow users to select a single instance or range of dates\nand times.\n\nDate picker\n[with AI label](https://react.carbondesignsystem.com/?path=/story/components-datepicker--with-ai-label)\nis now stable. This addition changes the visual appearance of the component and\nintroduces an AI explainability feature when AI is present in the component. See\nthe [AI presence](/components/date-picker/usage/#ai-presence) section for more\ndetails.\n\n- [Live demo](#live-demo)\n- [Overview](#overview)\n- [Formatting](#formatting)\n- [Content](#content)\n- [Universal behaviors](#universal-behaviors)\n- [Simple date input](#simple-date-input)\n- [Calendar pickers](#calendar-pickers)\n- [Time pickers](#time-pickers)\n- [AI presence](#ai-presence)\n- [Related](#related)\n- [Feedback](#feedback)\n\n## Live demo\n\nTheme selector\n\nWhite\n\n---\n\nVariant selector\n\nRange with calendar\n\n---\n\nThis live demo contains only a preview of functionality and styles available for this component. View the [full demo](https://react.carbondesignsystem.com/?path=/story/components-datepicker--range-with-calendar&globals=theme:white) on Storybook for additional information such as its version, controls, and API documentation.\n\n### Accessibility testing status For every latest release, Carbon runs tests on all components to meet the [accessibility requirements](https://www.ibm.com/able/requirements/requirements/). These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\n\nVariant\n\nDate picker\n\n---\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nPartially tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nNot available](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nNot available](//accessibility/#accessibility-testing-status)\n\n## Overview\n\nDate pickers allow users to select past, present, or future dates. The kind of\ndate you are requesting from the user will determine which date picker (simple\nor calendar) is best to use. A time picker helps users select a specific time.\nYou can customize the time picker’s format depending on location or need.\n\n### When to use\n\n- When asking the user for an exact, approximate, or memorable date or time.\n- For scheduling tasks.\n\n### Variants\n\n| Variant | Purpose |\n| --- | --- |\n| [Simple date input](/components/date-picker/usage#simple-date-input) | Use if the date can be remembered by the user easily, such as a date of birth, and they don’t need a calendar to anticipate the dates. It consists only of input fields. |\n| [Calendar picker](/components/date-picker/usage#calendar-pickers) | Use a calendar picker (single or range) when the user needs to know a date’s relationship to other days or when a date could be variable. The user can view and pick dates from a calendar widget or manually type them in the text field. |\n| [Time picker](/components/date-picker/usage/#time-pickers) | Use when asking the user to input a specific time. |\n\n## Formatting\n\n### Anatomy of date pickers\n\n- Default\n- Fluid\n\n![Default date picker anatomy](/static/d4f663c750fd3c45a5f2c31aa048a003/3cbba/date-picker-anatomy.png)\n\n![Fluid date picker anatomy](/static/49ab39956bdcc045dd25de1babc1316e/3cbba/date-picker-anatomy-fluid.png)\n\nAnatomy of a simple date input and a single date calendar picker.\n\n1. **Label**: Instructs the user what to do with the control.\n2. **Date field**: A text input field where the user can manually type in the\n   date.\n3. **Date format**: Format instructions should appear as helper text below the\n   field or inline with the label.\n4. **Icon**:\n\n   ```\n   calendar\n   ```\n\n   Copy to clipboard\n\n   icon indicates the calendar menu is available.\n5. **Calendar**: The menu where a date may be selected.\n6. **Month and year controls**: Allows the user to navigate through past and\n   future time frames.\n7. **Previous and next month controls**: Allows the user to move forward or\n   backward one month at a time.\n8. **Week day**: Days of the week.\n9. **Day**: Days in the month, see\n   [calendar variants](/components/date-picker/usage#calendar-variants) for\n   specific day styles.\n\n### Anatomy of a time picker\n\n- Default\n- Fluid\n\n![Default time picker anatomy](/static/b6a0cc99b29bf0270965319390fccf04/3cbba/time-picker-anatomy.png)\n\n![Fluid time picker anatomy](/static/4b2dcfd8fdf50271713ef0722f320892/3cbba/time-picker-anatomy-fluid.png)\n\n1. **Label**: Instructs the user what to do with the control.\n2. **Hour and minute field**: A text input field where the user types the hours\n   and minutes of the desired time.\n3. **AM/PM selector**: A select control that allows the user to choose time\n   period.\n4. **Timezone selector**: A select control that allows the user to set the\n   associated time zone.\n\n### Styling\n\nThere are two styles of date picker inputs, default and fluid. They share the\nsame functionality but look visually different, influencing where to use them.\n\n| Style | Appearance | Use case |\n| --- | --- | --- |\n| Default | A traditional style where the label is positioned outside and above the input field. | Use when white space is needed between input components or in productive moments where space is at a premium, and smaller components are needed. |\n| Fluid | An alternative style where the label is placed inside of the input field and is stacked inline with the user input text. | Use in expressive moments, fluid forms, contained spaces, or attached to complex components, like a toolbar. |\n\n![An example of a default and fluid date picker input](/static/55ce18129af77ec1dfb9d5a68efe0931/3cbba/date-picker-formatting-styling.png)\n\n### Sizes\n\n#### Default input heights\n\nThe default input fields for date and time picker come in three height sizes:\nsmall (32px), medium (40px), and large (48px). The calendar menu in the date\npicker is a fixed height and width and does not change with the input size.\n\n| Default size | Height (px/rem) | Use case |\n| --- | --- | --- |\n| Small (sm) | 32 / 2 | Use when space is constricted or when placing a dropdown in a form that is long and complex. |\n| Medium (md) | 40 / 2.5 | This is the default size and the most commonly used size. When in doubt, use the medium size. |\n| Large (lg) | 48 / 3 | Use when there is a lot of space to work with. This size is typically used in simple forms or when a dropdown is placed by itself on a page, for example as a filter. |\n\n![Default input size example](/static/9ee70bdb834116c0adb66a3855fdb28d/3cbba/date-picker-sizes.png)\n\n#### Fluid input heights\n\nThere is only one fluid input height and it is visually larger than the default\nheights. The input is a set height of 64px except when a warning or error\nmessage has been added to the bottom.\n\n![Fluid input size example](/static/6ac344e1280532d3f0dac0674f8f67f3/3cbba/date-picker-sizes-fluid.png)\n\n### Alignment\n\nBy default, the pickers have set widths. If you are placing the picker inline\nwith other inputs, such as in a form, then the widths can be adjusted to match\nthe other inputs. The picker can either increase or decrease in width as needed.\nIf you adjust the size, be aware that pickers have minimum widths and the date\ncontent should never horizontally scroll or overflow.\n\n![Alignment example](/static/80e573d88a78b46494ad20bd80f9c179/3cbba/date-picker-alignment-01.png)\n\n#### Aligning the calendar menu\n\nThe calendar itself will always remain a set width and is not adjustable. It\nshould always be aligned to the left edge of its assigned text field.\n\n![Alignment example](/static/87425242ecd7f29fa7e805bd05b20bd6/3cbba/date-picker-alignment-02.png)\n\n## Content\n\n### Main elements\n\n#### Label\n\n- Both date and time pickers must be accompanied with labels.\n- The labels should be clear and descriptive.\n- Range inputs should be being properly labeled with a start and end label.\n\n#### Date format\n\n- When using a simple date input, include the date format in parentheses inline\n  with the label or as helper text below the label.\n- When using the calendar picker, the date format will be automated if the user\n  selects from the calendar menu.\n- Only including the date format as placeholder text inside the field is\n  problematic because it will disappear from view once the user begins typing.\n\n![Alignment example](/static/a2e0508f4f15603b9f1cc9feb60dcf2c/3cbba/date-format-placement.png)\n\nExample suggesting the proper date format in helper text on the left or in a\nlabel on the right.\n\n- The date format can be displayed differently depending on your location. For\n  example, some countries use the format month/day/year, while others may change\n  the order to year-month-day and can use dashes instead of slashes. The date\n  picker utilizes [flatpickr](https://flatpickr.js.org/), which accepts\n\n  ```\n  dateFormat\n  ```\n\n  Copy to clipboard\n\n  and\n\n  ```\n  locale\n  ```\n\n  Copy to clipboard\n\n  props that allow you to change how the date is\n  displayed and lets you change the language of the calendar. Localizing static\n  dates in the same UI is also recommended if you choose to localize your date\n  entries.\n\n![Localized dates example](/static/a8a61edbabb10c1afc6afc24f72bc1a9/3cbba/date-picker-usage-localized.png)\n\nExample of formatting dates with American English format on the left and\nInternational Standard format on the right.\n\n#### Time format\n\n- Both the 12-hour and 24-hour time systems are allowed.\n- If using the 12-hour format it must be accompanied by an AM/PM selection.\n- Use uppercase letters and no periods for the abbreviations AM and PM.\n- Specific times should specify a timezone.\n\n### Further guidance\n\nFor further content guidance, see Carbon’s\n[content guidelines](/guidelines/content/overview/).\n\n## Universal behaviors\n\nThe behaviors listed in this section are universal across all of the variants.\nFor behaviors that are unique to each variant, see each of the component variant\nsections below.\n\n### States\n\n#### Date picker and calendar menu\n\nThe date picker input is a [text input](/components/text-input/usage) and has\nthe same interactive state and behaviors. Only date pickers with calendars will\nhave the calendar icon present in the right side of the input field. See the\n[style tab](/components/date-picker/style#date-picker-color) for more details.\nFor calendar menu states, see the\n[calendar variants](/components/date-picker/usage/#calendar-variants) section.\n\n#### Time picker\n\nThe time picker is a combination of a [text input](/components/text-input/usage)\nand [select inputs](/components/select/usage) and has the same interactive state\nand behaviors. See the\n[style tab](/components/date-picker/style/#time-picker-color) for more details.\n\n| State | When to use |\n| --- | --- |\n| *Enabled* | When the date or time picker is live, but a user is not directly interacting with it. This is commonly referred to as the default or normal state of the component. |\n| *Hover* | When a user’s mouse cursor is hovering over the field. |\n| *Focus* | When a user tabs to or clicks into the input, the field becomes focused, indicating the user has successfully navigated to the component. |\n| *Open* | The open state is specifically for the calendar menu. When the calendar menu is open, the user can navigate within the menu to select a single date or a range of dates. |\n| *Error* | When the required field for a text input in the date or time picker component has not been filled in or when a select in the time picker component does not have a selection. It can also be triggered due to a system error. This state requires a user response before data can be submitted or saved. |\n| *Warning* | When you need to call the user’s attention to an exception condition. The condition might not be an error but can cause problems if not resolved. |\n| *Disabled* | When the user cannot interact with a component and all interactive functions have been removed. Unlike read-only states, disabled states are not focusable, are not read by screen readers, and do not need to pass visual contrast, making them inaccessible if they need to be interpreted. |\n| *Skeleton* | Use on an initial page load to indicate that the date picker or time picker has not yet fully loaded. |\n| *Read-only* | When the user can review but not modify the component. This state removes all interactive functions like the disabled state but can still be focusable, accessible by screen readers, and passes visual contrast for readability. |\n\n#### Validation\n\nInvalid fields should be clearly marked. In pickers with more than one field,\nthe invalid state should only be set on the individual factor that is triggering\nthe error so the user can clearly understand which to address.\n\n![Validation example](/static/03b166c16dfff1ee7fdd4037bd169544/3cbba/date-picker-validation.png)\n\n### Internationalization\n\nInternationalization, also referred to as globalization, refers to software\nadapting to different languages, regional peculiarities, and technical\nrequirements of a target locale without additional code changes. This means that\nif the location is known, then formatting of a date or time can automatically\nchange to the acceptable local format. You should always try to design for\ninternationalization.\n\n## Simple date input\n\nThe simple date input provides the user with only a text field in which they can\nmanually input a date. It allows dates to be entered without adding unnecessary\ninteractions that come with the calendar menu or a dropdown.\n\nThe simple date input can include *month/year* or *month/day/year.* The\nformatting may be localized and rearranged in sequence of appearance.\n\n### When to use\n\n#### Use for memorable dates\n\nSimple date inputs are typically used when the date is known by the user, such\nas a date of birth or credit card expiration.\n\n#### Use for approximate dates\n\nSimple date inputs are best for when asking the user for an approximate date\ninstead of an exact date, especially in regards to past dates. For example, when\nwas asking a user when a purchase was made they will most likely easily recall\nthe month and year (November 2019) versus the specific date (November 22, 2019).\n\n![Simple date input](/static/eda30a9fc8911e0ca54a2293bd19891f/3cbba/single-date-input.png)\n\n## Calendar pickers\n\nCalendar pickers default to showing today’s date when opened and only one month\nis shown at a time. Calendar pickers allow users to navigate through months and\nyears, however they work best when used for recent or near future dates. If a\nuser needs to input a far distant or future date consider having the calendar\ndefault open to a more convenient day.\n\nKeep in mind that some users may find calendar pickers difficult to use. There\nshould always be a simple way to enter dates in a text field when using calendar\npickers.\n\n#### Use for scheduling\n\nUse a calendar picker when the user needs to know a date’s relation to other\ndays such as the day of the week it falls on or its proximity to today. They are\noptimal for scheduling tasks.\n\n### Calendar variants\n\n#### Single date picker\n\nIn a single date picker a user has the option to either manually input a date in\nthe text field or select one specific date from the menu calendar. It requires a\nday, month, and year to be selected.\n\n![Single date calendar picker](/static/ab1c2731904f3e37874f7e617d3589c9/3cbba/single-date-picker.png)\n\n1. Today’s date\n2. Hover\n3. Day in month\n4. Selected day\n5. Day in next/previous month\n\n#### Date range picker\n\nThe date range picker functions much like the single date picker but instead of\nchoosing just one date the user can choose a\n\n```\nstart\n```\n\nCopy to clipboard\n\nand\n\n```\nend\n```\n\nCopy to clipboard\n\ndate. For each\ndate in the range, users have the option to manually enter the date in a text\nfield or select the date in the calendar. Each point requires a day, month, and\nyear to be selected.\n\n![Date range calendar picker](/static/3755cd6576787b33307d6d515ed79e5f/3cbba/range-date-picker.png)\n\n1. Day in month\n2. Today\n3. Selected start date\n4. Day in range\n5. End date hover and focus\n6. Day in next/previous month\n\n### Calendar behaviors\n\n#### Opening the calendar\n\nThe calendar can be opened in two ways:\n\n- Clicking the\n\n  ```\n  calendar\n  ```\n\n  Copy to clipboard\n\n  icon on the far right of the field opens the calendar\n  menu.\n- When the text field receives focus the calendar menu also appears and remains\n  open until a date is selected or the focus is removed from the picker.\n\n#### Selecting a date\n\nA date can be selected by:\n\n- Manually entering a date in the text input field.\n- Clicking on a date in the calendar menu.\n- Navigating to a date by using the\n\n  ```\n  Arrow\n  ```\n\n  Copy to clipboard\n\n  keys and then pressing\n\n  ```\n  Enter\n  ```\n\n  Copy to clipboard\n\n  .\n\n#### Next and previous month\n\nA user can navigate between the months in a year by:\n\n- Clicking on\n\n  ```\n  chevron\n  ```\n\n  Copy to clipboard\n\n  icons at the top left and right of the calendar.\n- Using the\n\n  ```\n  Arrow\n  ```\n\n  Copy to clipboard\n\n  keys to move through the into the next or previous month.\n\n#### Selecting a year\n\nBy default the current date and year appears in the calendar. To navigate to\nanother year the user can do one of the following:\n\n- Manually typing the year in the date text field.\n- Clicking the up and down arrows that appear when you focus or hover on the\n  year input in the calendar.\n- Selecting then typing into the year input.\n\n#### Closing the calendar\n\nThe calendar can be closed in one of the following ways:\n\n- Selecting a single date or the end date in a range. This will automatically\n  close it.\n- Clicking anywhere outside of the calendar menu.\n- Removing focus from the picker.\n- Pressing\n\n  ```\n  Esc\n  ```\n\n  Copy to clipboard\n\n  .\n\n#### Selecting a range\n\nThere are several ways in which a range can be selected:\n\n- Manually type the start and end dates in the text field.\n- Once the calendar is open the first date you click becomes the start date and\n  second date you click becomes the end date.\n- Navigating to the start date by using the\n\n  ```\n  Arrow\n  ```\n\n  Copy to clipboard\n\n  keys and pressing\n\n  ```\n  Enter\n  ```\n\n  Copy to clipboard\n\n  .\n  Then continue using the\n\n  ```\n  Arrow\n  ```\n\n  Copy to clipboard\n\n  keys to navigate to a second date and press\n\n  ```\n  Enter\n  ```\n\n  Copy to clipboard\n\n  again.\n\n#### Min and max dates\n\nIn order to constrain the possible selectable dates in a calendar, a min and max\ndate may be set. Once set, only the dates that fall within the min/max range\nwill be selectable with the dates outside of the range being disabled.\n\nUse min and max dates to help prevent user error. If a user cannot select dates\nin the past when scheduling, then set a min date to today.\n\n![Min and max date example](/static/378473efb4ba043c64752ddd31aeecd8/3cbba/calendar-picker-min-max.png)\n\nThe dates before today are out of range and disabled.\n\n## Time pickers\n\nTime pickers provide the user with a text field in which they can input the hour\nand minutes. Additionally, they can be accompanied by an AM/PM and a time zone\ncontrol, both styled as selects.\n\nThe time field format should include the hour and minutes, for example 11:30. It\nmay be localized to accommodate the 12-hour or 24-hour format.\n\n#### Use for scheduling\n\nUse the time picker when a specific time needs to be scheduled, such as planning\na meeting time.\n\n![Time picker example](/static/73a4cac2638d03221f341e104b6aa4a3/3cbba/time-picker-example.png)\n\n## AI presence\n\nDate picker has a modification that takes on the AI visual styling when the AI\nlabel is present in the input. The AI variant functions the same as the normal\nversion except with the addition of the AI label which is both a visual\nindicator and the trigger for the explainability popover.\n\nFor more information on designing for AI, see the\n[Carbon for AI](/guidelines/carbon-for-ai/) guidelines.\n\n- Default\n- Fluid\n\n![Default date picker with AI presence](/static/8ee79d72797da5311b86ddef7c343d3d/3cbba/date-picker-AI-presence-default-usage.png)\n\n![Fluid date picker with AI presence](/static/56b745cbd777a137b2430895c1c211be/3cbba/date-picker-AI-presence-fluid-usage.png)\n\n### Revert to AI\n\nA date picker can toggle between the AI variant and the non-AI variant depending\non the user’s interaction. If the user manually overrides the AI-suggested\ncontent then the input will change from the AI variant to the non-AI variant.\nOnce edited, the user should still be able to switch back to the initially AI\ngenerated content via a revert to AI button.\n\n- Default\n- Fluid\n\n![Default date picker with AI revert](/static/7ee587152c90077fefc52a4c62823124/3cbba/date-picker-revert-to-AI-default-usage.png)\n\n![Fluid date picker with AI revert](/static/3dfdbbf7bc96a27f7fae8f603418570b/3cbba/date-picker-revert-to-AI-fluid-usage.png)\n\n## Related\n\n#### Asking for relative times and dates\n\nAnother common use case not accounted for in the above pickers is setting a time\nor date relative to today or now, such as with a reminder. For example, setting\nan install to begin now, in one hour, or tonight. This variant of picker can\nmade by using the standard [select](/components/select/usage/) component.\n\n#### Using individual inputs\n\nAnother acceptable form of a date experience would be using individual inputs\nfor each factor. Using an individual field for each factor of a date can help\nreduce formatting errors. This is especially beneficial when localization cannot\nbe used to reformat dates.\n\nInstead of having one input for an exact date (month/day/year), you could have\nthree separate inputs and a clear label for each.\n\n## Feedback\n\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\n[GitHub](https://github.com/carbon-design-system/carbon-website/issues/new?assignees=&labels=feedback&template=feedback.md).\n\n[Edit this page on GitHub](https://github.com/carbon-design-system/carbon-website/edit/main/src/pages/components/date-picker/usage.mdx)\n\n[Previous\n\nComponents: Data table](/components/data-table/usage/)\n\n[Next\n\nDate picker: Style](/components/date-picker/style/)",
  "tags": [
    "ibm",
    "carbon",
    "design-system",
    "enterprise"
  ],
  "extracted_at": "2026-02-03T14:19:08.553590+00:00",
  "content_length": 17198,
  "content_hash": "e512c6f75da8b007"
}