{
  "id": "carbon-design__components_dropdown_usage_",
  "source_id": "carbon-design",
  "source_name": "IBM Carbon Design System",
  "category": "design_systems",
  "url": "https://carbondesignsystem.com/components/dropdown/usage/",
  "title": "Dropdown",
  "content": "Dropdown\nDropdowns have a list of options that a user can select from. These selections\ncan fill in a form, filter, or sort content.\nDropdown\n,\ncombo box\n,\nand\nmultiselect\nwith AI label are now stable. These additions change the visual appearance of\nthe component and introduce an AI explainability feature when AI is present in\nthe components. See the\nAI presence\nsection for more details.\nLive demo\nOverview\nFormatting\nContent\nUniversal behaviors\nDropdown\nMultiselect\nCombo box\nModifiers\nAI presence\nRelated\nReferences\nFeedback\nLive demo\nTheme selector\nWhite\nVariant selector\nDropdown\nThis live demo contains only a preview of functionality and styles available for this component. View the\nfull demo\non Storybook for additional information such as its version, controls, and API documentation.\nAccessibility testing status\nFor every latest release, Carbon runs tests on all components to meet the\naccessibility requirements\n. These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\nVariant\nDropdown\nDefault state\nTested\nAdvanced states\nPartially tested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nDefault state\nTested\nAdvanced states\nTested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nDefault state\nTested\nAdvanced states\nPartially tested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nDefault state\nTested\nAdvanced states\nTested\nScreen reader\nNot available\nKeyboard navigation\nTested\nDefault state\nTested\nAdvanced states\nTested\nScreen reader\nNot available\nKeyboard navigation\nTested\nDefault state\nNot tested\nAdvanced states\nNot tested\nScreen reader\nNot tested\nKeyboard navigation\nNot available\nOverview\nThere are three different variants of dropdowns that support various kinds of\nfunctionality—dropdown, multiselect, and combo box.\nWhen to use\nDropdowns can be used in forms on full pages, in modals, or on side panels. The\ndropdown component is used to filter or sort contents on a page. It is a\nstylized version of the select component, and can be styled as needed.\nWhen not to use\nLimited options\nIt is best practice not to use a dropdown if there are two options to choose\nfrom. In this case, use a\nradio button\ngroup\ninstead.\nNesting\nDo not nest dropdowns or use them to display overly complex information. Keep\noption selections as straight forward as possible.\nForm-based or mobile platform\nConsider using a\nselect\nif most of your experience\nis form-based or frequently used on mobile platforms. The native HTML select\nworks more easily when submitting data and is also easier to use on a mobile\nplatform.\nVariants\nVariant\nPurpose\nDropdown\nAllows the user to select one option from a list.\nMultiselect\nAllows the user to select multiple options from a list and filter.\nCombo box\nAllows the user to either select an option from a large list or type in their own custom value.\nFormatting\nAnatomy\nDropdowns are composed of four distinct sections—assistive text like labels or\nhelper text, a field, a menu, and options contained within the menu. Labels and\nhelper text can guide the user to make an informed decision when making a\nselection.\nDefault\nFluid\nLabel:\nText that informs the user what to expect in the list of dropdown\noptions.\nHelper text:\nAssistive text to help the user choose the right selection.\nField:\nPersists when the dropdown is open or closed.\nMenu:\nA list of options to choose from, displayed as an open state.\nOption:\nA choice for the user, shown with other choices in a menu.\nParent checkbox:\nUsed to select all the options from within the menu in\nmultiselect dropdowns.\nStyling\nThere are two styles of dropdown inputs: default and fluid. They share the same\nfunctionality but look visually different, influencing where to use them.\nStyle\nAppearance\nUse case\nDefault\nA traditional style where the label is positioned outside and above the input field.\nUse when white space is needed between input components or in productive moments where space is at a premium, and smaller components are needed.\nFluid\nAn alternative style where the label is placed inside of the input field and is stacked inline with the user input text.\nUse in expressive moments, fluid forms, contained spaces, or attached to complex components, like a toolbar.\nA default style input is shown on the left and fluid style is on the right.\nSizing\nThere are three default dropdown height sizes: small, medium, and large.\nSupporting three different dropdown sizes gives you more flexibility when\nstructuring layouts. However, use a consistent size for all form components on\nthe same page. For example, if you are using a medium size dropdown also use the\nsame size text inputs, buttons, and so on. When in doubt, use the default medium\nsize height.\nSize\nHeight (px/rem)\nUse case\nSmall (sm)\n32 / 2\nUse when space is constricted or when placing a dropdown in a form that is long and complex.\nMedium (md)\n40 / 2.5\nThis is the default size and the most commonly used size.\nLarge (lg)\n48 / 3\nChoose this size when there is a lot of space to work with. This size is typically used in simple forms or when a dropdown is placed by itself on a page, for example as a filter.\nWhen the menu is open, each option in the menu should be the same height as the\nfield.\nFluid inputs heights\nIn the fluid dropdown, there is only one input height but there are two menu\nitem sizes–default and condensed.\nFluid size\nHeight (px/rem)\nUse case\nDefault\n64 / 4\nUse when there are fewer menu options in expressive moments.\nCondensed\n40 / 2.5\nUse when there are many menu options so more can be viewed at once without scrolling.\nWidth\nThere is no minimum or maximum width for a dropdown. The width can be customized\nappropriately for its context.\nPlacement\nField containers should vertically align with other form components on a page.\nWhether it aligns flush to grid columns or hangs in the gutters depends on the\nstyle of dropdown you are using.\nDo align default style dropdown containers flush to the grid so the input label aligns with other type on the page.\nDon't hang default style dropdowns into the grid gutters.\nDo place fluid components flush to on another with no spacing between them.\nDo not use fluid components with vertical or horizontal spacing between them.\nContent\nMain elements\nLabel text\nLabel text informs users what to expect in the list of dropdown options.\nKeep the label text short and concise by limiting it to a single line of text.\nDo not remove label text in favor of using placeholder text in the dropdown\nfield. Labels are always strongly encouraged to be included when possible.\nHelper text\nHelper text is pertinent information that assists the user in choosing the\nright selection from the dropdown menu.\nHelper text is always available when the dropdown field is focused and appears\nunderneath the label.\nField placeholder text\nPlaceholder text is optional to display in the dropdown field if no option has\nbeen selected yet from the list. Do not put important information in\nplaceholder text because the text disappears once an option is selected from\nthe list. Reserve important information for dropdown label text or helper\ntext, which always remains visible.\nUse clear and concise placeholder text in the dropdown field to indicate how\nto interact with the dropdown. For example, “Choose an option” is commonly\nused as placeholder text in dropdowns.\nOption text\nDropdown option text should be brief, accurate, and not descriptive.\nNever use decorative images or icons within a dropdown.\nWe recommend presenting the options in alphabetical order.\nParent checkbox text\nSince the parent checkbox text is one among the options, do not describe it as\nan action.\nUse the word “All” to describe the parent checkbox.\nAlternatively, add a secondary descriptive word, for example, “All roles,” to\ndescribe the options in the menu.\nOptional versus required fields\nDropdowns can be labeled as either optional or required depending on several\nfactors. For more information, see the form\nUsage\ntab guidance.\nOverflow content\nAvoid multiple lines of text in a dropdown. If the text is too long for a single\nline, add an ellipsis (…) for overflow, and use a tooltip to display the full\ntext—preferably a Carbon tooltip for keyboard accessibility where possible.\nFurther guidance\nFor further content guidance, see Carbon’s\ncontent guidelines\n.\nUniversal behaviors\nThe behaviors listed in this section are universal across all of the variants.\nFor behaviors that are unique to each variant, see the sections below.\nDirection\nA dropdown can open up or down depending on its position on the screen. For\nexample, if the dropdown appears at the bottom and close to the edge of the\ninterface, the menu expands upward to avoid being cropped. By default, our\ndropdowns open downward.\nElevation\nThe dropdown menu has a style called\nbox-shadow\nCopy to clipboard\nthat is placed behind the menu\nwhen open to give the menu a perceived higher elevation than the content that\nmay fall behind it. Box-shadow is also used in other components that have\noverlaid menus, such as the overflow menu and date picker calendar. The SCSS for\nbox-shadow is\n0 2px 6px 0 rgba(0,0,0,.2)\nCopy to clipboard\n.\nScrolling behavior\nScroll bars may not always be enabled so we recommend showing 50% of the last\noption’s container height to indicate there is more to see within the menu. We\nrecommend starting a scroll at the sixth option in the menu list, but this may\nvary based on your specific use case.\nStates\nDropdowns, combo boxes, and multiselects have a series of states for both their\nfields and menus:\nenabled\n,\nhover\n,\nfocus\n,\nerror\n,\nwarning\n,\ndisabled\n,\nskeleton\n, and\nread-only\n. For more information on states,\nvisit the\ninteractive states\nguidance on the style tab.\nVertical dividers in input fields\nVertical dividers act as a visual separator between interactive elements in an\ninput field. These vertical dividers are only present between two interactive\nelements, they should not be introduced between non-interactive elements like\nerror states, other non-interactive icons, or buttons.\nA divider will also be present to the left of the leftmost interactive item set,\neven if it’s next to a non-interactive item.\nDo introduce a vertical divider between two interactive elements in an input field.\nDo not introduce a vertical divider between interactive and non-interactive elements in an input field.\nDo introduce a vertical divider to the left of the leftmost interactive set in an input field.\nDo not use vertical dividers inconsistently in the same icon set, where some icons have vertical dividers and some do not.\nDo introduce a vertical divider to the left of the leftmost interactive set in an input field.\nDo not use vertical dividers inconsistently in the same icon set, where some icons have vertical dividers and some do not.\nInteractions\nMouse\nUsers trigger a dropdown menu to open by clicking the chevron icon or clicking\nanywhere within the field. Users can close the menu by clicking the chevron icon\nor clicking outside of the menu.\nDefault\nFluid\nTo select an option the user can click anywhere inside an option container.\nDefault\nFluid\nTo clear all selected options from a list in a\nmultiselect\nCopy to clipboard\ndropdown, click\nthe “x” icon next to the value inside the tag.\nTo clear a selected value in a\ncombo box\nCopy to clipboard\nor a filterable multiselect\ndropdown, click the “x” icon to the right of the field input text.\nKeyboard\nA dropdown component and its variants multiselect and combo box are reached by\nTab\nCopy to clipboard\n, with navigation of the options by\nUp\nCopy to clipboard\nand\nDown\nCopy to clipboard\narrow keys. However,\nthe keys for opening the component and selecting its options are different for\neach variant. For more information on keyboard interactions, see the\naccessibility tab\n.\nDropdown\nUse a dropdown when the user needs to select one option from a list of\npredefined options. Dropdowns are the optimal default option to provide\nalternative choices. They are also a good choice when screen space is limited.\nDefault\nFluid\nSelecting an option from the menu closes it and the selected option text\nreplaces the placeholder text in the field and also remains as an option in\nplace if the menu is open.\nMultiselect\nUse a multiselect when the user needs to select multiple options from a list of\npredefined options. Multiselects are a good option when the user needs to filter\nor sort content on a page based on multiple criteria. A checkbox icon is\nincluded for each option in the list to enable multiselection.\nMaking a selection\nBy default, the dropdown displays any placeholder text in the field when\nclosed. Activating a closed field opens a menu of options.\nEach option contains a checkbox input to the left of the option text.\nThe menu stays open while options are being selected. The menu closes by\nclicking the field or outside of the dropdown, or by pressing\nEsc\nCopy to clipboard\nor tabbing\naway from the component.\nDefault\nFluid\nFeedback\nOnce options have been selected from the menu, a tag appears to the left of\nthe text in the field containing the total number of selected options, and\nalso provides a functionality to clear all the selected options.\nThe placeholder text can change to text that better reflects what is selected.\nSelected options shift to the top of the menu in an alphanumeric order when\nrevisiting the menu after closing it.\nUnlike dropdown and combo box, the menu does not close once the user makes\nselections. Because multiple selections are possible, the user needs to click\noutside of the dropdown or on the parent element to close the menu.\nDefault\nFluid\nSelecting all\nThe parent checkbox associated to the parent option makes it possible for the\nuser to select all options from the list. Although the parent checkbox element\nis used only for multiselect dropdowns, it is not mandated to be present in all\nmultiselect dropdowns.\nThe bottom stroke for the parent option has no padding and bleeds to the end\nof the dropdown menu.\nThe background fill for the all button does not change when selected and will\ncontinue to have the same background as the enabled state\nThe parent checkbox has a third indeterminate state and appears when some and\nnot all options have been selected.\nClicking on the indeterminate state clears all options.\nClicking on the unselected checkbox selects all options.\nClicking on the selected checkbox clears all options.\nWe recommend not to use the parent checkbox in scenarios like filters when\nchoosing all and choosing none means the same.\nClearing all\nTo clear all selected options from a list, hover over the filterable tag and\nclick the “x” (or\nclose\nCopy to clipboard\n) icon next to the value. To help with clarity, a\nbrowser tooltip appears when the user hovers over the “x” icon to indicate the\nclick action results. If you want to unselect individual options, you can do so\nby unselecting the checkbox of each option.\nFiltering\nUse filtering to narrow down a long list of options to find the option you want\nto select.\nBy default, the filterable multiselect dropdown displays placeholder text in\nthe field when closed.\nWhen hovering over the field, a text cursor appears.\nDefault\nFluid\nThe menu opens by clicking anywhere in the field and you can start typing to\nfilter the list of options. The options that start to match your entry remain\nin the list while other existing options are temporarily removed.\nAfter typing text in the field, the close (x) icon appears to the right of the\ntext in the field. This clears any text that’s been entered in the field.\nOnce options have been selected from the menu, a tag appears to the left of\nthe text in the field containing the total number of selected options. The\nplaceholder text can change to text that better reflects what is selected.\nSelected options shift to the top of the menu in alphanumeric order.\nLike the default multiselect dropdown, the menu does not close once the user\nmakes selections.\nDefault\nFluid\nCombo box\nUse a combo box when the user needs to select one option, but the list of\noptions may be very long or not predefined. Combo boxes allow the user to either\nselect from a list of suggested options or type in their own custom value. Combo\nboxes are useful when the data populating the list may come from a database.\nThe menu opens by clicking anywhere in the field, allowing users to type and\nsort through the list of options. The best-matching option is highlighted as\nusers type.\nA close (x) icon clears the input, and autocomplete refines options as users\ntype.\nSelecting an option closes the menu and the selected option replaces the\nplaceholder text.\nDefault\nFluid\nEntering a custom value\nIn a combo box, users can type in a custom or unique value that is not included\nin the list of predefined options.\nIf the desired option isn’t available in the list, users can start typing\ntheir custom value directly in the field, filtering out options as they type.\nTo save the new custom value, click outside the field with the mouse or press\nTab\nCopy to clipboard\nor\nEnter\nCopy to clipboard\non the keyboard.\nOnce saved, the placeholder text changes to display the custom typed value.\nModifiers\nInline\nWhen placing a dropdown inline with other content use the inline modifier. If\nadding a visual label to an inline dropdown it should appear inline to the left\nof the dropdown. If there is no visual label present you must supply an\nappropriate accessibility label to the inline dropdown. Note that inline is only\na modifier for dropdown and multiselect components, and it does not include\nfiltering functionality.\nAI presence\nDropdown and its variants have a modification that takes on the AI visual\nstyling when the AI label is present in the input. The AI variant of these\ncomponents function the same as the normal version except with the addition of\nthe AI label which is both a visual indicator and the trigger for the\nexplainability popover.\nFor more information on designing for AI, see the\nCarbon for AI\nguidelines.\nDefault\nFluid\nRevert to AI\nA dropdown can toggle between the AI variant and the non-AI variant depending on\nthe user’s interaction. If the user manually overrides the AI-suggested content\nthen the input will change from the AI variant to the non-AI variant. Once\nedited, the user should still be able to switch back to the initially AI\ngenerated content via a revert to AI button.\nDefault\nFluid\nRelated\nCheckbox\nCheckboxes are used when there are multiple options to select in a list. Users\ncan select zero, one, or any number of options. For further guidance, see\nCarbon’s\ncheckbox\n.\nForm\nA form is a group of related input controls that allows users to provide data or\nconfigure options. For further guidance, see Carbon’s\nform\n.\nRadio button\nRadio buttons are used when there is a group of mutually exclusive choices and\nonly one selection from the group is allowed. For further guidance, see\nCarbon’s\nradio button\n.\nselect\nDropdown versus Select\nDropdown and select components have functionality and style differences.\nThe underlying code of a dropdown component is styled to match the design\nsystem, while the select component’s appearance is determined by the browser\nbeing used.\nUse a dropdown component in forms, to select multiple options at a time and to\nfilter or sort content on a page. The select dropdown does not have filtering\nor multiselect functionality.\nUse a select dropdown component if most of your experience is form based.\nCustom dropdowns can be used in these situations, but the native select works\nmore easily with a native form when submitting data.\nUse a select dropdown component if your experience will be frequently used on\nmobile. The native select dropdown uses the native control for the platform\nwhich makes it easier to use.\nDropdown versus Combo box\nWhile the dropdown and combo box look similar they have different functions.\nWith a dropdown list, the selected option is always visible, and the other\noptions are visible by clicking and opening the list.\nA combo box is a combination of a standard list box or a dropdown list that\nlets users type inside the input field to find an option that matches their\ninputted value.\nReferences\nAngie Li,\nDropdown: Design Guidelines\n(Nielsen Norman Group, 2017)\nFeedback\nHelp us improve this pattern by providing feedback, asking questions, and\nleaving any other comments on\nGitHub\n.\nEdit this page on GitHub\nPrevious\nComponents: Date picker\nNext\nDropdown: Style",
  "content_markdown": "# Dropdown\n\nDropdowns have a list of options that a user can select from. These selections\ncan fill in a form, filter, or sort content.\n\n[Dropdown](https://react.carbondesignsystem.com/?path=/story/components-dropdown--with-ai-label),\n[combo box](https://react.carbondesignsystem.com/?path=/story/components-combobox--with-ai-label),\nand\n[multiselect](https://deploy-preview-16803--v11-carbon-react.netlify.app/?path=/story/components-multiselect--with-ai-label)\nwith AI label are now stable. These additions change the visual appearance of\nthe component and introduce an AI explainability feature when AI is present in\nthe components. See the [AI presence](/components/dropdown/usage/#ai-presence)\nsection for more details.\n\n- [Live demo](#live-demo)\n- [Overview](#overview)\n- [Formatting](#formatting)\n- [Content](#content)\n- [Universal behaviors](#universal-behaviors)\n- [Dropdown](#dropdown)\n- [Multiselect](#multiselect)\n- [Combo box](#combo-box)\n- [Modifiers](#modifiers)\n- [AI presence](#ai-presence)\n- [Related](#related)\n- [References](#references)\n- [Feedback](#feedback)\n\n## Live demo\n\nTheme selector\n\nWhite\n\n---\n\nVariant selector\n\nDropdown\n\n---\n\nThis live demo contains only a preview of functionality and styles available for this component. View the [full demo](https://react.carbondesignsystem.com/?path=/story/components-dropdown--default&globals=theme:white) on Storybook for additional information such as its version, controls, and API documentation.\n\n### Accessibility testing status For every latest release, Carbon runs tests on all components to meet the [accessibility requirements](https://www.ibm.com/able/requirements/requirements/). These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\n\nVariant\n\nDropdown\n\n---\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nPartially tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nPartially tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nNot available](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nNot available](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nNot available](//accessibility/#accessibility-testing-status)\n\n## Overview\n\nThere are three different variants of dropdowns that support various kinds of\nfunctionality—dropdown, multiselect, and combo box.\n\n### When to use\n\nDropdowns can be used in forms on full pages, in modals, or on side panels. The\ndropdown component is used to filter or sort contents on a page. It is a\nstylized version of the select component, and can be styled as needed.\n\n### When not to use\n\n#### Limited options\n\nIt is best practice not to use a dropdown if there are two options to choose\nfrom. In this case, use a [radio button](/components/radio-button/code) group\ninstead.\n\n#### Nesting\n\nDo not nest dropdowns or use them to display overly complex information. Keep\noption selections as straight forward as possible.\n\n#### Form-based or mobile platform\n\nConsider using a [select](/components/select/usage) if most of your experience\nis form-based or frequently used on mobile platforms. The native HTML select\nworks more easily when submitting data and is also easier to use on a mobile\nplatform.\n\n### Variants\n\n| Variant | Purpose |\n| --- | --- |\n| [Dropdown](#dropdown) | Allows the user to select one option from a list. |\n| [Multiselect](#multiselect) | Allows the user to select multiple options from a list and filter. |\n| [Combo box](#combo-box) | Allows the user to either select an option from a large list or type in their own custom value. |\n\n## Formatting\n\n### Anatomy\n\nDropdowns are composed of four distinct sections—assistive text like labels or\nhelper text, a field, a menu, and options contained within the menu. Labels and\nhelper text can guide the user to make an informed decision when making a\nselection.\n\n- Default\n- Fluid\n\n![Default style dropdown anatomy](/static/123682a6bb30ccb970e29e2346b6fc1b/3cbba/dropdown-usage-1.png)\n\n![Fluid style dropdown anatomy](/static/e840398057a9fa1bbf6b85d80c250274/3cbba/dropdown-usage-1-fluid.png)\n\n1. **Label:** Text that informs the user what to expect in the list of dropdown\n   options.\n2. **Helper text:** Assistive text to help the user choose the right selection.\n3. **Field:** Persists when the dropdown is open or closed.\n4. **Menu:** A list of options to choose from, displayed as an open state.\n5. **Option:** A choice for the user, shown with other choices in a menu.\n6. **Parent checkbox:** Used to select all the options from within the menu in\n   multiselect dropdowns.\n\n### Styling\n\nThere are two styles of dropdown inputs: default and fluid. They share the same\nfunctionality but look visually different, influencing where to use them.\n\n| Style | Appearance | Use case |\n| --- | --- | --- |\n| Default | A traditional style where the label is positioned outside and above the input field. | Use when white space is needed between input components or in productive moments where space is at a premium, and smaller components are needed. |\n| Fluid | An alternative style where the label is placed inside of the input field and is stacked inline with the user input text. | Use in expressive moments, fluid forms, contained spaces, or attached to complex components, like a toolbar. |\n\n![Default and fluid dropdown styles](/static/a803f30089edaddca1e3b7cff74f70aa/3cbba/dropdown-usage-formatting-1.png)\n\nA default style input is shown on the left and fluid style is on the right.\n\n### Sizing\n\nThere are three default dropdown height sizes: small, medium, and large.\nSupporting three different dropdown sizes gives you more flexibility when\nstructuring layouts. However, use a consistent size for all form components on\nthe same page. For example, if you are using a medium size dropdown also use the\nsame size text inputs, buttons, and so on. When in doubt, use the default medium\nsize height.\n\n| Size | Height (px/rem) | Use case |\n| --- | --- | --- |\n| Small (sm) | 32 / 2 | Use when space is constricted or when placing a dropdown in a form that is long and complex. |\n| Medium (md) | 40 / 2.5 | This is the default size and the most commonly used size. |\n| Large (lg) | 48 / 3 | Choose this size when there is a lot of space to work with. This size is typically used in simple forms or when a dropdown is placed by itself on a page, for example as a filter. |\n\n![Dropdown sizes in the default style](/static/45f89d6fdb519f95d88f7c50e5a5d1c9/3cbba/dropdown-usage-2.png)\n\nWhen the menu is open, each option in the menu should be the same height as the\nfield.\n\n![Dropdown field and option size relationship](/static/073b3bc83a91c6a2858a133f801a8364/3cbba/dropdown-usage-3.png)\n\n#### Fluid inputs heights\n\nIn the fluid dropdown, there is only one input height but there are two menu\nitem sizes–default and condensed.\n\n| Fluid size | Height (px/rem) | Use case |\n| --- | --- | --- |\n| Default | 64 / 4 | Use when there are fewer menu options in expressive moments. |\n| Condensed | 40 / 2.5 | Use when there are many menu options so more can be viewed at once without scrolling. |\n\n![Dropdown sizes in the fluid style](/static/0766175b330c7e2b8db1c83e8b164dea/3cbba/dropdown-usage-3-fluid.png)\n\n#### Width\n\nThere is no minimum or maximum width for a dropdown. The width can be customized\nappropriately for its context.\n\n### Placement\n\nField containers should vertically align with other form components on a page.\nWhether it aligns flush to grid columns or hangs in the gutters depends on the\nstyle of dropdown you are using.\n\n![Do align default style input dropdowns to the grid so the input label aligns with other type on the page.](/static/d8383d76776f04615ac88b1e30170c67/a5df1/dropdown-usage-4-do.png)\n\nDo align default style dropdown containers flush to the grid so the input label aligns with other type on the page.\n\n![Don't hang default style dropdowns into the grid gutters.](/static/2bfe2b1278549b3449c03615fa9e7728/a5df1/dropdown-usage-4-dont.png)\n\nDon't hang default style dropdowns into the grid gutters.\n\n![Do place fluid components flush to on another with no spacing between them.](/static/4629729016d9a59389d9eb8c34d7186d/a5df1/dropdown-usage-4-do-fluid.png)\n\nDo place fluid components flush to on another with no spacing between them.\n\n![Do not use fluid components with vertical or horizontal spacing between them.](/static/c20d1d06a78063e12a4a1a944c59e443/a5df1/dropdown-usage-4-dont-fluid.png)\n\nDo not use fluid components with vertical or horizontal spacing between them.\n\n## Content\n\n### Main elements\n\n#### Label text\n\n- Label text informs users what to expect in the list of dropdown options.\n- Keep the label text short and concise by limiting it to a single line of text.\n- Do not remove label text in favor of using placeholder text in the dropdown\n  field. Labels are always strongly encouraged to be included when possible.\n\n#### Helper text\n\n- Helper text is pertinent information that assists the user in choosing the\n  right selection from the dropdown menu.\n- Helper text is always available when the dropdown field is focused and appears\n  underneath the label.\n\n![Dropdown assistive labels, helper text or none.](/static/e0c4ef7014c5dec8fec0ceeff700f30e/3cbba/dropdown-usage-5.png)\n\n#### Field placeholder text\n\n- Placeholder text is optional to display in the dropdown field if no option has\n  been selected yet from the list. Do not put important information in\n  placeholder text because the text disappears once an option is selected from\n  the list. Reserve important information for dropdown label text or helper\n  text, which always remains visible.\n- Use clear and concise placeholder text in the dropdown field to indicate how\n  to interact with the dropdown. For example, “Choose an option” is commonly\n  used as placeholder text in dropdowns.\n\n#### Option text\n\n- Dropdown option text should be brief, accurate, and not descriptive.\n- Never use decorative images or icons within a dropdown.\n- We recommend presenting the options in alphabetical order.\n\n#### Parent checkbox text\n\n- Since the parent checkbox text is one among the options, do not describe it as\n  an action.\n- Use the word “All” to describe the parent checkbox.\n- Alternatively, add a secondary descriptive word, for example, “All roles,” to\n  describe the options in the menu.\n\n![Parent checkbox content guidelines.](/static/cce8db5133494807be17e2b8c5df4e99/3cbba/dropdown-usage-16.png)\n\n### Optional versus required fields\n\nDropdowns can be labeled as either optional or required depending on several\nfactors. For more information, see the form\n[Usage](/components/form/usage/#optional-versus-required-fields) tab guidance.\n\n### Overflow content\n\nAvoid multiple lines of text in a dropdown. If the text is too long for a single\nline, add an ellipsis (…) for overflow, and use a tooltip to display the full\ntext—preferably a Carbon tooltip for keyboard accessibility where possible.\n\n![Dropdown overflow text truncation.](/static/1a1d8c0187cc1cde33ac4fd3ab0a079c/3cbba/dropdown-usage-6.png)\n\n### Further guidance\n\nFor further content guidance, see Carbon’s\n[content guidelines](/guidelines/content/overview).\n\n## Universal behaviors\n\nThe behaviors listed in this section are universal across all of the variants.\nFor behaviors that are unique to each variant, see the sections below.\n\n### Direction\n\nA dropdown can open up or down depending on its position on the screen. For\nexample, if the dropdown appears at the bottom and close to the edge of the\ninterface, the menu expands upward to avoid being cropped. By default, our\ndropdowns open downward.\n\n### Elevation\n\nThe dropdown menu has a style called\n\n```\nbox-shadow\n```\n\nCopy to clipboard\n\nthat is placed behind the menu\nwhen open to give the menu a perceived higher elevation than the content that\nmay fall behind it. Box-shadow is also used in other components that have\noverlaid menus, such as the overflow menu and date picker calendar. The SCSS for\nbox-shadow is\n\n```\n0 2px 6px 0 rgba(0,0,0,.2)\n```\n\nCopy to clipboard\n\n.\n\n### Scrolling behavior\n\nScroll bars may not always be enabled so we recommend showing 50% of the last\noption’s container height to indicate there is more to see within the menu. We\nrecommend starting a scroll at the sixth option in the menu list, but this may\nvary based on your specific use case.\n\n![Dropdown scrolling menu option cutoff.](/static/732063beae2b79a103788fb913a955bc/3cbba/dropdown-usage-7a.png)\n\n### States\n\nDropdowns, combo boxes, and multiselects have a series of states for both their\nfields and menus: **enabled**, **hover**, **focus**, **error**, **warning**,\n**disabled**, **skeleton**, and **read-only**. For more information on states,\nvisit the\n[interactive states](https://carbondesignsystem.com/components/dropdown/style#interactive-states)\nguidance on the style tab.\n\n### Vertical dividers in input fields\n\nVertical dividers act as a visual separator between interactive elements in an\ninput field. These vertical dividers are only present between two interactive\nelements, they should not be introduced between non-interactive elements like\nerror states, other non-interactive icons, or buttons.\n\nA divider will also be present to the left of the leftmost interactive item set,\neven if it’s next to a non-interactive item.\n\n![Do introduce a vertical divider between two interactive elements in an input field.](/static/1ab1af7b56549647dbc6bb6f4fbb277e/a5df1/usage-combobox-vertical-divider-do-1.png)\n\nDo introduce a vertical divider between two interactive elements in an input field.\n\n![Do not introduce a vertical divider between interactive and non-interactive elements in an input field.](/static/3a0bfb4cd388d9a549ee481430e058f2/a5df1/usage-combobox-vertical-divider-dont.png)\n\nDo not introduce a vertical divider between interactive and non-interactive elements in an input field.\n\n![Do introduce a vertical divider to the left of the leftmost interactive set in an input field.](/static/d79a096865765441fb05248fe205509f/a5df1/usage-combobox-vertical-divider-do-3.png)\n\nDo introduce a vertical divider to the left of the leftmost interactive set in an input field.\n\n![Do not use vertical dividers inconsistently in the same icon set, where some icons have vertical dividers and some do not.](/static/4eef93f12b4aba1ad67ed89ccaa6871b/a5df1/usage-combobox-vertical-divider-dont-4.png)\n\nDo not use vertical dividers inconsistently in the same icon set, where some icons have vertical dividers and some do not.\n\n![Do introduce a vertical divider to the left of the leftmost interactive set in an input field.](/static/c613f987c4b8ef6b4adb36e364ce31c4/a5df1/usage-ai-combobox-vertical-divider-do.png)\n\nDo introduce a vertical divider to the left of the leftmost interactive set in an input field.\n\n![Do not use vertical dividers inconsistently in the same icon set, where some icons have vertical dividers and some do not.](/static/77d9bd73531503d1a09a200da345b38d/a5df1/usage-ai-combobox-vertical-divider-dont.png)\n\nDo not use vertical dividers inconsistently in the same icon set, where some icons have vertical dividers and some do not.\n\n### Interactions\n\n#### Mouse\n\nUsers trigger a dropdown menu to open by clicking the chevron icon or clicking\nanywhere within the field. Users can close the menu by clicking the chevron icon\nor clicking outside of the menu.\n\n- Default\n- Fluid\n\n![Default dropdown closed and open state click targets.](/static/0924a6f1935442948b465eb7abfd3945/3cbba/dropdown-usage-8a.png)\n\n![Fluid dropdown closed and open state click targets.](/static/1c35f6ac4a2d4d976a6c5d6274d727e0/3cbba/dropdown-usage-8a-fluid.png)\n\n- To select an option the user can click anywhere inside an option container.\n\n- Default\n- Fluid\n\n![Default dropdown menu option click target.](/static/881760eb47d8a3ce19cc370889db5d7a/3cbba/dropdown-usage-8b.png)\n\n![Fluid dropdown menu option click target.](/static/e1ac8f797012a3c8bb1c9128f0463f66/3cbba/dropdown-usage-8b-fluid.png)\n\n- To clear all selected options from a list in a\n\n  ```\n  multiselect\n  ```\n\n  Copy to clipboard\n\n  dropdown, click\n  the “x” icon next to the value inside the tag.\n\n![Multiselect dropdown tag clear click target.](/static/f02ec24af8710e888527af97276d3114/3cbba/dropdown-usage-8c.png)\n\n- To clear a selected value in a\n\n  ```\n  combo box\n  ```\n\n  Copy to clipboard\n\n  or a filterable multiselect\n  dropdown, click the “x” icon to the right of the field input text.\n\n![Combo box and filterable dropdown clear click target.](/static/34f0c75f8b4be9bf8ae09b7acea8b2eb/3cbba/dropdown-usage-8d.png)\n\n#### Keyboard\n\nA dropdown component and its variants multiselect and combo box are reached by\n\n```\nTab\n```\n\nCopy to clipboard\n\n, with navigation of the options by\n\n```\nUp\n```\n\nCopy to clipboard\n\nand\n\n```\nDown\n```\n\nCopy to clipboard\n\narrow keys. However,\nthe keys for opening the component and selecting its options are different for\neach variant. For more information on keyboard interactions, see the\n[accessibility tab](https://carbondesignsystem.com/components/dropdown/accessibility/?_ga=2.84465055.789214944.1712051588-758524008.1712051588&_gl=1*16jmo7x*_ga*NzU4NTI0MDA4LjE3MTIwNTE1ODg.*_ga_FYECCCS21D*MTcxMjEzODc0OC4zLjEuMTcxMjE0MTQ5OC4wLjAuMA..#what-carbon-provides).\n\n## Dropdown\n\nUse a dropdown when the user needs to select one option from a list of\npredefined options. Dropdowns are the optimal default option to provide\nalternative choices. They are also a good choice when screen space is limited.\n\n- Default\n- Fluid\n\n![Default dropdown closed and open state.](/static/1680a72891187170c6887a3178faf1f9/3cbba/dropdown-usage-9a.png)\n\n![Fluid dropdown closed and open state.](/static/04ad777e4a34298344639033511fbd34/3cbba/dropdown-usage-9a-fluid.png)\n\n- Selecting an option from the menu closes it and the selected option text\n  replaces the placeholder text in the field and also remains as an option in\n  place if the menu is open.\n\n![Dropdown selected state.](/static/48853e5a7817f0f40b3276d309f5c737/3cbba/dropdown-usage-9b.png)\n\n## Multiselect\n\nUse a multiselect when the user needs to select multiple options from a list of\npredefined options. Multiselects are a good option when the user needs to filter\nor sort content on a page based on multiple criteria. A checkbox icon is\nincluded for each option in the list to enable multiselection.\n\n#### Making a selection\n\n- By default, the dropdown displays any placeholder text in the field when\n  closed. Activating a closed field opens a menu of options.\n- Each option contains a checkbox input to the left of the option text.\n- The menu stays open while options are being selected. The menu closes by\n  clicking the field or outside of the dropdown, or by pressing\n\n  ```\n  Esc\n  ```\n\n  Copy to clipboard\n\n  or tabbing\n  away from the component.\n\n- Default\n- Fluid\n\n![Default multiselect dropdown closed and open states.](/static/aa91bf952ed1c3a0726768d292f7b88a/3cbba/dropdown-usage-10a.png)\n\n![Fluid multiselect dropdown closed and open states.](/static/c084c4f7998f2a0930714c5dcbdb61e3/3cbba/dropdown-usage-10a-fluid.png)\n\n#### Feedback\n\n- Once options have been selected from the menu, a tag appears to the left of\n  the text in the field containing the total number of selected options, and\n  also provides a functionality to clear all the selected options.\n- The placeholder text can change to text that better reflects what is selected.\n- Selected options shift to the top of the menu in an alphanumeric order when\n  revisiting the menu after closing it.\n- Unlike dropdown and combo box, the menu does not close once the user makes\n  selections. Because multiple selections are possible, the user needs to click\n  outside of the dropdown or on the parent element to close the menu.\n\n- Default\n- Fluid\n\n![Default multiselect dropdown selected state.](/static/8ad8139a290d6d19d7b5d402edb974de/3cbba/dropdown-usage-10b.png)\n\n![Fluid multiselect dropdown selected state.](/static/7f4c56fd86968a19b1206f2227d9ad17/3cbba/dropdown-usage-10b-fluid.png)\n\n#### Selecting all\n\nThe parent checkbox associated to the parent option makes it possible for the\nuser to select all options from the list. Although the parent checkbox element\nis used only for multiselect dropdowns, it is not mandated to be present in all\nmultiselect dropdowns.\n\n- The bottom stroke for the parent option has no padding and bleeds to the end\n  of the dropdown menu.\n- The background fill for the all button does not change when selected and will\n  continue to have the same background as the enabled state\n\nThe parent checkbox has a third indeterminate state and appears when some and\nnot all options have been selected.\n\n- Clicking on the indeterminate state clears all options.\n- Clicking on the unselected checkbox selects all options.\n- Clicking on the selected checkbox clears all options.\n\nWe recommend not to use the parent checkbox in scenarios like filters when\nchoosing all and choosing none means the same.\n\n![Multiselect selecting all and partially.](/static/95ec0c9cd071db39a081e781f29dc159/3cbba/dropdown-usage-17.png)\n\n#### Clearing all\n\nTo clear all selected options from a list, hover over the filterable tag and\nclick the “x” (or\n\n```\nclose\n```\n\nCopy to clipboard\n\n) icon next to the value. To help with clarity, a\nbrowser tooltip appears when the user hovers over the “x” icon to indicate the\nclick action results. If you want to unselect individual options, you can do so\nby unselecting the checkbox of each option.\n\n![Multiselect dropdown clear tag interaction.](/static/342f5d116ae1241916afef2e14c64f9f/3cbba/dropdown-usage-10c.png)\n\n#### Filtering\n\nUse filtering to narrow down a long list of options to find the option you want\nto select.\n\n- By default, the filterable multiselect dropdown displays placeholder text in\n  the field when closed.\n- When hovering over the field, a text cursor appears.\n\n- Default\n- Fluid\n\n![Default filterable dropdown closed and open state.](/static/d1bc4e86550d4ebdc986bc191c96d293/3cbba/dropdown-usage-10d.png)\n\n![Fluid filterable dropdown closed and open state.](/static/f8425bc79fc5211ebc07d2dde7d301d2/3cbba/dropdown-usage-10d-fluid.png)\n\n- The menu opens by clicking anywhere in the field and you can start typing to\n  filter the list of options. The options that start to match your entry remain\n  in the list while other existing options are temporarily removed.\n- After typing text in the field, the close (x) icon appears to the right of the\n  text in the field. This clears any text that’s been entered in the field.\n\n![Filterable dropdown typing and filtering open menu.](/static/d8ea6661d9bfd345bd5a4bdbbcf12c05/3cbba/dropdown-usage-10e.png)\n\n- Once options have been selected from the menu, a tag appears to the left of\n  the text in the field containing the total number of selected options. The\n  placeholder text can change to text that better reflects what is selected.\n- Selected options shift to the top of the menu in alphanumeric order.\n- Like the default multiselect dropdown, the menu does not close once the user\n  makes selections.\n\n- Default\n- Fluid\n\n![Default filterable dropdown selected state.](/static/b36fd587f0b9b6a3c4c2301e522a1a81/3cbba/dropdown-usage-10f.png)\n\n![Fluid filterable dropdown selected state.](/static/824381efeb319b556ccd4c77b2d5b5a0/3cbba/dropdown-usage-10f-fluid.png)\n\n## Combo box\n\nUse a combo box when the user needs to select one option, but the list of\noptions may be very long or not predefined. Combo boxes allow the user to either\nselect from a list of suggested options or type in their own custom value. Combo\nboxes are useful when the data populating the list may come from a database.\n\n![Combo box closed enabled and hover states.](/static/2438e6b17f4e70a46eaebb6062b79d52/3cbba/dropdown-usage-11a.png)\n\n- The menu opens by clicking anywhere in the field, allowing users to type and\n  sort through the list of options. The best-matching option is highlighted as\n  users type.\n- A close (x) icon clears the input, and autocomplete refines options as users\n  type.\n\n![Combo box typing and option hover jumping to matched entry in the menu.](/static/de7aee281e6a13b2268c0eb90595f11c/3cbba/dropdown-usage-11b.png)\n\n- Selecting an option closes the menu and the selected option replaces the\n  placeholder text.\n\n- Default\n- Fluid\n\n![Default combo box selected state.](/static/e830950fae5a35f09e559a014a28aba9/3cbba/dropdown-usage-11c.png)\n\n![Fluid combo box selected state.](/static/bf74df20291ebcb2bdafbe4b9c3aa11e/3cbba/dropdown-usage-11c-fluid.png)\n\n#### Entering a custom value\n\nIn a combo box, users can type in a custom or unique value that is not included\nin the list of predefined options.\n\n- If the desired option isn’t available in the list, users can start typing\n  their custom value directly in the field, filtering out options as they type.\n- To save the new custom value, click outside the field with the mouse or press\n\n  ```\n  Tab\n  ```\n\n  Copy to clipboard\n\n  or\n\n  ```\n  Enter\n  ```\n\n  Copy to clipboard\n\n  on the keyboard.\n- Once saved, the placeholder text changes to display the custom typed value.\n\n![Entering a custom value in a default combo box.](/static/6c959f248a6b67588c30f710e15fa464/3cbba/dropdown-usage-11d.png)\n\n## Modifiers\n\n#### Inline\n\nWhen placing a dropdown inline with other content use the inline modifier. If\nadding a visual label to an inline dropdown it should appear inline to the left\nof the dropdown. If there is no visual label present you must supply an\nappropriate accessibility label to the inline dropdown. Note that inline is only\na modifier for dropdown and multiselect components, and it does not include\nfiltering functionality.\n\n![Inline dropdown with label in a dashboard.](/static/894906ce3afb193b797717ac72b810b6/3cbba/dropdown-usage-12.png)\n\n## AI presence\n\nDropdown and its variants have a modification that takes on the AI visual\nstyling when the AI label is present in the input. The AI variant of these\ncomponents function the same as the normal version except with the addition of\nthe AI label which is both a visual indicator and the trigger for the\nexplainability popover.\n\nFor more information on designing for AI, see the\n[Carbon for AI](/guidelines/carbon-for-ai/) guidelines.\n\n- Default\n- Fluid\n\n![Default dropdown AI presence example](/static/fe8289f50d7cf06d616675b8d6cf5895/3cbba/dropdown-ai-presence-default.png)\n\n![Fluid dropdown AI presence example](/static/8b7355726247ed17e00f5409e7f7df25/3cbba/dropdown-ai-presence-fluid.png)\n\n### Revert to AI\n\nA dropdown can toggle between the AI variant and the non-AI variant depending on\nthe user’s interaction. If the user manually overrides the AI-suggested content\nthen the input will change from the AI variant to the non-AI variant. Once\nedited, the user should still be able to switch back to the initially AI\ngenerated content via a revert to AI button.\n\n- Default\n- Fluid\n\n![Default dropdown AI revert example](/static/01a0096d422a154e4204c9c55d5d2357/3cbba/dropdown-ai-revert-default.png)\n\n![Fluid dropdown AI revert example](/static/f59b6c974398703d800f8e3061f78580/3cbba/dropdown-ai-revert-fluid.png)\n\n## Related\n\n#### Checkbox\n\nCheckboxes are used when there are multiple options to select in a list. Users\ncan select zero, one, or any number of options. For further guidance, see\nCarbon’s [checkbox](/components/checkbox/code).\n\n#### Form\n\nA form is a group of related input controls that allows users to provide data or\nconfigure options. For further guidance, see Carbon’s\n[form](/components/form/code).\n\n#### Radio button\n\nRadio buttons are used when there is a group of mutually exclusive choices and\nonly one selection from the group is allowed. For further guidance, see\nCarbon’s[radio button](/components/radio-button/code).\n\n[select](https://www.carbondesignsystem.com/components/select/code)\n\n#### Dropdown versus Select\n\nDropdown and select components have functionality and style differences.\n\n- The underlying code of a dropdown component is styled to match the design\n  system, while the select component’s appearance is determined by the browser\n  being used.\n- Use a dropdown component in forms, to select multiple options at a time and to\n  filter or sort content on a page. The select dropdown does not have filtering\n  or multiselect functionality.\n- Use a select dropdown component if most of your experience is form based.\n  Custom dropdowns can be used in these situations, but the native select works\n  more easily with a native form when submitting data.\n- Use a select dropdown component if your experience will be frequently used on\n  mobile. The native select dropdown uses the native control for the platform\n  which makes it easier to use.\n\n#### Dropdown versus Combo box\n\nWhile the dropdown and combo box look similar they have different functions.\n\n- With a dropdown list, the selected option is always visible, and the other\n  options are visible by clicking and opening the list.\n- A combo box is a combination of a standard list box or a dropdown list that\n  lets users type inside the input field to find an option that matches their\n  inputted value.\n\n## References\n\nAngie Li,\n[Dropdown: Design Guidelines](https://www.nngroup.com/articles/drop-down-menus/)\n(Nielsen Norman Group, 2017)\n\n## Feedback\n\nHelp us improve this pattern by providing feedback, asking questions, and\nleaving any other comments on\n[GitHub](https://github.com/carbon-design-system/carbon-website/issues/new?assignees=&labels=feedback&template=feedback.md).\n\n[Edit this page on GitHub](https://github.com/carbon-design-system/carbon-website/edit/main/src/pages/components/dropdown/usage.mdx)\n\n[Previous\n\nComponents: Date picker](/components/date-picker/usage/)\n\n[Next\n\nDropdown: Style](/components/dropdown/style/)",
  "tags": [
    "ibm",
    "carbon",
    "design-system",
    "enterprise"
  ],
  "extracted_at": "2026-02-03T14:19:10.393355+00:00",
  "content_length": 20442,
  "content_hash": "a5b2a7a531fa996d"
}