{
  "id": "carbon-design__components_form_usage_",
  "source_id": "carbon-design",
  "source_name": "IBM Carbon Design System",
  "category": "design_systems",
  "url": "https://carbondesignsystem.com/components/form/usage/",
  "title": "Form",
  "content": "Form\nA form is a group of related input controls that allows users to provide data or\nconfigure options.\nForm\nwith AI label\nis now stable. This addition changes the visual appearance of the component and\nintroduces an AI explainability feature when AI is present in the component. See\nthe\nAI presence\nsection for more details.\nLive demo\nOverview\nFormatting\nContent\nBehaviors\nAdditional guidance\nAI presence\nRelated\nFeedback\nLive demo\nTheme selector\nWhite\nVariant selector\nDefault\nThis live demo contains only a preview of functionality and styles available for this component. View the\nfull demo\non Storybook for additional information such as its version, controls, and API documentation.\nAccessibility testing status\nFor every latest release, Carbon runs tests on all components to meet the\naccessibility requirements\n. These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\nVariant\nForm\nDefault state\nTested\nAdvanced states\nNot tested\nScreen reader\nManually tested\nKeyboard navigation\nNot available\nDefault state\nTested\nAdvanced states\nNot tested\nScreen reader\nManually tested\nKeyboard navigation\nNot available\nDefault state\nTested\nAdvanced states\nTested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nDefault state\nTested\nAdvanced states\nNot tested\nScreen reader\nNot available\nKeyboard navigation\nNot available\nOverview\nThe form component is configurable to fit various use cases and layouts. It is\npurposely simple out of the box, and users are responsible for configuring it to\nsuit their needs. For in-depth design guidance on the different ways to\nconfigure and extend a form, see the\nform pattern\n.\nFormatting\nAnatomy\nDefault\nFluid\nHeader\n(optional): The addition of a title and description as a header\nthat can provide the user with additional context or instructions.\nForm body\n: Area where users provide information. Information can be\nentered through various input fields, including text fields, checkboxes, and\nmany other types. Input components contain labels and helper text that the\nuser submits correct data.\nFooter\n: Provides actions that allow users to submit or cancel the data\nentered in the form.\nStyling\nForms can use two styles of inputs: default and fluid. They share the same\nfunctionality but look visually different and have different alignment rules.\nStyle\nAppearance\nAlignment\nUse case\nDefault\nUses a traditional style of input where the label is positioned outside and above the input field. Default forms can use any of the three default input field sizes: small (32px), medium (40px), or large (48px).\nForm inputs are equally stacked with 32px/2rem padding separating each component.\nUse when white space is needed between input components, if smaller components are required, or in productive moments like in complex forms.\nFluid\nAn alternative input style where the label is placed inside the input field and aligned with the user input text. Fluid inputs only have one size at the height of 64px.\nForm inputs are stacked flush to one another with 0px of padding between them.\nUse in expressive moments or where larger form components can aid in emphasizing the featured form.\nAlignment\nIn a form, input components should vertically align with all other form\ncomponents. Whether a form aligns flush to grid columns or hangs in the gutters\ndepends on the style of form input you are using as well as the gutter mode.\nDefault forms typically use a wide gutter mode and align flush to the grid\ncolumns prioritizing vertical label alignment. Fluid forms use the condensed\ngrid and can hang into the gutter without causing label misalignment. Fluid\nforms are architectural and remain cohesive by never allowing vertical or\nhorizontal space between inputs.\nDo align default form inputs and labels to the grid columns using the wide gutter mode.\nDon’t hang default inputs into the grid gutters. Doing so will cause labels to misalign with other form elements.\nDo stack fluid components flush to one another with no spacing between them using the condensed gutter mode.\nDon’t add vertical or horizontal space between fluid components. Fluid forms are architectural and should remain a cohesive unit.\nTwo column forms\nIf a form has more than one column, then the columns should be proportional and\nalign to grid columns when possible. The space between form columns is\ndetermined by the gutter mode you are using; default forms use the wide gutter\nmode with 32px padding between form columns, versus fluid forms use the\ncondensed gutter mode with 1px padding. The narrow gutter mode (16px) is\ntypically not used in forms as it often places the text in the gutter.\nWhen using two columns, the row should respond as a group. For example, if the\nleft column form item becomes invalid and pushes form content down to\naccommodate space for an error message, then the accompanying right form item\nwill also grow to account for the needed space.\nVertical spacing\nThe typical recommended vertical spacing between components is 32px. For all\nguidance and recommendation for spacing for forms, see the\nform pattern\n.\nContent\nLabels\nEffective labeling helps users understand what information to enter into a text\ninput. Text fields should always have a label. There are rare instances where\nthe context of an input negates the need for a visible label, but we advise you\nto consult an accessibility expert before proceeding with a label-less design.\nBest practices for labels\nUse sentence-style capitalization for all labels except for product names and\nproper nouns.\nKeep the label short and concise.\nDo not use colons after label names.\nDefault values\nWhere possible, add programmatic assistance. Detect and pre-fill inputs to\nreduce errors and save time. When the software can’t determine the value that\nbelongs in an input, use type-ahead to make suggestions. Use sentence-case for\ndefault values, detected values, and auto-completion text.\nHelper text\nOptional helper text is pertinent information that assists the user in correctly\ncompleting a field. Helper text should always be available when the input is\nfocused. It is often used to explain the correct data format. Helper text\nappears as persistent text under a default input (helper text is not available\nin fluid input, which uses tooltips instead). Helper text is the preferred\nmethod of assisting users because it is always visible for the user to reference\nwithout additional effort.\nBest practices for helper text\nUse sentence-style capitalization, and in most cases, write the text as full\nsentences with punctuation.\nWhen used, helper text that appears persistently underneath the field is\nreplaced by an error or warning message if a state change occurs.\nTooltip help\nTooltips can be added inline with a form label if additional non-pertinent\ninformation is needed to assist the user in correctly completing a field, such\nas context setting. Tooltip content may include more in-depth information about\nthe field or the options the user is choosing from. Links to additional\ninformation or references may also be included if needed. In certain situations\nwhere complex instructions or additional context would be appropriate, tooltips\ncan be used in addition to the helper text. However, it is recommended that all\npertinent assistive information to form completion—such as format content—be\npresented simply and directly as helper text under the field and not be in a\ntooltip.\nTooltips in fluid components\nFluid inputs are an exception to the no critical information in tooltips rule.\nDue to their architectural nature, fluid inputs do not provide the allotted\nspace under the field needed for helper text. All assistive text whether\npertinent or additional, is provided through a tooltip when using fluid inputs.\nPlaceholder text\nOptional placeholder text is text that appears inside an input field at a lower\ncontrast than the user input text. It provides hints or examples of what to\nenter. Placeholder text disappears after the user begins entering data into the\ninput. As such, it should not be used as a replacement for a persistent label\nnor should it contain crucial information. Sometimes providing an example of the\nkind of thing the user might enter is useful. Using certain examples as\nplaceholder text is allowed but it still should not contain essential\ninformation.\nBest practices for placeholder text\nUse sentence-style capitalization, and in most cases, write the text as a\ndirect statement without punctuation.\nPlaceholder text is not required and by default not shown in text input\nfields.\nPlaceholder text can be harmful to user interactions and should only be added\nwhen necessary.\nFurther guidance\nFor further content guidance, see Carbon’s\ncontent guidelines\n.\nBehaviors\nOptional versus required fields\nForms items can be labeled as either optional or required depending on several\nfactors. A common distinction in IBM products for using required or optional is\nthe forms complexity.\nSimple forms\n- generally shorter and/or user- or consumer-oriented; such\nas sign-up and contact forms and checkout screens. Most of the fields will\ntend to be required.\nComplex forms\n- generally longer and product-oriented; contain properties\nand settings that are used to configure Enterprise software.  Although they\nwill usually contain at least one required field, the majority of the fields\nwill tend to be optional.\nNote if the majority of the fields are\nrequired\nor\noptional\n, as the\noverall number of form fields for your entire product should inform your\ntreatment. The pattern used should be consistent throughout your product, or at\nminimum, consistent between all of the same types of form within your product.\nIf the majority of the fields are required, mark\nonly\nthe optional field\nlabels with\n(optional)\n.\nIf the majority of the fields are optional, mark\nonly\nthe required field\nlabels with\n(required)\n.\nOptional\nRequired\nForm controls\nCarbon provides a variety of data input components that enable a user to enter\nor select data. The components are divided into three different interaction\ntypes.\nType\nOverview\nFree form inputs\nFree-form text inputs are the most commonly used components in forms. They allow a user to enter any configuration of letters or numbers. Common free-form inputs include: text input and text area.\nSelection controls\nSelection controls offer users a selection from pre-determined options. Common selection controls include: checkboxes, radio buttons, file uploaders, toggles, and select lists (combo box and multiselect).\nBound entry controls\nBound entry controls allow users to input numeric data, like dates and times and may restrict user input to a certain range. Common bound entry controls include: number input, date picker, and slider components.\nStates\nThe following are common states that can be applied to components when used in a\nform.\nState\nWhen to use\nEnabled\nWhen a text input is live but a user is not directly interacting with it. This is commonly referred to as the default or normal state of the component. An enabled text input field can contain no content, placeholder text, or user generate content.\nActive\nWhen a user is actively typing content into the field.\nFocus\nWhen a user\ntabs\nCopy to clipboard\nto or clicks on the text input, it becomes focused, indicating the user has successfully navigated to the component.\nError\nWhen the user input is invalid or a required text input has not been filled in. It can also be triggered due to a system error. This state requires a user response before data can be submitted or saved.\nWarning\nWhen you need to call the user’s attention to an exception condition. The condition might not be an error but can cause problems if not resolved.\nDisabled\nWhen the user is not allowed to interact with the text input due to either permissions, dependencies, or pre-requisites. The disabled state completely removes the interactive function from a component. The styling is not subject to WCAG contrast compliance.\nSkeleton\nUse on an initial page load to indicate that the text input has not yet fully loaded.\nRead-only\nComing soon!\nDefault\nFluid\nAI\nAdditional guidance\nThe form pattern provides additional and elaborative guidance to the information\nfound with the form component. Below is a list of key sections available in the\npattern.\nTopic\nOverview\nButtons in forms\nProvides guidance on button alignment, emphasis, placement, and naming in relation to a form.\nErrors and validation\nEffective and immediate error messaging can help the user to understand the problem and how to fix it.\nForm layout\nAdditional guidance around layout, spacing, and columns in a form.\nDesigning for longer forms\nTechniques to help make longer forms less overwhelming, including guidance for accordion and multistep forms.\nForm variants\nForms may be presented as dedicated pages, side panels, or dialogs depending on the use case and the situation.\nAI presence\nForm has a modification that takes on the AI visual styling when AI is present\nin the form. The AI variants of a form function the same as the normal variants\nexcept for the addition of the AI label, which is both a visual indicator and\nthe trigger for the explainability popover.\nThe AI presence in form can appear in two ways: broadly, over the whole form, or\nfocused, just in certain parts of the form. When the entire form is styled for\nAI, it indicates to the user that AI is present in all aspects of the form. If\nonly a limited amount of the form content is generated by AI, then only those\ncomponents should receive the AI presence styling, not the entire form.\nFor more information on designing for AI, see the\nCarbon for AI\nguidelines.\nExample of form with full AI presence on the left and component based AI\npresence on the right.\nRelated\nComponents\nButton\nCheckbox\nCombo box\nMultiselect\nPassword input\nRadio button\nText area\nText input\nToggle\nPatterns\nDialogs\nNotifications\nFeedback\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\nGitHub\n.\nEdit this page on GitHub\nPrevious\nComponents: File uploader\nNext\nForm: Style",
  "content_markdown": "# Form\n\nA form is a group of related input controls that allows users to provide data or\nconfigure options.\n\nForm\n[with AI label](https://react.carbondesignsystem.com/?path=/story/components-form--with-ai-label)\nis now stable. This addition changes the visual appearance of the component and\nintroduces an AI explainability feature when AI is present in the component. See\nthe [AI presence](/components/form/usage/#ai-presence) section for more details.\n\n- [Live demo](#live-demo)\n- [Overview](#overview)\n- [Formatting](#formatting)\n- [Content](#content)\n- [Behaviors](#behaviors)\n- [Additional guidance](#additional-guidance)\n- [AI presence](#ai-presence)\n- [Related](#related)\n- [Feedback](#feedback)\n\n## Live demo\n\nTheme selector\n\nWhite\n\n---\n\nVariant selector\n\nDefault\n\n---\n\nThis live demo contains only a preview of functionality and styles available for this component. View the [full demo](https://react.carbondesignsystem.com/?path=/story/components-form--default&globals=theme:white) on Storybook for additional information such as its version, controls, and API documentation.\n\n### Accessibility testing status For every latest release, Carbon runs tests on all components to meet the [accessibility requirements](https://www.ibm.com/able/requirements/requirements/). These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\n\nVariant\n\nForm\n\n---\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nNot available](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nNot available](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nNot available](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nNot available](//accessibility/#accessibility-testing-status)\n\n## Overview\n\nThe form component is configurable to fit various use cases and layouts. It is\npurposely simple out of the box, and users are responsible for configuring it to\nsuit their needs. For in-depth design guidance on the different ways to\nconfigure and extend a form, see the\n[form pattern](/patterns/forms-pattern/#spacing).\n\n## Formatting\n\n### Anatomy\n\n- Default\n- Fluid\n\n![Anatomy of a default form](/static/7a61d81f1e7ea29fae9c0a75f2e947a5/3cbba/form-usage-1.png)\n\n![Anatomy of a fluid form](/static/2bcc7db28967c7f2c89a16f24b43371a/3cbba/form-usage-1-fluid.png)\n\n1. **Header** (optional): The addition of a title and description as a header\n   that can provide the user with additional context or instructions.\n2. **Form body**: Area where users provide information. Information can be\n   entered through various input fields, including text fields, checkboxes, and\n   many other types. Input components contain labels and helper text that the\n   user submits correct data.\n3. **Footer**: Provides actions that allow users to submit or cancel the data\n   entered in the form.\n\n### Styling\n\nForms can use two styles of inputs: default and fluid. They share the same\nfunctionality but look visually different and have different alignment rules.\n\n| Style | Appearance | Alignment | Use case |\n| --- | --- | --- | --- |\n| Default | Uses a traditional style of input where the label is positioned outside and above the input field. Default forms can use any of the three default input field sizes: small (32px), medium (40px), or large (48px). | Form inputs are equally stacked with 32px/2rem padding separating each component. | Use when white space is needed between input components, if smaller components are required, or in productive moments like in complex forms. |\n| Fluid | An alternative input style where the label is placed inside the input field and aligned with the user input text. Fluid inputs only have one size at the height of 64px. | Form inputs are stacked flush to one another with 0px of padding between them. | Use in expressive moments or where larger form components can aid in emphasizing the featured form. |\n\n![Examples of a default and fluid form styles](/static/750025cb1e756066f124b64cecc3e65b/3cbba/form-usage-2.png)\n\n### Alignment\n\nIn a form, input components should vertically align with all other form\ncomponents. Whether a form aligns flush to grid columns or hangs in the gutters\ndepends on the style of form input you are using as well as the gutter mode.\nDefault forms typically use a wide gutter mode and align flush to the grid\ncolumns prioritizing vertical label alignment. Fluid forms use the condensed\ngrid and can hang into the gutter without causing label misalignment. Fluid\nforms are architectural and remain cohesive by never allowing vertical or\nhorizontal space between inputs.\n\n![An example showing a properly aligned default inputs](/static/43fc1a11ff45d27d9e072f4000c82949/a5df1/form-usage-3-do.png)\n\nDo align default form inputs and labels to the grid columns using the wide gutter mode.\n\n![An example showing incorrectly aligned default inputs](/static/fd06153583b470c9643b7a793151c017/a5df1/form-usage-3-dont.png)\n\nDon’t hang default inputs into the grid gutters. Doing so will cause labels to misalign with other form elements.\n\n![An example showing a properly stacked fluid inputs](/static/39d9a8d534ffd69d78f193be3a753389/a5df1/form-usage-4-do.png)\n\nDo stack fluid components flush to one another with no spacing between them using the condensed gutter mode.\n\n![An example showing incorrectly arranged fluid inputs](/static/41ade9f6290f392cb97c059ae703d4fe/a5df1/form-usage-4-dont.png)\n\nDon’t add vertical or horizontal space between fluid components. Fluid forms are architectural and should remain a cohesive unit.\n\n### Two column forms\n\nIf a form has more than one column, then the columns should be proportional and\nalign to grid columns when possible. The space between form columns is\ndetermined by the gutter mode you are using; default forms use the wide gutter\nmode with 32px padding between form columns, versus fluid forms use the\ncondensed gutter mode with 1px padding. The narrow gutter mode (16px) is\ntypically not used in forms as it often places the text in the gutter.\n\n![Examples of two column forms](/static/69c1f62cf55f384c48ffc9583e9bf6c2/3cbba/form-usage-5.png)\n\nWhen using two columns, the row should respond as a group. For example, if the\nleft column form item becomes invalid and pushes form content down to\naccommodate space for an error message, then the accompanying right form item\nwill also grow to account for the needed space.\n\n![Examples of an invalid state with two columns](/static/f6c026e52cda95342b1f92d9f585bd3c/3cbba/form-usage-5b.png)\n\n### Vertical spacing\n\nThe typical recommended vertical spacing between components is 32px. For all\nguidance and recommendation for spacing for forms, see the\n[form pattern](/patterns/forms-pattern/#spacing).\n\n## Content\n\n### Labels\n\nEffective labeling helps users understand what information to enter into a text\ninput. Text fields should always have a label. There are rare instances where\nthe context of an input negates the need for a visible label, but we advise you\nto consult an accessibility expert before proceeding with a label-less design.\n\n#### Best practices for labels\n\n- Use sentence-style capitalization for all labels except for product names and\n  proper nouns.\n- Keep the label short and concise.\n- Do not use colons after label names.\n\n### Default values\n\nWhere possible, add programmatic assistance. Detect and pre-fill inputs to\nreduce errors and save time. When the software can’t determine the value that\nbelongs in an input, use type-ahead to make suggestions. Use sentence-case for\ndefault values, detected values, and auto-completion text.\n\n### Helper text\n\nOptional helper text is pertinent information that assists the user in correctly\ncompleting a field. Helper text should always be available when the input is\nfocused. It is often used to explain the correct data format. Helper text\nappears as persistent text under a default input (helper text is not available\nin fluid input, which uses tooltips instead). Helper text is the preferred\nmethod of assisting users because it is always visible for the user to reference\nwithout additional effort.\n\n#### Best practices for helper text\n\n- Use sentence-style capitalization, and in most cases, write the text as full\n  sentences with punctuation.\n- When used, helper text that appears persistently underneath the field is\n  replaced by an error or warning message if a state change occurs.\n\n### Tooltip help\n\nTooltips can be added inline with a form label if additional non-pertinent\ninformation is needed to assist the user in correctly completing a field, such\nas context setting. Tooltip content may include more in-depth information about\nthe field or the options the user is choosing from. Links to additional\ninformation or references may also be included if needed. In certain situations\nwhere complex instructions or additional context would be appropriate, tooltips\ncan be used in addition to the helper text. However, it is recommended that all\npertinent assistive information to form completion—such as format content—be\npresented simply and directly as helper text under the field and not be in a\ntooltip.\n\n![Example of text input with a tooltip](/static/e396ac4b8a6b0887466d81513b8c5736/3cbba/form-usage-6.png)\n\n#### Tooltips in fluid components\n\nFluid inputs are an exception to the no critical information in tooltips rule.\nDue to their architectural nature, fluid inputs do not provide the allotted\nspace under the field needed for helper text. All assistive text whether\npertinent or additional, is provided through a tooltip when using fluid inputs.\n\n![Example of a fluid input using a tooltip for help](/static/c9cbfd6b0170bc69951d61bae8441047/3cbba/form-usage-7.png)\n\n### Placeholder text\n\nOptional placeholder text is text that appears inside an input field at a lower\ncontrast than the user input text. It provides hints or examples of what to\nenter. Placeholder text disappears after the user begins entering data into the\ninput. As such, it should not be used as a replacement for a persistent label\nnor should it contain crucial information. Sometimes providing an example of the\nkind of thing the user might enter is useful. Using certain examples as\nplaceholder text is allowed but it still should not contain essential\ninformation.\n\n#### Best practices for placeholder text\n\n- Use sentence-style capitalization, and in most cases, write the text as a\n  direct statement without punctuation.\n- Placeholder text is not required and by default not shown in text input\n  fields.\n- Placeholder text can be harmful to user interactions and should only be added\n  when necessary.\n\n![Example of appropriate placeholder text](/static/fb0d29fa22b304d283b1a8fdbdf14b5f/3cbba/form-usage-8.png)\n\n### Further guidance\n\nFor further content guidance, see Carbon’s\n[content guidelines](/guidelines/content/overview/).\n\n## Behaviors\n\n### Optional versus required fields\n\nForms items can be labeled as either optional or required depending on several\nfactors. A common distinction in IBM products for using required or optional is\nthe forms complexity.\n\n1. **Simple forms** - generally shorter and/or user- or consumer-oriented; such\n   as sign-up and contact forms and checkout screens. Most of the fields will\n   tend to be required.\n2. **Complex forms** - generally longer and product-oriented; contain properties\n   and settings that are used to configure Enterprise software.  Although they\n   will usually contain at least one required field, the majority of the fields\n   will tend to be optional.\n\nNote if the majority of the fields are **required** or **optional**, as the\noverall number of form fields for your entire product should inform your\ntreatment. The pattern used should be consistent throughout your product, or at\nminimum, consistent between all of the same types of form within your product.\n\n- If the majority of the fields are required, mark **only** the optional field\n  labels with *(optional)*.\n- If the majority of the fields are optional, mark **only** the required field\n  labels with *(required)*.\n\n- Optional\n- Required\n\n![Example of a short user sign-up form using the optional pattern](/static/de10eabed2180ada9163fa745f233a73/3cbba/form-usage-optional.png)\n\n![Example of product configuration properties using the required pattern](/static/2a83fb05a46075a4c6b6c336eca2d73f/3cbba/form-usage-required.png)\n\n### Form controls\n\nCarbon provides a variety of data input components that enable a user to enter\nor select data. The components are divided into three different interaction\ntypes.\n\n| Type | Overview |\n| --- | --- |\n| [Free form inputs](/patterns/forms-pattern/#text-inputs) | Free-form text inputs are the most commonly used components in forms. They allow a user to enter any configuration of letters or numbers. Common free-form inputs include: text input and text area. |\n| [Selection controls](/patterns/forms-pattern/#data-inputs) | Selection controls offer users a selection from pre-determined options. Common selection controls include: checkboxes, radio buttons, file uploaders, toggles, and select lists (combo box and multiselect). |\n| [Bound entry controls](/patterns/forms-pattern/#data-inputs) | Bound entry controls allow users to input numeric data, like dates and times and may restrict user input to a certain range. Common bound entry controls include: number input, date picker, and slider components. |\n\n### States\n\nThe following are common states that can be applied to components when used in a\nform.\n\n| State | When to use |\n| --- | --- |\n| *Enabled* | When a text input is live but a user is not directly interacting with it. This is commonly referred to as the default or normal state of the component. An enabled text input field can contain no content, placeholder text, or user generate content. |\n| *Active* | When a user is actively typing content into the field. |\n| *Focus* | When a user ```  tabs ```   Copy to clipboard to or clicks on the text input, it becomes focused, indicating the user has successfully navigated to the component. |\n| *Error* | When the user input is invalid or a required text input has not been filled in. It can also be triggered due to a system error. This state requires a user response before data can be submitted or saved. |\n| *Warning* | When you need to call the user’s attention to an exception condition. The condition might not be an error but can cause problems if not resolved. |\n| *Disabled* | When the user is not allowed to interact with the text input due to either permissions, dependencies, or pre-requisites. The disabled state completely removes the interactive function from a component. The styling is not subject to WCAG contrast compliance. |\n| *Skeleton* | Use on an initial page load to indicate that the text input has not yet fully loaded. |\n| *Read-only* | *Coming soon!* |\n\n- Default\n- Fluid\n- AI\n\n![Examples of default input states](/static/cd1b818597e4aea87052760a6f95b071/3cbba/form-usage-states-fixed.png)\n\n![Examples fluid input states](/static/f0920b4ae12ea79470f4e3a01181f35c/3cbba/form-usage-states-fluid.png)\n\n![Examples fluid input states](/static/c1c7fafe6920658c305a9281f58ac633/3cbba/form-usage-states-ai.png)\n\n## Additional guidance\n\nThe form pattern provides additional and elaborative guidance to the information\nfound with the form component. Below is a list of key sections available in the\npattern.\n\n| Topic | Overview |\n| --- | --- |\n| [Buttons in forms](/patterns/forms-pattern/#buttons) | Provides guidance on button alignment, emphasis, placement, and naming in relation to a form. |\n| [Errors and validation](/patterns/forms-pattern/#errors-and-validation) | Effective and immediate error messaging can help the user to understand the problem and how to fix it. |\n| [Form layout](/patterns/forms-pattern/#designing-a-form) | Additional guidance around layout, spacing, and columns in a form. |\n| [Designing for longer forms](/patterns/forms-pattern/#designing-for-longer-forms) | Techniques to help make longer forms less overwhelming, including guidance for accordion and multistep forms. |\n| [Form variants](/patterns/forms-pattern/#variants) | Forms may be presented as dedicated pages, side panels, or dialogs depending on the use case and the situation. |\n\n## AI presence\n\nForm has a modification that takes on the AI visual styling when AI is present\nin the form. The AI variants of a form function the same as the normal variants\nexcept for the addition of the AI label, which is both a visual indicator and\nthe trigger for the explainability popover.\n\nThe AI presence in form can appear in two ways: broadly, over the whole form, or\nfocused, just in certain parts of the form. When the entire form is styled for\nAI, it indicates to the user that AI is present in all aspects of the form. If\nonly a limited amount of the form content is generated by AI, then only those\ncomponents should receive the AI presence styling, not the entire form.\n\nFor more information on designing for AI, see the\n[Carbon for AI](/guidelines/carbon-for-ai/) guidelines.\n\n![Example of form with full and component based AI presence](/static/657941cfbd1d809d290278f63de81dc2/3cbba/usage-ai-presence-form.png)\n\nExample of form with full AI presence on the left and component based AI\npresence on the right.\n\n## Related\n\n#### Components\n\n- [Button](/components/button/usage)\n- [Checkbox](/components/checkbox/usage)\n- [Combo box](http://react.carbondesignsystem.com/?path=/story/combobox--default)\n- [Multiselect](http://react.carbondesignsystem.com/?path=/story/multiselect--default)\n- [Password input](http://react.carbondesignsystem.com/?path=/story/textinput--toggle-password-visibility)\n- [Radio button](/components/radio-button/usage)\n- [Text area](http://react.carbondesignsystem.com/?path=/story/textarea--default)\n- [Text input](/components/text-input/usage)\n- [Toggle](/components/toggle/usage)\n\n#### Patterns\n\n- [Dialogs](/patterns/dialog-pattern)\n- [Notifications](/patterns/notification-pattern)\n\n## Feedback\n\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\n[GitHub](https://github.com/carbon-design-system/carbon-website/issues/new?assignees=&labels=feedback&template=feedback.md).\n\n[Edit this page on GitHub](https://github.com/carbon-design-system/carbon-website/edit/main/src/pages/components/form/usage.mdx)\n\n[Previous\n\nComponents: File uploader](/components/file-uploader/usage/)\n\n[Next\n\nForm: Style](/components/form/style/)",
  "tags": [
    "ibm",
    "carbon",
    "design-system",
    "enterprise"
  ],
  "extracted_at": "2026-02-03T14:19:14.080699+00:00",
  "content_length": 14116,
  "content_hash": "56df150a3338d32a"
}