{
  "id": "carbon-design__components_modal_usage_",
  "source_id": "carbon-design",
  "source_name": "IBM Carbon Design System",
  "category": "design_systems",
  "url": "https://carbondesignsystem.com/components/modal/usage/",
  "title": "Modal",
  "content": "Modal\nFeature flag\nModals focus the user’s attention exclusively on one task or piece of\ninformation by using a window that is displayed on top of the page content.\nModal\nwith AI label\nis now stable. This addition changes the visual appearance of the component and\nintroduces an AI explainability feature when AI is present in the component. See\nthe\nAI presence\nsection for more\ndetails.\nLive demo\nOverview\nFormatting\nContent\nUniversal behaviors\nModal variants\nAI presence\nRelated\nFeedback\nLive demo\nTheme selector\nWhite\nVariant selector\nDefault\nThis live demo contains only a preview of functionality and styles available for this component. View the\nfull demo\non Storybook for additional information such as its version, controls, and API documentation.\nAccessibility testing status\nFor every latest release, Carbon runs tests on all components to meet the\naccessibility requirements\n. These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\nVariant\nModal\nDefault state\nTested\nAdvanced states\nPartially tested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nDefault state\nTested\nAdvanced states\nPartially tested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nOverview\nModals are a type of\ndialog\nbecause it is a\nconversation between the user and the system. Use a modal to present critical\ninformation or request user input that’s needed to complete a user’s workflow.\nModals interrupt a user’s workflow for short and non-frequent tasks, such as\nediting or management tasks. When the modal is open, the user is blocked from\nthe on-page content and can’t return to their previous workflow until the modal\ntask is completed or the user dismisses the modal. While effective when used\ncorrectly, modals should be used sparingly to limit disrupting the user.\nTherefore, if a user needs to repeatably perform a task, consider making the\ntask completable on the main page.\nWhen to use\nRequire an immediate response from the user\nUse a dialog to request information that is preventing the system from\ncontinuing a user-initiated process.\nNotify the user of urgent information\nUse a modal to notify the user of urgent information concerning their current\nwork. Modals are commonly used to report system errors or convey a consequence\nof a user’s action.\nConfirm a user decision\nUse a modal to confirm user decisions. Clearly describe the action being\nconfirmed and explain any potential consequences that it may cause. Both the\ntitle and the button should reflect the action that will occur. If the action is\ndestructive or irreversible, then use a transactional danger modal.\nVariants\nVariant\nUsage\nPassive\nPresents information the user needs to be aware of concerning their current workflow. Contains no actions for the user to take.\nTransactional\nRequires an action to be taken for the modal to be completed and closed. Contains a cancel and primary action buttons.\nDanger\nA specific variant of transactional modal used for destructive or irreversible actions.\nAcknowledgment\nSystem requires an acknowledgement of the information from the user. Contains only a single button, commonly\nOK\n.\nProgress\nRequires several steps to be completed before it can be closed. Contains a cancel, previous, and next or completion buttons, such as\nComplete\nor\nDone\n.\nFeature flags\nA\nfeature flag\nwas added to the modal\ncomponent to improve accessibility and changes parts of its functionality, not\nits visual appearance. For code-specific feature flag information, refer to the\nCode\ntab. The current modal is not being deprecated,\nbut teams are encouraged to use the feature flag modal for their products moving\nforward. Once the next major release (v12) is released in the future, this\nfeature flag will become the default version of the component.\nFormatting\nAnatomy\nThe modal has three distinct zones: A header, the body, and a footer.\nComponents, for example a data table, form or, progress indicator, can occupy\nthe full width of the modal.\nHeader\n: Includes a title, optional label, and the close icon.\nBody\n: Contains the information and controls, or both that are needed to\ncomplete the modal’s task. It can include message text and components.\nFooter\n: Contains the main actions needed to complete or cancel the modal\ntask. Button groupings change based on the modal variant.\nx\n: The close\nx\nicon will close the modal without submitting any data.\nOverlay\n: Screen overlay that obscures the on-page content.\nSizing\nThere are four responsive\nmodal sizes\n: extra\nsmall, small, medium, and large. Choose a size that works best for the amount of\nmodal content you have. Modals with brief text should be extra small or small to\navoid long single lines; for complex components, like a data table, the default\nor large modal is more suitable.\nMax heights\nTo maintain a proper window ratio, each modal size has a\nmaximum height\n. If your modal has too much\nscrolling because of a maximum height limitation, consider using the next modal\nsize up. If the large modal height is still not enough space then a full page\nmight be needed instead.\nAlignment\nIn a modal that has\nlarger breakpoints\n,\nbody copy, including titles, use a 20% margin-right. However, form inputs and\nother components expand the entire width of a modal.\nFull-width content\nCertain components, such as a structure list or table, can expand into the\nmargins of the modal and align flush to the container edges. These components\ntypically have border dividers or containers that extend beyond the text or\nicon. Labels or text of any kind should never be in the modal margins.\nContent\nIn IBM Style, the modal is referred to as a dialog.\nTitle\nUse a brief verb phrase that describes the modal’s task or purpose.\nIf the modal is accessed by clicking a button, use the button label for the\nmodal title:\nFor example, if the user clicks the\nCreate access group\nbutton to open\nthe modal,\nCreate access group\nis the modal title. Modals might also be\naccessed by clicking a menu item or an icon.\nBe aware of situations where there’s a tendency to mix and match button or\nicon labels and modal titles. For example, if the icon name is\nNew user\n,\nuse\nNew user\nas the modal title, not\nCreate user\n.\nIf your product has a more conversational tone, use articles (a, an, the) in\nthe modal title even though the button label doesn’t include the article, for\nexample\nCreate an access group\n.\nSometimes, you might need to provide contextual information for the modal,\nsuch as when the actions performed using the modal apply to a specific item\nand you want to make it clear which item the actions apply to.\nIn this case, you can use the optional label that is displayed above the\ntitle.\nFor example, if the user needs to know the path to the object that they are\nediting, you might put the path in the optional label.\nModal description\nIf the purpose or goal of the modal is not readily apparent, provide a sentence\nor two of embedded assistance to help the user understand the modal or to\nprovide examples to explain how to use the modal. If the title and the purpose\nare clear, such as\nEdit object\nfor the title when the purpose of the modal is\nto edit an object, a description is not needed.\nBody content\nInclude only fields, components, and embedded assistance that are relevant to\ncompleting the current task.\nEnsure that the text is 80% of the modal’s width. The components can span 100%\nof the width.\nTo add a link to IBM Documentation, include it as a link in the body of the\nmodal.\nUse a clear label, such as\nLearn more about topic\nor\nIBM Docs\n.\nEnsure that the URL is easy to update\nButtons\nFor action button labels, use active words that describe the purpose of the\nmodal, such as\nAdd\n,\nDelete\n, and\nSave\n. For a list of approved\naction labels, see\nthe Carbon content guidelines\n.\nAvoid vague or passive words, such as\nDone\nor\nOK\n.\nOverflow content\nWhen the modal content is longer than the modal height then the body section\nshould scroll vertically with the header and footer remaining fixed in place.\nThe content should visibly fade at the end of the modal body area to indicate\nthere is additional content out of view.\nModal content should never scroll horizontally; instead, use a larger size\nmodal.\nTitle as message\nFor short, direct messages the title can include the whole message to add visual\nclarity to an otherwise repetitive title and body message. When using this\nstyle, no other body copy may be included.\nFurther guidance\nFor further content guidance, see Carbon’s\ncontent guidelines\n.\nUniversal behaviors\nTrigger\nModals are triggered as a result of a user’s action and are not system\ngenerated. Common components that can trigger a modal include, button, link, or\nicon. On a keyboard, selecting\nEnter\nCopy to clipboard\nor\nSpace\nCopy to clipboard\nshould launch the modal.\nFocus\nOnce the modal is open, set the initial focus to the first location that accepts\nuser input. For example, if the modal contains a form then the focus should\nautomatically be set to the first field when opened. If it is a transactional\nmodal without form inputs in the body section then the first focus should be on\nthe primary button.\nFocus should then remain trapped in the dialog until it is closed. When\nnavigating by keyboard,\nTab\nCopy to clipboard\nand\nShift-Tab\nCopy to clipboard\ndo not move the focus outside of\nthe modal.\nLoading\nThe task completion action should take place immediately. If a longer loading\nperiod is needed, a\nloading spinner\nand overlay\nshould appear on top of the modal body area with content disabled. The primary\naction button should be disabled while loading is in progress.\nIf a quick loading period is needed, use an\ninline loading\nbehavior on the\nprimary button to indicate the data is being processed.\nValidation\nValidate a user’s entries before the modal is closed. If any entry is invalid\nthen the modal should remain open with the entry marked in an error state and\ninclude an inline error message. The message should inform the user what has\nhappened and provide guidance on next steps or possible resolutions. Effective\nand immediate error messaging can help the user to understand the problem and\nhow to fix it.\nWhen possible, validate the user’s data before submission. This kind of inline\nvalidation (aka client-side validation) should happen as soon as the field loses\nfocus. This will help easily identify the elements that need to be corrected.\nIn-field error messages should disappear when the form criteria is met. If the\ndata was not able to be submitted due to server-side issues, an inline\nnotification should appear.\nModal variants\nPassive modal\nPassive modals presents information the user needs to be aware of concerning\ntheir current workflow. It contains no actions for the user to take and should\nnot include any data that needs to be submitted. They serve as a type of\nnotification alerting the user to urgent information such as reporting system\nerrors or conveying a consequence of a user’s action.\nDismissing a passive modal\nPassive modals are persistent until dismissed in one of the following ways.\nx\n: Clicking the close\nx\nicon in the upper right will close the modal\nwithout submitting any data and return the user to its previous context.\nClick elsewhere\n: Clicking outside the passive modal area will\nautomatically close the modal.\nEsc\n: Pressing\nESC\nCopy to clipboard\non the keyboard\nTransactional modal\nTransactional modals are used to validate user decisions or to gain secondary\nconfirmation from the user. Transactional modals require an action to be taken\nin order for the modal to be completed and closed. It contains a cancel and\nprimary action buttons.\nDismissing a transactional modal\nTransactional modals are persistent until dismissed in one of the following\nways.\nTask completion\n: Clicking the primary action will complete the task and\nautomatically close the modal.\nCancel button\n: Clicking the cancel button will close the modal and return\nthe user to its previous context. Cancel undoes all applied changes.\nx\n: Clicking the close\nx\nicon in the upper right will close the modal\nwithout submitting any data and return the user to its previous context.\nEsc\n: Press ESC on the keyboard.\nTwo buttons\nWhen using two buttons, the secondary button is on the left and the primary\nbutton is placed on the right. Each button spans 50% of the modal and are full\nbleed to the edge.\nThree buttons\nIn the rare case where three buttons are needed, each is 25% of the modal width\nand aligned to the right side of the modal. Only the outmost right button is\nallowed to be a primary button with the other two being secondary buttons. If\nall three actions have the same weight, all three should be secondary buttons.\nDanger modal\nDanger modal is a specific kind of\ntransactional modal\nused for\ndestructive or irreversible actions. In danger modal, the primary button is\nreplaced by a danger button. They are commonly used in high impact moments as a\nconfirmation for an action that would result in a significant data loss if done\naccidentally.\nAcknowledgment modal\nAcknowledgment modals are used when the system requires the user to acknowledge\nthe presented information. It contains only a single button, commonly\nOK\n. \nAcknowledgment is confirmed when the user clicks the primary button.\nDismissing an acknowledgment modal\nAcknowledgment modals are persistent until dismissed in one of the following\nways.\nTask completion\n: Clicking the primary action will complete the task and\nautomatically close the modal.\nx\n: Clicking the close\nx\nicon in the upper right will close the modal\nwithout submitting the user’s acknowledgement and return the user to the\nprevious context.\nEsc\n: Press\nESC\nCopy to clipboard\non the keyboard.\nSingle button\nSingle buttons are placed on the right side, span 50% of the modal, and bleed to\nthe edge. In most scenarios, a primary button is used when one button is needed.\nProgress modal\nFor longer tasks, use a progress modal to give the user a sense of completion\nand orientation within the focused flow. For complex flows with complex choices,\nconsider using a full page instead of a modal. A progress modal is not a\nsolution for excess modal content. It should only be used to present information\nin more consumable and focused chunks.\nDismissing a progress modal\nTransactional modals are persistent until dismissed in one of the following\nways.\nTask completion\n: Clicking the primary action will complete the task and\nautomatically close the modal.\nCancel button\n: Clicking the\nCancel\nbutton will close the modal and\nreturn the user to its previous context. Cancel undoes all applied changes.\nx\n: Clicking the close\nx\nicon in the upper right will close the modal\nwithout submitting any data and return the user to its previous context.\nEsc\n: Press\nESC\nCopy to clipboard\non the keyboard.\nButton group\nThere are three buttons in the progress modal footer:\nCancel\n,\nPrevious\n,\nNext\n. Each button’s width is 25% of the modal window and are full bleed.\nPrevious\nand\nNext\nare grouped together and placed on the right half of\nthe dialog, with\nPrevious\nas a secondary button and\nNext\nas a primary\nbutton. In the last step of the sequence, the\nNext\nbutton label should\nchange to reflect the final action. The\nCancel\nbutton is aligned to left\nside of the modal and uses a ghost button.\nAI presence\nThe modal component has a modification that takes on the AI visual styling when\nAI is present in the entire container. The AI variants of a modal function the\nsame as the other modal variants except for the addition of the AI label, which\nis both a visual indicator and the trigger for the explainability popover.\nAI in modal can appear in two ways: broadly, over the whole modal, or focused,\njust in certain parts of the modal. When the entire modal is styled for AI, it\nindicates to the user that AI is present in all aspects of the modal. If only a\nlimited amount of the modal content is generated by AI, then only those\ncomponents should receive the AI presence styling, not the entire modal.\nFor more information on designing for AI, see the\nCarbon for AI\nguidelines.\nLight mode\nDark mode\nRelated\nModal versus notification\nModals are highly disruptive and block tasks until dismissed by the user. A\nmodal should only be used as a form of notification if it provides the user with\ncritical information immediately related to their task. For non-critical\nmessaging, consider using a toast or inline notification instead of a modal.\nToast and inline notifications provide users with non-disruptive feedback or the\nstatus of an action without breaking their workflow.\nComponents\nNotification\nPatterns\nDialogs\nNotifications\nFeedback\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\nGitHub\n.\nEdit this page on GitHub\nPrevious\nComponents: Menu buttons\nNext\nModal: Style",
  "content_markdown": "# Modal\n\nFeature flag\n\nModals focus the user’s attention exclusively on one task or piece of\ninformation by using a window that is displayed on top of the page content.\n\nModal\n[with AI label](https://react.carbondesignsystem.com/?path=/story/components-modal--with-ai-label)\nis now stable. This addition changes the visual appearance of the component and\nintroduces an AI explainability feature when AI is present in the component. See\nthe [AI presence](/components/modal/usage/#ai-presence) section for more\ndetails.\n\n- [Live demo](#live-demo)\n- [Overview](#overview)\n- [Formatting](#formatting)\n- [Content](#content)\n- [Universal behaviors](#universal-behaviors)\n- [Modal variants](#modal-variants)\n- [AI presence](#ai-presence)\n- [Related](#related)\n- [Feedback](#feedback)\n\n## Live demo\n\nTheme selector\n\nWhite\n\n---\n\nVariant selector\n\nDefault\n\n---\n\nThis live demo contains only a preview of functionality and styles available for this component. View the [full demo](https://react.carbondesignsystem.com/?path=/story/components-modal--default&globals=theme:white) on Storybook for additional information such as its version, controls, and API documentation.\n\n### Accessibility testing status For every latest release, Carbon runs tests on all components to meet the [accessibility requirements](https://www.ibm.com/able/requirements/requirements/). These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\n\nVariant\n\nModal\n\n---\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nPartially tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nPartially tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n## Overview\n\nModals are a type of [dialog](/patterns/dialog-pattern) because it is a\nconversation between the user and the system. Use a modal to present critical\ninformation or request user input that’s needed to complete a user’s workflow.\nModals interrupt a user’s workflow for short and non-frequent tasks, such as\nediting or management tasks. When the modal is open, the user is blocked from\nthe on-page content and can’t return to their previous workflow until the modal\ntask is completed or the user dismisses the modal. While effective when used\ncorrectly, modals should be used sparingly to limit disrupting the user.\nTherefore, if a user needs to repeatably perform a task, consider making the\ntask completable on the main page.\n\n### When to use\n\n#### Require an immediate response from the user\n\nUse a dialog to request information that is preventing the system from\ncontinuing a user-initiated process.\n\n#### Notify the user of urgent information\n\nUse a modal to notify the user of urgent information concerning their current\nwork. Modals are commonly used to report system errors or convey a consequence\nof a user’s action.\n\n#### Confirm a user decision\n\nUse a modal to confirm user decisions. Clearly describe the action being\nconfirmed and explain any potential consequences that it may cause. Both the\ntitle and the button should reflect the action that will occur. If the action is\ndestructive or irreversible, then use a transactional danger modal.\n\n### Variants\n\n| Variant | Usage |\n| --- | --- |\n| [Passive](/components/modal/usage#passive-modal) | Presents information the user needs to be aware of concerning their current workflow. Contains no actions for the user to take. |\n| [Transactional](/components/modal/usage#transactional-modal) | Requires an action to be taken for the modal to be completed and closed. Contains a cancel and primary action buttons. |\n| [Danger](/components/modal/usage#danger-modal) | A specific variant of transactional modal used for destructive or irreversible actions. |\n| [Acknowledgment](/components/modal/usage#acknowledgment-modal) | System requires an acknowledgement of the information from the user. Contains only a single button, commonly **OK**. |\n| [Progress](/components/modal/usage#progress-modal) | Requires several steps to be completed before it can be closed. Contains a cancel, previous, and next or completion buttons, such as **Complete** or **Done**. |\n\n### Feature flags\n\nA [feature flag](/components/overview/feature-flags/) was added to the modal\ncomponent to improve accessibility and changes parts of its functionality, not\nits visual appearance. For code-specific feature flag information, refer to the\n[Code](/components/modal/code/) tab. The current modal is not being deprecated,\nbut teams are encouraged to use the feature flag modal for their products moving\nforward. Once the next major release (v12) is released in the future, this\nfeature flag will become the default version of the component.\n\n## Formatting\n\n### Anatomy\n\n![Modal anatomy diagram](/static/de29bd7439e7f1ce9f0317dac2a503b9/3cbba/modal-usage-anatomy.png)\n\nThe modal has three distinct zones: A header, the body, and a footer.\nComponents, for example a data table, form or, progress indicator, can occupy\nthe full width of the modal.\n\n1. **Header**: Includes a title, optional label, and the close icon.\n2. **Body**: Contains the information and controls, or both that are needed to\n   complete the modal’s task. It can include message text and components.\n3. **Footer**: Contains the main actions needed to complete or cancel the modal\n   task. Button groupings change based on the modal variant.\n4. **x**: The close **x** icon will close the modal without submitting any data.\n5. **Overlay**: Screen overlay that obscures the on-page content.\n\n### Sizing\n\nThere are four responsive [modal sizes](/components/modal/style#sizes): extra\nsmall, small, medium, and large. Choose a size that works best for the amount of\nmodal content you have. Modals with brief text should be extra small or small to\navoid long single lines; for complex components, like a data table, the default\nor large modal is more suitable.\n\n![Modal sizes](/static/34708ca47604da89a722144532b1bf5b/3cbba/modal-usage-sizes.png)\n\n#### Max heights\n\nTo maintain a proper window ratio, each modal size has a\n[maximum height](/components/modal/style#max-sizes). If your modal has too much\nscrolling because of a maximum height limitation, consider using the next modal\nsize up. If the large modal height is still not enough space then a full page\nmight be needed instead.\n\n![Modal max heights](/static/5e037091c30905c01952dfaae309c1c0/3cbba/modal-usage-max-heights.png)\n\n### Alignment\n\nIn a modal that has [larger breakpoints](/components/modal/style#margin-right),\nbody copy, including titles, use a 20% margin-right. However, form inputs and\nother components expand the entire width of a modal.\n\n![Modal alignment](/static/f79867f4d6546b8347f80faf5d583bcb/3cbba/modal-usage-alignment.png)\n\n#### Full-width content\n\nCertain components, such as a structure list or table, can expand into the\nmargins of the modal and align flush to the container edges. These components\ntypically have border dividers or containers that extend beyond the text or\nicon. Labels or text of any kind should never be in the modal margins.\n\n![Modal alignment](/static/f81fcf68254315228e3a9b958dc4a360/3cbba/modal-usage-alignment-2.png)\n\n## Content\n\nIn IBM Style, the modal is referred to as a dialog.\n\n### Title\n\n- Use a brief verb phrase that describes the modal’s task or purpose.\n- If the modal is accessed by clicking a button, use the button label for the\n  modal title:\n  - For example, if the user clicks the **Create access group** button to open\n    the modal, *Create access group* is the modal title. Modals might also be\n    accessed by clicking a menu item or an icon.\n  - Be aware of situations where there’s a tendency to mix and match button or\n    icon labels and modal titles. For example, if the icon name is **New user**,\n    use *New user* as the modal title, not *Create user*.\n- If your product has a more conversational tone, use articles (a, an, the) in\n  the modal title even though the button label doesn’t include the article, for\n  example *Create an access group*.\n- Sometimes, you might need to provide contextual information for the modal,\n  such as when the actions performed using the modal apply to a specific item\n  and you want to make it clear which item the actions apply to.\n  - In this case, you can use the optional label that is displayed above the\n    title.\n  - For example, if the user needs to know the path to the object that they are\n    editing, you might put the path in the optional label.\n\n### Modal description\n\nIf the purpose or goal of the modal is not readily apparent, provide a sentence\nor two of embedded assistance to help the user understand the modal or to\nprovide examples to explain how to use the modal. If the title and the purpose\nare clear, such as *Edit object* for the title when the purpose of the modal is\nto edit an object, a description is not needed.\n\n### Body content\n\n- Include only fields, components, and embedded assistance that are relevant to\n  completing the current task.\n- Ensure that the text is 80% of the modal’s width. The components can span 100%\n  of the width.\n- To add a link to IBM Documentation, include it as a link in the body of the\n  modal.\n  - Use a clear label, such as *Learn more about topic* or *IBM Docs*.\n  - Ensure that the URL is easy to update\n\n### Buttons\n\n- For action button labels, use active words that describe the purpose of the\n  modal, such as **Add**, **Delete**, and **Save**. For a list of approved\n  action labels, see\n  [the Carbon content guidelines](https://www.carbondesignsystem.com/guidelines/content/action-labels).\n- Avoid vague or passive words, such as **Done** or **OK**.\n\n### Overflow content\n\nWhen the modal content is longer than the modal height then the body section\nshould scroll vertically with the header and footer remaining fixed in place.\nThe content should visibly fade at the end of the modal body area to indicate\nthere is additional content out of view.\n\nModal content should never scroll horizontally; instead, use a larger size\nmodal.\n\n![Overflow content example](/static/0774bbde8d3ba94a7d4cdf5678c48bd0/3cbba/modal-usage-scrolling.png)\n\n### Title as message\n\nFor short, direct messages the title can include the whole message to add visual\nclarity to an otherwise repetitive title and body message. When using this\nstyle, no other body copy may be included.\n\n![Title as message example](/static/a991065de12f0225c4bb3ed9b55ddc49/3cbba/modal-usage-title.png)\n\n### Further guidance\n\nFor further content guidance, see Carbon’s\n[content guidelines](/guidelines/content/overview).\n\n## Universal behaviors\n\n### Trigger\n\nModals are triggered as a result of a user’s action and are not system\ngenerated. Common components that can trigger a modal include, button, link, or\nicon. On a keyboard, selecting\n\n```\nEnter\n```\n\nCopy to clipboard\n\nor\n\n```\nSpace\n```\n\nCopy to clipboard\n\nshould launch the modal.\n\n### Focus\n\nOnce the modal is open, set the initial focus to the first location that accepts\nuser input. For example, if the modal contains a form then the focus should\nautomatically be set to the first field when opened. If it is a transactional\nmodal without form inputs in the body section then the first focus should be on\nthe primary button.\n\nFocus should then remain trapped in the dialog until it is closed. When\nnavigating by keyboard,\n\n```\nTab\n```\n\nCopy to clipboard\n\nand\n\n```\nShift-Tab\n```\n\nCopy to clipboard\n\ndo not move the focus outside of\nthe modal.\n\n![Modal focus example](/static/21937f39bcdb6f455feafeb48d12ff75/3cbba/modal-usage-focus.png)\n\n### Loading\n\nThe task completion action should take place immediately. If a longer loading\nperiod is needed, a [loading spinner](/components/loading/usage) and overlay\nshould appear on top of the modal body area with content disabled. The primary\naction button should be disabled while loading is in progress.\n\nIf a quick loading period is needed, use an\n[inline loading](/patterns/loading-pattern#inline-loading) behavior on the\nprimary button to indicate the data is being processed.\n\n![Modal loading options](/static/0f2d0eb59ad43711286d285f578f12c3/3cbba/modal-usage-loading.png)\n\n### Validation\n\nValidate a user’s entries before the modal is closed. If any entry is invalid\nthen the modal should remain open with the entry marked in an error state and\ninclude an inline error message. The message should inform the user what has\nhappened and provide guidance on next steps or possible resolutions. Effective\nand immediate error messaging can help the user to understand the problem and\nhow to fix it.\n\nWhen possible, validate the user’s data before submission. This kind of inline\nvalidation (aka client-side validation) should happen as soon as the field loses\nfocus. This will help easily identify the elements that need to be corrected.\nIn-field error messages should disappear when the form criteria is met. If the\ndata was not able to be submitted due to server-side issues, an inline\nnotification should appear.\n\n![Validation example](/static/ee372970e8b7618348ec24b4d6a0a009/3cbba/modal-usage-invalid.png)\n\n## Modal variants\n\n### Passive modal\n\nPassive modals presents information the user needs to be aware of concerning\ntheir current workflow. It contains no actions for the user to take and should\nnot include any data that needs to be submitted. They serve as a type of\nnotification alerting the user to urgent information such as reporting system\nerrors or conveying a consequence of a user’s action.\n\n#### Dismissing a passive modal\n\nPassive modals are persistent until dismissed in one of the following ways.\n\n- **x**: Clicking the close **x** icon in the upper right will close the modal\n  without submitting any data and return the user to its previous context.\n- **Click elsewhere**: Clicking outside the passive modal area will\n  automatically close the modal.\n- **Esc**: Pressing\n\n  ```\n  ESC\n  ```\n\n  Copy to clipboard\n\n  on the keyboard\n\n![Passive modal example](/static/55bd338e2c2bf6401617173e30d674d7/3cbba/modal-usage-passive.png)\n\n### Transactional modal\n\nTransactional modals are used to validate user decisions or to gain secondary\nconfirmation from the user. Transactional modals require an action to be taken\nin order for the modal to be completed and closed. It contains a cancel and\nprimary action buttons.\n\n#### Dismissing a transactional modal\n\nTransactional modals are persistent until dismissed in one of the following\nways.\n\n- **Task completion**: Clicking the primary action will complete the task and\n  automatically close the modal.\n- **Cancel button**: Clicking the cancel button will close the modal and return\n  the user to its previous context. Cancel undoes all applied changes.\n- **x**: Clicking the close **x** icon in the upper right will close the modal\n  without submitting any data and return the user to its previous context.\n- **Esc**: Press ESC on the keyboard.\n\n#### Two buttons\n\nWhen using two buttons, the secondary button is on the left and the primary\nbutton is placed on the right. Each button spans 50% of the modal and are full\nbleed to the edge.\n\n![Two button modal example](/static/5dc350610a67506f90c97bba6a59345e/3cbba/modal-usage-two-buttons.png)\n\n#### Three buttons\n\nIn the rare case where three buttons are needed, each is 25% of the modal width\nand aligned to the right side of the modal. Only the outmost right button is\nallowed to be a primary button with the other two being secondary buttons. If\nall three actions have the same weight, all three should be secondary buttons.\n\n![Three button modal example](/static/2b708c497539d696119aa372218740ff/3cbba/modal-usage-three-buttons.png)\n\n### Danger modal\n\nDanger modal is a specific kind of\n[transactional modal](/components/modal/usage#transactional-modal) used for\ndestructive or irreversible actions. In danger modal, the primary button is\nreplaced by a danger button. They are commonly used in high impact moments as a\nconfirmation for an action that would result in a significant data loss if done\naccidentally.\n\n![danger modal](/static/13ffc3ff1ecce468ac4cd5289a0f0e53/3cbba/modal-usage-danger.png)\n\n### Acknowledgment modal\n\nAcknowledgment modals are used when the system requires the user to acknowledge\nthe presented information. It contains only a single button, commonly **OK**. \nAcknowledgment is confirmed when the user clicks the primary button.\n\n#### Dismissing an acknowledgment modal\n\nAcknowledgment modals are persistent until dismissed in one of the following\nways.\n\n- **Task completion**: Clicking the primary action will complete the task and\n  automatically close the modal.\n- **x**: Clicking the close **x** icon in the upper right will close the modal\n  without submitting the user’s acknowledgement and return the user to the\n  previous context.\n- **Esc**: Press\n\n  ```\n  ESC\n  ```\n\n  Copy to clipboard\n\n  on the keyboard.\n\n#### Single button\n\nSingle buttons are placed on the right side, span 50% of the modal, and bleed to\nthe edge. In most scenarios, a primary button is used when one button is needed.\n\n![One button modal example](/static/f9382b9ad420210fc7820a51554d4a84/3cbba/modal-usage-one-button.png)\n\n### Progress modal\n\nFor longer tasks, use a progress modal to give the user a sense of completion\nand orientation within the focused flow. For complex flows with complex choices,\nconsider using a full page instead of a modal. A progress modal is not a\nsolution for excess modal content. It should only be used to present information\nin more consumable and focused chunks.\n\n#### Dismissing a progress modal\n\nTransactional modals are persistent until dismissed in one of the following\nways.\n\n- **Task completion**: Clicking the primary action will complete the task and\n  automatically close the modal.\n- **Cancel button**: Clicking the **Cancel** button will close the modal and\n  return the user to its previous context. Cancel undoes all applied changes.\n- **x**: Clicking the close **x** icon in the upper right will close the modal\n  without submitting any data and return the user to its previous context.\n- **Esc**: Press\n\n  ```\n  ESC\n  ```\n\n  Copy to clipboard\n\n  on the keyboard.\n\n#### Button group\n\nThere are three buttons in the progress modal footer: **Cancel**, **Previous**,\n**Next**. Each button’s width is 25% of the modal window and are full bleed.\n**Previous** and **Next** are grouped together and placed on the right half of\nthe dialog, with **Previous** as a secondary button and **Next** as a primary\nbutton. In the last step of the sequence, the **Next** button label should\nchange to reflect the final action. The **Cancel** button is aligned to left\nside of the modal and uses a ghost button.\n\n![Progress modal example](/static/b9b58cc598ef1e50ccbfbeb1554b2e1d/3cbba/modal-usage-progress.png)\n\n## AI presence\n\nThe modal component has a modification that takes on the AI visual styling when\nAI is present in the entire container. The AI variants of a modal function the\nsame as the other modal variants except for the addition of the AI label, which\nis both a visual indicator and the trigger for the explainability popover.\n\nAI in modal can appear in two ways: broadly, over the whole modal, or focused,\njust in certain parts of the modal. When the entire modal is styled for AI, it\nindicates to the user that AI is present in all aspects of the modal. If only a\nlimited amount of the modal content is generated by AI, then only those\ncomponents should receive the AI presence styling, not the entire modal.\n\nFor more information on designing for AI, see the\n[Carbon for AI](/guidelines/carbon-for-ai/) guidelines.\n\n- Light mode\n- Dark mode\n\n![Modal's light mode AI presence example](/static/57bc4193daba4848eb3152b719d15243/3cbba/modal-usage-ai-presence-w.png)\n\n![Modal's dark mode AI presence example](/static/3fbb289e9bda58e448f949afd4718034/3cbba/modal-usage-ai-presence-g100.png)\n\n## Related\n\n#### Modal versus notification\n\nModals are highly disruptive and block tasks until dismissed by the user. A\nmodal should only be used as a form of notification if it provides the user with\ncritical information immediately related to their task. For non-critical\nmessaging, consider using a toast or inline notification instead of a modal.\nToast and inline notifications provide users with non-disruptive feedback or the\nstatus of an action without breaking their workflow.\n\n#### Components\n\n- [Notification](/components/notification/usage)\n\n#### Patterns\n\n- [Dialogs](/patterns/dialog-pattern)\n- [Notifications](/patterns/notification-pattern)\n\n## Feedback\n\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\n[GitHub](https://github.com/carbon-design-system/carbon-website/issues/new?assignees=&labels=feedback&template=feedback.md).\n\n[Edit this page on GitHub](https://github.com/carbon-design-system/carbon-website/edit/main/src/pages/components/modal/usage.mdx)\n\n[Previous\n\nComponents: Menu buttons](/components/menu-buttons/usage/)\n\n[Next\n\nModal: Style](/components/modal/style/)",
  "tags": [
    "ibm",
    "carbon",
    "design-system",
    "enterprise"
  ],
  "extracted_at": "2026-02-03T14:19:24.240237+00:00",
  "content_length": 16838,
  "content_hash": "305b3c4528d07edf"
}