{
  "id": "carbon-design__components_notification_usage_",
  "source_id": "carbon-design",
  "source_name": "IBM Carbon Design System",
  "category": "design_systems",
  "url": "https://carbondesignsystem.com/components/notification/usage/",
  "title": "Notification",
  "content": "Notification\nFeature flag\nNotifications are messages that communicate information to the user. The four\nvariants of notifications are toast, inline, actionable, and callout.\nLive demo\nOverview\nFormatting\nContent\nInline\nToast\nActionable\nCallout\nUniversal behaviors\nModifiers\nRelated\nFeedback\nLive demo\nTheme selector\nWhite\nVariant selector\nActionable\nThis live demo contains only a preview of functionality and styles available for this component. View the\nfull demo\non Storybook for additional information such as its version, controls, and API documentation.\nAccessibility testing status\nFor every latest release, Carbon runs tests on all components to meet the\naccessibility requirements\n. These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\nDefault state\nTested\nAdvanced states\nTested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nOverview\nNotifications provide a method for communicating with users and sharing\nfeedback. They come in four statuses which when combined with the right variants\nmake notifications that are relevant, timely, and informative for each use case.\nTheir status signifies the purpose of the information being conveyed and allow\nyou to tailor the disruptiveness of the notification to the specific situation.\nWhen to use\nUse notifications to inform users of updates or changes to system status.\nCommunicating with users and providing immediate feedback are important for\nbuilding trust. While notifications are an effective method of communicating\nwith users, they are disruptive and should be used sparingly.\nFor more context on when to use each notification variant, including modals,\nrefer to the\nnotifications pattern\n. Carbon\nsupports only inline, toast, actionable, and modal notification variants,\nalthough some product teams also support banners and notification centers.\nVariants\nVariant\nPurpose\nInline\nInline notifications show up in task flows, to notify users of the status of an action. They usually appear at the top of the primary content area.\nToast\nToast notifications are non-modal, time-based window elements used to display short messages; they usually appear at the top of the screen and disappear after a few seconds.\nActionable\nActionable notifications allow for interactive elements within a notification styled like an inline or toast notification.\nCallout\nCallouts are used to highlight important information that loads with the contents of the page, is placed contextually, and cannot be dismissed.\nFeature flags\nA\nfeature flag\nhas been added to the\nactionable notification variant to improve accessibility and changes parts of\nits functionality, not its visual appearance. For code-specific feature flag\ninformation, refer to the\nCode\ntab. The\ncurrent actionable notification is not being deprecated, but teams are\nencouraged to use the feature flag notification for their products moving\nforward. Once the next major release (v12) is released in the future, this\nfeature flag will become the default version of the component.\nFormatting\nAnatomy\n1. Inline\nA. Icon\nB. Title\nC. Body content\nD. Close button\n3. Actionable (inline and toast)\nA. Icon\nB. Title\nC. Body content\nD. Close button\nE.\nAction button\n2. Toast\nA. Icon\nB. Title\nC. Body content\nD. Close button\n4. Callout\nA. Icon\nB. Title\nC. Body content\nF. Link\nNotification status\nNotification statuses are designed to convey the emotional tone of the\ninformation being communicated. Each status is associated with a specific color\nand icon, ensuring a consistent and universal user experience\nNotification status for the inline variant\nDeciding what to use\nWhen choosing between the various notification statuses, consider the context\nand the emotion that needs to be conveyed. All notification variants, except for\ncallout, typically serve as feedback after an action or task is completed. The\ncallout variant is unique, as it provides guidance before users begin a task or\ntake action and, therefore, does not include success or error statuses.\nStatus\nUsage\nColor\nIcon\nVariants\nInformational\nProvide additional information to users that may not be tied to their current action or task\nBlue\ninformation filled\nCopy to clipboard\nInline, Toast, Actionable, Callout\nSuccess\nConfirm a task was completed as expected\nGreen\ncheckmark filled\nCopy to clipboard\nInline, Toast, Actionable\nWarning\nInform users that they are taking actions that are not desirable or might have unexpected results\nYellow\nwarning filled\nCopy to clipboard\nInline, Toast, Actionable, Callout\nError\nInform users of an error or critical failure and optionally block the user from proceeding until the issue has been resolved\nRed\nerror filled\nCopy to clipboard\nInline, Toast, Actionable\nContent\nNotifications provide limited space for content and, therefore, the content must\nbe short and concise. Follow the guidance in\nIBM Style - Messages\nand write the message so the user can, by scanning the notification, be apprised\nof the situation and quickly know what to do next.\nMain elements\nTitle\nThe title should be short and descriptive, explaining the most important piece\nof information. For error messages, tell users what stopped or can’t be done\nin the title, for example “Server instance unavailable”.\nDon’t use a period to end a title.\nWhen using rich text, such as in a title, a screen reader will read aloud the\nentire message as one sentence. Because the message will be read as one\nstring, do not depend on text styling to convey meaning.\nBody content\nBe concise; limit the content to one or two short sentences.\nDon’t repeat or paraphrase the title.\nExplain how to resolve the issue by including any troubleshooting actions or\nnext steps. This is what IBM Style calls the “user action”. User actions are\nmandatory for error messages.\nWhen possible, use an actionable notification and include links in the\nnotification body that redirect the user to where they resolve the problem.\nAction button\nKeep labels concise and clearly indicate the action the user can take.\nLimit action labels to one or two words. For a list of recommended action\nlabels, see Carbon’s\ncontent guidelines\n.\nLink\nThey must be descriptive and meaningfully indicate the link’s destination.\nThey don’t necessarily have to be at the end of the sentence—they can also be\nwithin the body content.\nOverflow\nIf a toast or inline notification requires a message that is longer than two\nlines, use an actionable notification and include a short message with a “View\nmore” link that takes the user to a view of the full notification message. This\ndestination can be either a full page with more details or a modal.\nFurther guidance\nFor further content guidance, see Carbon’s\ncontent guidelines\n.\nInline\nInline notifications show up in task flows to notify users of the status of an\naction or system. Inline notifications usually appear at the top of the primary\ncontent area or close to the item needing attention.\nInline formatting\nExamples of inline notification placements across different UI layouts\nSizing\nThe width of inline notifications varies based on content and layout. They can\nexpand to the fill the container or content area they relate to. Their height is\nbased on the content length, which should not exceed two lines of text.\nPlacement\nInline notifications appear near their related items. They can expand to fill\nthe width of the container or content area they are in and should align to the\ngrid columns.\nPlace inline notifications at the bottom of forms, just above the submission and\ncancel buttons. When error notifications apply to individual text inputs, they\nshould supplement the error state on that specific input field.\nExamples of an inline notification supporting an error message on a form\nDismissal\nInline notifications do not dismiss automatically. They persist on the page\nuntil the user dismisses them or takes action that resolves the notification.\nA small “x” in the top right corner is used to dismiss inline notifications.\nIncluding the close button is optional and should not be included if it is\ncritical for a user to read or interact with the notification.\nToast\nToast notifications are non-modal, time-based window elements used to display\nshort messages; they usually appear at the top of the screen and disappear after\na few seconds.\nToast formatting\nExamples of toast notification placements across different UI layouts\nTime stamp\nToast notifications can include a time stamp at the bottom the container. The\ntime stamp shows the time the notification was sent. Using time stamps is\noptional but toast notifications should be consistent across the product so\neither all toast notifications should include time stamps or none of them\nshould. The time stamp is optional and can be removed if a third line of content\nis needed.\nSizing\nToast notifications use a fixed width and their height depends on the length of\nthe notification message. As noted in the content guidelines, limit toast\nnotifications to two lines of text.\nPlacement\nToast notifications slide in and out from the top right of the screen. They\nstack with\n$spacing-03\nCopy to clipboard\nin-between. New toast notifications should appear at\nthe top of the list, with older notifications being pushed down until they are\ndismissed.\nDismissal\nToast notifications persist by default, but they can timeout and be coded to\ndismiss automatically after five seconds on the screen. They can also include a\nclose button so users can dismiss them sooner. Toast notifications cover content\non the screen so they should always be easily dismissed. Because toast\nnotifications can dismiss automatically, users should be able to access them\nelsewhere after the toast notification disappears if they need more time to read\nthe notification or who want to refer to it later.\nActionable\nActionable notifications are inline or toast notifications that have interactive\nelements. Because actionable notifications require user interaction, actionable\nnotifications come into focus when triggered and, therefore, they disrupt screen\nreaders and keyboard users. Only one action is allowed for each notification,\nand this action frequently takes users to a flow or page related to the message\nwhere they can resolve the notification.\nConsider using a notification center where a user can revisit and act on past\nnotifications.\nFormatting\nInline\nActionable inline notifications have a ghost button action that is adjacent to\nthe title and body content. On mobile screens the action button wraps under the\nbody content. This button should allow users to take further action on the\nnotification.\nToast\nActionable toast notifications can include a tertiary button at the end of their\nbody content. This button should be short and should take users to a page or\nmodal where they can take action to address the notification or find further\ninformation. Because toast notifications automatically dismiss, ensure there are\nalternative routes to navigate to the link destination.\nActionable toast notification (top); actionable inline notification (bottom)\nDismissal\nActionable notifications persist until a user dismisses them. If you’re using\ninline styling, refer to\ninline notifications\nfor\ninline dismissal. If you’re using toast-notification style for an actionable\nnotification, the notification should remain on screen until the user dismisses\nit. Because the notification remains open, the user has enough time to interact\nwith the button without the toast closing too soon. For more information, see\ntoast notifications\n.\nLinks\nIf needed, actionable notifications can contain links. Links within an\nactionable notification can be used to redirect the user to next steps.\nActions\nIf needed, actionable notifications can include a ghost button for inline\nnotifications or a tertiary button for toast notifications. These action buttons\nenable users to address the notification or navigate to a page for more details.\nCallout\nCallouts are used to highlight important information contextually within the\ncontents of the page, and cannot be dismissed. Unlike other notification\ncomponents they are not triggered by the user or system, rather they load with\nthe contents of the page. They do not act as a feedback mechanism, they are\npersistent, and always present on the screen to provide necessary information to\nthe user.\nCallout can be used within forms, dashboard, articles, etc when there is a need\nto highlight information. It’s designed to draw attention to important\ninformation that can prevent a negative user experience. Additionally, it can be\nused to emphasize details that guide users toward making informed decisions,\nultimately enhancing their overall experience.\nCallout formatting\nStatus\nThe callout variant only includes informational and warning statuses as they are\nprovided to complete a user journey successfully. Hence, it does not include\nsuccess and error statuses present in other notifications, which are reactive\nand provided as feedback after a task has been completed.\nTitle\nThe title can be omitted on callouts when it is redundant and might break the\nflow while reading through the information. Use a title only if it makes it\neasier for people to scan through the content without diverting focus from the\ntask.\nSizing\nThe width of callout varies based on content and layout. They can expand to fill\nthe container or content area they relate to. Their height is based on the\ncontent length.\nAlignment\nAvoid overloading a single page with multiple callouts, and refrain from\nstacking them together. Callout should be used sparingly to emphasize\ninformation that must not be overlooked. For all other content, use a standard\ntext component.\nPlacement\nCallouts are related to a particular page element and should be positioned near\nit to associate them more effectively.\nWith button or input:\nIf important information affects an action, place\nthe callout above the relevant button or input. This highlighted message\nensures that users feel confident about their action before proceeding.\nWith data or information:\nPlace the callout contextually, either before or\nafter the data being viewed by users, depending on what fits best.\nWith inline notification:\nWhen a callout and an inline notification need\nto coexist during a user journey, move the callout above the inline\nnotification and position the short-lived inline notification closer to the\nbutton or input that triggered it.\nExample of how a callout is placed when an inline error notification appears\nDismissal\nUnlike other notifications, callouts do not dismiss because they are used to\nhighlight important information for the user that cannot be dismissed. They are\nalways present on the screen and load with the contents of the page.\nLinks\nIf needed, callouts can contain links. Links on callout should be used only when\nit provides additional context or relevant information necessary for the current\nuser journey. It should not be used to promote navigation to a separate user\njourney.\nActions\nUnlike actionable notifications, callouts do not contain an action button of\ntheir own. Place the callout near an action button instead as they are meant to\ncontextually provide information for users before they take an action.\nUniversal behaviors\nInteractions\nMouse\nA user can close a dismissible notification by clicking the close\nx\nCopy to clipboard\nKeyboard\nFor actionable notifications, the action gets focus first. Use\nTab\nCopy to clipboard\nto move\nbetween action and the close\nx\nCopy to clipboard\n. To close notifications, press\nEnter\nCopy to clipboard\nor\nSpace\nCopy to clipboard\nwhile the close\nx\nCopy to clipboard\nhas focus or use the\nEsc\nCopy to clipboard\nkey.\nScreen readers\nVoiceOver: To close notifications, press\nEnter\nCopy to clipboard\nor\nSpace\nCopy to clipboard\nwhile the close\nx\nCopy to clipboard\nhas focus or use the\nEsc\nCopy to clipboard\nkey.\nJAWS: To close notifications, press\nEnter\nCopy to clipboard\nor\nSpace\nCopy to clipboard\nwhile the close\nx\nCopy to clipboard\nhas\nfocus or use the\nEsc\nCopy to clipboard\nkey.\nNVDA: To close notifications, press\nEnter\nCopy to clipboard\nor\nSpace\nCopy to clipboard\nwhile the close\nx\nCopy to clipboard\nhas\nfocus or use the\nEsc\nCopy to clipboard\nkey.\nModifiers\nHigh and low contrast\nCarbon supports high and low contrast style notifications. High-contrast\nnotifications are best for critical messaging while low-contrast notifications\nare less visually disruptive for users.\nIt’s up to the product team to decide which notification style to use in their\nproduct. Callouts, inline, and toast notifications can use different styles, but\nyou should never mix styles within each notification variant. When in doubt, use\nlow-contrast notifications.\nHigh contrast notification (top); low contrast notification (bottom)\nRelated\nModal component\nNotifications pattern\nInline link\nButton\nForm\nFeedback\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\nGitHub\n.\nEdit this page on GitHub\nPrevious\nComponents: Modal\nNext\nNotification: Style",
  "content_markdown": "# Notification\n\nFeature flag\n\nNotifications are messages that communicate information to the user. The four\nvariants of notifications are toast, inline, actionable, and callout.\n\n- [Live demo](#live-demo)\n- [Overview](#overview)\n- [Formatting](#formatting)\n- [Content](#content)\n- [Inline](#inline)\n- [Toast](#toast)\n- [Actionable](#actionable)\n- [Callout](#callout)\n- [Universal behaviors](#universal-behaviors)\n- [Modifiers](#modifiers)\n- [Related](#related)\n- [Feedback](#feedback)\n\n## Live demo\n\nTheme selector\n\nWhite\n\n---\n\nVariant selector\n\nActionable\n\n---\n\nThis live demo contains only a preview of functionality and styles available for this component. View the [full demo](https://react.carbondesignsystem.com/?path=/story/components-notifications-actionable--default&globals=theme:white) on Storybook for additional information such as its version, controls, and API documentation.\n\n### Accessibility testing status For every latest release, Carbon runs tests on all components to meet the [accessibility requirements](https://www.ibm.com/able/requirements/requirements/). These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n## Overview\n\nNotifications provide a method for communicating with users and sharing\nfeedback. They come in four statuses which when combined with the right variants\nmake notifications that are relevant, timely, and informative for each use case.\nTheir status signifies the purpose of the information being conveyed and allow\nyou to tailor the disruptiveness of the notification to the specific situation.\n\n### When to use\n\nUse notifications to inform users of updates or changes to system status.\nCommunicating with users and providing immediate feedback are important for\nbuilding trust. While notifications are an effective method of communicating\nwith users, they are disruptive and should be used sparingly.\n\nFor more context on when to use each notification variant, including modals,\nrefer to the [notifications pattern](/patterns/notification-pattern/). Carbon\nsupports only inline, toast, actionable, and modal notification variants,\nalthough some product teams also support banners and notification centers.\n\n### Variants\n\n| Variant | Purpose |\n| --- | --- |\n| [Inline](#inline) | Inline notifications show up in task flows, to notify users of the status of an action. They usually appear at the top of the primary content area. |\n| [Toast](#toast) | Toast notifications are non-modal, time-based window elements used to display short messages; they usually appear at the top of the screen and disappear after a few seconds. |\n| [Actionable](#actionable) | Actionable notifications allow for interactive elements within a notification styled like an inline or toast notification. |\n| [Callout](#callout) | Callouts are used to highlight important information that loads with the contents of the page, is placed contextually, and cannot be dismissed. |\n\n### Feature flags\n\nA [feature flag](/components/overview/feature-flags/) has been added to the\nactionable notification variant to improve accessibility and changes parts of\nits functionality, not its visual appearance. For code-specific feature flag\ninformation, refer to the [Code](/components/notification/code/) tab. The\ncurrent actionable notification is not being deprecated, but teams are\nencouraged to use the feature flag notification for their products moving\nforward. Once the next major release (v12) is released in the future, this\nfeature flag will become the default version of the component.\n\n## Formatting\n\n### Anatomy\n\n![notification anatomy image](/static/24a2ef0ff7cb6849ac67dedc6d2a1ef1/3cbba/notification-usage-anatomy.png)\n\n#### 1. Inline\n\nA. Icon   \n B. Title   \n C. Body content   \n D. Close button\n\n#### 3. Actionable (inline and toast)\n\nA. Icon   \n B. Title   \n C. Body content   \n D. Close button   \n E.\nAction button\n\n#### 2. Toast\n\nA. Icon   \n B. Title   \n C. Body content   \n D. Close button\n\n#### 4. Callout\n\nA. Icon   \n B. Title   \n C. Body content   \n F. Link\n\n### Notification status\n\nNotification statuses are designed to convey the emotional tone of the\ninformation being communicated. Each status is associated with a specific color\nand icon, ensuring a consistent and universal user experience\n\n![Example of notification status](/static/5e9d0377294adf0adb2d8d7f6164aa7c/3cbba/1_notification_status_1120.png)\n\nNotification status for the inline variant\n\n  \n Deciding what to use \n\nWhen choosing between the various notification statuses, consider the context\nand the emotion that needs to be conveyed. All notification variants, except for\ncallout, typically serve as feedback after an action or task is completed. The\ncallout variant is unique, as it provides guidance before users begin a task or\ntake action and, therefore, does not include success or error statuses.\n\n| Status | Usage | Color | Icon | Variants |\n| --- | --- | --- | --- | --- |\n| Informational | Provide additional information to users that may not be tied to their current action or task | Blue | ```  information filled ```   Copy to clipboard | Inline, Toast, Actionable, Callout |\n| Success | Confirm a task was completed as expected | Green | ```  checkmark filled ```   Copy to clipboard | Inline, Toast, Actionable |\n| Warning | Inform users that they are taking actions that are not desirable or might have unexpected results | Yellow | ```  warning filled ```   Copy to clipboard | Inline, Toast, Actionable, Callout |\n| Error | Inform users of an error or critical failure and optionally block the user from proceeding until the issue has been resolved | Red | ```  error filled ```   Copy to clipboard | Inline, Toast, Actionable |\n\n## Content\n\nNotifications provide limited space for content and, therefore, the content must\nbe short and concise. Follow the guidance in\n[IBM Style - Messages](https://ibmdocs-test.dcs.ibm.com/docs/en/ibm-style?topic=format-messages)\nand write the message so the user can, by scanning the notification, be apprised\nof the situation and quickly know what to do next.\n\n### Main elements\n\n#### Title\n\n- The title should be short and descriptive, explaining the most important piece\n  of information. For error messages, tell users what stopped or can’t be done\n  in the title, for example “Server instance unavailable”.\n- Don’t use a period to end a title.\n- When using rich text, such as in a title, a screen reader will read aloud the\n  entire message as one sentence. Because the message will be read as one\n  string, do not depend on text styling to convey meaning.\n\n#### Body content\n\n- Be concise; limit the content to one or two short sentences.\n- Don’t repeat or paraphrase the title.\n- Explain how to resolve the issue by including any troubleshooting actions or\n  next steps. This is what IBM Style calls the “user action”. User actions are\n  mandatory for error messages.\n- When possible, use an actionable notification and include links in the\n  notification body that redirect the user to where they resolve the problem.\n\n#### Action button\n\n- Keep labels concise and clearly indicate the action the user can take.\n- Limit action labels to one or two words. For a list of recommended action\n  labels, see Carbon’s\n  [content guidelines](https://www.carbondesignsystem.com/guidelines/content/action-labels).\n\n#### Link\n\n- They must be descriptive and meaningfully indicate the link’s destination.\n- They don’t necessarily have to be at the end of the sentence—they can also be\n  within the body content.\n\n### Overflow\n\nIf a toast or inline notification requires a message that is longer than two\nlines, use an actionable notification and include a short message with a “View\nmore” link that takes the user to a view of the full notification message. This\ndestination can be either a full page with more details or a modal.\n\n### Further guidance\n\nFor further content guidance, see Carbon’s\n[content guidelines](/guidelines/content/overview).\n\n## Inline\n\nInline notifications show up in task flows to notify users of the status of an\naction or system. Inline notifications usually appear at the top of the primary\ncontent area or close to the item needing attention.\n\n### Inline formatting\n\n![Examples of inline notification placements across different UI layouts](/static/b48342a6f1d403d2443b844d33039f35/3cbba/02_notification_format_608.png)\n\nExamples of inline notification placements across different UI layouts\n\n#### Sizing\n\nThe width of inline notifications varies based on content and layout. They can\nexpand to the fill the container or content area they relate to. Their height is\nbased on the content length, which should not exceed two lines of text.\n\n#### Placement\n\nInline notifications appear near their related items. They can expand to fill\nthe width of the container or content area they are in and should align to the\ngrid columns.\n\nPlace inline notifications at the bottom of forms, just above the submission and\ncancel buttons. When error notifications apply to individual text inputs, they\nshould supplement the error state on that specific input field.\n\n![Example of inline notification  supporting an error message on a form](/static/c1611af4edc457e6ec566f0aec3f82e8/3cbba/notification-usage-placement.png)\n\nExamples of an inline notification supporting an error message on a form\n\n### Dismissal\n\nInline notifications do not dismiss automatically. They persist on the page\nuntil the user dismisses them or takes action that resolves the notification.\n\nA small “x” in the top right corner is used to dismiss inline notifications.\nIncluding the close button is optional and should not be included if it is\ncritical for a user to read or interact with the notification.\n\n## Toast\n\nToast notifications are non-modal, time-based window elements used to display\nshort messages; they usually appear at the top of the screen and disappear after\na few seconds.\n\n### Toast formatting\n\n![Examples of toast notification placements across different UI layouts](/static/b4068e395ce4c5cdc937fb438ed76b48/3cbba/04_toast_format_608.png)\n\nExamples of toast notification placements across different UI layouts\n\n#### Time stamp\n\nToast notifications can include a time stamp at the bottom the container. The\ntime stamp shows the time the notification was sent. Using time stamps is\noptional but toast notifications should be consistent across the product so\neither all toast notifications should include time stamps or none of them\nshould. The time stamp is optional and can be removed if a third line of content\nis needed.\n\n#### Sizing\n\nToast notifications use a fixed width and their height depends on the length of\nthe notification message. As noted in the content guidelines, limit toast\nnotifications to two lines of text.\n\n#### Placement\n\nToast notifications slide in and out from the top right of the screen. They\nstack with\n\n```\n$spacing-03\n```\n\nCopy to clipboard\n\nin-between. New toast notifications should appear at\nthe top of the list, with older notifications being pushed down until they are\ndismissed.\n\n![Example of toast notification placement](/68e91360788d30b50cec71d1975cc2a1/notification.gif)\n\n![Example of toast notification placement](/static/0439f61a06d26be343f7754b4443f43c/d2d67/notification.png)\n\n### Dismissal\n\nToast notifications persist by default, but they can timeout and be coded to\ndismiss automatically after five seconds on the screen. They can also include a\nclose button so users can dismiss them sooner. Toast notifications cover content\non the screen so they should always be easily dismissed. Because toast\nnotifications can dismiss automatically, users should be able to access them\nelsewhere after the toast notification disappears if they need more time to read\nthe notification or who want to refer to it later.\n\n## Actionable\n\nActionable notifications are inline or toast notifications that have interactive\nelements. Because actionable notifications require user interaction, actionable\nnotifications come into focus when triggered and, therefore, they disrupt screen\nreaders and keyboard users. Only one action is allowed for each notification,\nand this action frequently takes users to a flow or page related to the message\nwhere they can resolve the notification.\n\nConsider using a notification center where a user can revisit and act on past\nnotifications.\n\n### Formatting\n\n#### Inline\n\nActionable inline notifications have a ghost button action that is adjacent to\nthe title and body content. On mobile screens the action button wraps under the\nbody content. This button should allow users to take further action on the\nnotification.\n\n#### Toast\n\nActionable toast notifications can include a tertiary button at the end of their\nbody content. This button should be short and should take users to a page or\nmodal where they can take action to address the notification or find further\ninformation. Because toast notifications automatically dismiss, ensure there are\nalternative routes to navigate to the link destination.\n\n![Example of actionable notifications](/static/f3e4c07e1de0bb6b72bd85678091e528/3cbba/notification-usage-actionable.png)\n\nActionable toast notification (top); actionable inline notification (bottom)\n\n### Dismissal\n\nActionable notifications persist until a user dismisses them. If you’re using\ninline styling, refer to [inline notifications](#inline-notifications) for\ninline dismissal. If you’re using toast-notification style for an actionable\nnotification, the notification should remain on screen until the user dismisses\nit. Because the notification remains open, the user has enough time to interact\nwith the button without the toast closing too soon. For more information, see\n[toast notifications](#toast-notifications).\n\n### Links\n\nIf needed, actionable notifications can contain links. Links within an\nactionable notification can be used to redirect the user to next steps.\n\n### Actions\n\nIf needed, actionable notifications can include a ghost button for inline\nnotifications or a tertiary button for toast notifications. These action buttons\nenable users to address the notification or navigate to a page for more details.\n\n## Callout\n\nCallouts are used to highlight important information contextually within the\ncontents of the page, and cannot be dismissed. Unlike other notification\ncomponents they are not triggered by the user or system, rather they load with\nthe contents of the page. They do not act as a feedback mechanism, they are\npersistent, and always present on the screen to provide necessary information to\nthe user.\n\nCallout can be used within forms, dashboard, articles, etc when there is a need\nto highlight information. It’s designed to draw attention to important\ninformation that can prevent a negative user experience. Additionally, it can be\nused to emphasize details that guide users toward making informed decisions,\nultimately enhancing their overall experience.\n\n### Callout formatting\n\n![Example of callout usage](/static/0e6765067b8fcf83770b9194b8a116a1/3cbba/notification-usage-microlayouts.png)\n\n#### Status\n\nThe callout variant only includes informational and warning statuses as they are\nprovided to complete a user journey successfully. Hence, it does not include\nsuccess and error statuses present in other notifications, which are reactive\nand provided as feedback after a task has been completed.\n\n#### Title\n\nThe title can be omitted on callouts when it is redundant and might break the\nflow while reading through the information. Use a title only if it makes it\neasier for people to scan through the content without diverting focus from the\ntask.\n\n#### Sizing\n\nThe width of callout varies based on content and layout. They can expand to fill\nthe container or content area they relate to. Their height is based on the\ncontent length.\n\n#### Alignment\n\nAvoid overloading a single page with multiple callouts, and refrain from\nstacking them together. Callout should be used sparingly to emphasize\ninformation that must not be overlooked. For all other content, use a standard\ntext component.\n\n#### Placement\n\nCallouts are related to a particular page element and should be positioned near\nit to associate them more effectively.\n\n- **With button or input:** If important information affects an action, place\n  the callout above the relevant button or input. This highlighted message\n  ensures that users feel confident about their action before proceeding.\n- **With data or information:** Place the callout contextually, either before or\n  after the data being viewed by users, depending on what fits best.\n- **With inline notification:** When a callout and an inline notification need\n  to coexist during a user journey, move the callout above the inline\n  notification and position the short-lived inline notification closer to the\n  button or input that triggered it.\n\n![Example of callout placement](/static/9c5b698e1e4ecb05c3ce5623d4aca907/3cbba/notification-usage-calloutplacement.png)\n\nExample of how a callout is placed when an inline error notification appears\n\n### Dismissal\n\nUnlike other notifications, callouts do not dismiss because they are used to\nhighlight important information for the user that cannot be dismissed. They are\nalways present on the screen and load with the contents of the page.\n\n### Links\n\nIf needed, callouts can contain links. Links on callout should be used only when\nit provides additional context or relevant information necessary for the current\nuser journey. It should not be used to promote navigation to a separate user\njourney.\n\n### Actions\n\nUnlike actionable notifications, callouts do not contain an action button of\ntheir own. Place the callout near an action button instead as they are meant to\ncontextually provide information for users before they take an action.\n\n## Universal behaviors\n\n### Interactions\n\n#### Mouse\n\nA user can close a dismissible notification by clicking the close\n\n```\nx\n```\n\nCopy to clipboard\n\n#### Keyboard\n\nFor actionable notifications, the action gets focus first. Use\n\n```\nTab\n```\n\nCopy to clipboard\n\nto move\nbetween action and the close\n\n```\nx\n```\n\nCopy to clipboard\n\n. To close notifications, press\n\n```\nEnter\n```\n\nCopy to clipboard\n\nor\n\n```\nSpace\n```\n\nCopy to clipboard\n\nwhile the close\n\n```\nx\n```\n\nCopy to clipboard\n\nhas focus or use the\n\n```\nEsc\n```\n\nCopy to clipboard\n\nkey.\n\n#### Screen readers\n\nVoiceOver: To close notifications, press\n\n```\nEnter\n```\n\nCopy to clipboard\n\nor\n\n```\nSpace\n```\n\nCopy to clipboard\n\nwhile the close\n\n```\nx\n```\n\nCopy to clipboard\n\nhas focus or use the\n\n```\nEsc\n```\n\nCopy to clipboard\n\nkey.\n\nJAWS: To close notifications, press\n\n```\nEnter\n```\n\nCopy to clipboard\n\nor\n\n```\nSpace\n```\n\nCopy to clipboard\n\nwhile the close\n\n```\nx\n```\n\nCopy to clipboard\n\nhas\nfocus or use the\n\n```\nEsc\n```\n\nCopy to clipboard\n\nkey.\n\nNVDA: To close notifications, press\n\n```\nEnter\n```\n\nCopy to clipboard\n\nor\n\n```\nSpace\n```\n\nCopy to clipboard\n\nwhile the close\n\n```\nx\n```\n\nCopy to clipboard\n\nhas\nfocus or use the\n\n```\nEsc\n```\n\nCopy to clipboard\n\nkey.\n\n## Modifiers\n\n### High and low contrast\n\nCarbon supports high and low contrast style notifications. High-contrast\nnotifications are best for critical messaging while low-contrast notifications\nare less visually disruptive for users.\n\nIt’s up to the product team to decide which notification style to use in their\nproduct. Callouts, inline, and toast notifications can use different styles, but\nyou should never mix styles within each notification variant. When in doubt, use\nlow-contrast notifications.\n\n![High and low contrast inline notifications](/static/d32a4bac141bc54a5ad6e1b74daeeeba/3cbba/notification-usage-contrast.png)\n\nHigh contrast notification (top); low contrast notification (bottom)\n\n## Related\n\n- [Modal component](https://www.carbondesignsystem.com/components/modal/usage/)\n- [Notifications pattern](https://www.carbondesignsystem.com/patterns/notification-pattern)\n- [Inline link](https://carbondesignsystem.com/components/link/usage/#inline-link)\n- [Button](https://carbondesignsystem.com/components/button/usage/)\n- [Form](https://carbondesignsystem.com/components/form/usage/)\n\n## Feedback\n\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\n[GitHub](https://github.com/carbon-design-system/carbon-website/issues/new?assignees=&labels=feedback&template=feedback.md).\n\n[Edit this page on GitHub](https://github.com/carbon-design-system/carbon-website/edit/main/src/pages/components/notification/usage.mdx)\n\n[Previous\n\nComponents: Modal](/components/modal/usage/)\n\n[Next\n\nNotification: Style](/components/notification/style/)",
  "tags": [
    "ibm",
    "carbon",
    "design-system",
    "enterprise"
  ],
  "extracted_at": "2026-02-03T14:19:26.235339+00:00",
  "content_length": 17047,
  "content_hash": "e132b49e2c9f50cd"
}