{
  "id": "carbon-design__components_tag_usage_",
  "source_id": "carbon-design",
  "source_name": "IBM Carbon Design System",
  "category": "design_systems",
  "url": "https://carbondesignsystem.com/components/tag/usage/",
  "title": "Tag",
  "content": "Tag\nUse tags to label, categorize, or organize items using keywords that describe\nthem.\nTag with AI label\nis now stable. This addition changes the visual appearance of the component and\nintroduces an AI explainability feature when AI is present in the component.\nLive demo\nOverview\nFormatting\nContent\nBehaviors\nRead-only tag\nDismissible tag\nSelectable tag\nOperational tag\nModifiers\nAI presence\nReferences\nFeedback\nLive demo\nTheme selector\nWhite\nVariant selector\nRead-only\nThis live demo contains only a preview of functionality and styles available for this component. View the\nfull demo\non Storybook for additional information such as its version, controls, and API documentation.\nAccessibility testing status\nFor every latest release, Carbon runs tests on all components to meet the\naccessibility requirements\n. These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\nDefault state\nNot tested\nAdvanced states\nTested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nOverview\nTags are components that are often used to label different items, create\ncategorization, filter data, select or deselect options, and include\nfunctionality to disclose several related tags in another view. To support these\ndifferent use cases, tags come in four variants—read-only, dismissible,\nselectable, and operational.\nTags being used in context of a product UI.\nWhen to use\nUse tags when content is mapped to multiple categories, and the user needs a way\nto differentiate between them.\nWhen to use\nUse for categorizing, labeling, or read-only situations\nUse as a method of filtering data on a page, within a component, or in\nconjunction with search capabilities\nUse in a chat flow to make decisions and advance the chat\nUse for creating user-generated custom labeling and use when needing to remove\ncreated labels\nUse to view an overflow of multiple tags, like in a popover, modal, or detail\nview\nWhen not to use\nDo not use tags as links that direct you to an entirely different page or\nlaunch you from a current experience to a separate tab\nAvoid using tags with multiple functions to prevent confusion and reduce\naccidental clicks\nVariants\nVariant\nPurpose\nRead-only tag\nTags that have no interactive functionality and are commonly used for categorizing and labeling.\nDismissible tag\nTags that can be dismissed, closed, or removed. These tags are typically used for filtering and creating user-generated content.\nSelectable tag\nTags that can be selected or deselected and are frequently used as selections that filter data in the context of a page. They also can be used in chat flows to make decisions to advance the chat.\nOperational tag\nWhen interacted with, these tags can disclose additional or overflow tags, like in a popover, modal, or breadcrumb detail view.\nFormatting\nAnatomy\nRead-only, dismissible, selectable, and operational tags are all comprised of a\ncontainer, a text title, and the option to add a decorative icon. Dismissible\ntags include an additional close icon to filter or dismiss a tag. Selectable and\nOperational tags include a container border to indicate at a glance that these\nvariants have increased interactivity and function differently.\nAnatomy of read-only, dismissible, selectable, and operational tags.\n1. Read-only tag\nA. Decorative icon (optional)\nB. Title\nC. Container\n3. Selectable tag\nA. Decorative icon (optional)\nB. Title\nC. Container\nE.\nBorder\n2. Dismissible tag\nA. Decorative icon (optional)\nB. Title\nC. Container\nD.\nClose icon\n4. Operational tag\nA. Decorative icon (optional)\nB. Title\nC. Container\nE.\nBorder\nSizing\nThere are three different tag sizes — small, medium, and large. Use small tags\nin condensed or inline spaces. The medium tag size is the default size and is\nmost commonly used. Use large tags when they are used as a primary task of the\npage or focal point, when you have more screen real estate at your disposal, or\nif the tag lives near other components that are also 32px in height.\nTags shown in small, medium, and large sizes.\nPlacement\nVertically align the tag’s container to the other components or text near it. Do\nnot hang tag containers into grid gutters to vertically align the tag’s titles\nwith other text on the page. When tags are placed in groups, it is recommended\nto have 8px of space between them on the top, bottom, left, and right.\nVertical alignment of a group of tags with other components and text.\nContent\nMain elements\nTitle\nTag titles should be concise and informative.\nTag titles should describe the tag in a few words or be under 20 characters\nwhen possible.\nOnly include long title content in tags when necessary, for instance, when\nthere are user-defined names of categories, system-generated strings of text,\netc.\nOverflow content\nWhen the tag’s title is too long to fit within the available space of the tag\ncontainer, the title can be truncated with an ellipsis. By mouse, the full title\nis disclosed in a browser tooltip on hover. By keyboard, the full title is\ndisclosed on focus in a tooltip. Truncation should be set at the title’s start,\nmiddle, or end, depending on what is best for the given use case.\nTruncated tag title disclosed in a tooltip on hover by mouse and on focus by\nkeyboard.\nAvoid having long tag titles wrap to multiple lines within the tag container.\nThis can construe the shape of the tag and integrity of a traditional tag shape,\nwhich should be compact in form. It can also create misalignment with other tags\nif they are placed within a group.\nDo use a browser tooltip to show the full length of overflow tag title text.\nDo not wrap overflow tag title text to multiple lines.\nFurther guidance\nFor further content guidance, see Carbon’s\ncontent guidelines\n.\nBehaviors\nStates\nThe four tag variants have different states:\nRead-only tags:\nenabled, disabled, and skeleton\nDismissible tags\nand\noperational tags:\nenabled, hover, focus, on\nclick, disabled, and skeleton\nSelectable tags:\nenabled, hover, focus, selected, disabled, and skeleton\nFor more information on tag states, see the\nstyle tab\n.\nState\nWhen to use\nEnabled\nWhen a tag is live but a user is not directly interacting with it. This is commonly referred to as the default or normal state of the component.\nHover\nWhen a user is hovering over the tag with the mouse cursor to interact with it (except read-only tags).\nFocus\nWhen a user presses tab or clicks on the tag, it becomes focused, indicating the user has successfully navigated to the component (except read-only tags).\nOn click\nWhen a user presses enters, space, or clicks on the tag to either dismiss it or disclose a list of additional tags.\nSelected\nWhen a user presses enter, space, or clicks on the tag to select it or deselect it.\nDisabled\nWhen a user is not allowed to interact with the tag due to either permissions, dependencies, or pre-requisites. The disabled state completely removes the interactive function from a component. The styling is not subject to WCAG contrast compliance.\nInteractions\nMouse\nRead-only tags: Do not get mouse functionality besides a mouse cursor on hover\nand do not have interactive functionality.\nDismissible tags: Receive a mouse cursor when hovering over the title area of\nthe tag. When hovering over the close icon, the icon gets a background color\nchange and a mouse pointer. Once the close icon area is clicked, the tag will be\ndismissed, closed, or removed.\nSelectable tags: Receive a full background color change and mouse pointer on\nhover. Clicking anywhere on the tag will put it in a selected state. Once in the\nselected state, clicking anywhere on the tag again will deselect it.\nOperational tags: Receive a background color change and mouse pointer on hover.\nClicking anywhere on the tag will disclose a way of viewing more related tags in\neither a popover, modal, or breadcrumb view.\nKeyboard\nRead-only tags: Can not be operated by a keyboard and have no interactive\nfunctionality.\nDismissible tags: Receive focus on the close icon area by pressing the\nTab\nCopy to clipboard\nkey. Pressing the\nEnter\nCopy to clipboard\nor\nSpace\nCopy to clipboard\nkeys will dismiss, close, or remove the\ntag.\nSelectable tags: The container receives focus by pressing the\nTab\nCopy to clipboard\nkey.\nPressing the\nEnter\nCopy to clipboard\nor\nSpace\nCopy to clipboard\nkeys will select or deselect the tag. If\nnavigating in a group of tags, use the\nTab\nCopy to clipboard\nkey to move focus to different tags\nin the group.\nOperational tags: The container receives focus by pressing the\nTab\nCopy to clipboard\nkey.\nPressing the\nEnter\nCopy to clipboard\nor\nSpace\nCopy to clipboard\nkeys will disclose additional related tags, in a\npopover, modal, or breadcrumb view.\nClickable areas\nRead-only tags are not clickable and can not be interacted with. Dismissible\ntags have a clickable area around the close icon to dismiss or close the tag.\nSelectable and operational tags containers are clickable to either select the\ntag or view more tags.\nRead-only, dismissible, selectable, and operational tags with their clickable\nareas.\nRead-only tag\nRead-only tags are used to categorize, are used for labeling, and do not have\ninteractive functionality. Read-only tags come in several color choices and can\nuse optional decorative icons to delineate between multiple categories.\nRead-only tags in the context of a product UI.\nIf your design intends to use tags as labels or for categorization, use\nmodifiers like colors or icons to help indicate this differentiation.\nDo use colors to help distinguish between different tag labels or categories for easier scanning.\nDo not use the same color for every tag if they are supposed to be used as labels or categories.\nDismissible tag\nDismissible tags allow users to dismiss, close, or remove a tag. Dismissible\ntags are commonly used with the search component to search or filter keywords on\na page or within sections of a page.\nDismissible tags can also be used as user-generated labels that are applied to\ninstances and can be removed later if needed. Do not use a dismissible tag if\nthe intention for it is to remain persistent at all times since they can be\nclosed or dismissed by the user.\nDismissible tags in the context of a product UI.\nSelectable tag\nSelectable tags give users the ability to select or deselect them. They can be\nused in a form containing only tags as the selection method, in a chat to make\ndecisions and forward the chat, and can be used as selections to filter content\non a page or within a component.\nIn some cases, selectable tags can be an alternative to traditional form\ncomponents when the entire form consistently uses tags as its form selection\nstyle. Selectable tags can be used for multi-selection or single-selection use\ncases. These tags should always remain in high contrast to ensure a noticeable\ndifference between selected and unselected tags.\nSelectable tags in the context of a product UI.\nWhen selectable tags are in groups, we recommend using horizontal alignment for\neasier scanning when there are only a few tags. Keep groups of tags horizontally\non one line when there are six tags or less. Horizontal alignment is not\nrecommended when there are many tags to select from in a group. Tags should wrap\nto form another line if there are too many to arrange horizontally on one line.\nIf the number of tags exceeds five lines of wrapping, consider using a different\ncomponent for your use case, like a\nmulti-select dropdown\n.\nDo wrap tags in a group to a few multiple lines.\nDo not wrap tags in a group of more than five lines.\nOperational tag\nOperational tags enable the user to see a more comprehensive view of all tags\ndisclosed in a popover, or breadcrumb detail view. Do not use tags as links that\ndirect you to an entirely different page or launch you from a current experience\nto a separate tab.\nOperational tags in the context of a product UI.\nModifiers\nDecorative icons\nDecorative icons lead before the tag title. Decorative icons are optional and\nare often used to support the tag title visually. We recommend not using\ndecorative icons in the small tag size where there is compact spacing, which\ncould create possible visual tension between some icon shapes and tags with\nborders.\nTags with decorative icons.\nTag colors\nRead-only, dismissible, and operational tags come in a variety of different\ncolors, with values from the IBM Design Language\ncolor palette\nusing\ncomponent tokens\n. It is\nrecommended to use multiple colors to denote different categories or labels.\nSelectable tags are unavailable in these colors; instead, they use\ncore tokens\n.\nRead-only using component color tokens and selectable tags using core color\ntokens.\nAI presence\nTag has a modification that embeds the AI label when AI is present in the\ncomponent. The AI variants function the same as the normal versions except with\nthe addition of the inline AI label which is both a visual indicator and the\ntrigger for the explainability popover. Read-only and dismissible tags are the\nonly tag variants that allow for the interactive AI label.\nFor more information on designing for AI, see the\nCarbon for AI\nguidelines.\nRead-only AI tag (top), dismissible tag (bottom)\nFeedback\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\nGitHub\n.\nEdit this page on GitHub\nPrevious\nComponents: Tabs\nNext\nTag: Style",
  "content_markdown": "# Tag\n\nUse tags to label, categorize, or organize items using keywords that describe\nthem.\n\n[Tag with AI label](https://react.carbondesignsystem.com/?path=/story/components-tag--with-ai-label)\nis now stable. This addition changes the visual appearance of the component and\nintroduces an AI explainability feature when AI is present in the component.\n\n- [Live demo](#live-demo)\n- [Overview](#overview)\n- [Formatting](#formatting)\n- [Content](#content)\n- [Behaviors](#behaviors)\n- [Read-only tag](#read-only-tag)\n- [Dismissible tag](#dismissible-tag)\n- [Selectable tag](#selectable-tag)\n- [Operational tag](#operational-tag)\n- [Modifiers](#modifiers)\n- [AI presence](#ai-presence)\n- [References](#references)\n- [Feedback](#feedback)\n\n## Live demo\n\nTheme selector\n\nWhite\n\n---\n\nVariant selector\n\nRead-only\n\n---\n\nThis live demo contains only a preview of functionality and styles available for this component. View the [full demo](https://react.carbondesignsystem.com/?path=/story/components-tag--read-only&globals=theme:white) on Storybook for additional information such as its version, controls, and API documentation.\n\n### Accessibility testing status For every latest release, Carbon runs tests on all components to meet the [accessibility requirements](https://www.ibm.com/able/requirements/requirements/). These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\n\n[##### Default state\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n## Overview\n\nTags are components that are often used to label different items, create\ncategorization, filter data, select or deselect options, and include\nfunctionality to disclose several related tags in another view. To support these\ndifferent use cases, tags come in four variants—read-only, dismissible,\nselectable, and operational.\n\n![Tags being used in context of a product UI.](/static/09790f7896b01ef63c0d7d95b1b347a2/3cbba/tag-usage-overview.png)\n\nTags being used in context of a product UI.\n\n### When to use\n\nUse tags when content is mapped to multiple categories, and the user needs a way\nto differentiate between them.\n\n### When to use\n\n- Use for categorizing, labeling, or read-only situations\n- Use as a method of filtering data on a page, within a component, or in\n  conjunction with search capabilities\n- Use in a chat flow to make decisions and advance the chat\n- Use for creating user-generated custom labeling and use when needing to remove\n  created labels\n- Use to view an overflow of multiple tags, like in a popover, modal, or detail\n  view\n\n### When not to use\n\n- Do not use tags as links that direct you to an entirely different page or\n  launch you from a current experience to a separate tab\n- Avoid using tags with multiple functions to prevent confusion and reduce\n  accidental clicks\n\n### Variants\n\n| Variant | Purpose |\n| --- | --- |\n| [Read-only tag](#read-only-tag) | Tags that have no interactive functionality and are commonly used for categorizing and labeling. |\n| [Dismissible tag](#dismissible-tag) | Tags that can be dismissed, closed, or removed. These tags are typically used for filtering and creating user-generated content. |\n| [Selectable tag](#selectable-tag) | Tags that can be selected or deselected and are frequently used as selections that filter data in the context of a page. They also can be used in chat flows to make decisions to advance the chat. |\n| [Operational tag](#operational-tag) | When interacted with, these tags can disclose additional or overflow tags, like in a popover, modal, or breadcrumb detail view. |\n\n## Formatting\n\n### Anatomy\n\nRead-only, dismissible, selectable, and operational tags are all comprised of a\ncontainer, a text title, and the option to add a decorative icon. Dismissible\ntags include an additional close icon to filter or dismiss a tag. Selectable and\nOperational tags include a container border to indicate at a glance that these\nvariants have increased interactivity and function differently.\n\n![Anatomy of read-only, dismissible, selectable, and operational tags.](/static/a9249fb3fa733cb572bcd0dba806f190/3cbba/tag-usage-anatomy.png)\n\nAnatomy of read-only, dismissible, selectable, and operational tags.\n\n#### 1. Read-only tag\n\nA. Decorative icon (optional)   \n B. Title   \n C. Container\n\n#### 3. Selectable tag\n\nA. Decorative icon (optional)   \n B. Title   \n C. Container   \n E.\nBorder\n\n#### 2. Dismissible tag\n\nA. Decorative icon (optional)   \n B. Title   \n C. Container   \n D.\nClose icon\n\n#### 4. Operational tag\n\nA. Decorative icon (optional)   \n B. Title   \n C. Container   \n E.\nBorder\n\n### Sizing\n\nThere are three different tag sizes — small, medium, and large. Use small tags\nin condensed or inline spaces. The medium tag size is the default size and is\nmost commonly used. Use large tags when they are used as a primary task of the\npage or focal point, when you have more screen real estate at your disposal, or\nif the tag lives near other components that are also 32px in height.\n\n![Tags shown in small, medium, and large sizes.](/static/7b84fc92109c793879e5cc2c5cfa70c7/3cbba/tag-usage-sizing.png)\n\nTags shown in small, medium, and large sizes.\n\n### Placement\n\nVertically align the tag’s container to the other components or text near it. Do\nnot hang tag containers into grid gutters to vertically align the tag’s titles\nwith other text on the page. When tags are placed in groups, it is recommended\nto have 8px of space between them on the top, bottom, left, and right.\n\n![Vertical alignment of a group of tags with other components and text.](/static/7c51333143046b9313a76a1ca7997202/3cbba/tag-usage-placement.png)\n\nVertical alignment of a group of tags with other components and text.\n\n## Content\n\n### Main elements\n\n#### Title\n\n- Tag titles should be concise and informative.\n- Tag titles should describe the tag in a few words or be under 20 characters\n  when possible.\n- Only include long title content in tags when necessary, for instance, when\n  there are user-defined names of categories, system-generated strings of text,\n  etc.\n\n### Overflow content\n\nWhen the tag’s title is too long to fit within the available space of the tag\ncontainer, the title can be truncated with an ellipsis. By mouse, the full title\nis disclosed in a browser tooltip on hover. By keyboard, the full title is\ndisclosed on focus in a tooltip. Truncation should be set at the title’s start,\nmiddle, or end, depending on what is best for the given use case.\n\n![Truncated tag title disclosed in a tooltip on hover by mouse and on focus by keyboard.](/static/02fa1ca6ba37505521803980b3126222/3cbba/tag-usage-overflow.png)\n\nTruncated tag title disclosed in a tooltip on hover by mouse and on focus by\nkeyboard.\n\nAvoid having long tag titles wrap to multiple lines within the tag container.\nThis can construe the shape of the tag and integrity of a traditional tag shape,\nwhich should be compact in form. It can also create misalignment with other tags\nif they are placed within a group.\n\n![Do use a browser tooltip to show the full length of overflow tag title text.](/static/e3956a7a1e53ef511bcdffe3a83b1a09/a5df1/tag-usage-overflow-do.png)\n\nDo use a browser tooltip to show the full length of overflow tag title text.\n\n![Do not wrap overflow tag title text to multiple lines.](/static/ebe5086c653356463742149f1d09a108/a5df1/tag-usage-overflow-dont.png)\n\nDo not wrap overflow tag title text to multiple lines.\n\n### Further guidance\n\nFor further content guidance, see Carbon’s\n[content guidelines](https://carbondesignsystem.com/guidelines/content/overview/).\n\n## Behaviors\n\n### States\n\nThe four tag variants have different states:\n\n- **Read-only tags:** enabled, disabled, and skeleton\n- **Dismissible tags** and **operational tags:** enabled, hover, focus, on\n  click, disabled, and skeleton\n- **Selectable tags:** enabled, hover, focus, selected, disabled, and skeleton\n\nFor more information on tag states, see the\n[style tab](https://carbondesignsystem.com/components/tag/style).\n\n| State | When to use |\n| --- | --- |\n| *Enabled* | When a tag is live but a user is not directly interacting with it. This is commonly referred to as the default or normal state of the component. |\n| *Hover* | When a user is hovering over the tag with the mouse cursor to interact with it (except read-only tags). |\n| *Focus* | When a user presses tab or clicks on the tag, it becomes focused, indicating the user has successfully navigated to the component (except read-only tags). |\n| *On click* | When a user presses enters, space, or clicks on the tag to either dismiss it or disclose a list of additional tags. |\n| *Selected* | When a user presses enter, space, or clicks on the tag to select it or deselect it. |\n| *Disabled* | When a user is not allowed to interact with the tag due to either permissions, dependencies, or pre-requisites. The disabled state completely removes the interactive function from a component. The styling is not subject to WCAG contrast compliance. |\n\n### Interactions\n\n#### Mouse\n\nRead-only tags: Do not get mouse functionality besides a mouse cursor on hover\nand do not have interactive functionality.\n\nDismissible tags: Receive a mouse cursor when hovering over the title area of\nthe tag. When hovering over the close icon, the icon gets a background color\nchange and a mouse pointer. Once the close icon area is clicked, the tag will be\ndismissed, closed, or removed.\n\nSelectable tags: Receive a full background color change and mouse pointer on\nhover. Clicking anywhere on the tag will put it in a selected state. Once in the\nselected state, clicking anywhere on the tag again will deselect it.\n\nOperational tags: Receive a background color change and mouse pointer on hover.\nClicking anywhere on the tag will disclose a way of viewing more related tags in\neither a popover, modal, or breadcrumb view.\n\n#### Keyboard\n\nRead-only tags: Can not be operated by a keyboard and have no interactive\nfunctionality.\n\nDismissible tags: Receive focus on the close icon area by pressing the\n\n```\nTab\n```\n\nCopy to clipboard\n\nkey. Pressing the\n\n```\nEnter\n```\n\nCopy to clipboard\n\nor\n\n```\nSpace\n```\n\nCopy to clipboard\n\nkeys will dismiss, close, or remove the\ntag.\n\nSelectable tags: The container receives focus by pressing the\n\n```\nTab\n```\n\nCopy to clipboard\n\nkey.\nPressing the\n\n```\nEnter\n```\n\nCopy to clipboard\n\nor\n\n```\nSpace\n```\n\nCopy to clipboard\n\nkeys will select or deselect the tag. If\nnavigating in a group of tags, use the\n\n```\nTab\n```\n\nCopy to clipboard\n\nkey to move focus to different tags\nin the group.\n\nOperational tags: The container receives focus by pressing the\n\n```\nTab\n```\n\nCopy to clipboard\n\nkey.\nPressing the\n\n```\nEnter\n```\n\nCopy to clipboard\n\nor\n\n```\nSpace\n```\n\nCopy to clipboard\n\nkeys will disclose additional related tags, in a\npopover, modal, or breadcrumb view.\n\n### Clickable areas\n\nRead-only tags are not clickable and can not be interacted with. Dismissible\ntags have a clickable area around the close icon to dismiss or close the tag.\nSelectable and operational tags containers are clickable to either select the\ntag or view more tags.\n\n![Read-only, dismissible, selectable, and operational tags with their clickable areas.](/static/eece9ee6d58738bb64641fde1a34f75b/3cbba/tag-usage-clickable-areas.png)\n\nRead-only, dismissible, selectable, and operational tags with their clickable\nareas.\n\n## Read-only tag\n\nRead-only tags are used to categorize, are used for labeling, and do not have\ninteractive functionality. Read-only tags come in several color choices and can\nuse optional decorative icons to delineate between multiple categories.\n\n![Read-only tags in the context of a product UI.](/static/157b14dc7e73d968728c0404a43b929d/3cbba/tag-usage-read-only.png)\n\nRead-only tags in the context of a product UI.\n\nIf your design intends to use tags as labels or for categorization, use\nmodifiers like colors or icons to help indicate this differentiation.\n\n![Do use colors to help distinguish between different tag labels or categories for easier scanning.](/static/fee759c7b5d0458285847ea511a50e77/a5df1/tag-usage-read-only-colors-do.png)\n\nDo use colors to help distinguish between different tag labels or categories for easier scanning.\n\n![Do not use the same color for every tag if they are supposed to be used as labels or categories.](/static/04c4228e0f562772e044a6f6a6fcbd1d/a5df1/tag-usage-read-only-colors-dont.png)\n\nDo not use the same color for every tag if they are supposed to be used as labels or categories.\n\n## Dismissible tag\n\nDismissible tags allow users to dismiss, close, or remove a tag. Dismissible\ntags are commonly used with the search component to search or filter keywords on\na page or within sections of a page.\n\nDismissible tags can also be used as user-generated labels that are applied to\ninstances and can be removed later if needed. Do not use a dismissible tag if\nthe intention for it is to remain persistent at all times since they can be\nclosed or dismissed by the user.\n\n![Dismissible tags in the context of a product UI.](/static/d6ade30df8c2b59d69bf3906cb091f15/3cbba/tag-usage-dismissable.png)\n\nDismissible tags in the context of a product UI.\n\n## Selectable tag\n\nSelectable tags give users the ability to select or deselect them. They can be\nused in a form containing only tags as the selection method, in a chat to make\ndecisions and forward the chat, and can be used as selections to filter content\non a page or within a component.\n\nIn some cases, selectable tags can be an alternative to traditional form\ncomponents when the entire form consistently uses tags as its form selection\nstyle. Selectable tags can be used for multi-selection or single-selection use\ncases. These tags should always remain in high contrast to ensure a noticeable\ndifference between selected and unselected tags.\n\n![Selectable tags in the context of a product UI.](/static/33fc39f1894a908a3372837ab1905a7a/3cbba/tag-usage-selectable.png)\n\nSelectable tags in the context of a product UI.\n\nWhen selectable tags are in groups, we recommend using horizontal alignment for\neasier scanning when there are only a few tags. Keep groups of tags horizontally\non one line when there are six tags or less. Horizontal alignment is not\nrecommended when there are many tags to select from in a group. Tags should wrap\nto form another line if there are too many to arrange horizontally on one line.\nIf the number of tags exceeds five lines of wrapping, consider using a different\ncomponent for your use case, like a\n[multi-select dropdown](https://carbondesignsystem.com/components/dropdown/usage/#multiselect).\n\n![Do wrap tags in a group to a few multiple lines when possible.](/static/d3eaa5d94ec547de82e0473ec499b633/a5df1/tag-usage-selectable-wrap-do.png)\n\nDo wrap tags in a group to a few multiple lines.\n\n![Do not wrap tags in a group of more than five lines when possible.](/static/010240c938f6d901cc66eaad4b13231d/a5df1/tag-usage-selectable-wrap-dont.png)\n\nDo not wrap tags in a group of more than five lines.\n\n## Operational tag\n\nOperational tags enable the user to see a more comprehensive view of all tags\ndisclosed in a popover, or breadcrumb detail view. Do not use tags as links that\ndirect you to an entirely different page or launch you from a current experience\nto a separate tab.\n\n![Operational tags in the context of a product UI.](/static/e3d1f3b6b4d42cb78892fb2b1622781c/3cbba/tag-usage-operational.png)\n\nOperational tags in the context of a product UI.\n\n## Modifiers\n\n### Decorative icons\n\nDecorative icons lead before the tag title. Decorative icons are optional and\nare often used to support the tag title visually. We recommend not using\ndecorative icons in the small tag size where there is compact spacing, which\ncould create possible visual tension between some icon shapes and tags with\nborders.\n\n![Tags with decorative icons.](/static/79f5abe17a3446b6407a84adafa3edb2/3cbba/tag-usage-decorative-icons.png)\n\nTags with decorative icons.\n\n### Tag colors\n\nRead-only, dismissible, and operational tags come in a variety of different\ncolors, with values from the IBM Design Language\n[color palette](https://www.ibm.com/design/language/color) using\n[component tokens](https://carbondesignsystem.com/elements/color/tokens). It is\nrecommended to use multiple colors to denote different categories or labels.\nSelectable tags are unavailable in these colors; instead, they use\n[core tokens](https://carbondesignsystem.com/elements/color/overview#core-tokens).\n\n![Read-only using component color tokens and selectable tags using core color tokens.](/static/41e9d386a16e50074390fa9010c9897c/3cbba/tag-usage-colors.png)\n\nRead-only using component color tokens and selectable tags using core color\ntokens.\n\n## AI presence\n\nTag has a modification that embeds the AI label when AI is present in the\ncomponent. The AI variants function the same as the normal versions except with\nthe addition of the inline AI label which is both a visual indicator and the\ntrigger for the explainability popover. Read-only and dismissible tags are the\nonly tag variants that allow for the interactive AI label.\n\nFor more information on designing for AI, see the\n[Carbon for AI](/guidelines/carbon-for-ai/) guidelines.\n\n![Example of AI labels in tags.](/static/b148db125f84c7568cbe8e44a715ea06/3cbba/tag-usage-ai-presence.png)\n\nRead-only AI tag (top), dismissible tag (bottom)\n\n## Feedback\n\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\n[GitHub](https://github.com/carbon-design-system/carbon-website/issues/new?assignees=&labels=feedback&template=feedback.md).\n\n[Edit this page on GitHub](https://github.com/carbon-design-system/carbon-website/edit/main/src/pages/components/tag/usage.mdx)\n\n[Previous\n\nComponents: Tabs](/components/tabs/usage/)\n\n[Next\n\nTag: Style](/components/tag/style/)",
  "tags": [
    "ibm",
    "carbon",
    "design-system",
    "enterprise"
  ],
  "extracted_at": "2026-02-03T14:19:48.906881+00:00",
  "content_length": 13339,
  "content_hash": "3b455e639a9d6055"
}