{
  "id": "carbon-design__components_text-input_usage_",
  "source_id": "carbon-design",
  "source_name": "IBM Carbon Design System",
  "category": "design_systems",
  "url": "https://carbondesignsystem.com/components/text-input/usage/",
  "title": "Text input",
  "content": "Text input\nText inputs enable users to enter free-form text data. You can use them for long\nand short-form entries.\nText input\nand\ntext area\nwith AI label are now stable. These additions change the visual appearance of\nthe components and introduces an AI explainability feature when AI is present in\nthe components. See the\nAI presence\nsection for more details.\nLive demo\nOverview\nText input\nText area\nFormatting\nContent\nUniversal behaviors\nModifiers\nAI Presence\nRelated\nFeedback\nLive demo\nTheme selector\nWhite\nVariant selector\nDefault\nThis live demo contains only a preview of functionality and styles available for this component. View the\nfull demo\non Storybook for additional information such as its version, controls, and API documentation.\nAccessibility testing status\nFor every latest release, Carbon runs tests on all components to meet the\naccessibility requirements\n. These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\nVariant\nText input\nDefault state\nTested\nAdvanced states\nTested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nDefault state\nTested\nAdvanced states\nTested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nDefault state\nNot tested\nAdvanced states\nNot tested\nScreen reader\nManually tested\nKeyboard navigation\nNot available\nDefault state\nNot tested\nAdvanced states\nNot tested\nScreen reader\nNot available\nKeyboard navigation\nNot available\nOverview\nText inputs enable users to enter free-form text data. The type of text field\nused should reflect the length of the content you expect the user to enter. The\ndefault text input is for short, one-line content, whereas text area is for\nlonger, multi-line entries.\nWhen to use\nA user needs to input unique information that cannot be predicted with a\npreset of options.\nA user needs to input memorable data that can be entered more quickly in a\nfree-hand format versus a more complex control.\nWhen not to use\nIf a user can only enter an option from a predefined list then avoid using a\nfree-form text input as it is likely to result in an error. Consider using a\nselection control such as a dropdown, select, or radio button group instead.\nVariants\nVariant\nPurpose\nText input\nWhen the expected user input is a single line of text.\nText area\nWhen the expected user input is more than a few words that could span multiple lines.\nText input\nUse a text input when the expected user input is a single line of text. Text\ninputs have a fixed height and are used to enter simple free-form data entries\nwith any combination of letters, numbers, or symbols. There are two styles of\ntext input, default and fluid, which share the same functionality but look\nvisually different. The context of how or where the component is used will\ndictate which style to use.\nStyle\nPurpose\nDefault\nDefault is the most commonly used text input style with the label and helper text outside the field. Use when white space is needed between input components or in productive moments where space is at a premium, and smaller components are needed.\nFluid\nFluid is an alternate styling for text input used in more expressive moments. Use in fluid forms, contained spaces, or attached to complex components, like a toolbar. Fluid components always sit flush with components around them.\nAnatomy\nDefault\nFluid\nLabel\n: Text that informs the user about the content they need to enter in\nthe field. It is required unless you get an approved accessibility exemption.\nValue\n: The content the user has entered into the field.\nField\n: The container in which a user enters data. Must meet 3:1 non-text\ncontrast requirements.\nHelper text\n(optional): Assistive text that can provide additional aid or\ncontext to the user. Often used to explain the correct data format. It is\npositioned below the field in the default style and surfaced through a\ntooltip in the fluid style.\nSizing\nDefault input heights\nThere are three text input height sizes: small, medium, and large. Supporting\nthree sizes gives you more flexibility in structuring layouts. Be sure to use a\nconsistent field height when pairing form components on the same page.\nSize\nHeight (px/rem)\nUse case\nSmall (sm)\n32 / 2\nUse when space is constricted or when placing a text input in a form that is long and complex.\nMedium (md)\n40 / 2.5\nThis is the default size and the most commonly used size. When in doubt, use the medium size.\nLarge (lg)\n48 / 3\nUse when there is a lot of space to work with. The large size is typically used in simple forms or when a text input is placed by itself on a page.\nFluid input heights\nThere is only one fluid input height and it is visually larger than the default\nheights. The input is a set height expect for when a warning or error message\nhas been added to the bottom.\nText area\nUse a text area when the expected user input is more than a few words and could\nspan multiple lines. It is commonly used for features like user commentary or\ndescriptions. It supports all the same states and functionality as text input\nexcept for the password functionality. Text area has several unique\nfunctionalities not included in the text input, like the resize handle, word\ncounter and character counter.\nStyle\nPurpose\nDefault\nDefault is the most commonly used text area style with the label and helper text outside the field. Use when white space is needed between input components or in productive moments where space is at a premium, and smaller components are needed.\nFluid\nFluid is an alternate styling for text area used in more expressive moments. Use in fluid forms, contained spaces, or attached to complex components, like a toolbar. Fluid components always sit flush with components around them.\nAnatomy\nDefault\nFluid\nLabel\n: Text that informs the user about the content they need to enter in\nthe field. It is required unless you get an approved accessibility exemption.\nValue\n: The content the user has entered into the field.\nField\n: The container in which a user enters data. Must meet 3:1 non-text\ncontrast requirements.\nResize handle\n: Allows a user to manipulate the field height by making it\nlonger or shorter.\nOptional versus required indicator\n(optional): This label indicates if\nthe field is optional or required for the user to complete.\nCounter\n(optional)\nCharacter counter: Indicate the number of characters being entered and the\ntotal number of characters allowed.\nWord counter: Indicate the number of words being entered and the total\nnumber of words allowed.\nSizing\nText area has a variable height that can be lengthened or shortened by the user\nusing the resize handle in the bottom right of the field. By default, text area\nhas a minimum height of 40px/2.5rem but no maximum height.\nResize handle\nIncluded by default in both default and fluid text area is the resize handle. It\nallows a user to manipulate the field height by making it longer or shorter. The\nresize handle has no effect on the width of the text area container, it only\neffects the height. If the user makes the field size shorter than the content\ninside the field then a vertical scroll will become available.\nFormatting\nAlignment\nInput labels should vertically align to the grid and with other type elements on\nthe page. The alignment of the input container will differ based on the style of\ntext input you are using. Default inputs are always flush to the columns and\nfluid inputs will hang into the gutters.\nAlign default input containers to the grid so the input label aligns with other type of the page.\nHang fluid input containers into the gutters so the input label aligns with other type of the page.\nPlacement\nThe field widths of both text input and text area should reflect the intended\nlength of the content while still aligning to the grid columns or mini unit\ngrid. Unlike the height, the width of the text area cannot be controlled by the\nuser. There are no minimum or maximum widths but you should avoid excessively\nwide fields that are disproportionate to the intended data being collected.\nDo make text input widths proportional to the content and align to grid columns.\nDo not make text inputs excessively wide just to fill in space.\nAlignment\nLabels and field containers should vertically align to the grid and with other\nform components on a page.\nDo align field containers to the grid.\nDo not align field text to the grid and hang the field in the gutter.\nContent\nMain elements\nLabels\nEffective labeling helps users understand what information to enter into a text\ninput. Text fields should always have a label. There are rare instances were the\ncontext of an input negates the need for a visible label but we advise you\nconsult an accessibility expert before proceeding with a label-less design.\nUse sentence-style capitalization for all labels, except for product names and\nproper nouns.\nKeep the label short and concise.\nDo not use colons after label names.\nHelper text\nOptional helper text is pertinent information that assists the user in correctly\ncompleting a field. It is often used to explain the correct data format.\nUse sentence-style capitalization, and in most cases, write the text as full\nsentences with punctuation.\nWhen used, helper text appears persistently underneath the field, except when\nan error or warning message replaces it.\nPlaceholder text\nOptional placeholder text provides hints or examples of what to enter.\nPlaceholder text disappears after the user begins entering data into the input.\nAs such, it should not be used as a replacement for a persistent label nor\nshould it contain crucial information.\nUse sentence-style capitalization, and in most cases, write the text as a\ndirect statement without punctuation.\nPlaceholder text is not required and by default not shown in text input\nfields.\nPlaceholder text can be harmful to user interactions and should only be added\nwhen necessary.\nOverflow content\nOverflow in a text input\nIf a user’s content is unexpectedly too long for the single line of a text input\nthen the value content can horizontally scroll inside the field container when\nmoving the cursor from one end of the value to the other.\nOverflow in a text area\nIf a user’s content exceeds the vertical space of the variable text area then a\nuser can either expand the field container using the resize handle or they can\nvertically scroll the content inside the set field container.\nFurther guidance\nFor further content guidance, see Carbon’s\ncontent guidelines\n.\nUniversal behaviors\nThe behaviors listed in this section are universal across all variants. For\nbehaviors that are unique to each variant, see each of the component variant\nsections below.\nStates\nThe text input and text area have multiple interactive states:\nenabled\n,\nactive\n,\nfocus\n,\nerror\n,\nwarning\n,\ndisabled\n,\nskeleton\n, and\nread-only\n. For more details on text input and text area interactive states,\nsee the\nstyle tab\n.\nState\nWhen to use\nEnabled\nWhen a text input or text area is live but a user is not directly interacting with it. This is commonly referred to as the default or normal state of the component. An enabled text input field can contain no content, placeholder text, or user generate content.\nActive\nWhen a user is actively typing content into the field.\nFocus\nWhen a user\ntabs\nCopy to clipboard\nto or clicks on the text input or text area, it becomes focused, indicating the user has successfully navigated to the component.\nError\nWhen the user input is invalid or a required text input or text area has not been filled in. It can also be triggered due to a system error. This state requires a user response before data can be submitted or saved.\nWarning\nWhen you need to call the user’s attention to an exception condition. The condition might not be an error but can cause problems if not resolved.\nDisabled\nWhen the user cannot interact with a component and all interactive functions have been removed. Unlike read-only states, disabled states are not focusable, are not read by screen readers, and do not need to pass visual contrast, making them inaccessible if they need to be interpreted.\nSkeleton\nUse on an initial page load to indicate that the text input or text area has not yet fully loaded.\nRead-only\nWhen the user can review but not modify the component. This state removes all interactive functions like the disabled state but can still be focusable, accessible by screen readers, and passes visual contrast for readability.\nValidation\nReal-time validation helps streamline the process and keep data clean when the\nuser fills out forms. Otherwise, validate the text input data when the user\nsubmits the associated form. For complete guidance on error and validation, see\nthe\nform pattern\n.\nInvalid\nAn error state is triggered if the data is invalid or a required field is left\nempty. Error states have three visual indicators to signify invalid content: a\nred border, an error icon indicator, and an error message.\nRequired versus optional\nText inputs can be labeled as either optional or required depending on the\ndepending on the circumstance. For more guidance on requirement labeling, see\nthe\nform pattern\n.\nIf the majority of the fields are required, mark only the optional field labels with (optional).\nIf the majority of the fields are optional, mark only the required field labels with (required).\nInteractions\nMouse\nUsers can activate a text input by clicking on the field container. A separate\nclick is required to activate any additional actions associated with the text\ninput such as a password visibility toggle.\nDefault\nFluid\nKeyboard\nFor additional keyboard interactions, see the\naccessibility tab\n.\nKey\nInteraction\nTab\nBrings focus to the text input.\nEnter\nor\nSpace\nOpens any associated actions added to the input, such as a password visibility toggle.\nEsc\nCloses any associated actions added to the input.\nctrl\nor\nopt\n+\nleft/right arrows\nMoves you word by word inside the field.\nctrl\nor\nopt\n+\nup/down arrows\nRelocates you to the start or end of the input content.\nModifiers\nPassword input\nPassword input is a sub-variant of text input. It is used to collect private\ndata and will hide the characters as a user enters them. A user can choose to\ntoggle on the character visibility by clicking the view icon on the far right of\nthe input field. When using a password input be sure to provide detailed helper\ntext listing any requirements related to the data format, such as types of\ncharacters allowed or date structure.\nCharacter counter\nA character counter can be added to text area to indicate both the number of\ncharacters being entered and the total number of characters allowed. Once the\nmax number of characters is reached the text area should prevent the user from\nentering any additional character and provide messaging to the user that a limit\nhas been met.\nWord counter\nA word counter can be added to text area to indicate both the number of words\nbeing entered and the total number of words allowed. Once the max number of\nwords is reached the text area should prevent the user from entering any\nadditional character and provide messaging to the user that a limit has been\nmet.\nAI presence\nText input and text area have a modification that takes on the AI visual styling\nwhen the AI label is present in the input. The AI variant functions the same as\nthe normal version except with the addition of the AI label which is both a\nvisual indicator and the trigger for the explainability popover.\nFor more information on designing for AI, see the\nCarbon for AI\nguidelines.\nDefault\nFluid\nRevert to AI\nThe text input and text area can toggle between the AI variant and the non-AI\nvariant depending on the user’s interaction. If the user manually overrides the\nAI-suggested content then the input will change from the AI variant to the\nnon-AI variant. Once edited, the user should still be able to switch back to the\ninitially AI generated content via a revert to AI button.\nDefault\nFluid\nRelated\nForm pattern\nFeedback\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\nGitHub\n.\nEdit this page on GitHub\nPrevious\nComponents: Tag\nNext\nText input: Style",
  "content_markdown": "# Text input\n\nText inputs enable users to enter free-form text data. You can use them for long\nand short-form entries.\n\n[Text input](https://react.carbondesignsystem.com/?path=/story/components-textinput--with-ai-label)\nand\n[text area](https://react.carbondesignsystem.com/?path=/story/components-textarea--with-ai-label)\nwith AI label are now stable. These additions change the visual appearance of\nthe components and introduces an AI explainability feature when AI is present in\nthe components. See the [AI presence](/components/text-input/usage/#ai-presence)\nsection for more details.\n\n- [Live demo](#live-demo)\n- [Overview](#overview)\n- [Text input](#text-input)\n- [Text area](#text-area)\n- [Formatting](#formatting)\n- [Content](#content)\n- [Universal behaviors](#universal-behaviors)\n- [Modifiers](#modifiers)\n- [AI Presence](#ai-presence)\n- [Related](#related)\n- [Feedback](#feedback)\n\n## Live demo\n\nTheme selector\n\nWhite\n\n---\n\nVariant selector\n\nDefault\n\n---\n\nThis live demo contains only a preview of functionality and styles available for this component. View the [full demo](https://react.carbondesignsystem.com/?path=/story/components-textinput--default&globals=theme:white) on Storybook for additional information such as its version, controls, and API documentation.\n\n### Accessibility testing status For every latest release, Carbon runs tests on all components to meet the [accessibility requirements](https://www.ibm.com/able/requirements/requirements/). These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\n\nVariant\n\nText input\n\n---\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nNot available](//accessibility/#accessibility-testing-status)\n\n[##### Default state\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nNot tested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nNot available](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nNot available](//accessibility/#accessibility-testing-status)\n\n## Overview\n\nText inputs enable users to enter free-form text data. The type of text field\nused should reflect the length of the content you expect the user to enter. The\ndefault text input is for short, one-line content, whereas text area is for\nlonger, multi-line entries.\n\n![Text input and text area example](/static/e84198fa0dca3973f497a6d2677e731f/3cbba/text-input-usage-2.png)\n\n#### When to use\n\n- A user needs to input unique information that cannot be predicted with a\n  preset of options.\n- A user needs to input memorable data that can be entered more quickly in a\n  free-hand format versus a more complex control.\n\n#### When not to use\n\n- If a user can only enter an option from a predefined list then avoid using a\n  free-form text input as it is likely to result in an error. Consider using a\n  selection control such as a dropdown, select, or radio button group instead.\n\n### Variants\n\n| Variant | Purpose |\n| --- | --- |\n| [Text input](/components/text-input/usage/#text-input) | When the expected user input is a single line of text. |\n| [Text area](/components/text-input/usage/#text-area) | When the expected user input is more than a few words that could span multiple lines. |\n\n## Text input\n\nUse a text input when the expected user input is a single line of text. Text\ninputs have a fixed height and are used to enter simple free-form data entries\nwith any combination of letters, numbers, or symbols. There are two styles of\ntext input, default and fluid, which share the same functionality but look\nvisually different. The context of how or where the component is used will\ndictate which style to use.\n\n| Style | Purpose |\n| --- | --- |\n| Default | Default is the most commonly used text input style with the label and helper text outside the field. Use when white space is needed between input components or in productive moments where space is at a premium, and smaller components are needed. |\n| Fluid | Fluid is an alternate styling for text input used in more expressive moments. Use in fluid forms, contained spaces, or attached to complex components, like a toolbar. Fluid components always sit flush with components around them. |\n\n### Anatomy\n\n- Default\n- Fluid\n\n![Anatomy of a text input in the default style](/static/f1873e0003e08b79688ec3f91886b100/3cbba/text-input-usage-anatomy-fixed.png)\n\n![Anatomy of a text input in the fluid style](/static/f100c94bdadb109182c75ea3215e2c78/3cbba/text-input-usage-anatomy-fluid.png)\n\n1. **Label**: Text that informs the user about the content they need to enter in\n   the field. It is required unless you get an approved accessibility exemption.\n2. **Value**: The content the user has entered into the field.\n3. **Field**: The container in which a user enters data. Must meet 3:1 non-text\n   contrast requirements.\n4. **Helper text** (optional): Assistive text that can provide additional aid or\n   context to the user. Often used to explain the correct data format. It is\n   positioned below the field in the default style and surfaced through a\n   tooltip in the fluid style.\n\n### Sizing\n\n#### Default input heights\n\nThere are three text input height sizes: small, medium, and large. Supporting\nthree sizes gives you more flexibility in structuring layouts. Be sure to use a\nconsistent field height when pairing form components on the same page.\n\n| Size | Height (px/rem) | Use case |\n| --- | --- | --- |\n| Small (sm) | 32 / 2 | Use when space is constricted or when placing a text input in a form that is long and complex. |\n| Medium (md) | 40 / 2.5 | This is the default size and the most commonly used size. When in doubt, use the medium size. |\n| Large (lg) | 48 / 3 | Use when there is a lot of space to work with. The large size is typically used in simple forms or when a text input is placed by itself on a page. |\n\n![Default text input heights](/static/4914792ec452ee8665da92b60161abe2/3cbba/text-input-usage-size.png)\n\n#### Fluid input heights\n\nThere is only one fluid input height and it is visually larger than the default\nheights. The input is a set height expect for when a warning or error message\nhas been added to the bottom.\n\n![Fluid text input heights](/static/c052e6f4e332c9ad1575f1bcfdfc2842/3cbba/text-input-usage-size-fluid.png)\n\n## Text area\n\nUse a text area when the expected user input is more than a few words and could\nspan multiple lines. It is commonly used for features like user commentary or\ndescriptions. It supports all the same states and functionality as text input\nexcept for the password functionality. Text area has several unique\nfunctionalities not included in the text input, like the resize handle, word\ncounter and character counter.\n\n| Style | Purpose |\n| --- | --- |\n| Default | Default is the most commonly used text area style with the label and helper text outside the field. Use when white space is needed between input components or in productive moments where space is at a premium, and smaller components are needed. |\n| Fluid | Fluid is an alternate styling for text area used in more expressive moments. Use in fluid forms, contained spaces, or attached to complex components, like a toolbar. Fluid components always sit flush with components around them. |\n\n### Anatomy\n\n- Default\n- Fluid\n\n![Anatomy of a text area in the default style](/static/32a4edc50adedd15e5d6b9997d154c0f/3cbba/text-area-usage-anatomy-fixed.png)\n\n![Anatomy of a text area in the fluid style](/static/4713b17f8b16c75a81d1d0a6deaf789b/3cbba/text-area-usage-anatomy-fluid.png)\n\n1. **Label**: Text that informs the user about the content they need to enter in\n   the field. It is required unless you get an approved accessibility exemption.\n2. **Value**: The content the user has entered into the field.\n3. **Field**: The container in which a user enters data. Must meet 3:1 non-text\n   contrast requirements.\n4. **Resize handle**: Allows a user to manipulate the field height by making it\n   longer or shorter.\n5. **Optional versus required indicator** (optional): This label indicates if\n   the field is optional or required for the user to complete.\n6. **Counter** (optional)\n   - Character counter: Indicate the number of characters being entered and the\n     total number of characters allowed.\n   - Word counter: Indicate the number of words being entered and the total\n     number of words allowed.\n\n### Sizing\n\nText area has a variable height that can be lengthened or shortened by the user\nusing the resize handle in the bottom right of the field. By default, text area\nhas a minimum height of 40px/2.5rem but no maximum height.\n\n#### Resize handle\n\nIncluded by default in both default and fluid text area is the resize handle. It\nallows a user to manipulate the field height by making it longer or shorter. The\nresize handle has no effect on the width of the text area container, it only\neffects the height. If the user makes the field size shorter than the content\ninside the field then a vertical scroll will become available.\n\n![Example showing the resize handle in text area](/static/1fdf41041c129944be3f56c5c88c8b0a/3cbba/text-area-usage-resize.png)\n\n## Formatting\n\n### Alignment\n\nInput labels should vertically align to the grid and with other type elements on\nthe page. The alignment of the input container will differ based on the style of\ntext input you are using. Default inputs are always flush to the columns and\nfluid inputs will hang into the gutters.\n\n![Do align field containers to the grid.](/static/397213c8fe1f5ccc6cccbe47761e5fb0/a5df1/text-input-usage-4-do.png)\n\nAlign default input containers to the grid so the input label aligns with other type of the page.\n\n![Do hang fluid field containers to the gutter.](/static/ac51d516d81f2129abd005d9099e1b7c/a5df1/text-input-usage-4-do-fluid.png)\n\nHang fluid input containers into the gutters so the input label aligns with other type of the page.\n\n#### Placement\n\nThe field widths of both text input and text area should reflect the intended\nlength of the content while still aligning to the grid columns or mini unit\ngrid. Unlike the height, the width of the text area cannot be controlled by the\nuser. There are no minimum or maximum widths but you should avoid excessively\nwide fields that are disproportionate to the intended data being collected.\n\n![Do use proportional widths](/static/535f473bbc31d886cc1f40a257727cc9/a5df1/text-input-width-do.png)\n\nDo make text input widths proportional to the content and align to grid columns.\n\n![Do not make inputs excessively wide.](/static/0aa6ed5a71e71bf605a0941b635c7ee1/a5df1/text-input-width-dont.png)\n\nDo not make text inputs excessively wide just to fill in space.\n\n### Alignment\n\nLabels and field containers should vertically align to the grid and with other\nform components on a page.\n\n![Do align field containers to the grid.](/static/397213c8fe1f5ccc6cccbe47761e5fb0/a5df1/text-input-usage-4-do.png)\n\nDo align field containers to the grid.\n\n![Do not align field text to the grid and hang the field in the gutter.](/static/539711e32bc2ca8db8a52975da220d4d/a5df1/text-input-usage-4-dont.png)\n\nDo not align field text to the grid and hang the field in the gutter.\n\n## Content\n\n### Main elements\n\n#### Labels\n\nEffective labeling helps users understand what information to enter into a text\ninput. Text fields should always have a label. There are rare instances were the\ncontext of an input negates the need for a visible label but we advise you\nconsult an accessibility expert before proceeding with a label-less design.\n\n- Use sentence-style capitalization for all labels, except for product names and\n  proper nouns.\n- Keep the label short and concise.\n- Do not use colons after label names.\n\n#### Helper text\n\nOptional helper text is pertinent information that assists the user in correctly\ncompleting a field. It is often used to explain the correct data format.\n\n- Use sentence-style capitalization, and in most cases, write the text as full\n  sentences with punctuation.\n- When used, helper text appears persistently underneath the field, except when\n  an error or warning message replaces it.\n\n#### Placeholder text\n\nOptional placeholder text provides hints or examples of what to enter.\nPlaceholder text disappears after the user begins entering data into the input.\nAs such, it should not be used as a replacement for a persistent label nor\nshould it contain crucial information.\n\n- Use sentence-style capitalization, and in most cases, write the text as a\n  direct statement without punctuation.\n- Placeholder text is not required and by default not shown in text input\n  fields.\n- Placeholder text can be harmful to user interactions and should only be added\n  when necessary.\n\n### Overflow content\n\n#### Overflow in a text input\n\nIf a user’s content is unexpectedly too long for the single line of a text input\nthen the value content can horizontally scroll inside the field container when\nmoving the cursor from one end of the value to the other.\n\n#### Overflow in a text area\n\nIf a user’s content exceeds the vertical space of the variable text area then a\nuser can either expand the field container using the resize handle or they can\nvertically scroll the content inside the set field container.\n\n### Further guidance\n\nFor further content guidance, see Carbon’s\n[content guidelines](/guidelines/content/overview).\n\n## Universal behaviors\n\nThe behaviors listed in this section are universal across all variants. For\nbehaviors that are unique to each variant, see each of the component variant\nsections below.\n\n### States\n\nThe text input and text area have multiple interactive states: **enabled**,\n**active**, **focus**, **error**, **warning**, **disabled**, **skeleton**, and\n**read-only**. For more details on text input and text area interactive states,\nsee the [style tab](https://carbondesignsystem.com/components/text-input/style).\n\n| State | When to use |\n| --- | --- |\n| *Enabled* | When a text input or text area is live but a user is not directly interacting with it. This is commonly referred to as the default or normal state of the component. An enabled text input field can contain no content, placeholder text, or user generate content. |\n| *Active* | When a user is actively typing content into the field. |\n| *Focus* | When a user ```  tabs ```   Copy to clipboard to or clicks on the text input or text area, it becomes focused, indicating the user has successfully navigated to the component. |\n| *Error* | When the user input is invalid or a required text input or text area has not been filled in. It can also be triggered due to a system error. This state requires a user response before data can be submitted or saved. |\n| *Warning* | When you need to call the user’s attention to an exception condition. The condition might not be an error but can cause problems if not resolved. |\n| *Disabled* | When the user cannot interact with a component and all interactive functions have been removed. Unlike read-only states, disabled states are not focusable, are not read by screen readers, and do not need to pass visual contrast, making them inaccessible if they need to be interpreted. |\n| *Skeleton* | Use on an initial page load to indicate that the text input or text area has not yet fully loaded. |\n| *Read-only* | When the user can review but not modify the component. This state removes all interactive functions like the disabled state but can still be focusable, accessible by screen readers, and passes visual contrast for readability. |\n\n### Validation\n\nReal-time validation helps streamline the process and keep data clean when the\nuser fills out forms. Otherwise, validate the text input data when the user\nsubmits the associated form. For complete guidance on error and validation, see\nthe [form pattern](https://carbondesignsystem.com/patterns/forms-pattern/).\n\n#### Invalid\n\nAn error state is triggered if the data is invalid or a required field is left\nempty. Error states have three visual indicators to signify invalid content: a\nred border, an error icon indicator, and an error message.\n\n![Example of an error state being triggered](/fbba7bf70afc3d71bc666b918417d7bf/text-input-usage-2.gif)\n\n![Example of an error state being triggered](/static/851f0b8b51288d7f86a50dfd975a9c3c/3cbba/text-input-usage-invalid.png)\n\n### Required versus optional\n\nText inputs can be labeled as either optional or required depending on the\ndepending on the circumstance. For more guidance on requirement labeling, see\nthe [form pattern](/patterns/forms-pattern/#optional-vs.-mandatory).\n\n![Example showing optional field indicator](/static/572f19e382ca589f7a64fd953f2991fa/a5df1/text-input-usage-optional-do.png)\n\nIf the majority of the fields are required, mark only the optional field labels with (optional).\n\n![Example showing required field indicator](/static/4dfcfd1c2fa7580f185c8c0701ffcc33/a5df1/text-input-usage-required-do.png)\n\nIf the majority of the fields are optional, mark only the required field labels with (required).\n\n### Interactions\n\n#### Mouse\n\nUsers can activate a text input by clicking on the field container. A separate\nclick is required to activate any additional actions associated with the text\ninput such as a password visibility toggle.\n\n- Default\n- Fluid\n\n![Example showing click target areas for text input in the default style](/static/e16a9a641393454aedf1430b8d70115f/3cbba/text-input-usage-mouse-fixed.png)\n\n![Example showing click target areas for text input in the fluid style](/static/e0a14add0714e232b8522a6ab860ce9d/3cbba/text-input-usage-mouse-fluid.png)\n\n#### Keyboard\n\nFor additional keyboard interactions, see the\n[accessibility tab](/components/text-input/accessibility).\n\n| Key | Interaction |\n| --- | --- |\n| *Tab* | Brings focus to the text input. |\n| *Enter* or *Space* | Opens any associated actions added to the input, such as a password visibility toggle. |\n| *Esc* | Closes any associated actions added to the input. |\n| *ctrl* or *opt* + *left/right arrows* | Moves you word by word inside the field. |\n| *ctrl* or *opt* + *up/down arrows* | Relocates you to the start or end of the input content. |\n\n## Modifiers\n\n### Password input\n\nPassword input is a sub-variant of text input. It is used to collect private\ndata and will hide the characters as a user enters them. A user can choose to\ntoggle on the character visibility by clicking the view icon on the far right of\nthe input field. When using a password input be sure to provide detailed helper\ntext listing any requirements related to the data format, such as types of\ncharacters allowed or date structure.\n\n![Example of a password input](/static/723806ee59b300663f4b5f0cc0d39db5/3cbba/text-input-usage-password.png)\n\n### Character counter\n\nA character counter can be added to text area to indicate both the number of\ncharacters being entered and the total number of characters allowed. Once the\nmax number of characters is reached the text area should prevent the user from\nentering any additional character and provide messaging to the user that a limit\nhas been met.\n\n![Example showing a character counter in text area](/static/190a58dbd50c4d45c0a90f9c3a510d74/3cbba/text-area-character-counter.png)\n\n### Word counter\n\nA word counter can be added to text area to indicate both the number of words\nbeing entered and the total number of words allowed. Once the max number of\nwords is reached the text area should prevent the user from entering any\nadditional character and provide messaging to the user that a limit has been\nmet.\n\n![Example showing a word counter in text area](/static/6d45045c2f68c8d796e36d97668808f9/3cbba/text-area-word-counter.png)\n\n## AI presence\n\nText input and text area have a modification that takes on the AI visual styling\nwhen the AI label is present in the input. The AI variant functions the same as\nthe normal version except with the addition of the AI label which is both a\nvisual indicator and the trigger for the explainability popover.\n\nFor more information on designing for AI, see the\n[Carbon for AI](/guidelines/carbon-for-ai/) guidelines.\n\n- Default\n- Fluid\n\n![Default text input and text area AI presence example](/static/d1665edaa143cbede74495086df633ca/3cbba/text-input-text-area-ai-presence-default.png)\n\n![Fluid text input and text area AI presence example](/static/f50f5d756ba7a0a6d0daa483e2fd88a0/3cbba/text-input-text-area-ai-presence-fluid.png)\n\n### Revert to AI\n\nThe text input and text area can toggle between the AI variant and the non-AI\nvariant depending on the user’s interaction. If the user manually overrides the\nAI-suggested content then the input will change from the AI variant to the\nnon-AI variant. Once edited, the user should still be able to switch back to the\ninitially AI generated content via a revert to AI button.\n\n- Default\n- Fluid\n\n![Default text input and text area AI revert example](/static/11c737774e1feda46eb6041388fa6fee/3cbba/text-input-text-area-ai-revert.png)\n\n![Fluid text input and text area AI revert example](/static/64393442bad2c63a0b5bc52d5d121f19/3cbba/text-input-text-area-ai-revert-fluid.png)\n\n## Related\n\n- [Form pattern](/patterns/forms-pattern/)\n\n## Feedback\n\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\n[GitHub](https://github.com/carbon-design-system/carbon-website/issues/new?assignees=&labels=feedback&template=feedback.md).\n\n[Edit this page on GitHub](https://github.com/carbon-design-system/carbon-website/edit/main/src/pages/components/text-input/usage.mdx)\n\n[Previous\n\nComponents: Tag](/components/tag/usage/)\n\n[Next\n\nText input: Style](/components/text-input/style/)",
  "tags": [
    "ibm",
    "carbon",
    "design-system",
    "enterprise"
  ],
  "extracted_at": "2026-02-03T14:19:50.748902+00:00",
  "content_length": 16089,
  "content_hash": "6b8208000b62c447"
}