{
  "id": "carbon-design__components_tile_usage_",
  "source_id": "carbon-design",
  "source_name": "IBM Carbon Design System",
  "category": "design_systems",
  "url": "https://carbondesignsystem.com/components/tile/usage/",
  "title": "Tile",
  "content": "Tile\nFeature flag\nTiles are a highly flexible component for displaying a wide variety of content,\nincluding information, getting started, how-to, next steps, and more.\nTile\nwith AI label\nchanges the visual appearance of the component and introduces an AI\nexplainability feature when AI is present in the component.\nLive demo\nOverview\nVariants\nFormatting\nContent\nBase\nClickable\nSelectable\nExpandable\nAI presence\nRelated\nReferences\nFeedback\nLive demo\nTheme selector\nWhite\nVariant selector\nDefault\nThis live demo contains only a preview of functionality and styles available for this component. View the\nfull demo\non Storybook for additional information such as its version, controls, and API documentation.\nAccessibility testing status\nFor every latest release, Carbon runs tests on all components to meet the\naccessibility requirements\n. These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\nDefault state\nTested\nAdvanced states\nTested\nScreen reader\nManually tested\nKeyboard navigation\nTested\nOverview\nTile is a component that can contain various content and nested components and\ncan have interactive functions. Tile is often laid out in groups, is a different\ncolor than the UI background, and responds to the grid. Tiles have no pre-set\nstyles and are purposely flexible so product teams can determine their tile\ncontent for specific use cases.\nExample of the tile component in a UI\nTiles versus cards\nTiles are simple and foundational. Cards can be very complex. Cards are built\nupon the tile foundation and have various patterns of information hierarchy,\nmultiple actions, overflow menus, selectable features, etc. Carbon does not have\na card pattern, but we link out to several card patterns within our pattern\nasset library (PAL) ecosystem below:\nProductive versus Expressive cards\n(Carbon for IBM Products)\nDashboard cards\n(IBM Sustainability Software Design)\nCards\n(Carbon for\nIBM.com)\nWhen to use\nTiles are reusable components that provide shortcuts to building cards and other\nmodules. Use tiles to group related information in flexible containers. Here are\nsome common use cases for when to use tiles:\nTo contain related groupings of information or actions\nTo guide users to take actions or navigate\nTo present options for single or multiple selections\nTo hide or show large amounts of content\nWhen not to use\nTiles reside on the same plane as the page background layer and do not have\nelevation. Tiles organize essential information and have the same visual\nhierarchy as content on the same page.\nDo not add a drop shadow to tiles and use them to reveal secondary information,\nactions, or notifications. Use\nmodals\n,\npopovers\n, and\ndialogs\nthat have\nelevation and are appropriate for this use case instead.\nVariants\nTiles can have different functions and are implemented in four ways: base,\nclickable, selectable, and expandable. These tile variants are flexible to\nsupport various use cases when building more complicated card features.\nVariant\nPurpose\nBase\nFor high-level, short, and digestible content pieces such as features, plans, or services offered.\nClickable\nFor prompting an action, navigating or directing to other pieces of information about the subject matter. This variant has an available feature flag.\nSelectable\nFor presenting options to a user in a structured manner, such as a set of pricing plans. This variant has available feature flags.\nExpandable\nFor hiding and revealing a large amount of content to focus on specific pieces of information. This variant has an available feature flag.\nFeature flags\nFeature flags\nhave been added to the\nclickable, selectable, and expandable variants of tile to improve accessibility\nand changes its visual appearance, not its functionality. For code-specific\nfeature flag information, refer to the\nCode\ntab. These\ncurrent variants of tile are not being deprecated, but teams are encouraged to\nuse the feature flag tile for their products moving forward. Once the next major\nrelease (v12) is released in the future, these feature flags will become the\ndefault version of the component.\nThe following are the feature flag changes made to tile.\nA border has been added to the clickable, selectable, and expandable variants\nof tile to visually indicate they are operable.\nSingle-select tile icons have been changed from checkmark icons to radio\nbutton icons, where as multi-select tile icons have been changed from\ncheckmark icons to checkbox icons. These icons appear in the enabled state\ninstead of only on hover before making a selection.\nFlag enabled\nFlag disabled\nFormatting\nSizing\nTile width varies depending on the three basic gutter modes:\nwide\n,\nnarrow\n, and\ncondensed\n. Tile height varies depending on the content\nplaced within it while using\nspacing tokens\nand\nfollowing\naspect ratios\n.\nThe minimum tile height is a 2:1 aspect ratio. As the content grows, set\nvertical spacing between sections within the content area.\nAlignment\nTile groups\nTile groups are helpful when aligning tiles that have a strong relationship.\nTile groups usually flow horizontally from left to right and have hierarchical\nimportance, similar to navigation or catalog tiles.\nExample image of tiles on the wide grid\nExample image of tiles on the narrow grid\nExample image of tiles on the condensed grid\nDo match the tile variants in groups.\nDo not mix different variants of tiles in groups.\nLayout\nThere are three basic layouts for tiles:\nstandard\n,\nvertical masonry\n, and\nhorizontal masonry\n. The standard layout is the the most commonly used.\nIn a standard layout, tiles are the same in height and width as all other\ntiles in the group.\nIn a vertical masonry layout, tiles can vary in height, but are consistent in\nwidth.\nIn a horizontal masonry layout, tiles can vary in width; different rows of\ntiles may vary in height, but tiles within a row should be consistent in\nheight.\nExamples of standard, vertical masonry, and horizontal masonry tile layouts\nContent\nMain elements\nTile text\nTile text can vary based on the content. It can consist of heading text, body\ntext, label text, and include interactive elements.\nFurther guidance\nFor further content guidance, see\nCarbon’s\ncontent guidelines\n.\nBase\nBase tiles are used to display information to the user, such as features or\nservices offered. Base tiles are often seen on marketing pages to promote\ncontent or on highly interactive dashboards. These tiles can have internal\ncalls-to-action (CTAs), such as a\nbuttons\nor\nlinks\n.\nExample of base tiles\nAnatomy\nAnatomy of base tiles\nContainer\n: Contains all content in a tile.\nText\n: The text in a tile.\nInteractive elements (optional)\n: Elements like links or buttons in a tile\nthat are interactive.\nAlignment\nWhen placing interactive elements within base tiles, place links at the bottom\nleft of the tile and span buttons in width at the bottom to indicate\ncall-to-action items.\nDo left align the link at the bottom of the base tile.\nDo span the button in width at the bottom of the base tile.\nStates\nBase tiles only have an\nenabled\nstate because they are not operable by a\nmouse or keyboard. For more information about base tile states, see the\nStyle\ntab.\nInteractions\nMouse\nBase tiles are not operable by a mouse unless they contain interactive elements\nwithin them. Interactive elements can be clicked on and activated.\nKeyboard\nBase tiles do not receive focus unless they contain interactive elements.\nTab\nCopy to clipboard\nmoves focus forward through interactive elements within base tile in a\nlogical order.\nShift\nCopy to clipboard\n+\nTab\nCopy to clipboard\nmoves focus backward through interactive elements within base\ntile in a logical order.\nEnter\nCopy to clipboard\nactivates the base tiles interactive elements.\nClickable areas\nBase tiles can have interactive elements within them, like links or buttons,\nwhich can be clicked on.\nClickable areas of base tile with interactive elements\nClickable\nClickable tiles can be used as navigational elements that redirect the user to a\nnew page. In these situations, the entire tile is in a clickable state. Due to\naccessibility concerns, clickable tiles cannot contain separate internal CTAs\nbut can contain pictograms, icons, or media such as illustrations or images.\nClickable tile has an available\nfeature flag\n.\nFlag enabled\nFlag disabled\nAnatomy\nAnatomy of clickable tile with the feature flag enabled\nContainer\n: Contains all content within a tile.\nText\n: The text within a tile.\nIcon\n: The icon that visually indicates the tile is navigational.\nBorder\n: The border that visually indicates the tile is interactive.\nAlignment\nIcons\nOn clickable tiles, use the arrow icon paired with the\n$icon-interactive\nCopy to clipboard\ncolor\ntoken. Place the icon at the bottom right to indicate navigation. Avoid\nconfusing the user with multiple click targets, like interactive links or\nbuttons, since the whole tile is already clickable.\nDo right align the arrow icon when it is by itself.\nDo right align the arrow icon when there is additional text.\nDo right align the arrow icon when there is a decorative icon or pictogram.\nDo not add interactive links or components on clickable tiles.\nStates\nClickable tiles have\nenabled\n,\nhover\n,\nfocus\n, and\ndisabled\nstates.\nFor more information about clickable tile states, see the\nStyle\ntab.\nInteractions\nMouse\nThe clickable tile is triggered by clicking anywhere within the tile container.\nKeyboard\nTab\nCopy to clipboard\nmoves focus forward through clickable tiles in a logical order.\nShift\nCopy to clipboard\n+\nTab\nCopy to clipboard\nmoves focus backward through clickable tiles in a logical\norder.\nEnter\nCopy to clipboard\nactivates the tile and navigates you to its destination.\nClickable areas\nClickable tiles can be triggered by clicking anywhere on the tiles container.\nClickable areas of clickable tile with the feature flag enabled\nSelectable\nSelectable tiles are used to present different options for users to select from.\nSelectable tiles can contain internal CTAs, like links to documentation, if the\nCTA is given a click target of its own in addition to the tile’s click target.\nSelectable tiles can either have single-selection or multi-selection.\nSelectable tile has available\nfeature flags\n.\nSingle-select\nUse single-select tiles when the user can only select one tile from a tile\ngroup.\nFlag enabled\nFlag disabled\nMulti-select\nUse multi-select tiles when the user can select multiple tiles from a tile\ngroup.\nFlag enabled\nFlag disabled\nAnatomy\nAnatomy of selectable tile with the feature flags enabled\nContainer\n: Contains all content within a tile.\nText\n: The text within a tile.\nIcon\n: The radio or checkbox icon that visually indicates the tile is\nselectable.\nBorder\n: The border that visually indicates the tile is interactive.\nStates\nSelectable tiles have\nenabled\n,\nhover\n,\nhover selected\n,\nselected\n,\nfocus\n, and\ndisabled\nstates. For more information about base tile states,\nsee the\nStyle\ntab.\nInteractions\nMouse\nThe clickable tile is triggered by clicking anywhere within the tile container.\nKeyboard\nTab\nCopy to clipboard\nmoves focus forward through selectable tiles in a logical order.\nShift\nCopy to clipboard\n+\nTab\nCopy to clipboard\nmoves focus backward through selectable tiles in a logical\norder.\nEnter\nCopy to clipboard\nselects the tile.\nClickable areas\nSelectable tiles can be selected by clicking anywhere on the tiles container.\nClickable areas of selectable tile with the feature flags enabled\nExpandable\nExpandable tiles are used to reveal or hide additional information to the user\nand can be expanded and collapsed differently depending on their content. If an\nexpandable tile does not have interactive elements, clicking anywhere in the\ntile expands and collapses the tile. If an expandable tile has interactive\nelements, the chevron icon button expands and collapses the tile.\nExpandable tile has an available\nfeature flag\n.\nWithout interactive elements\nUse the container expansion functionality to expand and collapse the tile when\nthere are no interactive elements.\nFlag enabled\nFlag disabled\nWith interactive elements\nUse the button expansion functionality to expand and collapse the tile when\nincluding interactive elements.\nFlag enabled\nFlag disabled\nAnatomy\nAnatomy of expandable tile with the feature flag enabled\nContainer\n: Contains all content within a tile.\nText\n: The text within a tile.\nInteractive elements (optional)\n: Interactive elements like links or\nbuttons placed within a tile.\nIcon\n: The icon that visually indicates the tile is expandable.\nBorder\n: The border that visually indicates the tile is interactive.\nStates\nExpandable tiles have\nenabled\n,\nhover\n,\nfocus\n, and\ndisabled\nstates. For more information about expandable tile states, see the\nStyle\ntab.\nInteractions\nMouse\nWithout interactive elements: The tile is expanded by clicking anywhere within\nthe tile container.\nWith interactive elements: The tile is expanded by clicking on the button in\nthe bottom right of the tile.\nKeyboard\nTab\nCopy to clipboard\nmoves focus forward through tiles. If there are interactive elements,\nTab\nCopy to clipboard\nmoves focus forward in a logical order.\nShift\nCopy to clipboard\n+\nTab\nCopy to clipboard\nmoves focus backward through tiles. If there are interactive\nelements,\nTab\nCopy to clipboard\nmoves focus forward in a logical order.\nEnter\nCopy to clipboard\nexpands and collapses the tile.\nClickable areas\nIf the expandable tile does not have interactive elements, it can be expanded or\ncollapsed by clicking anywhere on the tiles container. If the expandable tile\nhas interactive elements, it can be expanded or collapsed by clicking on the\nbutton in the bottom right corner. Interactive elements within a tile can also\nbe clicked on and have their own click targets.\nClickable areas of expandable tile with the feature flag enabled\nAI presence\nTile has a modification that takes on the AI visual styling when the AI label is\npresent in the container. The AI variants function the same as the normal\nversions except with the addition of the AI label which is both a visual\nindicator and the trigger for the explainability popover.\nFor more information on designing for AI, see the\nCarbon for AI\nguidelines.\nBase, clickable, and selectable tiles with AI presence and feature flags\nenabled\nRelated\nGrid\nTo learn more about how to build tiles correctly on the grid, see Carbon’s\n2x grid\n.\nAspect ratio\nThe aspect ratio is important when building tiles and images. For further\nguidance, see Carbon’s\naspect ratio\nand its\nimplementation\n.\nButtons\nWhen in doubt, use full-span button alignment within tiles. For further\nguidance, see Carbon’s\nbuttons\n.\nLink\nLink has variants depending on the context. For further guidance, see Carbon’s\nlink\n.\nSpacing\nSpacing helps deliver clear and functional layouts. For further guidance, see\nCarbon’s\nspacing\n.\nReferences\nHagan Rivers,\nInteractions design with cards/tiles\n(Medium, 2017)\nFeedback\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\nGitHub\n.\nEdit this page on GitHub\nPrevious\nComponents: Text input\nNext\nTile: Style",
  "content_markdown": "# Tile\n\nFeature flag\n\nTiles are a highly flexible component for displaying a wide variety of content,\nincluding information, getting started, how-to, next steps, and more.\n\nTile\n[with AI label](https://react.carbondesignsystem.com/?path=/story/components-tile--with-ai-label)\nchanges the visual appearance of the component and introduces an AI\nexplainability feature when AI is present in the component.\n\n- [Live demo](#live-demo)\n- [Overview](#overview)\n- [Variants](#variants)\n- [Formatting](#formatting)\n- [Content](#content)\n- [Base](#base)\n- [Clickable](#clickable)\n- [Selectable](#selectable)\n- [Expandable](#expandable)\n- [AI presence](#ai-presence)\n- [Related](#related)\n- [References](#references)\n- [Feedback](#feedback)\n\n## Live demo\n\nTheme selector\n\nWhite\n\n---\n\nVariant selector\n\nDefault\n\n---\n\nThis live demo contains only a preview of functionality and styles available for this component. View the [full demo](https://react.carbondesignsystem.com/?path=/story/components-tile--default&globals=theme:white) on Storybook for additional information such as its version, controls, and API documentation.\n\n### Accessibility testing status For every latest release, Carbon runs tests on all components to meet the [accessibility requirements](https://www.ibm.com/able/requirements/requirements/). These different statuses report the work that Carbon has done in the back end. These tests appear only when the components are stable.\n\n[##### Default state\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Advanced states\n\nTested](//accessibility/#accessibility-testing-status)\n\n[##### Screen reader\n\nManually tested](//accessibility/#accessibility-testing-status)\n\n[##### Keyboard navigation\n\nTested](//accessibility/#accessibility-testing-status)\n\n## Overview\n\nTile is a component that can contain various content and nested components and\ncan have interactive functions. Tile is often laid out in groups, is a different\ncolor than the UI background, and responds to the grid. Tiles have no pre-set\nstyles and are purposely flexible so product teams can determine their tile\ncontent for specific use cases.\n\n![Example of the tile component in a UI](/static/f54982885ff280cc5f85ef6466db8328/3cbba/tile-usage-overview.png)\n\nExample of the tile component in a UI\n\n#### Tiles versus cards\n\nTiles are simple and foundational. Cards can be very complex. Cards are built\nupon the tile foundation and have various patterns of information hierarchy,\nmultiple actions, overflow menus, selectable features, etc. Carbon does not have\na card pattern, but we link out to several card patterns within our pattern\nasset library (PAL) ecosystem below:\n\n- [Productive versus Expressive cards](https://pages.github.ibm.com/cdai-design/pal/components/card/overview/)\n  (Carbon for IBM Products)\n- [Dashboard cards](https://pages.github.ibm.com/ai-applications/design/patterns/dashboards-v2/overview/#dashboard-cards)\n  (IBM Sustainability Software Design)\n- [Cards](https://www.ibm.com/standards/carbon/components/cards) (Carbon for\n  IBM.com)\n\n### When to use\n\nTiles are reusable components that provide shortcuts to building cards and other\nmodules. Use tiles to group related information in flexible containers. Here are\nsome common use cases for when to use tiles:\n\n- To contain related groupings of information or actions\n- To guide users to take actions or navigate\n- To present options for single or multiple selections\n- To hide or show large amounts of content\n\n### When not to use\n\nTiles reside on the same plane as the page background layer and do not have\nelevation. Tiles organize essential information and have the same visual\nhierarchy as content on the same page.\n\nDo not add a drop shadow to tiles and use them to reveal secondary information,\nactions, or notifications. Use [modals](/components/modal/usage),\n[popovers](/components/popover/usage), and\n[dialogs](https://carbondesignsystem.com/patterns/dialog-pattern/) that have\nelevation and are appropriate for this use case instead.\n\n### Variants\n\nTiles can have different functions and are implemented in four ways: base,\nclickable, selectable, and expandable. These tile variants are flexible to\nsupport various use cases when building more complicated card features.\n\n| Variant | Purpose |\n| --- | --- |\n| [Base](#base) | For high-level, short, and digestible content pieces such as features, plans, or services offered. |\n| [Clickable](#clickable) | For prompting an action, navigating or directing to other pieces of information about the subject matter. This variant has an available feature flag. |\n| [Selectable](#selectable) | For presenting options to a user in a structured manner, such as a set of pricing plans. This variant has available feature flags. |\n| [Expandable](#expandable) | For hiding and revealing a large amount of content to focus on specific pieces of information. This variant has an available feature flag. |\n\n### Feature flags\n\n[Feature flags](/components/overview/feature-flags/) have been added to the\nclickable, selectable, and expandable variants of tile to improve accessibility\nand changes its visual appearance, not its functionality. For code-specific\nfeature flag information, refer to the [Code](/components/tile/code/) tab. These\ncurrent variants of tile are not being deprecated, but teams are encouraged to\nuse the feature flag tile for their products moving forward. Once the next major\nrelease (v12) is released in the future, these feature flags will become the\ndefault version of the component.\n\nThe following are the feature flag changes made to tile.\n\n- A border has been added to the clickable, selectable, and expandable variants\n  of tile to visually indicate they are operable.\n- Single-select tile icons have been changed from checkmark icons to radio\n  button icons, where as multi-select tile icons have been changed from\n  checkmark icons to checkbox icons. These icons appear in the enabled state\n  instead of only on hover before making a selection.\n\n- Flag enabled\n- Flag disabled\n\n![Interactive tiles with the feature flag enabled](/static/11a834e65091fb57ac36e51cdc512b0f/3cbba/tile-usage-feature-flag-enabled.png)\n\n![Interactive tiles with the feature flag disabled](/static/5dff26143540bbf684b7ef0910da710a/3cbba/tile-usage-feature-flag-disabled.png)\n\n## Formatting\n\n### Sizing\n\nTile width varies depending on the three basic gutter modes: **wide**,\n**narrow**, and **condensed**. Tile height varies depending on the content\nplaced within it while using\n[spacing tokens](https://carbondesignsystem.com/elements/spacing/overview/) and\nfollowing\n[aspect ratios](https://carbondesignsystem.com/elements/2x-grid/usage/#continuity).\nThe minimum tile height is a 2:1 aspect ratio. As the content grows, set\nvertical spacing between sections within the content area.\n\n### Alignment\n\n#### Tile groups\n\nTile groups are helpful when aligning tiles that have a strong relationship.\nTile groups usually flow horizontally from left to right and have hierarchical\nimportance, similar to navigation or catalog tiles.\n\n![Example image of tiles on the wide grid](/static/1d9558f804c8f51926cef86f06882c22/3cbba/tile-usage-wide-grid.png)\n\nExample image of tiles on the wide grid\n\n![Example image of tiles on the narrow grid](/static/bfd0f56814949ae98099bb3d52380930/3cbba/tile-usage-narrow-grid.png)\n\nExample image of tiles on the narrow grid\n\n![Example image of tiles on the condensed grid](/static/118d07a7921045dcf4707b3ca285b3d7/3cbba/tile-usage-condensed-grid.png)\n\nExample image of tiles on the condensed grid\n\n![Example of \"do\" of tile matching](/static/590d51b2056638465cc48394064b0290/6e9cd/tile-usage-group-do.png)\n\nDo match the tile variants in groups.\n\n![Example of \"do not\" of tile mixing](/static/9974a971593ed06af0d3db9d6aa10dab/6e9cd/tile-usage-group-dont.png)\n\nDo not mix different variants of tiles in groups.\n\n#### Layout\n\nThere are three basic layouts for tiles: **standard**, **vertical masonry**, and\n**horizontal masonry**. The standard layout is the the most commonly used.\n\n- In a standard layout, tiles are the same in height and width as all other\n  tiles in the group.\n- In a vertical masonry layout, tiles can vary in height, but are consistent in\n  width.\n- In a horizontal masonry layout, tiles can vary in width; different rows of\n  tiles may vary in height, but tiles within a row should be consistent in\n  height.\n\n![Tile layouts](/static/22acc83f052e9993ee2615a1cefcf1bd/3cbba/tile-usage-18.png)\n\nExamples of standard, vertical masonry, and horizontal masonry tile layouts\n\n## Content\n\n### Main elements\n\n#### Tile text\n\nTile text can vary based on the content. It can consist of heading text, body\ntext, label text, and include interactive elements.\n\n### Further guidance\n\nFor further content guidance, see\nCarbon’s [content guidelines](https://carbondesignsystem.com/guidelines/content/overview/).\n\n## Base\n\nBase tiles are used to display information to the user, such as features or\nservices offered. Base tiles are often seen on marketing pages to promote\ncontent or on highly interactive dashboards. These tiles can have internal\ncalls-to-action (CTAs), such as a [buttons](/components/button/usage) or\n[links](/components/link/usage).\n\n![Example of base tiles](/static/e1bdc5d773f9a48a2275acd4e1017f4b/3cbba/tile-usage-base.png)\n\nExample of base tiles\n\n### Anatomy\n\n![Anatomy of base tiles](/static/3a5a88e3ecb4d22f33aea72990f70cb5/3cbba/tile-usage-base-anatomy.png)\n\nAnatomy of base tiles\n\n1. **Container**: Contains all content in a tile.\n2. **Text**: The text in a tile.\n3. **Interactive elements (optional)**: Elements like links or buttons in a tile\n   that are interactive.\n\n### Alignment\n\nWhen placing interactive elements within base tiles, place links at the bottom\nleft of the tile and span buttons in width at the bottom to indicate\ncall-to-action items.\n\n![Example of \"do\" on base tile](/static/94fcceed8e3568b225e47c2721c16710/a5df1/tile-usage-base-link-do.png)\n\nDo left align the link at the bottom of the base tile.\n\n![Example of \"do\" on base tile](/static/34112a6fddaf3a828cbc7a9b0498e7d2/a5df1/tile-usage-base-button-do.png)\n\nDo span the button in width at the bottom of the base tile.\n\n### States\n\nBase tiles only have an **enabled** state because they are not operable by a\nmouse or keyboard. For more information about base tile states, see the\n[Style](https://carbondesignsystem.com/components/tile/style) tab.\n\n### Interactions\n\n#### Mouse\n\nBase tiles are not operable by a mouse unless they contain interactive elements\nwithin them. Interactive elements can be clicked on and activated.\n\n#### Keyboard\n\n- Base tiles do not receive focus unless they contain interactive elements.\n- ```\n  Tab\n  ```\n\n  Copy to clipboard\n\n  moves focus forward through interactive elements within base tile in a\n  logical order.\n- ```\n  Shift\n  ```\n\n  Copy to clipboard\n\n  +\n\n  ```\n  Tab\n  ```\n\n  Copy to clipboard\n\n  moves focus backward through interactive elements within base\n  tile in a logical order.\n- ```\n  Enter\n  ```\n\n  Copy to clipboard\n\n  activates the base tiles interactive elements.\n\n### Clickable areas\n\nBase tiles can have interactive elements within them, like links or buttons,\nwhich can be clicked on.\n\n![Clickable areas of base tile with interactive elements](/static/43e089be502eb20cddbd36eb34db6378/3cbba/tile-usage-base-clickable-areas.png)\n\nClickable areas of base tile with interactive elements\n\n## Clickable\n\nClickable tiles can be used as navigational elements that redirect the user to a\nnew page. In these situations, the entire tile is in a clickable state. Due to\naccessibility concerns, clickable tiles cannot contain separate internal CTAs\nbut can contain pictograms, icons, or media such as illustrations or images.\n\nClickable tile has an available\n[feature flag](/components/overview/feature-flags/).\n\n- Flag enabled\n- Flag disabled\n\n![Clickable tile with the feature flag enabled](/static/bc58c0edd2c56cd49f4e2e634889ddab/3cbba/tile-usage-clickable-flag-enabled.png)\n\n![Clickable tile with the feature flag disabled](/static/1a3474cbba5f692c18c865ade1355b90/3cbba/tile-usage-clickable-flag-disabled.png)\n\n### Anatomy\n\n![Anatomy of clickable tile with the feature flag enabled](/static/2206108cbd74b032cf1f54dad7228834/3cbba/tile-usage-clickable-anatomy.png)\n\nAnatomy of clickable tile with the feature flag enabled\n\n1. **Container**: Contains all content within a tile.\n2. **Text**: The text within a tile.\n3. **Icon**: The icon that visually indicates the tile is navigational.\n4. **Border**: The border that visually indicates the tile is interactive.\n\n### Alignment\n\n#### Icons\n\nOn clickable tiles, use the arrow icon paired with the\n\n```\n$icon-interactive\n```\n\nCopy to clipboard\n\ncolor\ntoken. Place the icon at the bottom right to indicate navigation. Avoid\nconfusing the user with multiple click targets, like interactive links or\nbuttons, since the whole tile is already clickable.\n\n![Example of \"do\" on clickable tile](/static/4fa4741f99fe0ba4e90eb9c2c29ab2a0/a5df1/tile-usage-clickable-arrow-do.png)\n\nDo right align the arrow icon when it is by itself.\n\n![Example of \"do\" on clickable tile](/static/379645ad5360828df1ffb54cab6f81af/a5df1/tile-usage-clickable-arrow-pdf-do.png)\n\nDo right align the arrow icon when there is additional text.\n\n![Example of \"do\" on clickable tile](/static/28a2ba69cbcb0aa070c583d7e1b5bb0a/a5df1/tile-usage-clickable-arrow-pictogram-do.png)\n\nDo right align the arrow icon when there is a decorative icon or pictogram.\n\n![Example of \"do not\" on clickable tile](/static/f88d015fe08c9ab3884259247f4649c9/a5df1/tile-usage-clickable-link-dont.png)\n\nDo not add interactive links or components on clickable tiles.\n\n### States\n\nClickable tiles have **enabled**, **hover**, **focus**, and **disabled** states.\nFor more information about clickable tile states, see the\n[Style](https://carbondesignsystem.com/components/tile/style) tab.\n\n### Interactions\n\n#### Mouse\n\nThe clickable tile is triggered by clicking anywhere within the tile container.\n\n#### Keyboard\n\n- ```\n  Tab\n  ```\n\n  Copy to clipboard\n\n  moves focus forward through clickable tiles in a logical order.\n- ```\n  Shift\n  ```\n\n  Copy to clipboard\n\n  +\n\n  ```\n  Tab\n  ```\n\n  Copy to clipboard\n\n  moves focus backward through clickable tiles in a logical\n  order.\n- ```\n  Enter\n  ```\n\n  Copy to clipboard\n\n  activates the tile and navigates you to its destination.\n\n### Clickable areas\n\nClickable tiles can be triggered by clicking anywhere on the tiles container.\n\n![Clickable areas of clickable tile with the feature flag enabled](/static/19bc657386e980ca29407d6d067ee929/3cbba/tile-usage-clickable-clickable-areas.png)\n\nClickable areas of clickable tile with the feature flag enabled\n\n## Selectable\n\nSelectable tiles are used to present different options for users to select from.\nSelectable tiles can contain internal CTAs, like links to documentation, if the\nCTA is given a click target of its own in addition to the tile’s click target.\nSelectable tiles can either have single-selection or multi-selection.\n\nSelectable tile has available\n[feature flags](/components/overview/feature-flags/).\n\n### Single-select\n\nUse single-select tiles when the user can only select one tile from a tile\ngroup.\n\n- Flag enabled\n- Flag disabled\n\n![Single-select tile with the feature flag enabled](/static/f39da855a77208b08e337003c3cf043d/3cbba/tile-usage-selectable-single-select-flag-enabled.png)\n\n![Single-select tile with the feature flag disabled](/static/4b19ee17d63eccdd463a8d6ed478d640/3cbba/tile-usage-selectable-single-select-flag-disabled.png)\n\n### Multi-select\n\nUse multi-select tiles when the user can select multiple tiles from a tile\ngroup.\n\n- Flag enabled\n- Flag disabled\n\n![Multi-select tile with the feature flag enabled](/static/d91e1a054f1ec5bb7f49712570718533/3cbba/tile-usage-selectable-multi-select-flag-enabled.png)\n\n![Multi-select tile with the feature flag disabled](/static/f437e37d67dfb9e1ba37b4ab3bb38a13/3cbba/tile-usage-selectable-multi-select-flag-disabled.png)\n\n### Anatomy\n\n![Anatomy of selectable tile with feature flags](/static/af74d15bda1e5d310d3510ce0b1e5d11/3cbba/tile-usage-selectable-anatomy.png)\n\nAnatomy of selectable tile with the feature flags enabled\n\n1. **Container**: Contains all content within a tile.\n2. **Text**: The text within a tile.\n3. **Icon**: The radio or checkbox icon that visually indicates the tile is\n   selectable.\n4. **Border**: The border that visually indicates the tile is interactive.\n\n### States\n\nSelectable tiles have **enabled**, **hover**, **hover selected**, **selected**,\n**focus**, and **disabled** states. For more information about base tile states,\nsee the [Style](https://carbondesignsystem.com/components/tile/style/) tab.\n\n### Interactions\n\n#### Mouse\n\nThe clickable tile is triggered by clicking anywhere within the tile container.\n\n#### Keyboard\n\n- ```\n  Tab\n  ```\n\n  Copy to clipboard\n\n  moves focus forward through selectable tiles in a logical order.\n- ```\n  Shift\n  ```\n\n  Copy to clipboard\n\n  +\n\n  ```\n  Tab\n  ```\n\n  Copy to clipboard\n\n  moves focus backward through selectable tiles in a logical\n  order.\n- ```\n  Enter\n  ```\n\n  Copy to clipboard\n\n  selects the tile.\n\n### Clickable areas\n\nSelectable tiles can be selected by clicking anywhere on the tiles container.\n\n![Clickable areas of selectable tile with the feature flags enabled](/static/fe225a16974fe5a19567a37a515c228a/3cbba/tile-usage-selectable-clickable-areas.png)\n\nClickable areas of selectable tile with the feature flags enabled\n\n### Expandable\n\nExpandable tiles are used to reveal or hide additional information to the user\nand can be expanded and collapsed differently depending on their content. If an\nexpandable tile does not have interactive elements, clicking anywhere in the\ntile expands and collapses the tile. If an expandable tile has interactive\nelements, the chevron icon button expands and collapses the tile.\n\nExpandable tile has an available\n[feature flag](/components/overview/feature-flags/).\n\n### Without interactive elements\n\nUse the container expansion functionality to expand and collapse the tile when\nthere are no interactive elements.\n\n- Flag enabled\n- Flag disabled\n\n![Expandable tile without interactive elements with the feature flag enabled](/static/9d682bf5652d7c2cb75d9c2bd8e9adc0/3cbba/tile-usage-expandable-non-interactive-flag-enabled.png)\n\n![Expandable tile without interactive elements with the feature flag disabled](/static/4354c3088f9db8e2cbdaacaa7cfc3291/3cbba/tile-usage-expandable-non-interactive-flag-disabled.png)\n\n### With interactive elements\n\nUse the button expansion functionality to expand and collapse the tile when\nincluding interactive elements.\n\n- Flag enabled\n- Flag disabled\n\n![Expandable tile with interactive elements with the feature flag enabled](/static/68f66b33ce3db88c2f8e4e66d1567e68/3cbba/tile-usage-expandable-interactive-flag-enabled.png)\n\n![Expandable tile with interactive elements with the feature flag disabled](/static/a618fc936b9ef8da185bc9c6f8aaa57c/3cbba/tile-usage-expandable-interactive-flag-disabled.png)\n\n### Anatomy\n\n![Anatomy of expandable tile with the feature flag enabled](/static/cdf29c3b46a5a043dcf15072159dc4fa/3cbba/tile-usage-expandable-anatomy.png)\n\nAnatomy of expandable tile with the feature flag enabled\n\n1. **Container**: Contains all content within a tile.\n2. **Text**: The text within a tile.\n3. **Interactive elements (optional)**: Interactive elements like links or\n   buttons placed within a tile.\n4. **Icon**: The icon that visually indicates the tile is expandable.\n5. **Border**: The border that visually indicates the tile is interactive.\n\n### States\n\nExpandable tiles have **enabled**, **hover**, **focus**, and **disabled**\nstates. For more information about expandable tile states, see the\n[Style](https://carbondesignsystem.com/components/tile/style/) tab.\n\n### Interactions\n\n#### Mouse\n\n- Without interactive elements: The tile is expanded by clicking anywhere within\n  the tile container.\n- With interactive elements: The tile is expanded by clicking on the button in\n  the bottom right of the tile.\n\n#### Keyboard\n\n- ```\n  Tab\n  ```\n\n  Copy to clipboard\n\n  moves focus forward through tiles. If there are interactive elements,\n\n  ```\n  Tab\n  ```\n\n  Copy to clipboard\n\n  moves focus forward in a logical order.\n- ```\n  Shift\n  ```\n\n  Copy to clipboard\n\n  +\n\n  ```\n  Tab\n  ```\n\n  Copy to clipboard\n\n  moves focus backward through tiles. If there are interactive\n  elements,\n\n  ```\n  Tab\n  ```\n\n  Copy to clipboard\n\n  moves focus forward in a logical order.\n- ```\n  Enter\n  ```\n\n  Copy to clipboard\n\n  expands and collapses the tile.\n\n### Clickable areas\n\nIf the expandable tile does not have interactive elements, it can be expanded or\ncollapsed by clicking anywhere on the tiles container. If the expandable tile\nhas interactive elements, it can be expanded or collapsed by clicking on the\nbutton in the bottom right corner. Interactive elements within a tile can also\nbe clicked on and have their own click targets.\n\n![Clickable areas of expandable tile with the feature flag enabled](/static/1fa6d3feffb65a8f0fca182d5a49d426/3cbba/tile-usage-expandable-clickable-areas.png)\n\nClickable areas of expandable tile with the feature flag enabled\n\n## AI presence\n\nTile has a modification that takes on the AI visual styling when the AI label is\npresent in the container. The AI variants function the same as the normal\nversions except with the addition of the AI label which is both a visual\nindicator and the trigger for the explainability popover.\n\nFor more information on designing for AI, see the\n[Carbon for AI](/guidelines/carbon-for-ai/) guidelines.\n\n![Base, clickable, and selectable tiles with AI presence and feature flags enabled](/static/dd6721e604f28a5d87251025e0b88611/3cbba/tile-usage-AI-presence.png)\n\nBase, clickable, and selectable tiles with AI presence and feature flags\nenabled\n\n## Related\n\n#### Grid\n\nTo learn more about how to build tiles correctly on the grid, see Carbon’s\n[2x grid](/elements/2x-grid/implementation).\n\n#### Aspect ratio\n\nThe aspect ratio is important when building tiles and images. For further\nguidance, see Carbon’s\n[aspect ratio](https://www.carbondesignsystem.com/elements/2x-grid/overview/#aspect-ratio)\nand its\n[implementation](https://www.carbondesignsystem.com/elements/2x-grid/implementation#screen-regions).\n\n#### Buttons\n\nWhen in doubt, use full-span button alignment within tiles. For further\nguidance, see Carbon’s\n[buttons](https://carbondesignsystem.com/components/button/usage/).\n\n#### Link\n\nLink has variants depending on the context. For further guidance, see Carbon’s\n[link](https://carbondesignsystem.com/components/link/usage/).\n\n#### Spacing\n\nSpacing helps deliver clear and functional layouts. For further guidance, see\nCarbon’s [spacing](https://carbondesignsystem.com/elements/spacing/overview/).\n\n## References\n\nHagan Rivers,\n[Interactions design with cards/tiles](https://medium.com/@hagan.rivers/interaction-design-with-cards-tiles-5a6895aa220d/)\n(Medium, 2017)\n\n## Feedback\n\nHelp us improve this component by providing feedback, asking questions, and\nleaving any other comments on\n[GitHub](https://github.com/carbon-design-system/carbon-website/issues/new?assignees=&labels=feedback&template=feedback.md).\n\n[Edit this page on GitHub](https://github.com/carbon-design-system/carbon-website/edit/main/src/pages/components/tile/usage.mdx)\n\n[Previous\n\nComponents: Text input](/components/text-input/usage/)\n\n[Next\n\nTile: Style](/components/tile/style/)",
  "tags": [
    "ibm",
    "carbon",
    "design-system",
    "enterprise"
  ],
  "extracted_at": "2026-02-03T14:19:52.624617+00:00",
  "content_length": 15086,
  "content_hash": "a95ceacc84be5efe"
}