{
  "id": "css-tricks__a-complete-guide-to-links-and-buttons_",
  "source_id": "css-tricks",
  "source_name": "CSS-Tricks Guides",
  "category": "css_styling",
  "url": "https://css-tricks.com/a-complete-guide-to-links-and-buttons/",
  "title": "Links and Buttons Guide | CSS-Tricks",
  "content": "There is a lot to know about links and buttons in HTML. There is markup implementation and related attributes, styling best practices, things to avoid, and the even-more-nuanced cousins of the link: buttons and button-like inputs.\nLet’s take a look at the whole world of links and buttons, and all the considerations at the HTML, CSS, JavaScript, design, and accessibility layers that come with them. There are plenty of pitfalls and bad practices to avoid along the way. By covering it, we’ll have a complete good UX implementation of both elements.\nQuick\nguidelines\non when to use each:\nAre you giving a user a way to go to another page or a different part of the same page? Use a\nlink\n(\n<a href=\"/somewhere\">link</a>\n)\nAre you making a JavaScript-powered clickable action? Use a\nbutton\n(\n<button type=\"button\">button</button>\n)\nAre you submitting a form? Use a\nsubmit input\n(\n<input type=\"submit\" value=\"Submit\">\n)\nLinks\nLinks are one of the most basic, yet deeply fundamental and foundational building blocks of the web. Click a link, and you move to another page or are moved to another place within the same page.\nTable of Contents\nHTML implementation\nStyling and CSS considerations\nJavaScript considerations\nAccessibility considerations\nHTML implementation\nA basic link\n<a href=\"https://css-tricks.com\">CSS-Tricks</a>\nThat’s a link to a “fully qualified” or “absolute” URL.\nA relative link\nYou can link “relatively” as well:\n<!-- Useful in navigation, but be careful in content that may travel elsewhere (e.g. RSS) -->\n<a href=\"/pages/about.html\">About</a>\nThat can be useful, for example, in development where the domain name is likely to be different than the production site, but you still want to be able to click links. Relative URLs are most useful for things like navigation, but be careful of using them within content — like blog posts — where that content may be read off-site, like in an app or RSS feed.\nA jump link\nLinks can also be “hash links” or “jump links” by starting with a\n#\n:\n<a href=\"#section-2\">Section Two</a>\n<!-- will jump to... -->\n<section id=\"section-2\"></section>\nClicking that link will “jump” (scroll) to the first element in the DOM with an ID that matches, like the section element above.\n💥\nLittle trick:\nUsing a hash link (e.g.\n#0\n) in development can be useful so you can click the link without being sent back to the top of the page like a click on a\n#\nlink does. But careful, links that don’t link anywhere should never make it to production.\n💥\nLittle trick:\nJump-links can sometimes benefit from\nsmooth scrolling\nto help people understand that the page is moving from one place to another.\nIt’s a fairly common UI/UX thing to see a “Back to top” link on sites, particularly where important navigational controls are at the top but there is quite a bit of content to scroll (or otherwise navigate) through. To create a jump link, link to the ID of an element that is at the top of the page where it makes sense to send focus back to.\n<a href=\"#top-of-page\">Back to Top</a>\nJump links are sometimes also used to link to other anchor (\n<a>\n) elements that have no\nhref\nattribute. Those are called “placeholder” links:\n<a id=\"section-2\"></a>\n<h3>Section 2</h3>\nThere are\naccessibility considerations\nof these, but overall they are acceptable.\nDisabled links\nA link without an\nhref\nattribute is the only\npractical way\nto disable a link. Why disable a link? Perhaps it’s a link that only becomes active after logging in or signing up.\na:not([href]) {\n  /* style a \"disabled\" link */\n}\nWhen a link has no\nhref\n, it has no role, no focusability, and no keyboard events.\nThis is intentional\n. You could think of it like a\n<span>\n.\nDo you need the link to open in a new window or tab?\nYou can use the\ntarget\nattribute for that, but it is\nstrongly discouraged\n.\n<a href=\"https://css-tricks.com\" target=\"_blank\" rel=\"noopener noreferrer\">\n  CSS-Tricks\n</a>\nThe bit that makes it work is\ntarget=\"_blank\"\n, but note the extra\nrel\nattribute and values there which\nmake it safer\nand\nfaster\n.\nMaking links open in new tabs is a major UX discussion. We have\na whole article about when to use it here\n. Summarized:\nDon’t use it:\nBecause you or your client prefer it personally.\nBecause you’re trying to beef up your time on site metric.\nBecause you’re distinguishing between internal and external links or content types.\nBecause it’s your way out of dealing with infinite scroll trickiness.\nDo use it:\nBecause a user is doing something on the current page, like actively playing media or has unsaved work.\nYou have some obscure technical reason where you are forced to (even then you’re still probably the rule, not the exception).\nNeed the link to trigger a download?\nThe\ndownload\nattribute\non a link will instruct the browser to download the linked file rather than opening it within the current page/tab. It’s a nice UX touch.\n<a href=\"/files/file.pdf\" download>Download PDF</a>\nThe\nrel\nattribute\nThis attribute is for the relationship of the link to the target.\nThe\nrel\nattribute is also commonly used on the\n<link>\nelement (which is not used for creating hyperlinks, but for things like including CSS and preloading). We’re not including\nrel\nvalues for the\n<link>\nelement here, just anchor links.\nHere are some basic examples:\n<a href=\"/page/3\" rel=\"next\">Next</a>\n<a href=\"/page/1\" rel=\"prev\">Previous</a>\n\n<a href=\"http://creativecommons.org/licenses/by/2.0/\" rel=\"license\">cc by 2.0</a>\n\n<a href=\"/topics/\" rel=\"directory\">All Topics</a>\nrel=\"alternate\"\n: Alternate version of the document.\nrel=\"author\"\n: Author of the document.\nrel=\"help\"\n: A resource for help with the document.\nrel=\"license\"\n: License and legal information.\nrel=\"manifest\"\n: Web App Manifest document.\nrel=\"next\"\n: Next document in the series.\nrel=\"prev\"\n: Previous document in the series.\nrel=\"search\"\n: A document meant to perform a search in the current document.\nThere are also some\nrel\nattributes specifically to\ninform search engines\n:\nrel=\"sponsored\"\n: Mark links that are advertisements or paid placements (commonly called paid links) as sponsored.\nrel=\"ugc\"\n: For not-particularly-trusted user-generated content, like comments and forum posts.\nrel=\"nofollow\"\n: Tell the search engine to ignore this and not associate this site with where this links to.\nAnd also some\nrel\nattributes that are most security-focused:\nrel=\"noopener\"\n: Prevent a new tab from using the JavaScript\nwindow.opener\nfeature, which could potentially access the page containing the link (your site) to perform malicious things, like stealing information or sharing infected code. Using this with\ntarget=\"_blank\"\nis\noften a good idea\n.\nrel=\"noreferrer\"\n: Prevent other sites or tracking services (e.g. Google Analytics) from identifying your page as the source of clicked link.\nYou can use multiple space-separated values if you need to (e.g.\nrel=\"noopener noreferrer\"\n)\nAnd finally, some\nrel\nattributes come from\nthe microformats standard\nor the\nindieweb\nlike:\nrel=\"directory\"\n: Indicates that the destination of the hyperlink is a directory listing containing an entry for the current page.\nrel=\"tag\"\n: Indicates that the destination of that hyperlink is an author-designated “tag” (or keyword/subject) for the current page.\nrel=\"payment\"\n: Indicates that the destination of that hyperlink provides a way to show or give support for the current page.\nrel=\"help\"\n: States that the resource linked to is a help file or FAQ for the current document.\nrel=\"me\"\n: Indicates that its destination represents the same person or entity as the current page.\nARIA roles\nThe default role of a link is\nlink\n, so you do\nnot\nneed to do:\n<a role=\"link\" href=\"/\">Link</a>\nYou’d only need that if you were faking a link, which would be a weird/rare thing to ever need to do, and you’d have to use some JavaScript in addition to this to make it actually follow the link.\n<span class=\"link\" tabindex=\"0\" role=\"link\" data-href=\"/\">\n  Fake accessible link created using a span\n</span>\nJust looking above you can see how much extra work faking a link is, and that is before you consider that is breaks right-clicking, doesn’t allow opening in a new tab, doesn’t work with Windows High Contrast Mode and other reader modes and assistive technology. Pretty bad!\nA useful ARIA role to\nindicate the current\npage, like:\n<a href=\"/\" aria-current=\"page\">Home</a>\n<a href=\"/contact\">Contact</a>\n<a href=\"/about\">About/a></a>\nShould you use the\ntitle\nattribute?\nProbably not\n. Save this for giving an\niframe\na short, descriptive title.\n<a title=\"I don't need to be here\" href=\"/\">\n  List of Concerts\n</a>\ntitle\nprovides a hover-triggered UI popup showing the text you wrote. You can’t style it, and it’s\nnot really that accessible\n.\nHover-triggered is the key phrase here. It’s unusable on any touch-only device. If a link needs more contextual information, provide that in actual content around the link, or use descriptive text the link itself (as opposed to something like “Click Here”).\nIcon-only links\nIf a link only has an icon inside it, like:\n<a href=\"/\">😃</a>\n\n<a href=\"/\">\n  <svg> ... </svg>\n</a>\nThat isn’t enough contextual information about the link, particularly for accessibility reasons, but\npotentially for anybody\n. Links with text are almost always more clear. If you absolutely can’t use text, you can use a pattern like:\n<a href=\"/\">\n  <!-- Hide the icon from assistive technology -->\n  <svg aria-hidden=\"true\" focusable=\"false\"> ... </svg>\n  <!-- Acts as a label that is hidden from view -->\n  <span class=\"visually-hidden\">Useful link text</span>\n</a>\nvisually-hidden\nis a class used to visually hide the label text with CSS:\n.visually-hidden {\n  border: 0;\n  clip: rect(0 0 0 0);\n  height: 1px;\n  margin: -1px;\n  overflow: hidden;\n  padding: 0;\n  position: absolute;\n  white-space: nowrap;\n  width: 1px;\n}\nUnlike\naria-label\n, visually hidden text can be translated and will hold up better in\nspecialized browsing modes\n.\nLinks around images\nImages can be links if you wrap them in a link. There is no need to use the alt text to say the image is a link, as assistive technology will do that already.\n<a href=\"/buy/puppies/now\">\n  <img src=\"puppy.jpg\" alt=\"A happy puppy.\">\n</a>\nLinks around bigger chunks of content\nYou can link a whole area of content, like:\n<a href=\"/article/\">\n  <div class=\"card\">\n    <h2>Card</h2>\n    <img src=\"...\" alt=\"...\">\n    <p>Content</p>\n  </div>\n</a>\nBut of course, there are UX implications. For example, it can be harder to select the text, and the entire element needs fairly complex styling to create clear focus and hover states. There are also\naccessibility implications\n, like the fact that the content of the entire card is read before it is announced as a link.\nHere’s an example with two approaches. The first wraps the entire card in a link. This is valid, but remember the implications. The second has a link inside the title, and the link has a pseudo-element on it that covers the entire card. This also has implications (a bit awkward to select text, for example), but is perhaps more expected for assistive technology.\nThe second example also opens up the possibility of including multiple links. You\ncan’t nest links\n, so things get a little tricky if you need to.\nIt’s possible though\n, by making the individual links set above the card-covering link with z-index.\nStyling and CSS considerations\nHere’s the default look of a link:\nThe default User-Agent styling of a link.\nIt’s likely you’ll be changing the style of your links, and also likely you’ll use CSS to do it. I could make all my links red in CSS by doing:\na {\n  color: red;\n}\nSometimes selecting and styling\nall\nlinks on a page is a bit heavy-handed, as links in navigation might be treated entirely differently than links within text. You can always\nscope\nselectors to target links within particular areas like:\n/* Navigation links */\nnav a { }\n\n/* Links in an article */\narticle a { }\n\n/* Links contained in an element with a \"text\" class */\n.text a { }\nOr select the link directly to style.\n.link {\n  /* For styling <a class=\"link\" href=\"/\"> */\n}\n\na[aria-current=\"page\"] {\n  /* You'll need to apply this attribute yourself, but it's a great pattern to use for active navigation. */\n}\nLink states\nLinks are focusable elements. In other words, they can be selected using the\nTab\nkey on a keyboard. Links are perhaps the most common element where you’ll very consciously design the different states, including a\n:focus\nstate.\n:hover\n: For styling when a mouse pointer is over the link.\n:visited\n: For styling when the link has been followed, as best as the browser can remember. It has limited styling ability due to security.\n:link\n: For styling when a link has\nnot\nbeen visited.\n:active\n: For styling when the link is pressed (e.g. the mouse button is down or the element is being tapped on a touch screen).\n:focus\n: Very important! Links should always have a focus style. If you choose to remove the default blue outline that most browsers apply, also use this selector to\nre-apply a visually obvious focus style\n.\nThese are chainable like any pseudo-class, so you could do something like this if it is useful for your design/UX.\n/* Style focus and hover states in a single ruleset */\na:focus:hover { }\nYou can style a link to look button-like\nPerhaps some of the confusion between links and buttons is stuff like this:\nVery cool “button” style from\nKatherine Kato\n.\nThat certainly looks like a button! Everyone would call that a button. Even a design system would likely call that a button and perhaps have a class like\n.button { }\n. But! A thing you can click that says “Learn More” is\nvery much a link, not a button\n. That’s completely fine, it’s just yet another reminder to use the semantically and functionally correct element.\nColor contrast\nSince we often style links with a distinct color, it’s important to use a color with sufficient color contrast for accessibility. There is a wide variety of visual impairments (see the tool\nWhoCanUse\nfor simulating color combinations with different impairments) and high contrast helps nearly all of them.\nPerhaps you set a blue color for links:\nThe blue link is #2196F3.\nWhile that might look OK to you, it’s better to use tools for testing to ensure the color has a strong enough ratio according to\nresearched guidelines\n. Here, I’ll look at Chrome DevTools and it will tell me this color is not compliant in that it doesn’t have enough contrast with the background color behind it.\nChrome DevTools is telling us this link color does\nnot\nhave enough contrast.\nColor contrast is a big consideration with links, not just because they are often colored in a unique color that needs to be checked, but because they have all those different states (hover, focus, active, visited) which also might have different colors. Compound that with the fact that text can be selected and you’ve got a lot of places to consider contrast.\nHere’s an article about all that.\nStyling “types” of links\nWe can get clever in CSS with attribute selectors and figure out what kind of resource a link is pointing to, assuming the\nhref\nvalue has useful stuff in it.\n/* Style all links that include .pdf at the end */\na[href$=\".pdf\"]::after {\n  content: \" (PDF)\";\n}\n\n/* Style links that point to Google */\na[href*=\"google.com\"] {\n  color: purple;\n}\nStyling links for print\nCSS has an\n“at-rule”\nfor declaring styles that only take effect on printed media (e.g. printing out a web page). You can include them in any CSS like this:\n@media print {\n  /* For links in content, visually display the link */ \n  article a::after { \n    content: \" (\" attr(href) \")\";\n  }\n}\nResetting styles\nIf you needed to take all the styling off a link (or really any other element for that matter), CSS provides a way to remove all the styles using the\nall\nproperty.\n.special-area a {\n  all: unset;\n  all: revert;\n  \n  /* Start from scratch */\n  color: purple;\n}\nYou can also remove individual styles with keywords. (Again, this isn’t really unique to links, but is generically useful):\na {\n  /* Grab color from nearest parent that sets it */\n  color: inherit;\n\n  /* Wipe out style (turn black) */\n  color: initial;\n\n  /* Change back to User Agent style (blue) */\n  color: revert;\n}\nJavaScript considerations\nSay you wanted to stop the clicking of a link from doing what it normally does: go to that link or jump around the page. In JavaScript, you can use\npreventDefault\nto prevent jumping around.\nconst jumpLinks = document.querySelectorAll(\"a[href^='#']\");\n\njumpLinks.forEach(link => {\n link.addEventListener('click', event => {\n    event.preventDefault();\n    // Do something else instead, like handle the navigation behavior yourself\n  });\n});\nThis kind of thing is at the core of how “Single Page Apps” (SPAs) work. They intercept the clicks so browsers don’t take over and handle the navigation.\nSPAs see where you are trying to go (within your own site), load the data they need, replace what they need to on the page, and update the URL. It’s an awful lot of work to replicate what the browser does for free, but you get the ability to do things like animate between pages.\nAnother JavaScript concern with links is that, when a link to another page is clicked, the page is left and another page loads. That can be problematic for something like a page that contains a form the user is filling out but hasn’t completed. If they click the link and leave the page, they lose their work! Your only opportunity to prevent the user from leaving is by using the\nbeforeunload\nevent.\nwindow.addEventListener(\"beforeunload\", function(event) {\n  // Remind user to save their work or whatever.\n});\nA link that has had its default behavior removed won’t announce the new destination. This means a person using assistive technology may not know where they wound up. You’ll have to do things like update the page’s title and move focus back up to the top of the document.\nJavaScript frameworks\nIn a JavaScript framework, like\nReact\n, you might sometimes see links created from something like a\n<Link />\ncomponent rather than a native\n<a>\nelement. The custom component probably creates a native\n<a>\nelement, but with extra functionality, like enabling the JavaScript router to work, and adding attributes like\naria-current=\"page\"\nas needed, which is a good thing!\nUltimately, a link is a link. A JavaScript framework might offer or encourage some level of abstraction, but you’re always free to use regular links.\nAccessibility considerations\nWe covered some accessibility in the sections above (it’s all related!), but here are some more things to think about.\nYou don’t need text like “Link” or “Go to” in the link text itself. Make the text meaningful (“documentation” instead of “click here”).\nLinks already have an ARIA role by default (\nrole=\"link\"\n) so there’s no need to explicitly set it.\nTry not to use the URL itself as the text (\n<a href=\"google.com\">google.com</a>\n)\nLinks are\ngenerally\nblue and\ngenerally\nunderlined and that’s\ngenerally good\n.\nAll images in content should have\nalt\ntext anyway, but doubly so when the image is wrapped in a link with otherwise no text.\nUnique accessible names\nSome assistive technology can create\nlists of interactive elements on the page\n. Imagine a group of four article cards that all have a “Read More”, the list of interactive elements will be like:\nRead More\nRead More\nRead More\nRead More\nNot very useful. You could make use of that\n.visually-hidden\nclass we covered to make the links more like:\n<a href=\"/article\">\n  Read More\n  <span class=\"visually-hidden\">\n    of the article \"Dancing with Rabbits\".\n  <span>\n</a>\nNow each link is unique and clear. If the design can support it, do it\nwithout\nthe visually hidden class to remove the ambiguity for everyone.\nButtons\nButtons are for triggering actions. When do you use the\n<button>\nelement? A\ngood rule\nis to use a button when there is “no meaningful\nhref\n.” Here’s another way to think of that: if clicking it doesn’t do anything without JavaScript, it should be a\n<button>\n.\nA\n<button>\nthat is within a\n<form>\n, by default, will submit that form. But aside from that, button elements don’t have any default behavior, and you’ll be wiring up that interactivity with JavaScript.\nTable of Contents\nHTML implementation\nStyling and CSS considerations\nJavaScript considerations\nAccessibility considerations\nHTML implementation\n<button>Buy Now</button>\nButtons inside of a\n<form>\ndo something by default: they submit the form! They can also reset it, like their input counterparts. The\ntype\nattributes matter:\n<form action=\"/\" method=\"POST\">\n  <input type=\"text\" name=\"name\" id=\"name\">\n  <button>Submit</button>\n\n  <!-- If you want to be more explicit... -->\n  <button type=\"submit\">Submit</button>\n\n  <!-- ...or clear the form inputs back to their initial values -->\n  <button type=\"reset\">Reset</button>\n\n  <!-- This prevents a `submit` action from firing which may be useful sometimes inside a form -->\n  <button type=\"button\">Non-submitting button</button>\n</form>\nSpeaking of forms, buttons have some neat tricks up their sleeve where they can override attributes of the\n<form>\nitself.\n<form action=\"/\" method=\"get\">\n\n  <!-- override the action -->\n  <button formaction=\"/elsewhere/\" type=\"submit\">Submit to elsewhere</button>\n\n  <!-- override encytype -->\n  <button formenctype=\"multipart/form-data\" type=\"submit\"></button>\n\n  <!-- override method -->\n  <button formmethod=\"post\" type=\"submit\"></button>\n\n  <!-- do not validate fields -->\n  <button formnovalidate type=\"submit\"></button>\n\n  <!-- override target e.g. open in new tab -->\n  <button formtarget=\"_blank\" type=\"submit\"></button>\n\n</form>\nAutofocus\nSince buttons are focusable elements, we can automatically focus on them when the page loads using the\nautofocus\nattribute:\n<div class=\"modal\">\n\n  <h2>Save document?</h2>\n\n  <button>Cancel</button>\n  <button autofocus>OK</button>\n</div>\nPerhaps you’d do that inside of a modal dialog where one of the actions is a default action and it helps the UX (e.g. you can press\nEnter\nto dismiss the modal). Autofocusing\nafter a user action\nis perhaps the only good practice here, moving a user’s focus without their permission, as the\nautofocus\nattribute is capable of, can be a problem for screen reader and screen magnifier users.\nNote that\nautofocus\nmay not work if the element is within an\n<iframe sandbox>\nfor security reasons.\nDisabling buttons\nTo prevent a button from being interactive, there is a\ndisabled\nattribute you can use:\n<button disabled>Pay Now</button>\n<p class=\"error-message\">Correct the form above to submit payment.</p>\nNote that we’ve included descriptive text alongside the disabled button. It can be very frustrating to find a disabled button and not know why it’s disabled. A better way to do this could be to let someone submit the form, and then explain why it didn’t work in the validation feedback messaging.\nRegardless, you could style a disabled button this way:\n/* Might be good styles for ANY disabled element! */\nbutton[disabled] {\n  opacity: 0.5;\n  pointer-events: none;\n}\nWe’ll cover other states and styling later in this guide.\nButtons can contain child elements\nA submit button and a submit input (\n<input type=\"submit\">\n) are identical in functionality, but different in the sense that an input is unable to contain child elements while a button can.\n<button>\n   <svg aria-hidden=\"true\" focusable=\"false\">\n     <path d=\"...\" />\n   </svg>\n   <span class=\"callout\">Big</span>\n   Sale!\n</button>\n\n<button type=\"button\">\n  <span role=\"img\" aria-label=\"Fox\">\n    🦊\n  </span>\n  Button\n</button>\nNote the\nfocusable=\"false\"\nattribute on the SVG element above. In that case, since the icon is decorative, this will help assistive technology only announce the button’s label.\nStyling and CSS considerations\nButtons are generally styled to look very button-like. They should look\npressable\n. If you’re looking for inspiration on fancy button styles, you’d do well looking at\nthe CodePen Topic on Buttons\n.\n1\n,\n2\n,\n3\n,\n4\n,\n5\n,\n6\nCross-browser/platform button styles\nHow buttons look by default varies by browser and platform.\nJust on macOS: Chrome, Safari, and Firefox (they look the same)\nAdd\nborder: 0;\nto those same buttons as above, and we have different styles entirely.\nWhile there is some UX truth to leaving the defaults of form elements alone so that they match that browser/platform’s style and you get some\naffordance\nfor free, designers typically don’t like default styles, particularly ones that differ across browsers.\nResetting the default button style\nRemoving all the styles from a button is easier than you think. You’d think, as a form control,\nappearance: none;\nwould help, but don’t count on that. Actually\nall: revert;\nis a better bet to wipe the slate clean.\nYou can see how a variety of properties are involved\nAnd that’s not all of them. Here’s a consolidated chunk of\nwhat Normalize does\nto buttons.\nbutton {\n  font-family: inherit; /* For all browsers */\n  font-size: 100%; /* For all browsers */\n  line-height: 1.15; /* For all browsers */\n  margin: 0; /* Firefox and Safari have margin */\n  overflow: visible; /* Edge hides overflow */\n  text-transform: none; /* Firefox inherits text-transform */\n  -webkit-appearance: button; /* Safari otherwise prevents some styles */\n}\n\nbutton::-moz-focus-inner {\n  border-style: none;\n  padding: 0;\n}\n\nbutton:-moz-focusring {\n  outline: 1px dotted ButtonText;\n}\nA consistent\n.button\nclass\nIn addition to\nusing reset or baseline CSS\n, you may want to have a class for buttons that gives you a strong foundation for styling and works across both links and buttons.\n.button {\n  border: 0;\n  border-radius: 0.25rem;\n  background: #1E88E5;\n  color: white;\n  font-family: -system-ui, sans-serif;\n  font-size: 1rem;\n  line-height: 1.2;\n  white-space: nowrap;\n  text-decoration: none;\n  padding: 0.25rem 0.5rem;\n  margin: 0.25rem;\n  cursor: pointer;\n}\nCheck out this Pen\nto see why all these properties are needed to make sure it works correctly across elements.\nButton states\nJust as with links, you’ll want to style the states of buttons.\nbutton:hover { }\nbutton:focus { }\nbutton:active { }\nbutton:visited { } /* Maybe less so */\nYou may also want to\nuse ARIA attributes for styling\n, which is a neat way to encourage using them correctly:\nbutton[aria-pressed=\"true\"] { }\nbutton[aria-pressed=\"false\"] { }\nLink-styled buttons\nThere are always exceptions. For example, a website in which you need a button-triggered action within a sentence:\n<p>You may open your <button>user settings</button> to change this.</p>\nWe’ve used a button instead of an anchor tag in the above code, as this hypothetical website opens user settings in a modal dialog rather than linking to another page. In this situation, you may want to style the button as if it looks like a link.\nThis is probably rare enough that you would probably make a class (e.g.\n.link-looking-button\n) that incorporates the reset styles from above and otherwise matches what you do for anchor links.\nBreakout buttons\nRemember earlier when we talked about the possibility of wrapping entire elements in links? If you have a button within another element, but you want that\nentire\nouter element to be clickable/tappable as if it’s the button, that’s\na “breakout” button\n. You can use an absolutely-positioned pseudo-element on the button to expand the clickable area to the whole region. Fancy!\nJavaScript considerations\nEven without JavaScript, button elements can be triggered by the\nSpace\nand\nEnter\nkeys on a keyboard. That’s part of what makes them such appealing and useful elements: they are discoverable, focusable, and interactive with assistive technology in a predictable way.\nPerhaps any\n<button>\nin that situation should be inserted into the DOM\nby\nJavaScript. A tall order! Food for thought. 🤔\n“Once” handlers\nSay a button does something pretty darn important, like submitting a payment. It would be pretty scary if it was programmed such that clicking the button multiple times submitted multiple payment requests. It is situations like this where you would attach a click handler to a button that only runs once. To make that clear to the user, we’ll disable the button on click as well.\ndocument.querySelector(\"button\").addEventListener('click', function(event) {\n  event.currentTarget.setAttribute(\"disabled\", true);\n}, {\n    once: true\n});\nThen you would intentionally un-disable the button and reattach the handler when necessary.\nInline handlers\nJavaScript can be executed by activating a button through code on the button itself:\n<button onclick=\"console.log('clicked');\">\n  Log it.\n</button>\n\n<button onmousedown=\"\">\n</button>\n\n<button onmouseup=\"\">\n</button>\nThat practice went from being standard practice to being a faux pas (not abstracting JavaScript functionality away from HTML) to,\neh, you need it when you need it\n. One advantage is that if you’re injecting this HTML into the DOM, you don’t need to bind/re-bind JavaScript event handlers to it because it already has one.\nJavaScript frameworks\nIt’s common in any JavaScript framework to make a component for handling buttons, as buttons typically have lots of variations. Those variations can be turned into an API of sorts. For example, in React:\nconst Button = ({ className, children }) => {\n  const [activated, setActivated] = React.useState(false);\n  return (\n    <button\n      className={`button ${className}`}\n      aria-pressed={activated ? \"true\" : \"false\"}\n      onClick={() => setActivated(!activated)}\n    >\n      {children}\n    </button>\n  );\n};\nIn that example, the\n<Button />\ncomponent ensures the button will have a\nbutton\nclass and handles a toggle-like active class.\nAccessibility considerations\nThe biggest accessibility consideration with buttons is\nactually using\nbuttons. Don’t try to replicate a button with a\n<div>\nor a\n<span>\n, which is, unfortunately, more common than you might think. It’s very likely that will cause problems. (Did you deal with focusability? Did you deal with keyboard events? Great. There’s still probably more stuff you’re forgetting.)\nFocus styles\nLike all focusable elements, browsers apply a default focus style, which is usually a blue outline.\nFocus styles on Chrome/macOS\nWhile it’s arguable that you should leave that alone as it’s a very clear and obvious style for people that benefit from focus styles, it’s also not out of the question to change it.\nWhat you should\nnot\ndo is\nbutton:focus { outline: 0; }\nto remove it. If you ever remove a focus style like that, put it back at the same time.\nbutton:focus {\n  outline: 0; /* Removes the default blue ring */\n\n  /* Now, let's create our own focus style */\n  border-radius: 3px;\n  box-shadow: 0 0 0 2px red;\n}\nCustom focus style\nThe fact that a button may become focused when clicked and apply that style at the same time is offputting to some. There is a trick (that has limited, but increasing,\nbrowser support\n) on removing focus styles from clicks and not keyboard events:\n:focus:not(:focus-visible) { \n  outline: 0; \n}\nARIA\nButtons already have the\nrole\nthey need (\nrole=\"button\"\n). But there are some other ARIA attributes that are related to buttons:\naria-pressed\n: Turns a button into a\ntoggle\n, between\naria-pressed=\"true\"\nand\naria-pressed=\"false\"\n.\nMore on button toggles\n, which can also be done with\nrole=\"switch\"\nand\naria-checked=\"true\"\n.\naria-expanded\n: If the button controls the open/closed state of another element (like a dropdown menu), you apply this attribute to indicate that like\naria-expanded=\"true\"\n.\naria-label\n: Overrides the text within the button. This is useful for labeling buttons that otherwise don’t have text, but you’re still probably better off using a\nvisually-hidden\nclass so it can be translated.\naria-labelledby\n: Points to an element that will act as the label for the button.\nFor that last one:\n<button aria-labelledby=\"buttonText\">\n  Time is running out! \n  <span id=\"buttonText\">Add to Cart</span>\n</button>\nDeque has\na deeper dive blog post into button accessibility\nthat includes much about ARIA.\nDialogs\nIf a button opens a dialog, your job is to\nmove the focus inside and trap it there.\nWhen closing the dialog, you need to return focus back to that button so the user is back exactly where they started. This makes the experience of using a modal the same for someone who relies on assistive technology as for someone who doesn’t.\nFocus management isn’t just for dialogs, either. If clicking a button runs a calculation and changes a value on the page, there is no context change there, meaning focus should remain on the button. If the button does something like “move to next page,” the focus should be moved to the start of that next page.\nSize\nDon’t make buttons too small. That goes for links and any sort of interactive control. People with any sort of reduced dexterity\nwill benefit\n.\nThe classic Apple guideline for the\nminimum size for a touch target\n(button) is 44x44pt.\nHere’s some guidelines from other companies\n.\nFitt’s Law\ntells us smaller targets have greater error rates.\nGoogle even takes button sizes into consideration\nwhen evaluating the SEO of a site.\nIn addition to ample size,\ndon’t place buttons too close each other\n, whether they’re stacked vertically or together on the same line. Give them some margin because people experiencing motor control issues run the risk of clicking the wrong one.\nActivating buttons\nButtons work by being clicked/touched, pressing the\nEnter\nkey, or pressing the\nSpace\nkey (when focused). Even if you add\nrole=\"button\"\nto a link or div, you won’t get the spacebar functionality, so at the risk of beating a dead horse, use\n<button>\nin those cases.",
  "content_markdown": "There is a lot to know about links and buttons in HTML. There is markup implementation and related attributes, styling best practices, things to avoid, and the even-more-nuanced cousins of the link: buttons and button-like inputs.\n\nLet’s take a look at the whole world of links and buttons, and all the considerations at the HTML, CSS, JavaScript, design, and accessibility layers that come with them. There are plenty of pitfalls and bad practices to avoid along the way. By covering it, we’ll have a complete good UX implementation of both elements.\n\nQuick **guidelines** on when to use each:\n\n- Are you giving a user a way to go to another page or a different part of the same page? Use a **link** (`<a href=\"/somewhere\">link</a>`)\n- Are you making a JavaScript-powered clickable action? Use a **button** (`<button type=\"button\">button</button>`)\n- Are you submitting a form? Use a **submit input** (`<input type=\"submit\" value=\"Submit\">`)\n\n## Links\n\nLinks are one of the most basic, yet deeply fundamental and foundational building blocks of the web. Click a link, and you move to another page or are moved to another place within the same page.\n\n**Table of Contents**\n\n- [HTML implementation](#links-heading-1)\n- [Styling and CSS considerations](#links-heading-2)\n- [JavaScript considerations](#links-heading-3)\n- [Accessibility considerations](#links-heading-4)\n\n### HTML implementation\n\n#### A basic link\n\n```\n<a href=\"https://css-tricks.com\">CSS-Tricks</a>\n```\n\nThat’s a link to a “fully qualified” or “absolute” URL.\n\n#### A relative link\n\nYou can link “relatively” as well:\n\n```\n<!-- Useful in navigation, but be careful in content that may travel elsewhere (e.g. RSS) -->\n<a href=\"/pages/about.html\">About</a>\n```\n\nThat can be useful, for example, in development where the domain name is likely to be different than the production site, but you still want to be able to click links. Relative URLs are most useful for things like navigation, but be careful of using them within content — like blog posts — where that content may be read off-site, like in an app or RSS feed.\n\n#### A jump link\n\nLinks can also be “hash links” or “jump links” by starting with a `#`:\n\n```\n<a href=\"#section-2\">Section Two</a>\n<!-- will jump to... -->\n<section id=\"section-2\"></section>\n```\n\nClicking that link will “jump” (scroll) to the first element in the DOM with an ID that matches, like the section element above.\n\n💥 **Little trick:** Using a hash link (e.g. `#0`) in development can be useful so you can click the link without being sent back to the top of the page like a click on a `#` link does. But careful, links that don’t link anywhere should never make it to production.\n\n💥 **Little trick:** Jump-links can sometimes benefit from [smooth scrolling](https://css-tricks.com/snippets/jquery/smooth-scrolling/) to help people understand that the page is moving from one place to another.\n\nIt’s a fairly common UI/UX thing to see a “Back to top” link on sites, particularly where important navigational controls are at the top but there is quite a bit of content to scroll (or otherwise navigate) through. To create a jump link, link to the ID of an element that is at the top of the page where it makes sense to send focus back to.\n\n```\n<a href=\"#top-of-page\">Back to Top</a>\n```\n\nJump links are sometimes also used to link to other anchor (`<a>`) elements that have no `href` attribute. Those are called “placeholder” links:\n\n```\n<a id=\"section-2\"></a>\n<h3>Section 2</h3>\n```\n\nThere are [accessibility considerations](https://www.scottohara.me/note/2019/07/17/placeholder-link.html) of these, but overall they are acceptable.\n\n#### Disabled links\n\nA link without an `href` attribute is the only [practical way](https://css-tricks.com/how-to-disable-links/) to disable a link. Why disable a link? Perhaps it’s a link that only becomes active after logging in or signing up.\n\n```\na:not([href]) {\n  /* style a \"disabled\" link */\n}\n```\n\nWhen a link has no `href`, it has no role, no focusability, and no keyboard events. [This is intentional](https://www.scottohara.me/note/2019/07/17/placeholder-link.html). You could think of it like a `<span>`.\n\n#### Do you need the link to open in a new window or tab?\n\nYou can use the `target` attribute for that, but it is [strongly discouraged](https://adrianroselli.com/2020/02/link-targets-and-3-2-5.html).\n\n```\n<a href=\"https://css-tricks.com\" target=\"_blank\" rel=\"noopener noreferrer\">\n  CSS-Tricks\n</a>\n```\n\nThe bit that makes it work is `target=\"_blank\"`, but note the extra `rel` attribute and values there which [make it safer](https://mathiasbynens.github.io/rel-noopener/) and [faster](https://jakearchibald.com/2016/performance-benefits-of-rel-noopener/).\n\nMaking links open in new tabs is a major UX discussion. We have [a whole article about when to use it here](https://css-tricks.com/use-target_blank/). Summarized:\n\nDon’t use it:\n\n- Because you or your client prefer it personally.\n- Because you’re trying to beef up your time on site metric.\n- Because you’re distinguishing between internal and external links or content types.\n- Because it’s your way out of dealing with infinite scroll trickiness.\n\nDo use it:\n\n- Because a user is doing something on the current page, like actively playing media or has unsaved work.\n- You have some obscure technical reason where you are forced to (even then you’re still probably the rule, not the exception).\n\n#### Need the link to trigger a download?\n\n[The `download` attribute](https://css-tricks.com/building-good-download-button/) on a link will instruct the browser to download the linked file rather than opening it within the current page/tab. It’s a nice UX touch.\n\n```\n<a href=\"/files/file.pdf\" download>Download PDF</a>\n```\n\n#### The `rel` attribute\n\nThis attribute is for the relationship of the link to the target.\n\nThe `rel` attribute is also commonly used on the `<link>` element (which is not used for creating hyperlinks, but for things like including CSS and preloading). We’re not including `rel` values for the `<link>` element here, just anchor links.\n\nHere are some basic examples:\n\n```\n<a href=\"/page/3\" rel=\"next\">Next</a>\n<a href=\"/page/1\" rel=\"prev\">Previous</a>\n\n<a href=\"http://creativecommons.org/licenses/by/2.0/\" rel=\"license\">cc by 2.0</a>\n\n<a href=\"/topics/\" rel=\"directory\">All Topics</a>\n```\n\n- `rel=\"alternate\"`: Alternate version of the document.\n- `rel=\"author\"`: Author of the document.\n- `rel=\"help\"`: A resource for help with the document.\n- `rel=\"license\"`: License and legal information.\n- `rel=\"manifest\"`: Web App Manifest document.\n- `rel=\"next\"`: Next document in the series.\n- `rel=\"prev\"`: Previous document in the series.\n- `rel=\"search\"`: A document meant to perform a search in the current document.\n\nThere are also some `rel` attributes specifically to [inform search engines](https://support.google.com/webmasters/answer/96569?hl=en):\n\n- `rel=\"sponsored\"`: Mark links that are advertisements or paid placements (commonly called paid links) as sponsored.\n- `rel=\"ugc\"`: For not-particularly-trusted user-generated content, like comments and forum posts.\n- `rel=\"nofollow\"`: Tell the search engine to ignore this and not associate this site with where this links to.\n\nAnd also some `rel` attributes that are most security-focused:\n\n- `rel=\"noopener\"`: Prevent a new tab from using the JavaScript `window.opener` feature, which could potentially access the page containing the link (your site) to perform malicious things, like stealing information or sharing infected code. Using this with `target=\"_blank\"` is [often a good idea](https://jakearchibald.com/2016/performance-benefits-of-rel-noopener/).\n- `rel=\"noreferrer\"`: Prevent other sites or tracking services (e.g. Google Analytics) from identifying your page as the source of clicked link.\n\nYou can use multiple space-separated values if you need to (e.g. `rel=\"noopener noreferrer\"`)\n\nAnd finally, some `rel` attributes come from [the microformats standard](http://microformats.org/wiki/rel-faq#How_is_rel_used) or the [indieweb](https://indieweb.org/rel-me) like:\n\n- `rel=\"directory\"`: Indicates that the destination of the hyperlink is a directory listing containing an entry for the current page.\n- `rel=\"tag\"`: Indicates that the destination of that hyperlink is an author-designated “tag” (or keyword/subject) for the current page.\n- `rel=\"payment\"`: Indicates that the destination of that hyperlink provides a way to show or give support for the current page.\n- `rel=\"help\"`: States that the resource linked to is a help file or FAQ for the current document.\n- `rel=\"me\"`: Indicates that its destination represents the same person or entity as the current page.\n\n#### ARIA roles\n\nThe default role of a link is `link`, so you do *not* need to do:\n\n```\n<a role=\"link\" href=\"/\">Link</a>\n```\n\nYou’d only need that if you were faking a link, which would be a weird/rare thing to ever need to do, and you’d have to use some JavaScript in addition to this to make it actually follow the link.\n\n```\n<span class=\"link\" tabindex=\"0\" role=\"link\" data-href=\"/\">\n  Fake accessible link created using a span\n</span>\n```\n\nJust looking above you can see how much extra work faking a link is, and that is before you consider that is breaks right-clicking, doesn’t allow opening in a new tab, doesn’t work with Windows High Contrast Mode and other reader modes and assistive technology. Pretty bad!\n\nA useful ARIA role to [indicate the current](https://tink.uk/using-the-aria-current-attribute/) page, like:\n\n```\n<a href=\"/\" aria-current=\"page\">Home</a>\n<a href=\"/contact\">Contact</a>\n<a href=\"/about\">About/a></a>\n```\n\n#### Should you use the `title` attribute?\n\n[Probably not](https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/title#Accessibility_concerns). Save this for giving an `iframe` a short, descriptive title.\n\n```\n<a title=\"I don't need to be here\" href=\"/\">\n  List of Concerts\n</a>\n```\n\n`title` provides a hover-triggered UI popup showing the text you wrote. You can’t style it, and it’s [not really that accessible](https://www.24a11y.com/2017/the-trials-and-tribulations-of-the-title-attribute/).\n\nHover-triggered is the key phrase here. It’s unusable on any touch-only device. If a link needs more contextual information, provide that in actual content around the link, or use descriptive text the link itself (as opposed to something like “Click Here”).\n\n#### Icon-only links\n\nIf a link only has an icon inside it, like:\n\n```\n<a href=\"/\">😃</a>\n\n<a href=\"/\">\n  <svg> ... </svg>\n</a>\n```\n\nThat isn’t enough contextual information about the link, particularly for accessibility reasons, but [potentially for anybody](https://thomasbyttebier.be/blog/the-best-icon-is-a-text-label). Links with text are almost always more clear. If you absolutely can’t use text, you can use a pattern like:\n\n```\n<a href=\"/\">\n  <!-- Hide the icon from assistive technology -->\n  <svg aria-hidden=\"true\" focusable=\"false\"> ... </svg>\n  <!-- Acts as a label that is hidden from view -->\n  <span class=\"visually-hidden\">Useful link text</span>\n</a>\n```\n\n`visually-hidden` is a class used to visually hide the label text with CSS:\n\n```\n.visually-hidden {\n  border: 0;\n  clip: rect(0 0 0 0);\n  height: 1px;\n  margin: -1px;\n  overflow: hidden;\n  padding: 0;\n  position: absolute;\n  white-space: nowrap;\n  width: 1px;\n}\n```\n\nUnlike `aria-label`, visually hidden text can be translated and will hold up better in [specialized browsing modes](https://css-tricks.com/reader-mode-the-button-to-beat/).\n\n#### Links around images\n\nImages can be links if you wrap them in a link. There is no need to use the alt text to say the image is a link, as assistive technology will do that already.\n\n```\n<a href=\"/buy/puppies/now\">\n  <img src=\"puppy.jpg\" alt=\"A happy puppy.\">\n</a>\n```\n\n#### Links around bigger chunks of content\n\nYou can link a whole area of content, like:\n\n```\n<a href=\"/article/\">\n  <div class=\"card\">\n    <h2>Card</h2>\n    <img src=\"...\" alt=\"...\">\n    <p>Content</p>\n  </div>\n</a>\n```\n\nBut of course, there are UX implications. For example, it can be harder to select the text, and the entire element needs fairly complex styling to create clear focus and hover states. There are also [accessibility implications](https://adrianroselli.com/2020/02/block-links-cards-clickable-regions-etc.html), like the fact that the content of the entire card is read before it is announced as a link.\n\nHere’s an example with two approaches. The first wraps the entire card in a link. This is valid, but remember the implications. The second has a link inside the title, and the link has a pseudo-element on it that covers the entire card. This also has implications (a bit awkward to select text, for example), but is perhaps more expected for assistive technology.\n\nThe second example also opens up the possibility of including multiple links. You [can’t nest links](https://css-tricks.com/nested-links/), so things get a little tricky if you need to. [It’s possible though](https://www.sarasoueidan.com/blog/nested-links/), by making the individual links set above the card-covering link with z-index.\n\n### Styling and CSS considerations\n\nHere’s the default look of a link:\n\n![](https://i0.wp.com/css-tricks.com/wp-content/uploads/2020/01/default-link.png?resize=442%2C119&ssl=1)\n\nThe default User-Agent styling of a link.\n\nIt’s likely you’ll be changing the style of your links, and also likely you’ll use CSS to do it. I could make all my links red in CSS by doing:\n\n```\na {\n  color: red;\n}\n```\n\nSometimes selecting and styling *all* links on a page is a bit heavy-handed, as links in navigation might be treated entirely differently than links within text. You can always *scope* selectors to target links within particular areas like:\n\n```\n/* Navigation links */\nnav a { }\n\n/* Links in an article */\narticle a { }\n\n/* Links contained in an element with a \"text\" class */\n.text a { }\n```\n\nOr select the link directly to style.\n\n```\n.link {\n  /* For styling <a class=\"link\" href=\"/\"> */\n}\n\na[aria-current=\"page\"] {\n  /* You'll need to apply this attribute yourself, but it's a great pattern to use for active navigation. */\n}\n```\n\n#### Link states\n\nLinks are focusable elements. In other words, they can be selected using the `Tab` key on a keyboard. Links are perhaps the most common element where you’ll very consciously design the different states, including a `:focus` state.\n\n- `:hover`: For styling when a mouse pointer is over the link.\n- `:visited`: For styling when the link has been followed, as best as the browser can remember. It has limited styling ability due to security.\n- `:link`: For styling when a link has *not* been visited.\n- `:active`: For styling when the link is pressed (e.g. the mouse button is down or the element is being tapped on a touch screen).\n- `:focus`: Very important! Links should always have a focus style. If you choose to remove the default blue outline that most browsers apply, also use this selector to [re-apply a visually obvious focus style](https://css-tricks.com/focusing-on-focus-styles/).\n\nThese are chainable like any pseudo-class, so you could do something like this if it is useful for your design/UX.\n\n```\n/* Style focus and hover states in a single ruleset */\na:focus:hover { }\n```\n\n#### You can style a link to look button-like\n\nPerhaps some of the confusion between links and buttons is stuff like this:\n\n![](https://i0.wp.com/css-tricks.com/wp-content/uploads/2020/01/Screen-Shot-2020-01-08-at-8.55.49-PM.png?resize=264%2C142&ssl=1)\n\nVery cool “button” style from [Katherine Kato](https://codepen.io/kathykato/pen/gOOjgmP).\n\nThat certainly looks like a button! Everyone would call that a button. Even a design system would likely call that a button and perhaps have a class like `.button { }`. But! A thing you can click that says “Learn More” is [very much a link, not a button](https://css-tricks.com/css-basics-styling-links-like-boss/). That’s completely fine, it’s just yet another reminder to use the semantically and functionally correct element.\n\n#### Color contrast\n\nSince we often style links with a distinct color, it’s important to use a color with sufficient color contrast for accessibility. There is a wide variety of visual impairments (see the tool [WhoCanUse](https://whocanuse.com/) for simulating color combinations with different impairments) and high contrast helps nearly all of them.\n\nPerhaps you set a blue color for links:\n\n![](https://i0.wp.com/css-tricks.com/wp-content/uploads/2020/01/blue-links.png?resize=413%2C147&ssl=1)\n\nThe blue link is #2196F3.\n\nWhile that might look OK to you, it’s better to use tools for testing to ensure the color has a strong enough ratio according to [researched guidelines](https://developers.google.com/web/fundamentals/accessibility/accessible-styles#color_and_contrast). Here, I’ll look at Chrome DevTools and it will tell me this color is not compliant in that it doesn’t have enough contrast with the background color behind it.\n\n![](https://i0.wp.com/css-tricks.com/wp-content/uploads/2020/01/Screen-Shot-2020-01-09-at-2.22.20-PM-1024x941.png?resize=469%2C430&ssl=1)\n\nChrome DevTools is telling us this link color does *not* have enough contrast.\n\nColor contrast is a big consideration with links, not just because they are often colored in a unique color that needs to be checked, but because they have all those different states (hover, focus, active, visited) which also might have different colors. Compound that with the fact that text can be selected and you’ve got a lot of places to consider contrast. [Here’s an article about all that.](https://css-tricks.com/a-whole-bunch-of-places-to-consider-contrast-in-a-single-paragraph/)\n\n#### Styling “types” of links\n\nWe can get clever in CSS with attribute selectors and figure out what kind of resource a link is pointing to, assuming the `href` value has useful stuff in it.\n\n```\n/* Style all links that include .pdf at the end */\na[href$=\".pdf\"]::after {\n  content: \" (PDF)\";\n}\n\n/* Style links that point to Google */\na[href*=\"google.com\"] {\n  color: purple;\n}\n```\n\n#### Styling links for print\n\nCSS has an [“at-rule”](https://css-tricks.com/the-at-rules-of-css/) for declaring styles that only take effect on printed media (e.g. printing out a web page). You can include them in any CSS like this:\n\n```\n@media print {\n  /* For links in content, visually display the link */ \n  article a::after { \n    content: \" (\" attr(href) \")\";\n  }\n}\n```\n\n#### Resetting styles\n\nIf you needed to take all the styling off a link (or really any other element for that matter), CSS provides a way to remove all the styles using the `all` property.\n\n```\n.special-area a {\n  all: unset;\n  all: revert;\n  \n  /* Start from scratch */\n  color: purple;\n}\n```\n\nYou can also remove individual styles with keywords. (Again, this isn’t really unique to links, but is generically useful):\n\n```\na {\n  /* Grab color from nearest parent that sets it */\n  color: inherit;\n\n  /* Wipe out style (turn black) */\n  color: initial;\n\n  /* Change back to User Agent style (blue) */\n  color: revert;\n}\n```\n\n### JavaScript considerations\n\nSay you wanted to stop the clicking of a link from doing what it normally does: go to that link or jump around the page. In JavaScript, you can use`preventDefault` to prevent jumping around.\n\n```\nconst jumpLinks = document.querySelectorAll(\"a[href^='#']\");\n\njumpLinks.forEach(link => {\n link.addEventListener('click', event => {\n    event.preventDefault();\n    // Do something else instead, like handle the navigation behavior yourself\n  });\n});\n```\n\nThis kind of thing is at the core of how “Single Page Apps” (SPAs) work. They intercept the clicks so browsers don’t take over and handle the navigation.\n\nSPAs see where you are trying to go (within your own site), load the data they need, replace what they need to on the page, and update the URL. It’s an awful lot of work to replicate what the browser does for free, but you get the ability to do things like animate between pages.\n\nAnother JavaScript concern with links is that, when a link to another page is clicked, the page is left and another page loads. That can be problematic for something like a page that contains a form the user is filling out but hasn’t completed. If they click the link and leave the page, they lose their work! Your only opportunity to prevent the user from leaving is by using the `beforeunload` event.\n\n```\nwindow.addEventListener(\"beforeunload\", function(event) {\n  // Remind user to save their work or whatever.\n});\n```\n\nA link that has had its default behavior removed won’t announce the new destination. This means a person using assistive technology may not know where they wound up. You’ll have to do things like update the page’s title and move focus back up to the top of the document.\n\n#### JavaScript frameworks\n\nIn a JavaScript framework, like [React](https://reactjs.org/), you might sometimes see links created from something like a `<Link />` component rather than a native `<a>` element. The custom component probably creates a native `<a>` element, but with extra functionality, like enabling the JavaScript router to work, and adding attributes like `aria-current=\"page\"` as needed, which is a good thing!\n\nUltimately, a link is a link. A JavaScript framework might offer or encourage some level of abstraction, but you’re always free to use regular links.\n\n### Accessibility considerations\n\nWe covered some accessibility in the sections above (it’s all related!), but here are some more things to think about.\n\n- You don’t need text like “Link” or “Go to” in the link text itself. Make the text meaningful (“documentation” instead of “click here”).\n- Links already have an ARIA role by default (`role=\"link\"`) so there’s no need to explicitly set it.\n- Try not to use the URL itself as the text (`<a href=\"google.com\">google.com</a>`)\n- Links are *generally* blue and *generally* underlined and that’s [generally good](https://adrianroselli.com/2016/06/on-link-underlines.html).\n- All images in content should have `alt` text anyway, but doubly so when the image is wrapped in a link with otherwise no text.\n\n#### Unique accessible names\n\nSome assistive technology can create **lists of interactive elements on the page**. Imagine a group of four article cards that all have a “Read More”, the list of interactive elements will be like:\n\n- Read More\n- Read More\n- Read More\n- Read More\n\nNot very useful. You could make use of that `.visually-hidden` class we covered to make the links more like:\n\n```\n<a href=\"/article\">\n  Read More\n  <span class=\"visually-hidden\">\n    of the article \"Dancing with Rabbits\".\n  <span>\n</a>\n```\n\nNow each link is unique and clear. If the design can support it, do it *without* the visually hidden class to remove the ambiguity for everyone.\n\n## Buttons\n\nButtons are for triggering actions. When do you use the `<button>` element? A **good rule** is to use a button when there is “no meaningful `href`.” Here’s another way to think of that: if clicking it doesn’t do anything without JavaScript, it should be a `<button>`.\n\nA `<button>` that is within a `<form>`, by default, will submit that form. But aside from that, button elements don’t have any default behavior, and you’ll be wiring up that interactivity with JavaScript.\n\n**Table of Contents**\n\n- [HTML implementation](#buttons-heading-1)\n- [Styling and CSS considerations](#buttons-heading-2)\n- [JavaScript considerations](#buttons-heading-3)\n- [Accessibility considerations](#buttons-heading-4)\n\n### HTML implementation\n\n```\n<button>Buy Now</button>\n```\n\nButtons inside of a `<form>` do something by default: they submit the form! They can also reset it, like their input counterparts. The `type` attributes matter:\n\n```\n<form action=\"/\" method=\"POST\">\n  <input type=\"text\" name=\"name\" id=\"name\">\n  <button>Submit</button>\n\n  <!-- If you want to be more explicit... -->\n  <button type=\"submit\">Submit</button>\n\n  <!-- ...or clear the form inputs back to their initial values -->\n  <button type=\"reset\">Reset</button>\n\n  <!-- This prevents a `submit` action from firing which may be useful sometimes inside a form -->\n  <button type=\"button\">Non-submitting button</button>\n</form>\n```\n\nSpeaking of forms, buttons have some neat tricks up their sleeve where they can override attributes of the `<form>` itself.\n\n```\n<form action=\"/\" method=\"get\">\n\n  <!-- override the action -->\n  <button formaction=\"/elsewhere/\" type=\"submit\">Submit to elsewhere</button>\n\n  <!-- override encytype -->\n  <button formenctype=\"multipart/form-data\" type=\"submit\"></button>\n\n  <!-- override method -->\n  <button formmethod=\"post\" type=\"submit\"></button>\n\n  <!-- do not validate fields -->\n  <button formnovalidate type=\"submit\"></button>\n\n  <!-- override target e.g. open in new tab -->\n  <button formtarget=\"_blank\" type=\"submit\"></button>\n\n</form>\n```\n\n#### Autofocus\n\nSince buttons are focusable elements, we can automatically focus on them when the page loads using the `autofocus` attribute:\n\n```\n<div class=\"modal\">\n\n  <h2>Save document?</h2>\n\n  <button>Cancel</button>\n  <button autofocus>OK</button>\n</div>\n```\n\nPerhaps you’d do that inside of a modal dialog where one of the actions is a default action and it helps the UX (e.g. you can press `Enter` to dismiss the modal). Autofocusing *after a user action* is perhaps the only good practice here, moving a user’s focus without their permission, as the `autofocus` attribute is capable of, can be a problem for screen reader and screen magnifier users.\n\nNote that`autofocus` may not work if the element is within an `<iframe sandbox>` for security reasons.\n\n#### Disabling buttons\n\nTo prevent a button from being interactive, there is a `disabled` attribute you can use:\n\n```\n<button disabled>Pay Now</button>\n<p class=\"error-message\">Correct the form above to submit payment.</p>\n```\n\nNote that we’ve included descriptive text alongside the disabled button. It can be very frustrating to find a disabled button and not know why it’s disabled. A better way to do this could be to let someone submit the form, and then explain why it didn’t work in the validation feedback messaging.\n\nRegardless, you could style a disabled button this way:\n\n```\n/* Might be good styles for ANY disabled element! */\nbutton[disabled] {\n  opacity: 0.5;\n  pointer-events: none;\n}\n```\n\nWe’ll cover other states and styling later in this guide.\n\n#### Buttons can contain child elements\n\nA submit button and a submit input (`<input type=\"submit\">`) are identical in functionality, but different in the sense that an input is unable to contain child elements while a button can.\n\n```\n<button>\n   <svg aria-hidden=\"true\" focusable=\"false\">\n     <path d=\"...\" />\n   </svg>\n   <span class=\"callout\">Big</span>\n   Sale!\n</button>\n\n<button type=\"button\">\n  <span role=\"img\" aria-label=\"Fox\">\n    🦊\n  </span>\n  Button\n</button>\n```\n\nNote the `focusable=\"false\"` attribute on the SVG element above. In that case, since the icon is decorative, this will help assistive technology only announce the button’s label.\n\n### Styling and CSS considerations\n\nButtons are generally styled to look very button-like. They should look *pressable*. If you’re looking for inspiration on fancy button styles, you’d do well looking at [the CodePen Topic on Buttons](https://codepen.io/topic/buttons/picks).\n\n![](https://i0.wp.com/css-tricks.com/wp-content/uploads/2020/01/button-styles-1024x977.png?resize=1024%2C977&ssl=1)\n\n[1](https://codepen.io/jouanmarcel/pen/RwweKqb), [2](https://codepen.io/Zeindelf/pen/vZbyEg), [3](https://codepen.io/wallas/pen/lFABr), [4](https://codepen.io/tmrDevelops/pen/VeRvKX), [5](https://codepen.io/DeptofJeffAyer/pen/waLYxy), [6](https://codepen.io/ARS/pen/vEwEPP)\n\n#### Cross-browser/platform button styles\n\nHow buttons look by default varies by browser and platform.\n\n![](https://i0.wp.com/css-tricks.com/wp-content/uploads/2020/01/Screen-Shot-2020-01-11-at-5.50.45-AM.png?resize=368%2C182&ssl=1)\n\nJust on macOS: Chrome, Safari, and Firefox (they look the same)\n\n![](https://i0.wp.com/css-tricks.com/wp-content/uploads/2020/01/button-differences.png?resize=391%2C210&ssl=1)\n\nAdd `border: 0;` to those same buttons as above, and we have different styles entirely.\n\nWhile there is some UX truth to leaving the defaults of form elements alone so that they match that browser/platform’s style and you get some [affordance](https://en.wikipedia.org/wiki/Affordance) for free, designers typically don’t like default styles, particularly ones that differ across browsers.\n\n#### Resetting the default button style\n\nRemoving all the styles from a button is easier than you think. You’d think, as a form control, `appearance: none;` would help, but don’t count on that. Actually `all: revert;` is a better bet to wipe the slate clean.\n\nYou can see how a variety of properties are involved\n\n[](https://css-tricks.com/wp-content/uploads/2020/01/button.mp4)\n\nAnd that’s not all of them. Here’s a consolidated chunk of [what Normalize does](https://github.com/necolas/normalize.css/blob/master/normalize.css) to buttons.\n\n```\nbutton {\n  font-family: inherit; /* For all browsers */\n  font-size: 100%; /* For all browsers */\n  line-height: 1.15; /* For all browsers */\n  margin: 0; /* Firefox and Safari have margin */\n  overflow: visible; /* Edge hides overflow */\n  text-transform: none; /* Firefox inherits text-transform */\n  -webkit-appearance: button; /* Safari otherwise prevents some styles */\n}\n\nbutton::-moz-focus-inner {\n  border-style: none;\n  padding: 0;\n}\n\nbutton:-moz-focusring {\n  outline: 1px dotted ButtonText;\n}\n```\n\n#### A consistent `.button` class\n\nIn addition to [using reset or baseline CSS](https://css-tricks.com/reboot-resets-reasoning/), you may want to have a class for buttons that gives you a strong foundation for styling and works across both links and buttons.\n\n```\n.button {\n  border: 0;\n  border-radius: 0.25rem;\n  background: #1E88E5;\n  color: white;\n  font-family: -system-ui, sans-serif;\n  font-size: 1rem;\n  line-height: 1.2;\n  white-space: nowrap;\n  text-decoration: none;\n  padding: 0.25rem 0.5rem;\n  margin: 0.25rem;\n  cursor: pointer;\n}\n```\n\n[Check out this Pen](https://codepen.io/chriscoyier/pen/yjJwjL) to see why all these properties are needed to make sure it works correctly across elements.\n\n#### Button states\n\nJust as with links, you’ll want to style the states of buttons.\n\n```\nbutton:hover { }\nbutton:focus { }\nbutton:active { }\nbutton:visited { } /* Maybe less so */\n```\n\nYou may also want to [use ARIA attributes for styling](https://css-tricks.com/user-facing-state/), which is a neat way to encourage using them correctly:\n\n```\nbutton[aria-pressed=\"true\"] { }\nbutton[aria-pressed=\"false\"] { }\n```\n\n#### Link-styled buttons\n\nThere are always exceptions. For example, a website in which you need a button-triggered action within a sentence:\n\n```\n<p>You may open your <button>user settings</button> to change this.</p>\n```\n\nWe’ve used a button instead of an anchor tag in the above code, as this hypothetical website opens user settings in a modal dialog rather than linking to another page. In this situation, you may want to style the button as if it looks like a link.\n\nThis is probably rare enough that you would probably make a class (e.g. `.link-looking-button`) that incorporates the reset styles from above and otherwise matches what you do for anchor links.\n\n#### Breakout buttons\n\nRemember earlier when we talked about the possibility of wrapping entire elements in links? If you have a button within another element, but you want that *entire* outer element to be clickable/tappable as if it’s the button, that’s [a “breakout” button](https://css-tricks.com/breakout-buttons/). You can use an absolutely-positioned pseudo-element on the button to expand the clickable area to the whole region. Fancy!\n\n### JavaScript considerations\n\nEven without JavaScript, button elements can be triggered by the `Space` and `Enter` keys on a keyboard. That’s part of what makes them such appealing and useful elements: they are discoverable, focusable, and interactive with assistive technology in a predictable way.\n\nPerhaps any `<button>` in that situation should be inserted into the DOM *by* JavaScript. A tall order! Food for thought. 🤔\n\n#### “Once” handlers\n\nSay a button does something pretty darn important, like submitting a payment. It would be pretty scary if it was programmed such that clicking the button multiple times submitted multiple payment requests. It is situations like this where you would attach a click handler to a button that only runs once. To make that clear to the user, we’ll disable the button on click as well.\n\n```\ndocument.querySelector(\"button\").addEventListener('click', function(event) {\n  event.currentTarget.setAttribute(\"disabled\", true);\n}, {\n    once: true\n});\n```\n\nThen you would intentionally un-disable the button and reattach the handler when necessary.\n\n#### Inline handlers\n\nJavaScript can be executed by activating a button through code on the button itself:\n\n```\n<button onclick=\"console.log('clicked');\">\n  Log it.\n</button>\n\n<button onmousedown=\"\">\n</button>\n\n<button onmouseup=\"\">\n</button>\n```\n\nThat practice went from being standard practice to being a faux pas (not abstracting JavaScript functionality away from HTML) to, *eh, you need it when you need it*. One advantage is that if you’re injecting this HTML into the DOM, you don’t need to bind/re-bind JavaScript event handlers to it because it already has one.\n\n#### JavaScript frameworks\n\nIt’s common in any JavaScript framework to make a component for handling buttons, as buttons typically have lots of variations. Those variations can be turned into an API of sorts. For example, in React:\n\n```\nconst Button = ({ className, children }) => {\n  const [activated, setActivated] = React.useState(false);\n  return (\n    <button\n      className={`button ${className}`}\n      aria-pressed={activated ? \"true\" : \"false\"}\n      onClick={() => setActivated(!activated)}\n    >\n      {children}\n    </button>\n  );\n};\n```\n\nIn that example, the `<Button />` component ensures the button will have a `button` class and handles a toggle-like active class.\n\n### Accessibility considerations\n\nThe biggest accessibility consideration with buttons is *actually using* buttons. Don’t try to replicate a button with a `<div>` or a `<span>`, which is, unfortunately, more common than you might think. It’s very likely that will cause problems. (Did you deal with focusability? Did you deal with keyboard events? Great. There’s still probably more stuff you’re forgetting.)\n\n#### Focus styles\n\nLike all focusable elements, browsers apply a default focus style, which is usually a blue outline.\n\n![](https://i0.wp.com/css-tricks.com/wp-content/uploads/2020/01/Screen-Shot-2020-01-13-at-3.01.17-PM.png?resize=241%2C82&ssl=1)\n\nFocus styles on Chrome/macOS\n\nWhile it’s arguable that you should leave that alone as it’s a very clear and obvious style for people that benefit from focus styles, it’s also not out of the question to change it.\n\nWhat you should *not* do is `button:focus { outline: 0; }` to remove it. If you ever remove a focus style like that, put it back at the same time.\n\n```\nbutton:focus {\n  outline: 0; /* Removes the default blue ring */\n\n  /* Now, let's create our own focus style */\n  border-radius: 3px;\n  box-shadow: 0 0 0 2px red;\n}\n```\n\n![](https://i0.wp.com/css-tricks.com/wp-content/uploads/2020/01/focused-red.png?resize=289%2C111&ssl=1)\n\nCustom focus style\n\nThe fact that a button may become focused when clicked and apply that style at the same time is offputting to some. There is a trick (that has limited, but increasing, [browser support](https://caniuse.com/#feat=css-focus-visible)) on removing focus styles from clicks and not keyboard events:\n\n```\n:focus:not(:focus-visible) { \n  outline: 0; \n}\n```\n\n#### ARIA\n\nButtons already have the `role` they need (`role=\"button\"`). But there are some other ARIA attributes that are related to buttons:\n\n- `aria-pressed`: Turns a button into a **toggle**, between `aria-pressed=\"true\"` and `aria-pressed=\"false\"`. [More on button toggles](https://inclusive-components.design/toggle-button/), which can also be done with `role=\"switch\"` and `aria-checked=\"true\"`.\n- `aria-expanded`: If the button controls the open/closed state of another element (like a dropdown menu), you apply this attribute to indicate that like `aria-expanded=\"true\"`.\n- `aria-label`: Overrides the text within the button. This is useful for labeling buttons that otherwise don’t have text, but you’re still probably better off using a `visually-hidden` class so it can be translated.\n- `aria-labelledby`: Points to an element that will act as the label for the button.\n\nFor that last one:\n\n```\n<button aria-labelledby=\"buttonText\">\n  Time is running out! \n  <span id=\"buttonText\">Add to Cart</span>\n</button>\n```\n\nDeque has [a deeper dive blog post into button accessibility](https://www.deque.com/blog/accessible-aria-buttons/) that includes much about ARIA.\n\n#### Dialogs\n\nIf a button opens a dialog, your job is to [move the focus inside and trap it there.](https://css-tricks.com/a-css-approach-to-trap-focus-inside-of-an-element/) When closing the dialog, you need to return focus back to that button so the user is back exactly where they started. This makes the experience of using a modal the same for someone who relies on assistive technology as for someone who doesn’t.\n\nFocus management isn’t just for dialogs, either. If clicking a button runs a calculation and changes a value on the page, there is no context change there, meaning focus should remain on the button. If the button does something like “move to next page,” the focus should be moved to the start of that next page.\n\n#### Size\n\nDon’t make buttons too small. That goes for links and any sort of interactive control. People with any sort of reduced dexterity [will benefit](https://www.w3.org/WAI/perspective-videos/controls/).\n\nThe classic Apple guideline for the [minimum size for a touch target](https://developer.apple.com/design/human-interface-guidelines/ios/visual-design/adaptivity-and-layout/) (button) is 44x44pt.\n\n![](https://i0.wp.com/css-tricks.com/wp-content/uploads/2020/01/interactivity-hit-areas_2x-1024x650.png?resize=1024%2C650&ssl=1)\n\n[Here’s some guidelines from other companies](https://www.lukew.com/ff/entry.asp?1085). [Fitt’s Law](https://adrianroselli.com/2019/06/target-size-and-2-5-5.html#Fitts) tells us smaller targets have greater error rates. [Google even takes button sizes into consideration](https://web.dev/tap-targets/) when evaluating the SEO of a site.\n\nIn addition to ample size, [don’t place buttons too close each other](https://a11yproject.com/posts/large-touch-targets/), whether they’re stacked vertically or together on the same line. Give them some margin because people experiencing motor control issues run the risk of clicking the wrong one.\n\n#### Activating buttons\n\nButtons work by being clicked/touched, pressing the `Enter` key, or pressing the `Space` key (when focused). Even if you add `role=\"button\"` to a link or div, you won’t get the spacebar functionality, so at the risk of beating a dead horse, use `<button>` in those cases.",
  "tags": [
    "css-tricks",
    "guides",
    "css",
    "snippets"
  ],
  "extracted_at": "2026-02-03T12:46:47.464268+00:00",
  "content_length": 33576,
  "content_hash": "316ee8a695f6746c"
}