{
  "id": "mdn-aria__en-US_docs_Learn_Accessibility_CSS_and_JavaScript",
  "source_id": "mdn-aria",
  "source_name": "MDN ARIA Documentation",
  "category": "accessibility",
  "url": "https://developer.mozilla.org/en-US/docs/Learn/Accessibility/CSS_and_JavaScript",
  "title": "CSS and JavaScript accessibility best practices",
  "content": "CSS and JavaScript accessibility best practices\nPrevious\nOverview: Accessibility on the web\nNext\nCSS and JavaScript, when used properly, also have the potential to allow for accessible web experiences, or they can significantly harm accessibility if misused. This article outlines some CSS and JavaScript best practices that should be considered to ensure even complex content is as accessible as possible.\nPrerequisites:\nFamiliarity with\nHTML\n,\nCSS\n, a\nbasic understanding of accessibility concepts\n.\nLearning outcomes:\nAccessible text sizing and layout.\nColor contrast.\nThe importance of\n:focus\nand\n:hover\nstyles.\nSensible animation usage â\u0080\u0094 use animation subtly and provide controls to turn it off.\nBest practices for hiding content so that it doesn't become inaccessible.\nThat there is such a thing as too much JavaScript, and the value of unobtrusive JavaScript.\nUsing events sensibly so you don't lock out specific control types.\nCSS and JavaScript are accessible?\nCSS and JavaScript don't have the same immediate importance for accessibility as HTML, but they are still able to help or damage accessibility, depending on how they are used. To put it another way, it is important that you consider some best practice advice to make sure that your use of CSS and JavaScript doesn't ruin the accessibility of your documents.\nCSS\nLet's start off by looking at CSS.\nCorrect semantics and user expectation\nIt is possible to use CSS to make any HTML element look like\nanything\n, but this doesn't mean that you should. As we frequently mentioned in our\nHTML: A good basis for accessibility\narticle, you should use the appropriate semantic element for the job, whenever possible. If you don't, it can cause confusion and usability issues for everyone, but particularly users with disabilities. Using correct semantics has a lot to do with user expectations â\u0080\u0094 elements look and behave in certain ways, according to their functionality, and these common conventions are expected by users.\nAs an example, a screen reader user can't navigate a page via heading elements if the developer hasn't appropriately used heading elements to markup the content. By the same token, a heading loses its visual purpose if you style it so it doesn't look like a heading.\nBottom line, you can update the styling of a page feature to fit in your design, but don't change it so much that it no longer looks or behaves as expected. The following sections summarize the main HTML features to consider.\n\"Standard\" text content structure\nHeadings, paragraphs, lists â\u0080\u0094 the core text content of your page:\nhtml\n<h1>Heading</h1>\n\n<p>Paragraph</p>\n\n<ul>\n  <li>My list</li>\n  <li>has two items.</li>\n</ul>\nSome typical CSS might look like this:\ncss\nh1 {\n  font-size: 5rem;\n}\n\np,\nli {\n  line-height: 1.5;\n  font-size: 1.6rem;\n}\nYou should:\nSelect sensible font sizes, line heights, letter spacing, etc. to make your text logical, legible, and comfortable to read.\nMake sure your headings stand out from your body text, typically big and bold like the default styling. Your lists should look like lists.\nYour text color should contrast well with your background color.\nSee\nHeadings and paragraphs in HTML\nand\nCSS text styling\nfor more information.\nEmphasized text\nInline markup that confers specific emphasis to the text that it wraps:\nhtml\n<p>The water is <em>very hot</em>.</p>\n\n<p>\n  Water droplets collecting on surfaces is called <strong>condensation</strong>.\n</p>\nYou might want to add some simple coloring to your emphasized text:\ncss\nstrong,\nem {\n  color: #a60000;\n}\nYou will however rarely need to style emphasis elements in any significant way. The standard conventions of bold and italic text are very recognizable, and changing the style can cause confusion. For more on emphasis, see\nEmphasis and importance\n.\nAbbreviations\nAn element that allows an abbreviation, acronym, or initialization to be associated with its expansion:\nhtml\n<p>\n  Web content is marked up using Hypertext Markup Language, or\n  <abbr>HTML</abbr>.\n</p>\nAgain, you might want to style it in some simple way:\ncss\nabbr {\n  color: #a60000;\n}\nThe recognized styling convention for abbreviations is a dotted underline, and it is unwise to significantly deviate from this. For more on abbreviations, see\nAbbreviations\n.\nLinks\nHyperlinks â\u0080\u0094 the way you get to new places on the web:\nhtml\n<p>Visit the <a href=\"https://www.mozilla.org\">Mozilla homepage</a>.</p>\nSome very simple link styling is shown below:\ncss\na {\n  color: red;\n}\n\na:hover,\na:visited,\na:focus {\n  color: #a60000;\n  text-decoration: none;\n}\n\na:active {\n  color: black;\n  background-color: #a60000;\n}\nThe standard link conventions are underlined and a different color (default: blue) in their standard state, another color variation when the link has previously been visited (default: purple), and yet another color when the link is activated (default: red). In addition, the mouse pointer changes to a pointer icon when links are moused over, and the link receives a highlight when focused (e.g., via tabbing) or activated. The following image shows the highlight in both Firefox (a dotted outline) and Chrome (a blue outline):\nYou can be creative with link styles, as long as you keep giving users feedback when they interact with the links. Something should definitely happen when states change, and you shouldn't get rid of the pointer cursor or the outline â\u0080\u0094 both are very important accessibility aids for those using keyboard controls.\nForm elements\nElements to allow users to input data into websites:\nhtml\n<div>\n  <label for=\"name\">Enter your name</label>\n  <input type=\"text\" id=\"name\" name=\"name\" />\n</div>\nYou can see some good example CSS in our\nform-css.html\nexample (\nsee it live\nalso).\nMost of the CSS you'll write for forms will be for sizing the elements, lining up labels and inputs, and getting them looking neat and tidy.\nYou shouldn't however deviate too much from the expected visual feedback form elements receive when they are focused, which is basically the same as links (see above). You could style form focus/hover states to make this behavior more consistent across browsers or fit in better with your page design, but don't get rid of it altogether â\u0080\u0094 again, people rely on these clues to help them know what is going on.\nTables\nTables for presenting tabular data.\nYou can see a good, simple example of table HTML and CSS in our\ntable-css.html\nexample (\nsee it live also\n).\nTable CSS generally serves to make the table fit better into your design and look less ugly. It is a good idea to make sure the table headers stand out (normally using bold), and use zebra striping to make different rows easier to parse.\nColor and color contrast\nWhen choosing a color scheme for your website, make sure that the text (foreground) color contrasts well with the background color. Your design might look cool, but it is no good if people with visual impairments like color blindness can't read your content.\nThere is an easy way to check whether your contrast is large enough to not cause problems. There are a number of contrast checking tools online that you can enter your foreground and background colors into, to check them. For example WebAIM's\nColor Contrast Checker\nis simple to use, and provides an explanation of what you need to conform to the WCAG criteria around color contrast.\nNote:\nA high contrast ratio will also allow anyone using a smartphone or tablet with a glossy screen to better read pages when in a bright environment, such as sunlight.\nAnother tip is to not rely on color alone for signposts/information, as this will be no good for those who can't see the color. Instead of marking required form fields in red, for example, mark them with an asterisk and in red.\nHiding things\nThere are many instances where a visual design will require that not all content is shown at once. For example, in our\nTabbed info box example\n(see\nsource code\n) we have three panels of information, but we are\npositioning\nthem on top of one another and providing tabs that can be clicked to show each one (it is also keyboard accessible â\u0080\u0094 you can alternatively use Tab and Enter/Return to select them).\nScreen reader users don't care about any of this â\u0080\u0094 they are happy with the content as long as the source order makes sense, and they can get to it all. Absolute positioning (as used in this example) is generally seen as one of the best mechanisms of hiding content for visual effect because it doesn't stop screen readers from getting to it.\nOn the other hand, you shouldn't use\nvisibility: hidden\nor\ndisplay: none\n, because they do hide content from screen readers. Unless of course, there is a good reason why you want this content to be hidden from screen readers.\nNote:\nInvisible Content Just for Screen Reader Users\nhas a lot more useful detail surrounding this topic.\nAccept that users can override styles\nIt is possible for users to override your styles with their own custom styles, for example:\nSee Sarah Maddox's\nHow to use a custom style sheet (CSS) with Firefox\nfor a useful guide covering how to do this manually in Firefox.\nIt is probably easier to do it using an extension. For example, the Stylus extension is available for\nFirefox\n, with Stylish being a\nChrome\nequivalent.\nUsers might do this for a variety of reasons. A visually impaired user might want to make the text bigger on all websites they visit, or a user with severe color deficiency might want to put all websites in high contrast colors that are easy for them to see. Whatever the need, you should be comfortable with this, and make your designs flexible enough so that such changes will work in your design. As an example, you might want to make sure your main content area can handle bigger text (maybe it will start to scroll to allow it all to be seen), and won't just hide it, or break completely.\nJavaScript\nJavaScript can also break accessibility, depending on how it is used.\nModern JavaScript is a powerful language, and we can do so much with it these days, from simple content and UI updates to fully-fledged 2D and 3D games. There is no rule that says all content has to be 100% accessible to all people â\u0080\u0094 you just need to do what you can, and make your apps as accessible as possible.\nSimple content and functionality is arguably easy to make accessible â\u0080\u0094 for example text, images, tables, forms and push button that activate functions. As we looked at in our\nHTML: A good basis for accessibility\narticle, the key considerations are:\nGood semantics: Using the right element for the right job. For example, making sure you use headings and paragraphs, and\n<button>\nand\n<a>\nelements\nMaking sure content is available as text, either directly as text content, good text labels for form elements, or\ntext alternatives\n, e.g., alt text for images.\nWe also looked at an example of how to use JavaScript to build in functionality where it is missing â\u0080\u0094 see\nBuilding keyboard accessibility back in\n. This is not ideal â\u0080\u0094 really you should just use the right element for the right job â\u0080\u0094 but it shows that it is possible in situations where for some reason you can't control the markup that is used. Another way to improve accessibility for non-semantic JavaScript-powered widgets is to use WAI-ARIA to provide extra semantics for screen reader users. The next article will also cover this in detail.\nComplex functionality like 3D games are not so easy to make accessible â\u0080\u0094 a complex 3D game created using\nWebGL\nwill be rendered on a\n<canvas>\nelement, which has no facility at this time to provide text alternatives or other information for severely visually impaired users to make use of. It is arguable that such a game doesn't really have this group of people as a part of its main target audience, and it would be unreasonable to expect you to make it 100% accessible to blind people. However, you could implement\nkeyboard controls\nso it is usable by non-mouse users, and make the color scheme contrasting enough to be usable by those with color deficiencies.\nThe problem with too much JavaScript\nThe problem often comes when people rely on JavaScript too much. Sometimes you'll see a website where everything has been done with JavaScript â\u0080\u0094 the HTML has been generated by JavaScript, the CSS has been generated by JavaScript, etc. This has all kinds of accessibility and other issues associated with it, so it is not advised.\nAs well as using the right element for the right job, you should also make sure you are using the right technology for the right job! Think carefully about whether you need that shiny JavaScript-powered 3D information box, or whether plain old text would do. Think carefully about whether you need a complex non-standard form widget, or whether a text input would do. And don't generate all your HTML content using JavaScript if at all possible.\nKeeping it unobtrusive\nYou should keep\nunobtrusive JavaScript\nin mind when creating your content. The idea of unobtrusive JavaScript is that it should be used wherever possible to enhance functionality, not build it in entirely â\u0080\u0094 basic functions should ideally work without JavaScript, although it is appreciated that this is not always an option. But again, a large part of it is using built-in browser functionality where possible.\nGood example uses of unobtrusive JavaScript include:\nProviding client-side form validation, which alerts users to problems with their form entries quickly, without having to wait for the server to check the data. If it isn't available, the form will still work, but validation might be slower.\nProviding custom controls for HTML\n<video>\ns that are accessible to keyboard-only users, along with a direct link to the video that can be used to access it if JavaScript is not available (the default\n<video>\nbrowser controls aren't keyboard accessible in most browsers).\nAs an example, we've written a quick and dirty client-side form validation example â\u0080\u0094 see\nform-validation.html\n(also\nsee the demo live\n). Here you'll see a simple form; when you try to submit the form with one or both fields left empty, the submit fails, and an error message box appears to tell you what is wrong.\nThis kind of form validation is unobtrusive â\u0080\u0094 you can still use the form absolutely fine without the JavaScript being available, and any sensible form implementation will have server-side validation active as well, because it is too easy for malicious users to bypass client-side validation (for example, by turning JavaScript off in the browser). The client-side validation is still really useful for reporting errors â\u0080\u0094 users can know about mistakes they make instantly, rather than having to wait for a round trip to the server and a page reload. This is a definite usability advantage.\nNote:\nServer-side validation has not been implemented in this simple demo.\nWe've made this form validation pretty accessible too. We've used\n<label>\nelements to make sure the form labels are unambiguously linked to their inputs, so screen readers can read them out alongside:\nhtml\n<label for=\"name\">Enter your name:</label>\n<input type=\"text\" name=\"name\" id=\"name\" />\nWe only do the validation when the form is submitted â\u0080\u0094 this is so that we don't update the UI too often and potentially confuse screen reader (and possibly other) users:\njs\nform.onsubmit = validate;\n\nfunction validate(e) {\n  errorList.textContent = \"\";\n  for (const testItem of formItems) {\n    if (testItem.input.value === \"\") {\n      errorField.style.left = \"360px\";\n      createLink(testItem);\n    }\n  }\n\n  if (errorList.hasChildNodes()) {\n    e.preventDefault();\n  }\n}\nNote:\nIn this example, we are hiding and showing the error message box using absolute positioning rather than another method such as visibility or display, because it doesn't interfere with the screen reader being able to read content from it.\nReal form validation would be much more complex than this â\u0080\u0094 you'd want to check that the entered name actually looks like a name, the entered age is actually a number and is realistic (e.g., nonnegative and less than 4 digits). Here we've just implemented a simple check that a value has been filled in to each input field (\nif (testItem.input.value === '')\n).\nWhen the validation has been performed, if the tests pass then the form is submitted. If there are errors (\nif (errorList.hasChildNodes())\n) then we stop the form submitting (using\npreventDefault()\n), and display any error messages that have been created (see below). This mechanism means that the errors will only be shown if there are errors, which is better for usability.\nFor each input that doesn't have a value filled in when the form is submitted, we create a list item with a link and insert it in the\nerrorList\n.\njs\nfunction createLink(testItem) {\n  const listItem = document.createElement(\"li\");\n  const anchor = document.createElement(\"a\");\n\n  const name = testItem.input.name;\n  anchor.textContent = `${name} field is empty: fill in your ${name}.`;\n  anchor.href = `#${name}`;\n  listItem.appendChild(anchor);\n  errorList.appendChild(listItem);\n}\nEach link serves a dual purpose â\u0080\u0094 it tells you what the error is, plus you can click on it/activate it to jump straight to the input element in question and correct your entry.\nIn addition, the\nerrorField\nis placed at the top of the source order (although it is positioned differently in the UI using CSS), meaning that users can find out exactly what's wrong with their form submissions and get to the input elements in question by going back up to the start of the page.\nAs a final note, we have used some WAI-ARIA attributes in our demo to help solve accessibility problems caused by areas of content constantly updating without a page reload (screen readers won't pick this up or alert users to it by default):\nhtml\n<div class=\"errors\" role=\"alert\" aria-relevant=\"all\">\n  <ul></ul>\n</div>\nWe will explain these attributes in our next article, which covers\nWAI-ARIA\nin much more detail.\nNote:\nSome of you will probably be thinking about the fact that HTML forms have built-in validation mechanisms like the\nrequired\n,\nmin\n/\nminlength\n, and\nmax\n/\nmaxlength\nattributes (see the\n<input>\nelement reference for more information). We didn't end up using these in the demo because cross-browser support for them is patchy (for example IE10 and above only).\nNote:\nWebAIM's\nUsable and Accessible Form Validation and Error Recovery\nprovides some further useful information about accessible form validation.\nOther JavaScript accessibility concerns\nThere are other things to be aware of when implementing JavaScript and thinking about accessibility. We will add more as we find them.\nmouse-specific events\nAs you will be aware, most user interactions are implemented in client-side JavaScript using event handlers, which allow us to run functions in response to certain events happening. Some events can have accessibility issues. The main example you'll come across is mouse-specific events like\nmouseover\n,\nmouseout\n,\ndblclick\n, etc. Functionality that runs in response to these events will not be accessible using other mechanisms, like keyboard controls.\nTo mitigate such problems, you should double up these events with similar events that can be activated by other means (so-called device-independent event handlers) â\u0080\u0094\nfocus\nand\nblur\nwould provide accessibility for keyboard users.\nLet's look at an example that highlights when this could be useful. Maybe we want to provide a thumbnail image that shows a larger version of the image when it is moused over or focused (like you'd see on an e-commerce product catalog.)\nWe've made a very simple example, which you can find at\nmouse-and-keyboard-events.html\n(see also the\nsource code\n). The code features two functions that show and hide the zoomed-in image; these are run by the following lines that set them as event handlers:\njs\nimgThumb.onmouseover = showImg;\nimgThumb.onmouseout = hideImg;\n\nimgThumb.onfocus = showImg;\nimgThumb.onblur = hideImg;\nThe first two lines run the functions when the mouse pointer hovers over and stops hovering over the thumbnail, respectively. This won't allow us to access the zoomed view by keyboard though â\u0080\u0094 to allow that, we've included the last two lines, which run the functions when the image is focused and blurred (when focus stops). This can be done by tabbing over the image, because we've included\ntabindex=\"0\"\non it.\nThe\nclick\nevent is interesting â\u0080\u0094 it sounds mouse-dependent, but most browsers will activate\nonclick\nevent handlers after Enter/Return is pressed on a link or form element that has focus, or when such an element is tapped on a touchscreen device. This doesn't work by default however when you allow a non-default-focusable event to have focus using tabindex â\u0080\u0094 in such cases you need to detect specifically when that exact key is pressed (see\nBuilding keyboard accessibility back in\n).\nSummary\nWe hope this article has given you a good amount of detail and understanding about the accessibility issues surrounding CSS and JavaScript use on web pages.\nIn the next article, we'll give you some tests that you can use to check how well you've understood and retained all this information.\nPrevious\nOverview: Accessibility on the web\nNext\nHelp improve MDN\nLearn how to contribute\nThis page was last modified on\nSep 29, 2025\nby\nMDN contributors\n.\nView this page on GitHub\nâ\u0080¢\nReport a problem with this content",
  "content_markdown": "# CSS and JavaScript accessibility best practices\n\n- [Previous](/en-US/docs/Learn_web_development/Core/Accessibility/Test_your_skills/HTML)\n- [Overview: Accessibility on the web](/en-US/docs/Learn_web_development/Core/Accessibility)\n- [Next](/en-US/docs/Learn_web_development/Core/Accessibility/Test_your_skills/CSS_and_JavaScript)\n\nCSS and JavaScript, when used properly, also have the potential to allow for accessible web experiences, or they can significantly harm accessibility if misused. This article outlines some CSS and JavaScript best practices that should be considered to ensure even complex content is as accessible as possible.\n\n|  |  |\n| --- | --- |\n| Prerequisites: | Familiarity with [HTML](/en-US/docs/Learn_web_development/Core/Structuring_content), [CSS](/en-US/docs/Learn_web_development/Core/Styling_basics), a [basic understanding of accessibility concepts](/en-US/docs/Learn_web_development/Core/Accessibility/What_is_accessibility). |\n| Learning outcomes: | - Accessible text sizing and layout. - Color contrast. - The importance of `:focus` and `:hover` styles. - Sensible animation usage â\u0080\u0094 use animation subtly and provide controls to turn it off. - Best practices for hiding content so that it doesn't become inaccessible. - That there is such a thing as too much JavaScript, and the value of unobtrusive JavaScript. - Using events sensibly so you don't lock out specific control types. |\n\n## [CSS and JavaScript are accessible?](#css_and_javascript_are_accessible)\n\nCSS and JavaScript don't have the same immediate importance for accessibility as HTML, but they are still able to help or damage accessibility, depending on how they are used. To put it another way, it is important that you consider some best practice advice to make sure that your use of CSS and JavaScript doesn't ruin the accessibility of your documents.\n\n## [CSS](#css)\n\nLet's start off by looking at CSS.\n\n### [Correct semantics and user expectation](#correct_semantics_and_user_expectation)\n\nIt is possible to use CSS to make any HTML element look like *anything*, but this doesn't mean that you should. As we frequently mentioned in our [HTML: A good basis for accessibility](/en-US/docs/Learn_web_development/Core/Accessibility/HTML) article, you should use the appropriate semantic element for the job, whenever possible. If you don't, it can cause confusion and usability issues for everyone, but particularly users with disabilities. Using correct semantics has a lot to do with user expectations â\u0080\u0094 elements look and behave in certain ways, according to their functionality, and these common conventions are expected by users.\n\nAs an example, a screen reader user can't navigate a page via heading elements if the developer hasn't appropriately used heading elements to markup the content. By the same token, a heading loses its visual purpose if you style it so it doesn't look like a heading.\n\nBottom line, you can update the styling of a page feature to fit in your design, but don't change it so much that it no longer looks or behaves as expected. The following sections summarize the main HTML features to consider.\n\n#### \"Standard\" text content structure\n\nHeadings, paragraphs, lists â\u0080\u0094 the core text content of your page:\n\nhtml\n\n```\n<h1>Heading</h1>\n\n<p>Paragraph</p>\n\n<ul>\n  <li>My list</li>\n  <li>has two items.</li>\n</ul>\n```\n\nSome typical CSS might look like this:\n\ncss\n\n```\nh1 {\n  font-size: 5rem;\n}\n\np,\nli {\n  line-height: 1.5;\n  font-size: 1.6rem;\n}\n```\n\nYou should:\n\n- Select sensible font sizes, line heights, letter spacing, etc. to make your text logical, legible, and comfortable to read.\n- Make sure your headings stand out from your body text, typically big and bold like the default styling. Your lists should look like lists.\n- Your text color should contrast well with your background color.\n\nSee [Headings and paragraphs in HTML](/en-US/docs/Learn_web_development/Core/Structuring_content/Headings_and_paragraphs) and [CSS text styling](/en-US/docs/Learn_web_development/Core/Text_styling) for more information.\n\n#### Emphasized text\n\nInline markup that confers specific emphasis to the text that it wraps:\n\nhtml\n\n```\n<p>The water is <em>very hot</em>.</p>\n\n<p>\n  Water droplets collecting on surfaces is called <strong>condensation</strong>.\n</p>\n```\n\nYou might want to add some simple coloring to your emphasized text:\n\ncss\n\n```\nstrong,\nem {\n  color: #a60000;\n}\n```\n\nYou will however rarely need to style emphasis elements in any significant way. The standard conventions of bold and italic text are very recognizable, and changing the style can cause confusion. For more on emphasis, see [Emphasis and importance](/en-US/docs/Learn_web_development/Core/Structuring_content/Emphasis_and_importance).\n\n#### Abbreviations\n\nAn element that allows an abbreviation, acronym, or initialization to be associated with its expansion:\n\nhtml\n\n```\n<p>\n  Web content is marked up using Hypertext Markup Language, or\n  <abbr>HTML</abbr>.\n</p>\n```\n\nAgain, you might want to style it in some simple way:\n\ncss\n\n```\nabbr {\n  color: #a60000;\n}\n```\n\nThe recognized styling convention for abbreviations is a dotted underline, and it is unwise to significantly deviate from this. For more on abbreviations, see [Abbreviations](/en-US/docs/Learn_web_development/Core/Structuring_content/Advanced_text_features#abbreviations).\n\n#### Links\n\nHyperlinks â\u0080\u0094 the way you get to new places on the web:\n\nhtml\n\n```\n<p>Visit the <a href=\"https://www.mozilla.org\">Mozilla homepage</a>.</p>\n```\n\nSome very simple link styling is shown below:\n\ncss\n\n```\na {\n  color: red;\n}\n\na:hover,\na:visited,\na:focus {\n  color: #a60000;\n  text-decoration: none;\n}\n\na:active {\n  color: black;\n  background-color: #a60000;\n}\n```\n\nThe standard link conventions are underlined and a different color (default: blue) in their standard state, another color variation when the link has previously been visited (default: purple), and yet another color when the link is activated (default: red). In addition, the mouse pointer changes to a pointer icon when links are moused over, and the link receives a highlight when focused (e.g., via tabbing) or activated. The following image shows the highlight in both Firefox (a dotted outline) and Chrome (a blue outline):\n\n![Screenshot of a list of links in Firefox browser. The list contains 4 items. The second list item is highlighted using a blue dotted outline when it is focussed via tabbing.](/en-US/docs/Learn_web_development/Core/Accessibility/CSS_and_JavaScript/focus-highlight-firefox.png)\n\n![Screenshot of a list of links in Chrome browser. The list contains 4 items. The third list item is highlighted using a blue outline when it is focussed via tabbing.](/en-US/docs/Learn_web_development/Core/Accessibility/CSS_and_JavaScript/focus-highlight-chrome.png)\n\nYou can be creative with link styles, as long as you keep giving users feedback when they interact with the links. Something should definitely happen when states change, and you shouldn't get rid of the pointer cursor or the outline â\u0080\u0094 both are very important accessibility aids for those using keyboard controls.\n\n#### Form elements\n\nElements to allow users to input data into websites:\n\nhtml\n\n```\n<div>\n  <label for=\"name\">Enter your name</label>\n  <input type=\"text\" id=\"name\" name=\"name\" />\n</div>\n```\n\nYou can see some good example CSS in our [form-css.html](https://github.com/mdn/learning-area/blob/main/accessibility/css/form-css.html) example ([see it live](https://mdn.github.io/learning-area/accessibility/css/form-css.html) also).\n\nMost of the CSS you'll write for forms will be for sizing the elements, lining up labels and inputs, and getting them looking neat and tidy.\n\nYou shouldn't however deviate too much from the expected visual feedback form elements receive when they are focused, which is basically the same as links (see above). You could style form focus/hover states to make this behavior more consistent across browsers or fit in better with your page design, but don't get rid of it altogether â\u0080\u0094 again, people rely on these clues to help them know what is going on.\n\n#### Tables\n\nTables for presenting tabular data.\n\nYou can see a good, simple example of table HTML and CSS in our [table-css.html](https://github.com/mdn/learning-area/blob/main/accessibility/css/table-css.html) example ([see it live also](https://mdn.github.io/learning-area/accessibility/css/table-css.html)).\n\nTable CSS generally serves to make the table fit better into your design and look less ugly. It is a good idea to make sure the table headers stand out (normally using bold), and use zebra striping to make different rows easier to parse.\n\n### [Color and color contrast](#color_and_color_contrast)\n\nWhen choosing a color scheme for your website, make sure that the text (foreground) color contrasts well with the background color. Your design might look cool, but it is no good if people with visual impairments like color blindness can't read your content.\n\nThere is an easy way to check whether your contrast is large enough to not cause problems. There are a number of contrast checking tools online that you can enter your foreground and background colors into, to check them. For example WebAIM's [Color Contrast Checker](https://webaim.org/resources/contrastchecker/) is simple to use, and provides an explanation of what you need to conform to the WCAG criteria around color contrast.\n\n**Note:**\nA high contrast ratio will also allow anyone using a smartphone or tablet with a glossy screen to better read pages when in a bright environment, such as sunlight.\n\nAnother tip is to not rely on color alone for signposts/information, as this will be no good for those who can't see the color. Instead of marking required form fields in red, for example, mark them with an asterisk and in red.\n\n### [Hiding things](#hiding_things)\n\nThere are many instances where a visual design will require that not all content is shown at once. For example, in our [Tabbed info box example](https://mdn.github.io/learning-area/css/css-layout/practical-positioning-examples/tabbed-info-box.html) (see [source code](https://github.com/mdn/learning-area/blob/main/css/css-layout/practical-positioning-examples/tabbed-info-box.html)) we have three panels of information, but we are [positioning](/en-US/docs/Learn_web_development/Core/CSS_layout/Positioning) them on top of one another and providing tabs that can be clicked to show each one (it is also keyboard accessible â\u0080\u0094 you can alternatively use Tab and Enter/Return to select them).\n\n![Three tab interface with Tab 1 selected and only its contents are displayed. The contents of other tabs are hidden. If a tab is selected, then its text-color changes from black to white and the background-color changes from orange-red to saddle brown.](/en-US/docs/Learn_web_development/Core/Accessibility/CSS_and_JavaScript/tabbed-info-box.png)\n\nScreen reader users don't care about any of this â\u0080\u0094 they are happy with the content as long as the source order makes sense, and they can get to it all. Absolute positioning (as used in this example) is generally seen as one of the best mechanisms of hiding content for visual effect because it doesn't stop screen readers from getting to it.\n\nOn the other hand, you shouldn't use [`visibility: hidden`](/en-US/docs/Web/CSS/Reference/Properties/visibility) or [`display: none`](/en-US/docs/Web/CSS/Reference/Properties/display), because they do hide content from screen readers. Unless of course, there is a good reason why you want this content to be hidden from screen readers.\n\n**Note:**\n[Invisible Content Just for Screen Reader Users](https://webaim.org/techniques/css/invisiblecontent/) has a lot more useful detail surrounding this topic.\n\n### [Accept that users can override styles](#accept_that_users_can_override_styles)\n\nIt is possible for users to override your styles with their own custom styles, for example:\n\n- See Sarah Maddox's [How to use a custom style sheet (CSS) with Firefox](https://www.itsupportguides.com/knowledge-base/computer-accessibility/how-to-use-a-custom-style-sheet-css-with-firefox/) for a useful guide covering how to do this manually in Firefox.\n- It is probably easier to do it using an extension. For example, the Stylus extension is available for [Firefox](https://addons.mozilla.org/en-US/firefox/addon/styl-us/), with Stylish being a [Chrome](https://chromewebstore.google.com/detail/stylish-custom-themes-for/fjnbnpbmkenffdnngjfgmeleoegfcffe) equivalent.\n\nUsers might do this for a variety of reasons. A visually impaired user might want to make the text bigger on all websites they visit, or a user with severe color deficiency might want to put all websites in high contrast colors that are easy for them to see. Whatever the need, you should be comfortable with this, and make your designs flexible enough so that such changes will work in your design. As an example, you might want to make sure your main content area can handle bigger text (maybe it will start to scroll to allow it all to be seen), and won't just hide it, or break completely.\n\n## [JavaScript](#javascript)\n\nJavaScript can also break accessibility, depending on how it is used.\n\nModern JavaScript is a powerful language, and we can do so much with it these days, from simple content and UI updates to fully-fledged 2D and 3D games. There is no rule that says all content has to be 100% accessible to all people â\u0080\u0094 you just need to do what you can, and make your apps as accessible as possible.\n\nSimple content and functionality is arguably easy to make accessible â\u0080\u0094 for example text, images, tables, forms and push button that activate functions. As we looked at in our [HTML: A good basis for accessibility](/en-US/docs/Learn_web_development/Core/Accessibility/HTML) article, the key considerations are:\n\n- Good semantics: Using the right element for the right job. For example, making sure you use headings and paragraphs, and [`<button>`](/en-US/docs/Web/HTML/Reference/Elements/button) and [`<a>`](/en-US/docs/Web/HTML/Reference/Elements/a) elements\n- Making sure content is available as text, either directly as text content, good text labels for form elements, or [text alternatives](/en-US/docs/Learn_web_development/Core/Accessibility/HTML#text_alternatives), e.g., alt text for images.\n\nWe also looked at an example of how to use JavaScript to build in functionality where it is missing â\u0080\u0094 see [Building keyboard accessibility back in](/en-US/docs/Learn_web_development/Core/Accessibility/HTML#building_keyboard_accessibility_back_in). This is not ideal â\u0080\u0094 really you should just use the right element for the right job â\u0080\u0094 but it shows that it is possible in situations where for some reason you can't control the markup that is used. Another way to improve accessibility for non-semantic JavaScript-powered widgets is to use WAI-ARIA to provide extra semantics for screen reader users. The next article will also cover this in detail.\n\nComplex functionality like 3D games are not so easy to make accessible â\u0080\u0094 a complex 3D game created using [WebGL](/en-US/docs/Web/API/WebGL_API) will be rendered on a [`<canvas>`](/en-US/docs/Web/HTML/Reference/Elements/canvas) element, which has no facility at this time to provide text alternatives or other information for severely visually impaired users to make use of. It is arguable that such a game doesn't really have this group of people as a part of its main target audience, and it would be unreasonable to expect you to make it 100% accessible to blind people. However, you could implement [keyboard controls](/en-US/docs/Games/Techniques/Control_mechanisms/Desktop_with_mouse_and_keyboard) so it is usable by non-mouse users, and make the color scheme contrasting enough to be usable by those with color deficiencies.\n\n### [The problem with too much JavaScript](#the_problem_with_too_much_javascript)\n\nThe problem often comes when people rely on JavaScript too much. Sometimes you'll see a website where everything has been done with JavaScript â\u0080\u0094 the HTML has been generated by JavaScript, the CSS has been generated by JavaScript, etc. This has all kinds of accessibility and other issues associated with it, so it is not advised.\n\nAs well as using the right element for the right job, you should also make sure you are using the right technology for the right job! Think carefully about whether you need that shiny JavaScript-powered 3D information box, or whether plain old text would do. Think carefully about whether you need a complex non-standard form widget, or whether a text input would do. And don't generate all your HTML content using JavaScript if at all possible.\n\n### [Keeping it unobtrusive](#keeping_it_unobtrusive)\n\nYou should keep **unobtrusive JavaScript** in mind when creating your content. The idea of unobtrusive JavaScript is that it should be used wherever possible to enhance functionality, not build it in entirely â\u0080\u0094 basic functions should ideally work without JavaScript, although it is appreciated that this is not always an option. But again, a large part of it is using built-in browser functionality where possible.\n\nGood example uses of unobtrusive JavaScript include:\n\n- Providing client-side form validation, which alerts users to problems with their form entries quickly, without having to wait for the server to check the data. If it isn't available, the form will still work, but validation might be slower.\n- Providing custom controls for HTML `<video>`s that are accessible to keyboard-only users, along with a direct link to the video that can be used to access it if JavaScript is not available (the default `<video>` browser controls aren't keyboard accessible in most browsers).\n\nAs an example, we've written a quick and dirty client-side form validation example â\u0080\u0094 see [form-validation.html](https://github.com/mdn/learning-area/blob/main/accessibility/css/form-validation.html) (also [see the demo live](https://mdn.github.io/learning-area/accessibility/css/form-validation.html)). Here you'll see a simple form; when you try to submit the form with one or both fields left empty, the submit fails, and an error message box appears to tell you what is wrong.\n\nThis kind of form validation is unobtrusive â\u0080\u0094 you can still use the form absolutely fine without the JavaScript being available, and any sensible form implementation will have server-side validation active as well, because it is too easy for malicious users to bypass client-side validation (for example, by turning JavaScript off in the browser). The client-side validation is still really useful for reporting errors â\u0080\u0094 users can know about mistakes they make instantly, rather than having to wait for a round trip to the server and a page reload. This is a definite usability advantage.\n\n**Note:**\nServer-side validation has not been implemented in this simple demo.\n\nWe've made this form validation pretty accessible too. We've used [`<label>`](/en-US/docs/Web/HTML/Reference/Elements/label) elements to make sure the form labels are unambiguously linked to their inputs, so screen readers can read them out alongside:\n\nhtml\n\n```\n<label for=\"name\">Enter your name:</label>\n<input type=\"text\" name=\"name\" id=\"name\" />\n```\n\nWe only do the validation when the form is submitted â\u0080\u0094 this is so that we don't update the UI too often and potentially confuse screen reader (and possibly other) users:\n\njs\n\n```\nform.onsubmit = validate;\n\nfunction validate(e) {\n  errorList.textContent = \"\";\n  for (const testItem of formItems) {\n    if (testItem.input.value === \"\") {\n      errorField.style.left = \"360px\";\n      createLink(testItem);\n    }\n  }\n\n  if (errorList.hasChildNodes()) {\n    e.preventDefault();\n  }\n}\n```\n\n**Note:**\nIn this example, we are hiding and showing the error message box using absolute positioning rather than another method such as visibility or display, because it doesn't interfere with the screen reader being able to read content from it.\n\nReal form validation would be much more complex than this â\u0080\u0094 you'd want to check that the entered name actually looks like a name, the entered age is actually a number and is realistic (e.g., nonnegative and less than 4 digits). Here we've just implemented a simple check that a value has been filled in to each input field (`if (testItem.input.value === '')`).\n\nWhen the validation has been performed, if the tests pass then the form is submitted. If there are errors (`if (errorList.hasChildNodes())`) then we stop the form submitting (using [`preventDefault()`](/en-US/docs/Web/API/Event/preventDefault)), and display any error messages that have been created (see below). This mechanism means that the errors will only be shown if there are errors, which is better for usability.\n\nFor each input that doesn't have a value filled in when the form is submitted, we create a list item with a link and insert it in the `errorList`.\n\njs\n\n```\nfunction createLink(testItem) {\n  const listItem = document.createElement(\"li\");\n  const anchor = document.createElement(\"a\");\n\n  const name = testItem.input.name;\n  anchor.textContent = `${name} field is empty: fill in your ${name}.`;\n  anchor.href = `#${name}`;\n  listItem.appendChild(anchor);\n  errorList.appendChild(listItem);\n}\n```\n\nEach link serves a dual purpose â\u0080\u0094 it tells you what the error is, plus you can click on it/activate it to jump straight to the input element in question and correct your entry.\n\nIn addition, the `errorField` is placed at the top of the source order (although it is positioned differently in the UI using CSS), meaning that users can find out exactly what's wrong with their form submissions and get to the input elements in question by going back up to the start of the page.\n\nAs a final note, we have used some WAI-ARIA attributes in our demo to help solve accessibility problems caused by areas of content constantly updating without a page reload (screen readers won't pick this up or alert users to it by default):\n\nhtml\n\n```\n<div class=\"errors\" role=\"alert\" aria-relevant=\"all\">\n  <ul></ul>\n</div>\n```\n\nWe will explain these attributes in our next article, which covers [WAI-ARIA](/en-US/docs/Learn_web_development/Core/Accessibility/WAI-ARIA_basics) in much more detail.\n\n**Note:**\nSome of you will probably be thinking about the fact that HTML forms have built-in validation mechanisms like the `required`, `min`/`minlength`, and `max`/`maxlength` attributes (see the [`<input>`](/en-US/docs/Web/HTML/Reference/Elements/input) element reference for more information). We didn't end up using these in the demo because cross-browser support for them is patchy (for example IE10 and above only).\n\n**Note:**\nWebAIM's [Usable and Accessible Form Validation and Error Recovery](https://webaim.org/techniques/formvalidation/) provides some further useful information about accessible form validation.\n\n### [Other JavaScript accessibility concerns](#other_javascript_accessibility_concerns)\n\nThere are other things to be aware of when implementing JavaScript and thinking about accessibility. We will add more as we find them.\n\n#### mouse-specific events\n\nAs you will be aware, most user interactions are implemented in client-side JavaScript using event handlers, which allow us to run functions in response to certain events happening. Some events can have accessibility issues. The main example you'll come across is mouse-specific events like [mouseover](/en-US/docs/Web/API/Element/mouseover_event), [mouseout](/en-US/docs/Web/API/Element/mouseout_event), [dblclick](/en-US/docs/Web/API/Element/dblclick_event), etc. Functionality that runs in response to these events will not be accessible using other mechanisms, like keyboard controls.\n\nTo mitigate such problems, you should double up these events with similar events that can be activated by other means (so-called device-independent event handlers) â\u0080\u0094 [focus](/en-US/docs/Web/API/Element/focus_event) and [blur](/en-US/docs/Web/API/Element/blur_event) would provide accessibility for keyboard users.\n\nLet's look at an example that highlights when this could be useful. Maybe we want to provide a thumbnail image that shows a larger version of the image when it is moused over or focused (like you'd see on an e-commerce product catalog.)\n\nWe've made a very simple example, which you can find at [mouse-and-keyboard-events.html](https://mdn.github.io/learning-area/accessibility/css/mouse-and-keyboard-events.html) (see also the [source code](https://github.com/mdn/learning-area/blob/main/accessibility/css/mouse-and-keyboard-events.html)). The code features two functions that show and hide the zoomed-in image; these are run by the following lines that set them as event handlers:\n\njs\n\n```\nimgThumb.onmouseover = showImg;\nimgThumb.onmouseout = hideImg;\n\nimgThumb.onfocus = showImg;\nimgThumb.onblur = hideImg;\n```\n\nThe first two lines run the functions when the mouse pointer hovers over and stops hovering over the thumbnail, respectively. This won't allow us to access the zoomed view by keyboard though â\u0080\u0094 to allow that, we've included the last two lines, which run the functions when the image is focused and blurred (when focus stops). This can be done by tabbing over the image, because we've included `tabindex=\"0\"` on it.\n\nThe [click](/en-US/docs/Web/API/Element/click_event) event is interesting â\u0080\u0094 it sounds mouse-dependent, but most browsers will activate [onclick](/en-US/docs/Web/API/Element/click_event) event handlers after Enter/Return is pressed on a link or form element that has focus, or when such an element is tapped on a touchscreen device. This doesn't work by default however when you allow a non-default-focusable event to have focus using tabindex â\u0080\u0094 in such cases you need to detect specifically when that exact key is pressed (see [Building keyboard accessibility back in](/en-US/docs/Learn_web_development/Core/Accessibility/HTML#building_keyboard_accessibility_back_in)).\n\n## [Summary](#summary)\n\nWe hope this article has given you a good amount of detail and understanding about the accessibility issues surrounding CSS and JavaScript use on web pages.\n\nIn the next article, we'll give you some tests that you can use to check how well you've understood and retained all this information.\n\n- [Previous](/en-US/docs/Learn_web_development/Core/Accessibility/Test_your_skills/HTML)\n- [Overview: Accessibility on the web](/en-US/docs/Learn_web_development/Core/Accessibility)\n- [Next](/en-US/docs/Learn_web_development/Core/Accessibility/Test_your_skills/CSS_and_JavaScript)\n\n## Help improve MDN\n\nWas this page helpful to you?\n\nYes\n\nNo\n\n[Learn how to contribute](/en-US/docs/MDN/Community/Getting_started)\n\nThis page was last modified on Sep 29, 2025 by [MDN contributors](/en-US/docs/Learn_web_development/Core/Accessibility/CSS_and_JavaScript/contributors.txt).\n\n[View this page on GitHub](https://github.com/mdn/content/blob/main/files/en-us/learn_web_development/core/accessibility/css_and_javascript/index.md?plain=1 \"Folder: en-us/learn_web_development/core/accessibility/css_and_javascript (Opens in a new tab)\") â\u0080¢ [Report a problem with this content](https://github.com/mdn/content/issues/new?template=page-report.yml&mdn-url=https%3A%2F%2Fdeveloper.mozilla.org%2Fen-US%2Fdocs%2FLearn_web_development%2FCore%2FAccessibility%2FCSS_and_JavaScript&metadata=%3C%21--+Do+not+make+changes+below+this+line+--%3E%0A%3Cdetails%3E%0A%3Csummary%3EPage+report+details%3C%2Fsummary%3E%0A%0A*+Folder%3A+%60en-us%2Flearn_web_development%2Fcore%2Faccessibility%2Fcss_and_javascript%60%0A*+MDN+URL%3A+https%3A%2F%2Fdeveloper.mozilla.org%2Fen-US%2Fdocs%2FLearn_web_development%2FCore%2FAccessibility%2FCSS_and_JavaScript%0A*+GitHub+URL%3A+https%3A%2F%2Fgithub.com%2Fmdn%2Fcontent%2Fblob%2Fmain%2Ffiles%2Fen-us%2Flearn_web_development%2Fcore%2Faccessibility%2Fcss_and_javascript%2Findex.md%0A*+Last+commit%3A+https%3A%2F%2Fgithub.com%2Fmdn%2Fcontent%2Fcommit%2Ffd2acb039cc1caee4af10f76ffb839c8da7da5b8%0A*+Document+last+modified%3A+2025-09-29T15%3A51%3A12.000Z%0A%0A%3C%2Fdetails%3E \"This will take you to GitHub to file a new issue.\")",
  "tags": [
    "mdn",
    "aria",
    "reference",
    "mozilla"
  ],
  "extracted_at": "2026-02-03T14:44:17.069093+00:00",
  "content_length": 21361,
  "content_hash": "2b47e1f569cbc927"
}