{
  "id": "mdn-aria__en-US_docs_Learn_Accessibility_HTML",
  "source_id": "mdn-aria",
  "source_name": "MDN ARIA Documentation",
  "category": "accessibility",
  "url": "https://developer.mozilla.org/en-US/docs/Learn/Accessibility/HTML",
  "title": "HTML: A good basis for accessibility",
  "content": "HTML: A good basis for accessibility\nPrevious\nOverview: Accessibility on the web\nNext\nA great deal of web content can be made accessible just by making sure the correct Hypertext Markup Language elements are used for the correct purpose at all times. This article looks in detail at how HTML can be used to ensure maximum accessibility.\nPrerequisites:\nFamiliarity with\nHTML\n,\nCSS\n, a\nbasic understanding of accessibility concepts\n.\nLearning outcomes:\nUse semantic HTML, aka \"The right element for the right job\", because the browser provides so many built-in accessibility hooks.\nAccessible best practices such as alt text, good link text, form labels, and table row and column headings and scoping.\nUsing simple plain language, steering clear of slang and abbreviations where possible, and providing definitions where it is not possible.\nThe concept and practice of keyboard accessibility.\nThe importance of source order.\nHTML and accessibility\nAs you learn more about HTML â\u0080\u0094 read more resources, look at more examples, etc. â\u0080\u0094 you'll keep seeing a common theme: the importance of using semantic HTML (sometimes called POSH, or Plain Old Semantic HTML). This means using the correct HTML elements for their intended purpose as much as possible.\nYou might wonder why this is so important. After all, you can use a combination of CSS and JavaScript to make just about any HTML element behave in whatever way you want. For example, a control button to play a video on your site could be marked up like this:\nhtml\n<div>Play video</div>\nBut as you'll see in greater detail later on, it makes sense to use the correct element for the job:\nhtml\n<button>Play video</button>\nNot only do HTML\n<button>\ns have some suitable styling applied by default (which you will probably want to override), they also have built-in keyboard accessibility â\u0080\u0094 users can navigate between buttons using the\nTab\nkey and activate their selection using\nSpace\n,\nReturn\nor\nEnter\n.\nSemantic HTML doesn't take any longer to write than non-semantic (bad) markup if you do it consistently from the start of your project. Even better, semantic markup has other benefits beyond accessibility:\nEasier to develop with\nâ\u0080\u0094 as mentioned above, you get some functionality for free, plus it is arguably easier to understand.\nBetter on mobile\nâ\u0080\u0094 semantic HTML is arguably lighter in file size than non-semantic spaghetti code, and easier to make responsive.\nGood for SEO\nâ\u0080\u0094 search engines give more importance to keywords inside headings, links, etc. than keywords included in non-semantic\n<div>\ns, etc., so your documents will be more findable by customers.\nLet's get on and look at accessible HTML in more detail.\nGood semantics\nWe've already talked about the importance of proper semantics, and why we should use the right HTML element for the job. This cannot be ignored, as it is one of the main places that accessibility is badly broken if not handled properly.\nOut there on the web, the truth is that people do some very strange things with HTML markup. Often, misuse of HTML is because of legacy practices that haven't gone away yet, but sometimes it occurs because authors don't know any better. Whatever the case, you should replace bad code with good semantic markup wherever possible, in both static HTML pages and dynamically-generated HTML from\nserver-side\ncode or\nclient-side JavaScript frameworks\nsuch as React.\nSometimes you are not in a position to get rid of lousy markup â\u0080\u0094 your pages might be dependant on server-side code or web/framework components that you have no control over, or you might have third-party content on your page (such as ad banners).\nThe goal isn't \"all or nothing\"; every improvement you can make will help the cause of accessibility.\nUse well-structured text content\nOne of the best accessibility aids a screen reader user can have is an excellent text structure with headings, paragraphs, lists, etc. A good semantic example might look something like the following:\nhtml\n<h1>My heading</h1>\n\n<p>This is the first section of my document.</p>\n\n<p>I'll add another paragraph here too.</p>\n\n<ol>\n  <li>Here is</li>\n  <li>a list for</li>\n  <li>you to read</li>\n</ol>\n\n<h2>My subheading</h2>\n\n<p>\n  This is the first subsection of my document. I'd love people to be able to\n  find this content!\n</p>\n\n<h2>My 2nd subheading</h2>\n\n<p>\n  This is the second subsection of my content, which I think is more interesting\n  than the last one.\n</p>\nWe've prepared a version with longer text for you to try out with a screen reader (see\ngood-semantics.html\n). If you try navigating through this, you'll see that this is pretty easy to navigate:\nThe screen reader reads each header out as you progress through the content, notifying you what a heading is, what is a paragraph, etc.\nIt stops after each element, letting you go at whatever pace is comfortable for you.\nYou can jump to the next/previous heading in many screen readers.\nYou can also bring up a list of all headings in many screen readers, allowing you to use them as a handy table of contents to find specific content.\nPeople sometimes write headings, paragraphs, etc. using line breaks and adding HTML elements purely for styling, something like the following:\nhtml\n<span style=\"font-size: 3em\">My heading</span> <br /><br />\nThis is the first section of my document.\n<br /><br />\nI'll add another paragraph here too.\n<br /><br />\n1. Here is\n<br /><br />\n2. a list for\n<br /><br />\n3. you to read\n<br /><br />\n<span style=\"font-size: 2.5em\">My subheading</span>\n<br /><br />\nThis is the first subsection of my document. I'd love people to be able to find\nthis content!\n<br /><br />\n<span style=\"font-size: 2.5em\">My 2nd subheading</span>\n<br /><br />\nThis is the second subsection of my content. I think is more interesting than\nthe last one.\nIf you try our longer version out with a screen reader (see\nbad-semantics.html\n), you'll not have a very good experience â\u0080\u0094 the screen reader hasn't got anything to use as signposts, so you can't retrieve a useful table of contents, and the whole page is seen as a single giant block, so it is just read out in one go, all at once.\nThere are other issues too beyond accessibility â\u0080\u0094 it is harder to style the content using CSS, or manipulate it with JavaScript, for example, because there are no elements to use as selectors.\nUse clear language\nThe language you use can also affect accessibility. In general, you should use clear language that is not overly complex and doesn't use unnecessary jargon or slang terms. This not only benefits people with cognitive or other disabilities; it benefits readers for whom the text is not written in their first language, younger peopleâ\u0080¦, everyone, in fact! Apart from this, you should try to avoid using language and characters that don't get read out clearly by the screen reader. For example:\nDon't use dashes if you can avoid it. Instead of writing 5â\u0080\u00937, write 5 to 7.\nExpand abbreviations â\u0080\u0094 instead of writing Jan, write January.\nExpand acronyms, at least once or twice, then use the\n<abbr>\ntag to describe them.\nStructure page sections logically\nYou should use appropriate\nsectioning elements\nto structure your webpages, for example navigation (\n<nav>\n), footer (\n<footer>\n), and repeating content units (\n<article>\n). These provide extra semantics for screen readers (and other tools) to give users extra clues about the content they are navigating.\nFor example, a modern content structure could look something like this:\nhtml\n<header>\n  <h1>Header</h1>\n</header>\n\n<nav>\n  <!-- main navigation in here -->\n</nav>\n\n<!-- Here is our page's main content -->\n<main>\n  <!-- It contains an article -->\n  <article>\n    <h2>Article heading</h2>\n\n    <!-- article content in here -->\n  </article>\n\n  <aside>\n    <h2>Related</h2>\n\n    <!-- aside content in here -->\n  </aside>\n</main>\n\n<!-- And here is our main footer that is used across all the pages of our website -->\n\n<footer>\n  <!-- footer content in here -->\n</footer>\nYou can find a\nfull example here\n.\nIn addition to having good semantics and an attractive layout, your content should make logical sense in its source order â\u0080\u0094 you can always place it where you want using CSS later on, but you should get the source order right to start with, so what screen reader users get read out to them will make sense.\nUse semantic UI controls where possible\nBy UI controls, we mean the main parts of web documents that users interact with â\u0080\u0094 most commonly buttons, links, and form controls. In this section, we'll look at the basic accessibility concerns to be aware of when creating such controls. Later articles on WAI-ARIA and multimedia will look at other aspects of UI accessibility.\nOne key aspect of the accessibility of UI controls is that by default, browsers allow them to be manipulated by the keyboard. You can try this out using our\nnative-keyboard-accessibility.html\nexample (see the\nsource code\n). Open this in a new tab, and try pressing the tab key; after a few presses, you should see the tab focus start to move through the different focusable elements. The focused elements are given a highlighted default style in every browser (it differs slightly between different browsers) so that you can tell what element is focused.\nNote:\nYou can enable an overlay that shows the page tabbing order in your developer tools. For more information see:\nAccessibility Inspector > Show web page tabbing order\n.\nYou can then press Enter/Return to follow a focused link or press a button (we've included some JavaScript to make the buttons alert a message), or start typing to enter text in a text input. Other form elements have different controls; for example, the\n<select>\nelement can have its options displayed and cycled between using the up and down arrow keys.\nYou essentially get this behavior for free, just by using the appropriate elements, for example:\nhtml\n<h1>Links</h1>\n\n<p>This is a link to <a href=\"https://www.mozilla.org\">Mozilla</a>.</p>\n\n<p>\n  Another link, to the\n  <a href=\"https://developer.mozilla.org\">Mozilla Developer Network</a>.\n</p>\n\n<h2>Buttons</h2>\n\n<p>\n  <button data-message=\"This is from the first button\">Click me!</button>\n  <button data-message=\"This is from the second button\">Click me too!</button>\n  <button data-message=\"This is from the third button\">And me!</button>\n</p>\n\n<h2>Form</h2>\n\n<form>\n  <div>\n    <label for=\"name\">Fill in your name:</label>\n    <input type=\"text\" id=\"name\" name=\"name\" />\n  </div>\n  <div>\n    <label for=\"age\">Enter your age:</label>\n    <input type=\"text\" id=\"age\" name=\"age\" />\n  </div>\n  <div>\n    <label for=\"mood\">Choose your mood:</label>\n    <select id=\"mood\" name=\"mood\">\n      <option>Happy</option>\n      <option>Sad</option>\n      <option>Angry</option>\n      <option>Worried</option>\n    </select>\n  </div>\n</form>\nThis means using links, buttons, form elements, and labels appropriately (including the\n<label>\nelement for form controls).\nHowever, this is another case where people sometimes do strange things with HTML. For example, you sometimes see buttons marked up using\n<div>\ns, for example:\nhtml\n<div data-message=\"This is from the first button\">Click me!</div>\n<div data-message=\"This is from the second button\">Click me too!</div>\n<div data-message=\"This is from the third button\">And me!</div>\nBut using such code is not advised â\u0080\u0094 you immediately lose the native keyboard accessibility you would have had if you'd just used\n<button>\nelements, plus you don't get any of the default CSS styling that buttons get. In the rare to non-existent case when you need to use a non-button element for a button, use the\nbutton\nrole\nand implement all the default button behaviors, including keyboard and mouse button support.\nBuilding keyboard accessibility back in\nAdding such advantages back in takes a bit of work (you can see an example in our\nfake-div-buttons.html\nexample â\u0080\u0094 also see the\nsource code\n). Here we've given our fake\n<div>\nbuttons the ability to be focused (including via tab) by giving each one the attribute\ntabindex=\"0\"\n. We also include\nrole=\"button\"\nso screen reader users know they can focus on and interact with the element:\nhtml\n<div data-message=\"This is from the first button\" tabindex=\"0\" role=\"button\">\n  Click me!\n</div>\n<div data-message=\"This is from the second button\" tabindex=\"0\" role=\"button\">\n  Click me too!\n</div>\n<div data-message=\"This is from the third button\" tabindex=\"0\" role=\"button\">\n  And me!\n</div>\nBasically, the\ntabindex\nattribute is primarily intended to allow tabbable elements to have a custom tab order (specified in positive numerical order), instead of just being tabbed through in their default source order. This is nearly always a bad idea, as it can cause major confusion. Use it only if you really need to, for example, if the layout shows things in a very different visual order to the source code, and you want to make things work more logically. There are two other options for\ntabindex\n:\ntabindex=\"0\"\nâ\u0080\u0094 as indicated above, this value allows elements that are not normally tabbable to become tabbable. This is the most useful value of\ntabindex\n.\ntabindex=\"-1\"\nâ\u0080\u0094 this allows not normally tabbable elements to receive focus programmatically, e.g., via JavaScript, or as the target of links.\nWhile the above addition allows us to tab to the buttons, it does not allow us to activate them via the\nEnter\n/\nReturn\nkey. To do that, we had to add the following bit of JavaScript:\njs\ndocument.onkeydown = (e) => {\n  // The Enter/Return key\n  if (e.key === \"Enter\") {\n    document.activeElement.click();\n  }\n};\nHere we add a listener to the\ndocument\nobject to detect when a button has been pressed on the keyboard. We check what button was pressed via the event object's\nkey\nproperty; if the key pressed is\nEnter\n/\nReturn\n, we run the function stored in the button's\nonclick\nhandler using\ndocument.activeElement.click()\n.\nactiveElement\nwhich gives us the element that is currently focused on the page.\nThis is a lot of extra hassle to build the functionality back in. And there's bound to be other problems with it.\nBetter to just use the right element for the right job in the first place.\nUse meaningful text labels\nUI control text labels are very useful to all users, but getting them right is particularly important to users with disabilities.\nYou should make sure that your button and link text labels are understandable and distinctive. Don't just use \"Click here\" for your labels, as screen reader users sometimes get up a list of buttons and form controls. The following screenshot shows our controls being listed by VoiceOver on Mac.\nMake sure your labels make sense out of context, read on their own, as well as in the context of the paragraph they are in. For example, the following shows an example of good link text:\nhtml\n<p>\n  Whales are really awesome creatures.\n  <a href=\"whales.html\">Find out more about whales</a>.\n</p>\nbut this is bad link text:\nhtml\n<p>\n  Whales are really awesome creatures. To find out more about whales,\n  <a href=\"whales.html\">click here</a>.\n</p>\nNote:\nYou can find a lot more about link implementation and best practices in our\nCreating links\narticle. You can also see some good and bad examples at\ngood-links.html\nand\nbad-links.html\n.\nForm labels are also important for giving you a clue about what you need to enter into each form input. The following seems like a reasonable enough example:\nhtml\nFill in your name: <input type=\"text\" id=\"name\" name=\"name\" />\nHowever, this is not so useful for disabled users. There is nothing in the above example to associate the label unambiguously with the form input and make it clear how to fill it in if you cannot see it. If you access this with some screen readers, you may only be given a description along the lines of \"edit text.\"\nThe following is a much better example:\nhtml\n<div>\n  <label for=\"name\">Fill in your name:</label>\n  <input type=\"text\" id=\"name\" name=\"name\" />\n</div>\nWith code like this, the label will be clearly associated with the input; the description will be more like \"Fill in your name: edit text.\"\nAs an added bonus, in most browsers associating a label with a form input means that you can click the label to select or activate the form element. This gives the input a bigger hit area, making it easier to select.\nNote:\nYou can see some good and bad form examples in\ngood-form.html\nand\nbad-form.html\n.\nYou can find a nice explanation of the importance of proper text labels, and how to investigate text label issues using the\nFirefox Accessibility Inspector\n, in the following video:\nAccessible data tables\nA basic data table can be written with very simple markup, for example:\nhtml\n<table>\n  <tr>\n    <td>Name</td>\n    <td>Age</td>\n    <td>Pronouns</td>\n  </tr>\n  <tr>\n    <td>Gabriel</td>\n    <td>13</td>\n    <td>he/him</td>\n  </tr>\n  <tr>\n    <td>Elva</td>\n    <td>8</td>\n    <td>she/her</td>\n  </tr>\n  <tr>\n    <td>Freida</td>\n    <td>5</td>\n    <td>she/her</td>\n  </tr>\n</table>\nBut this has problems â\u0080\u0094 there is no way for a screen reader user to associate rows or columns together as groupings of data. To do this, you need to know what the header rows are and if they are heading up rows, columns, etc. This can only be done visually for the above table (see\nbad-table.html\nand try the example out yourself).\nNow have a look at our\npunk bands table example\nâ\u0080\u0094 you can see a few accessibility aids at work here:\nTable headers are defined using\n<th>\nelements â\u0080\u0094 you can also specify if they are headers for rows or columns using the\nscope\nattribute. This gives you complete groups of data that can be consumed by screen readers as single units.\nThe\n<caption>\nelement and the\n<table>\nelement's\nsummary\nattribute both do similar jobs â\u0080\u0094 they act as alt text for a table, giving a screen reader user a useful quick summary of the table's contents. The\n<caption>\nelement is generally preferred as it makes its content accessible to sighted users too, who might also find it useful. You don't really need both.\nNote:\nSee our\nHTML table accessibility\narticle for more details about accessible data tables.\nText alternatives\nWhereas textual content is inherently accessible, the same cannot necessarily be said for multimedia content â\u0080\u0094 image and video content cannot be seen by visually-impaired people, and audio content cannot be heard by hearing-impaired people. We cover video and audio content in detail in the\nAccessible multimedia\n, but for this article we'll look at accessibility for the humble\n<img>\nelement.\nWe have a simple example written up,\naccessible-image.html\n, which features four copies of the same image:\nhtml\n<img src=\"dinosaur.png\" />\n\n<img\n  src=\"dinosaur.png\"\n  alt=\"A red Tyrannosaurus Rex: A two legged dinosaur standing upright like a human, with small arms, and a large head with lots of sharp teeth.\" />\n\n<img\n  src=\"dinosaur.png\"\n  alt=\"A red Tyrannosaurus Rex: A two legged dinosaur standing upright like a human, with small arms, and a large head with lots of sharp teeth.\"\n  title=\"The Mozilla red dinosaur\" />\n\n<img src=\"dinosaur.png\" aria-labelledby=\"dino-label\" />\n\n<p id=\"dino-label\">\n  The Mozilla red Tyrannosaurus Rex: A two legged dinosaur standing upright like\n  a human, with small arms, and a large head with lots of sharp teeth.\n</p>\nThe first image, when viewed by a screen reader, doesn't really offer the user much help â\u0080\u0094 VoiceOver for example reads out \"/dinosaur.png, image\". It reads out the filename to try to provide some help. In this example the user will at least know it is a dinosaur of some kind, but often files may be uploaded with machine-generated file names (e.g., from a digital camera) and these file names would likely provide no context to the image's content.\nNote:\nThis is why you should never include text content inside an image â\u0080\u0094 screen readers can't access it. There are other disadvantages too â\u0080\u0094 you can't select it and copy/paste it. Just don't do it!\nWhen a screen reader encounters the second image, it reads out the full alt attribute â\u0080\u0094 \"A red Tyrannosaurus Rex: A two legged dinosaur standing upright like a human, with small arms, and a large head with lots of sharp teeth.\".\nThis highlights the importance of not only using meaningful file names in case so-called\nalt text\nis not available, but also making sure that alt text is provided in\nalt\nattributes wherever possible.\nNote that the contents of the\nalt\nattribute should always provide a direct representation of the image and what it conveys visually. The alt should be brief and concise and include all the information conveyed in the image that is not duplicated in the surrounding text.\nThe content of the\nalt\nattribute for a single image differs based on the context. For example, if the photo of Fluffy is an avatar next to a review for Yuckymeat dog food,\nalt=\"Fluffy\"\nis appropriate. If the photo is part of Fluffy's adoption page for the animal rescue society, information conveyed in the image that is relevant for a prospective dog parent that is not duplicated in the surrounding text should be included. A longer description, such as\nalt=\"Fluffy, a tri-color terrier with very short hair, with a tennis ball in her mouth.\"\nis appropriate. As the surrounding text likely has Fluffy's size and breed, that is not included in the\nalt\n. However, as the dog's biography likely doesn't include hair length, colors, or toy preferences, which the potential parent needs to know, it is included. Is the image outdoors, or does Fluffy have a red collar with a blue leash? Not important in terms of adopting the pet and therefore not included. All information image conveys that a sighted user can access and is relevant to the context is what needs to be conveyed; nothing more. Keep it short, precise, and useful.\nAny personal knowledge or extra description shouldn't be included here, as it is not useful for people who have not seen the image before. If the ball is Fluffy's favorite toy or if a sighted user can't know that from the image, then don't include it.\nOne thing to consider is whether your images have meaning inside your content, or whether they are purely for visual decoration, and thus have no meaning. If they are decorative, it is better to write an empty text as a value for\nalt\nattribute (see\nEmpty alt attributes\n) or to just include them in the page as CSS background images.\nNote:\nRead\nHTML images\nand\nResponsive images\nfor a lot more information about image implementation and best practices.\nYou can also check\nAn alt Decision Tree\nto learn how to use an alt attribute for images in various situations.\nIf you do want to provide extra contextual information, you should put it in the text surrounding the image, or inside a\ntitle\nattribute, as shown above. In this case, most screen readers will read out the alt text, the title attribute, and the filename. In addition, browsers display title text as tooltips when moused over.\nLet's have another quick look at the fourth method:\nhtml\n<img src=\"dinosaur.png\" aria-labelledby=\"dino-label\" />\n\n<p id=\"dino-label\">The Mozilla red Tyrannosaurusâ\u0080¦</p>\nIn this case, we are not using the\nalt\nattribute at all â\u0080\u0094 instead, we have presented our description of the image as a regular text paragraph, given it an\nid\n, and then used the\naria-labelledby\nattribute to refer to that\nid\n, which causes screen readers to use that paragraph as the alt text/label for that image. This is especially useful if you want to use the same text as a label for multiple images â\u0080\u0094 something that isn't possible with\nalt\n.\nNote:\naria-labelledby\nis part of the\nWAI-ARIA\nspec, which allows developers to add in extra semantics to their markup to improve screen reader accessibility where needed.\nFigures and figure captions\nHTML includes two elements â\u0080\u0094\n<figure>\nand\n<figcaption>\nâ\u0080\u0094 which associate a figure of some kind (it could be anything, not necessarily an image) with a figure caption:\nhtml\n<figure>\n  <img\n    src=\"dinosaur.png\"\n    alt=\"The Mozilla Tyrannosaurus\"\n    aria-describedby=\"dinodescr\" />\n  <figcaption id=\"dinodescr\">\n    A red Tyrannosaurus Rex: A two legged dinosaur standing upright like a\n    human, with small arms, and a large head with lots of sharp teeth.\n  </figcaption>\n</figure>\nWhile there is mixed screen reader support of associating figure captions with their figures, including\naria-labelledby\nor\naria-describedby\ncreates the association if none is present. That said, the element structure is useful for CSS styling, plus it provides a way to place a description of the image next to it in the source.\nEmpty alt attributes\nhtml\n<h3>\n  <img src=\"article-icon.png\" alt=\"\" />\n  Tyrannosaurus Rex: the king of the dinosaurs\n</h3>\nThere may be times where an image is included in a page's design, but its primary purpose is for visual decoration. You'll notice in the code example above that the image's\nalt\nattribute is empty â\u0080\u0094 this is to make screen readers recognize the image, but not attempt to describe the image (instead they'd just say \"image\", or similar).\nThe reason to use an empty\nalt\ninstead of not including it is because many screen readers announce the whole image URL if no\nalt\nis provided. In the above example, the image is acting as a visual decoration to the heading it's associated with. In cases like this, and in cases where an image is only decoration and has no content value, you should include an empty\nalt\nin your\nimg\nelements. Another alternative is to use the aria\nrole\nattribute\nrole=\"presentation\"\nas this also stops screen readers from reading out alternative text.\nNote:\nIf possible you should use CSS to display images that are only decorative.\nMore on links\nLinks (the\n<a>\nelement with an\nhref\nattribute), depending on how they are used, can help or harm accessibility. By default, links are accessible in appearance. They can improve accessibility by helping a user quickly navigate to different sections of a document. They can also harm accessibility if their accessible styling is removed or if JavaScript causes them to behave in unexpected ways.\nLink styling\nBy default, links are visually different from other text in both color and\ntext-decoration\n, with links being blue and underlined by default, purple and underlined if visited, and with a\nfocus-ring\nwhen they receive keyboard focus.\nColor should not be used as the sole method of distinguishing links from non-linking content. Link text color, like all text, has to be significantly different from the background color (\na 4.5:1 contrast\n). In addition, links should visually be significantly different from non-linking text, with a minimum contrast requirement of 3:1 between link text and surrounding text and between default, visited, and focus/active states and a 4.5:1 contrast between all those state colors and the background color.\nonclick\nevents\nAnchor tags are often abused with the\nonclick\nevent to create pseudo-buttons by setting\nhref\nto\n\"#\"\nor\n\"javascript:void(0)\"\nto prevent the page from refreshing.\nThese values cause unexpected behavior when copying or dragging links, opening links in a new tab or window, bookmarking, and when JavaScript is still downloading, errors out, or is disabled. This also conveys incorrect semantics to assistive technologies (e.g., screen readers). In these cases, it is recommended to use a\n<button>\ninstead. In general you should only use an anchor for navigation using a proper URL.\nExternal links and linking to non-HTML resources\nLinks that open in a new tab or window via the\ntarget=\"_blank\"\ndeclaration and links to whose\nhref\nvalue points to a file resource should include an indicator about the behavior that will occur when the link is activated.\nPeople experiencing low vision conditions, who are navigating with the aid of screen reading technology, or who have cognitive concerns may become confused when the new tab, window, or application is opened unexpectedly. Older versions of screen reading software may not even announce the behavior.\nLink that opens a new tab or window\nhtml\n<a target=\"_blank\" href=\"https://www.wikipedia.org/\"\n  >Wikipedia (opens in a new window)</a\n>\nLink to a non-HTML resource\nhtml\n<a target=\"_blank\" href=\"2017-annual-report.ppt\"\n  >2017 Annual Report (PowerPoint)</a\n>\nIf an icon is used in place of text to signify this kind of links behavior, make sure it includes an\nalternate description\n.\nWebAIM: Links and Hypertext - Hypertext Links\nMDN Understanding WCAG, Guideline 3.2 explanations\nG200: Opening new windows and tabs from a link only when necessary | W3C Techniques for WCAG 2.0\nG201: Giving users advanced warning when opening a new window | W3C Techniques for WCAG 2.0\nSkip links\nA skip link, also known as skipnav, is an\na\nelement placed as close as possible to the opening\n<body>\nelement that links to the beginning of the page's main content. This link allows people to bypass content repeated throughout multiple pages on a website, such as a website's header and primary navigation.\nSkip links are especially useful for people who navigate with the aid of assistive technology such as switch control, voice command, or mouth sticks/head wands, where the act of moving through repetitive links can be a laborious task.\nWebAIM: \"Skip Navigation\" Links\nHowâ\u0080\u0093to: Use Skip Navigation links - The A11Y Project\nMDN Understanding WCAG, Guideline 2.4 explanations\nUnderstanding Success Criterion 2.4.1 | W3C Understanding WCAG 2.0\nProximity\nLarge amounts of interactive contentâ\u0080\u0094including anchorsâ\u0080\u0094placed in close visual proximity to each other should have space inserted to separate them. This spacing is beneficial for people who suffer from fine motor control issues and may accidentally activate the wrong interactive content while navigating.\nSpacing may be created using CSS properties such as\nmargin\n.\nHand tremors and the giant-button-problem - Axess Lab\nSummary\nYou should now be well-versed in writing accessible HTML for most occasions. In the next article, we'll give you some tests that you can use to check how well you've understood and retained all this information.\nPrevious\nOverview: Accessibility on the web\nNext\nHelp improve MDN\nLearn how to contribute\nThis page was last modified on\nNov 4, 2025\nby\nMDN contributors\n.\nView this page on GitHub\nâ\u0080¢\nReport a problem with this content",
  "content_markdown": "# HTML: A good basis for accessibility\n\n- [Previous](/en-US/docs/Learn_web_development/Core/Accessibility/Tooling)\n- [Overview: Accessibility on the web](/en-US/docs/Learn_web_development/Core/Accessibility)\n- [Next](/en-US/docs/Learn_web_development/Core/Accessibility/Test_your_skills/HTML)\n\nA great deal of web content can be made accessible just by making sure the correct Hypertext Markup Language elements are used for the correct purpose at all times. This article looks in detail at how HTML can be used to ensure maximum accessibility.\n\n|  |  |\n| --- | --- |\n| Prerequisites: | Familiarity with [HTML](/en-US/docs/Learn_web_development/Core/Structuring_content), [CSS](/en-US/docs/Learn_web_development/Core/Styling_basics), a [basic understanding of accessibility concepts](/en-US/docs/Learn_web_development/Core/Accessibility/What_is_accessibility). |\n| Learning outcomes: | - Use semantic HTML, aka \"The right element for the right job\", because the browser provides so many built-in accessibility hooks. - Accessible best practices such as alt text, good link text, form labels, and table row and column headings and scoping. - Using simple plain language, steering clear of slang and abbreviations where possible, and providing definitions where it is not possible. - The concept and practice of keyboard accessibility. - The importance of source order. |\n\n## [HTML and accessibility](#html_and_accessibility)\n\nAs you learn more about HTML â\u0080\u0094 read more resources, look at more examples, etc. â\u0080\u0094 you'll keep seeing a common theme: the importance of using semantic HTML (sometimes called POSH, or Plain Old Semantic HTML). This means using the correct HTML elements for their intended purpose as much as possible.\n\nYou might wonder why this is so important. After all, you can use a combination of CSS and JavaScript to make just about any HTML element behave in whatever way you want. For example, a control button to play a video on your site could be marked up like this:\n\nhtml\n\n```\n<div>Play video</div>\n```\n\nBut as you'll see in greater detail later on, it makes sense to use the correct element for the job:\n\nhtml\n\n```\n<button>Play video</button>\n```\n\nNot only do HTML `<button>`s have some suitable styling applied by default (which you will probably want to override), they also have built-in keyboard accessibility â\u0080\u0094 users can navigate between buttons using the `Tab` key and activate their selection using `Space`, `Return` or `Enter`.\n\nSemantic HTML doesn't take any longer to write than non-semantic (bad) markup if you do it consistently from the start of your project. Even better, semantic markup has other benefits beyond accessibility:\n\n1. **Easier to develop with** â\u0080\u0094 as mentioned above, you get some functionality for free, plus it is arguably easier to understand.\n2. **Better on mobile** â\u0080\u0094 semantic HTML is arguably lighter in file size than non-semantic spaghetti code, and easier to make responsive.\n3. **Good for SEO** â\u0080\u0094 search engines give more importance to keywords inside headings, links, etc. than keywords included in non-semantic `<div>`s, etc., so your documents will be more findable by customers.\n\nLet's get on and look at accessible HTML in more detail.\n\n## [Good semantics](#good_semantics)\n\nWe've already talked about the importance of proper semantics, and why we should use the right HTML element for the job. This cannot be ignored, as it is one of the main places that accessibility is badly broken if not handled properly.\n\nOut there on the web, the truth is that people do some very strange things with HTML markup. Often, misuse of HTML is because of legacy practices that haven't gone away yet, but sometimes it occurs because authors don't know any better. Whatever the case, you should replace bad code with good semantic markup wherever possible, in both static HTML pages and dynamically-generated HTML from [server-side](/en-US/docs/Learn_web_development/Extensions/Server-side) code or [client-side JavaScript frameworks](/en-US/docs/Learn_web_development/Core/Frameworks_libraries) such as React.\n\nSometimes you are not in a position to get rid of lousy markup â\u0080\u0094 your pages might be dependant on server-side code or web/framework components that you have no control over, or you might have third-party content on your page (such as ad banners).\n\nThe goal isn't \"all or nothing\"; every improvement you can make will help the cause of accessibility.\n\n### [Use well-structured text content](#use_well-structured_text_content)\n\nOne of the best accessibility aids a screen reader user can have is an excellent text structure with headings, paragraphs, lists, etc. A good semantic example might look something like the following:\n\nhtml\n\n```\n<h1>My heading</h1>\n\n<p>This is the first section of my document.</p>\n\n<p>I'll add another paragraph here too.</p>\n\n<ol>\n  <li>Here is</li>\n  <li>a list for</li>\n  <li>you to read</li>\n</ol>\n\n<h2>My subheading</h2>\n\n<p>\n  This is the first subsection of my document. I'd love people to be able to\n  find this content!\n</p>\n\n<h2>My 2nd subheading</h2>\n\n<p>\n  This is the second subsection of my content, which I think is more interesting\n  than the last one.\n</p>\n```\n\nWe've prepared a version with longer text for you to try out with a screen reader (see [good-semantics.html](https://mdn.github.io/learning-area/accessibility/html/good-semantics.html)). If you try navigating through this, you'll see that this is pretty easy to navigate:\n\n1. The screen reader reads each header out as you progress through the content, notifying you what a heading is, what is a paragraph, etc.\n2. It stops after each element, letting you go at whatever pace is comfortable for you.\n3. You can jump to the next/previous heading in many screen readers.\n4. You can also bring up a list of all headings in many screen readers, allowing you to use them as a handy table of contents to find specific content.\n\nPeople sometimes write headings, paragraphs, etc. using line breaks and adding HTML elements purely for styling, something like the following:\n\nhtml\n\n```\n<span style=\"font-size: 3em\">My heading</span> <br /><br />\nThis is the first section of my document.\n<br /><br />\nI'll add another paragraph here too.\n<br /><br />\n1. Here is\n<br /><br />\n2. a list for\n<br /><br />\n3. you to read\n<br /><br />\n<span style=\"font-size: 2.5em\">My subheading</span>\n<br /><br />\nThis is the first subsection of my document. I'd love people to be able to find\nthis content!\n<br /><br />\n<span style=\"font-size: 2.5em\">My 2nd subheading</span>\n<br /><br />\nThis is the second subsection of my content. I think is more interesting than\nthe last one.\n```\n\nIf you try our longer version out with a screen reader (see [bad-semantics.html](https://mdn.github.io/learning-area/accessibility/html/bad-semantics.html)), you'll not have a very good experience â\u0080\u0094 the screen reader hasn't got anything to use as signposts, so you can't retrieve a useful table of contents, and the whole page is seen as a single giant block, so it is just read out in one go, all at once.\n\nThere are other issues too beyond accessibility â\u0080\u0094 it is harder to style the content using CSS, or manipulate it with JavaScript, for example, because there are no elements to use as selectors.\n\n### [Use clear language](#use_clear_language)\n\nThe language you use can also affect accessibility. In general, you should use clear language that is not overly complex and doesn't use unnecessary jargon or slang terms. This not only benefits people with cognitive or other disabilities; it benefits readers for whom the text is not written in their first language, younger peopleâ\u0080¦, everyone, in fact! Apart from this, you should try to avoid using language and characters that don't get read out clearly by the screen reader. For example:\n\n- Don't use dashes if you can avoid it. Instead of writing 5â\u0080\u00937, write 5 to 7.\n- Expand abbreviations â\u0080\u0094 instead of writing Jan, write January.\n- Expand acronyms, at least once or twice, then use the [`<abbr>`](/en-US/docs/Web/HTML/Reference/Elements/abbr) tag to describe them.\n\n### [Structure page sections logically](#structure_page_sections_logically)\n\nYou should use appropriate [sectioning elements](/en-US/docs/Web/HTML/Reference/Elements#content_sectioning) to structure your webpages, for example navigation ([`<nav>`](/en-US/docs/Web/HTML/Reference/Elements/nav)), footer ([`<footer>`](/en-US/docs/Web/HTML/Reference/Elements/footer)), and repeating content units ([`<article>`](/en-US/docs/Web/HTML/Reference/Elements/article)). These provide extra semantics for screen readers (and other tools) to give users extra clues about the content they are navigating.\n\nFor example, a modern content structure could look something like this:\n\nhtml\n\n```\n<header>\n  <h1>Header</h1>\n</header>\n\n<nav>\n  <!-- main navigation in here -->\n</nav>\n\n<!-- Here is our page's main content -->\n<main>\n  <!-- It contains an article -->\n  <article>\n    <h2>Article heading</h2>\n\n    <!-- article content in here -->\n  </article>\n\n  <aside>\n    <h2>Related</h2>\n\n    <!-- aside content in here -->\n  </aside>\n</main>\n\n<!-- And here is our main footer that is used across all the pages of our website -->\n\n<footer>\n  <!-- footer content in here -->\n</footer>\n```\n\nYou can find a [full example here](https://mdn.github.io/learning-area/html/introduction-to-html/document_and_website_structure/).\n\nIn addition to having good semantics and an attractive layout, your content should make logical sense in its source order â\u0080\u0094 you can always place it where you want using CSS later on, but you should get the source order right to start with, so what screen reader users get read out to them will make sense.\n\n### [Use semantic UI controls where possible](#use_semantic_ui_controls_where_possible)\n\nBy UI controls, we mean the main parts of web documents that users interact with â\u0080\u0094 most commonly buttons, links, and form controls. In this section, we'll look at the basic accessibility concerns to be aware of when creating such controls. Later articles on WAI-ARIA and multimedia will look at other aspects of UI accessibility.\n\nOne key aspect of the accessibility of UI controls is that by default, browsers allow them to be manipulated by the keyboard. You can try this out using our [native-keyboard-accessibility.html](https://mdn.github.io/learning-area/tools-testing/cross-browser-testing/accessibility/native-keyboard-accessibility.html) example (see the [source code](https://github.com/mdn/learning-area/blob/main/tools-testing/cross-browser-testing/accessibility/native-keyboard-accessibility.html)). Open this in a new tab, and try pressing the tab key; after a few presses, you should see the tab focus start to move through the different focusable elements. The focused elements are given a highlighted default style in every browser (it differs slightly between different browsers) so that you can tell what element is focused.\n\n![Three buttons with the text \"Click me!\", \"Click me too!\", and \"And me!\" inside them respectively. The third button has a blue outline around it to indicate current tab focus.](/en-US/docs/Learn_web_development/Core/Accessibility/HTML/button-focused-unfocused.png)\n\n**Note:**\nYou can enable an overlay that shows the page tabbing order in your developer tools. For more information see: [Accessibility Inspector > Show web page tabbing order](https://firefox-source-docs.mozilla.org/devtools-user/accessibility_inspector/index.html#show-web-page-tabbing-order).\n\nYou can then press Enter/Return to follow a focused link or press a button (we've included some JavaScript to make the buttons alert a message), or start typing to enter text in a text input. Other form elements have different controls; for example, the [`<select>`](/en-US/docs/Web/HTML/Reference/Elements/select) element can have its options displayed and cycled between using the up and down arrow keys.\n\nYou essentially get this behavior for free, just by using the appropriate elements, for example:\n\nhtml\n\n```\n<h1>Links</h1>\n\n<p>This is a link to <a href=\"https://www.mozilla.org\">Mozilla</a>.</p>\n\n<p>\n  Another link, to the\n  <a href=\"https://developer.mozilla.org\">Mozilla Developer Network</a>.\n</p>\n\n<h2>Buttons</h2>\n\n<p>\n  <button data-message=\"This is from the first button\">Click me!</button>\n  <button data-message=\"This is from the second button\">Click me too!</button>\n  <button data-message=\"This is from the third button\">And me!</button>\n</p>\n\n<h2>Form</h2>\n\n<form>\n  <div>\n    <label for=\"name\">Fill in your name:</label>\n    <input type=\"text\" id=\"name\" name=\"name\" />\n  </div>\n  <div>\n    <label for=\"age\">Enter your age:</label>\n    <input type=\"text\" id=\"age\" name=\"age\" />\n  </div>\n  <div>\n    <label for=\"mood\">Choose your mood:</label>\n    <select id=\"mood\" name=\"mood\">\n      <option>Happy</option>\n      <option>Sad</option>\n      <option>Angry</option>\n      <option>Worried</option>\n    </select>\n  </div>\n</form>\n```\n\nThis means using links, buttons, form elements, and labels appropriately (including the [`<label>`](/en-US/docs/Web/HTML/Reference/Elements/label) element for form controls).\n\nHowever, this is another case where people sometimes do strange things with HTML. For example, you sometimes see buttons marked up using [`<div>`](/en-US/docs/Web/HTML/Reference/Elements/div)s, for example:\n\nhtml\n\n```\n<div data-message=\"This is from the first button\">Click me!</div>\n<div data-message=\"This is from the second button\">Click me too!</div>\n<div data-message=\"This is from the third button\">And me!</div>\n```\n\nBut using such code is not advised â\u0080\u0094 you immediately lose the native keyboard accessibility you would have had if you'd just used [`<button>`](/en-US/docs/Web/HTML/Reference/Elements/button) elements, plus you don't get any of the default CSS styling that buttons get. In the rare to non-existent case when you need to use a non-button element for a button, use the [`button` role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/button_role) and implement all the default button behaviors, including keyboard and mouse button support.\n\n#### Building keyboard accessibility back in\n\nAdding such advantages back in takes a bit of work (you can see an example in our [fake-div-buttons.html](https://mdn.github.io/learning-area/tools-testing/cross-browser-testing/accessibility/fake-div-buttons.html) example â\u0080\u0094 also see the [source code](https://github.com/mdn/learning-area/blob/main/tools-testing/cross-browser-testing/accessibility/fake-div-buttons.html)). Here we've given our fake `<div>` buttons the ability to be focused (including via tab) by giving each one the attribute `tabindex=\"0\"`. We also include `role=\"button\"` so screen reader users know they can focus on and interact with the element:\n\nhtml\n\n```\n<div data-message=\"This is from the first button\" tabindex=\"0\" role=\"button\">\n  Click me!\n</div>\n<div data-message=\"This is from the second button\" tabindex=\"0\" role=\"button\">\n  Click me too!\n</div>\n<div data-message=\"This is from the third button\" tabindex=\"0\" role=\"button\">\n  And me!\n</div>\n```\n\nBasically, the [`tabindex`](/en-US/docs/Web/HTML/Reference/Global_attributes/tabindex) attribute is primarily intended to allow tabbable elements to have a custom tab order (specified in positive numerical order), instead of just being tabbed through in their default source order. This is nearly always a bad idea, as it can cause major confusion. Use it only if you really need to, for example, if the layout shows things in a very different visual order to the source code, and you want to make things work more logically. There are two other options for `tabindex`:\n\n- `tabindex=\"0\"` â\u0080\u0094 as indicated above, this value allows elements that are not normally tabbable to become tabbable. This is the most useful value of `tabindex`.\n- `tabindex=\"-1\"` â\u0080\u0094 this allows not normally tabbable elements to receive focus programmatically, e.g., via JavaScript, or as the target of links.\n\nWhile the above addition allows us to tab to the buttons, it does not allow us to activate them via the `Enter`/`Return` key. To do that, we had to add the following bit of JavaScript:\n\njs\n\n```\ndocument.onkeydown = (e) => {\n  // The Enter/Return key\n  if (e.key === \"Enter\") {\n    document.activeElement.click();\n  }\n};\n```\n\nHere we add a listener to the `document` object to detect when a button has been pressed on the keyboard. We check what button was pressed via the event object's [`key`](/en-US/docs/Web/API/KeyboardEvent/key) property; if the key pressed is `Enter`/`Return`, we run the function stored in the button's `onclick` handler using `document.activeElement.click()`. [`activeElement`](/en-US/docs/Web/API/Document/activeElement) which gives us the element that is currently focused on the page.\n\nThis is a lot of extra hassle to build the functionality back in. And there's bound to be other problems with it. **Better to just use the right element for the right job in the first place.**\n\n#### Use meaningful text labels\n\nUI control text labels are very useful to all users, but getting them right is particularly important to users with disabilities.\n\nYou should make sure that your button and link text labels are understandable and distinctive. Don't just use \"Click here\" for your labels, as screen reader users sometimes get up a list of buttons and form controls. The following screenshot shows our controls being listed by VoiceOver on Mac.\n\n![List of form input labels being listed by VoiceOver software on Mac. This list contains meaningless labels like 'happy menu button` given to various form controls like button, textfield and link](/en-US/docs/Learn_web_development/Core/Accessibility/HTML/voiceover-formcontrols.png)\n\nMake sure your labels make sense out of context, read on their own, as well as in the context of the paragraph they are in. For example, the following shows an example of good link text:\n\nhtml\n\n```\n<p>\n  Whales are really awesome creatures.\n  <a href=\"whales.html\">Find out more about whales</a>.\n</p>\n```\n\nbut this is bad link text:\n\nhtml\n\n```\n<p>\n  Whales are really awesome creatures. To find out more about whales,\n  <a href=\"whales.html\">click here</a>.\n</p>\n```\n\n**Note:**\nYou can find a lot more about link implementation and best practices in our [Creating links](/en-US/docs/Learn_web_development/Core/Structuring_content/Creating_links) article. You can also see some good and bad examples at [good-links.html](https://mdn.github.io/learning-area/accessibility/html/good-links.html) and [bad-links.html](https://mdn.github.io/learning-area/accessibility/html/bad-links.html).\n\nForm labels are also important for giving you a clue about what you need to enter into each form input. The following seems like a reasonable enough example:\n\nhtml\n\n```\nFill in your name: <input type=\"text\" id=\"name\" name=\"name\" />\n```\n\nHowever, this is not so useful for disabled users. There is nothing in the above example to associate the label unambiguously with the form input and make it clear how to fill it in if you cannot see it. If you access this with some screen readers, you may only be given a description along the lines of \"edit text.\"\n\nThe following is a much better example:\n\nhtml\n\n```\n<div>\n  <label for=\"name\">Fill in your name:</label>\n  <input type=\"text\" id=\"name\" name=\"name\" />\n</div>\n```\n\nWith code like this, the label will be clearly associated with the input; the description will be more like \"Fill in your name: edit text.\"\n\n![A good form label that reads 'Fill in your name' is given to a text input form control. ](/en-US/docs/Learn_web_development/Core/Accessibility/HTML/voiceover-good-form-label.png)\n\nAs an added bonus, in most browsers associating a label with a form input means that you can click the label to select or activate the form element. This gives the input a bigger hit area, making it easier to select.\n\n**Note:**\nYou can see some good and bad form examples in [good-form.html](https://mdn.github.io/learning-area/accessibility/html/good-form.html) and [bad-form.html](https://mdn.github.io/learning-area/accessibility/html/bad-form.html).\n\nYou can find a nice explanation of the importance of proper text labels, and how to investigate text label issues using the [Firefox Accessibility Inspector](https://firefox-source-docs.mozilla.org/devtools-user/accessibility_inspector/index.html), in the following video:\n\n## [Accessible data tables](#accessible_data_tables)\n\nA basic data table can be written with very simple markup, for example:\n\nhtml\n\n```\n<table>\n  <tr>\n    <td>Name</td>\n    <td>Age</td>\n    <td>Pronouns</td>\n  </tr>\n  <tr>\n    <td>Gabriel</td>\n    <td>13</td>\n    <td>he/him</td>\n  </tr>\n  <tr>\n    <td>Elva</td>\n    <td>8</td>\n    <td>she/her</td>\n  </tr>\n  <tr>\n    <td>Freida</td>\n    <td>5</td>\n    <td>she/her</td>\n  </tr>\n</table>\n```\n\nBut this has problems â\u0080\u0094 there is no way for a screen reader user to associate rows or columns together as groupings of data. To do this, you need to know what the header rows are and if they are heading up rows, columns, etc. This can only be done visually for the above table (see [bad-table.html](https://mdn.github.io/learning-area/accessibility/html/bad-table.html) and try the example out yourself).\n\nNow have a look at our [punk bands table example](https://github.com/mdn/learning-area/blob/main/css/styling-boxes/styling-tables/punk-bands-complete.html) â\u0080\u0094 you can see a few accessibility aids at work here:\n\n- Table headers are defined using [`<th>`](/en-US/docs/Web/HTML/Reference/Elements/th) elements â\u0080\u0094 you can also specify if they are headers for rows or columns using the `scope` attribute. This gives you complete groups of data that can be consumed by screen readers as single units.\n- The [`<caption>`](/en-US/docs/Web/HTML/Reference/Elements/caption) element and the `<table>` element's `summary` attribute both do similar jobs â\u0080\u0094 they act as alt text for a table, giving a screen reader user a useful quick summary of the table's contents. The `<caption>` element is generally preferred as it makes its content accessible to sighted users too, who might also find it useful. You don't really need both.\n\n**Note:**\nSee our [HTML table accessibility](/en-US/docs/Learn_web_development/Core/Structuring_content/Table_accessibility) article for more details about accessible data tables.\n\n## [Text alternatives](#text_alternatives)\n\nWhereas textual content is inherently accessible, the same cannot necessarily be said for multimedia content â\u0080\u0094 image and video content cannot be seen by visually-impaired people, and audio content cannot be heard by hearing-impaired people. We cover video and audio content in detail in the [Accessible multimedia](/en-US/docs/Learn_web_development/Core/Accessibility/Multimedia), but for this article we'll look at accessibility for the humble [`<img>`](/en-US/docs/Web/HTML/Reference/Elements/img) element.\n\nWe have a simple example written up, [accessible-image.html](https://mdn.github.io/learning-area/accessibility/html/accessible-image.html), which features four copies of the same image:\n\nhtml\n\n```\n<img src=\"dinosaur.png\" />\n\n<img\n  src=\"dinosaur.png\"\n  alt=\"A red Tyrannosaurus Rex: A two legged dinosaur standing upright like a human, with small arms, and a large head with lots of sharp teeth.\" />\n\n<img\n  src=\"dinosaur.png\"\n  alt=\"A red Tyrannosaurus Rex: A two legged dinosaur standing upright like a human, with small arms, and a large head with lots of sharp teeth.\"\n  title=\"The Mozilla red dinosaur\" />\n\n<img src=\"dinosaur.png\" aria-labelledby=\"dino-label\" />\n\n<p id=\"dino-label\">\n  The Mozilla red Tyrannosaurus Rex: A two legged dinosaur standing upright like\n  a human, with small arms, and a large head with lots of sharp teeth.\n</p>\n```\n\nThe first image, when viewed by a screen reader, doesn't really offer the user much help â\u0080\u0094 VoiceOver for example reads out \"/dinosaur.png, image\". It reads out the filename to try to provide some help. In this example the user will at least know it is a dinosaur of some kind, but often files may be uploaded with machine-generated file names (e.g., from a digital camera) and these file names would likely provide no context to the image's content.\n\n**Note:**\nThis is why you should never include text content inside an image â\u0080\u0094 screen readers can't access it. There are other disadvantages too â\u0080\u0094 you can't select it and copy/paste it. Just don't do it!\n\nWhen a screen reader encounters the second image, it reads out the full alt attribute â\u0080\u0094 \"A red Tyrannosaurus Rex: A two legged dinosaur standing upright like a human, with small arms, and a large head with lots of sharp teeth.\".\n\nThis highlights the importance of not only using meaningful file names in case so-called **alt text** is not available, but also making sure that alt text is provided in `alt` attributes wherever possible.\n\nNote that the contents of the `alt` attribute should always provide a direct representation of the image and what it conveys visually. The alt should be brief and concise and include all the information conveyed in the image that is not duplicated in the surrounding text.\n\nThe content of the `alt` attribute for a single image differs based on the context. For example, if the photo of Fluffy is an avatar next to a review for Yuckymeat dog food, `alt=\"Fluffy\"` is appropriate. If the photo is part of Fluffy's adoption page for the animal rescue society, information conveyed in the image that is relevant for a prospective dog parent that is not duplicated in the surrounding text should be included. A longer description, such as `alt=\"Fluffy, a tri-color terrier with very short hair, with a tennis ball in her mouth.\"` is appropriate. As the surrounding text likely has Fluffy's size and breed, that is not included in the `alt`. However, as the dog's biography likely doesn't include hair length, colors, or toy preferences, which the potential parent needs to know, it is included. Is the image outdoors, or does Fluffy have a red collar with a blue leash? Not important in terms of adopting the pet and therefore not included. All information image conveys that a sighted user can access and is relevant to the context is what needs to be conveyed; nothing more. Keep it short, precise, and useful.\n\nAny personal knowledge or extra description shouldn't be included here, as it is not useful for people who have not seen the image before. If the ball is Fluffy's favorite toy or if a sighted user can't know that from the image, then don't include it.\n\nOne thing to consider is whether your images have meaning inside your content, or whether they are purely for visual decoration, and thus have no meaning. If they are decorative, it is better to write an empty text as a value for `alt` attribute (see [Empty alt attributes](#empty_alt_attributes)) or to just include them in the page as CSS background images.\n\n**Note:**\nRead [HTML images](/en-US/docs/Learn_web_development/Core/Structuring_content/HTML_images) and [Responsive images](/en-US/docs/Web/HTML/Guides/Responsive_images) for a lot more information about image implementation and best practices.\nYou can also check [An alt Decision Tree](https://www.w3.org/WAI/tutorials/images/decision-tree/) to learn how to use an alt attribute for images in various situations.\n\nIf you do want to provide extra contextual information, you should put it in the text surrounding the image, or inside a `title` attribute, as shown above. In this case, most screen readers will read out the alt text, the title attribute, and the filename. In addition, browsers display title text as tooltips when moused over.\n\n![Screenshot of a red Tyrannosaurus Rex with the text \"The mozilla red dinosaur\" displayed as tooltip on mouseover.](/en-US/docs/Learn_web_development/Core/Accessibility/HTML/title-attribute.png)\n\nLet's have another quick look at the fourth method:\n\nhtml\n\n```\n<img src=\"dinosaur.png\" aria-labelledby=\"dino-label\" />\n\n<p id=\"dino-label\">The Mozilla red Tyrannosaurusâ\u0080¦</p>\n```\n\nIn this case, we are not using the `alt` attribute at all â\u0080\u0094 instead, we have presented our description of the image as a regular text paragraph, given it an `id`, and then used the `aria-labelledby` attribute to refer to that `id`, which causes screen readers to use that paragraph as the alt text/label for that image. This is especially useful if you want to use the same text as a label for multiple images â\u0080\u0094 something that isn't possible with `alt`.\n\n**Note:**\n[`aria-labelledby`](/en-US/docs/Web/Accessibility/ARIA/Reference/Attributes/aria-labelledby) is part of the [WAI-ARIA](https://w3c.github.io/aria/) spec, which allows developers to add in extra semantics to their markup to improve screen reader accessibility where needed.\n\n### [Figures and figure captions](#figures_and_figure_captions)\n\nHTML includes two elements â\u0080\u0094 [`<figure>`](/en-US/docs/Web/HTML/Reference/Elements/figure) and [`<figcaption>`](/en-US/docs/Web/HTML/Reference/Elements/figcaption) â\u0080\u0094 which associate a figure of some kind (it could be anything, not necessarily an image) with a figure caption:\n\nhtml\n\n```\n<figure>\n  <img\n    src=\"dinosaur.png\"\n    alt=\"The Mozilla Tyrannosaurus\"\n    aria-describedby=\"dinodescr\" />\n  <figcaption id=\"dinodescr\">\n    A red Tyrannosaurus Rex: A two legged dinosaur standing upright like a\n    human, with small arms, and a large head with lots of sharp teeth.\n  </figcaption>\n</figure>\n```\n\nWhile there is mixed screen reader support of associating figure captions with their figures, including [`aria-labelledby`](/en-US/docs/Web/Accessibility/ARIA/Reference/Attributes/aria-labelledby) or [`aria-describedby`](/en-US/docs/Web/Accessibility/ARIA/Reference/Attributes/aria-describedby) creates the association if none is present. That said, the element structure is useful for CSS styling, plus it provides a way to place a description of the image next to it in the source.\n\n### [Empty alt attributes](#empty_alt_attributes)\n\nhtml\n\n```\n<h3>\n  <img src=\"article-icon.png\" alt=\"\" />\n  Tyrannosaurus Rex: the king of the dinosaurs\n</h3>\n```\n\nThere may be times where an image is included in a page's design, but its primary purpose is for visual decoration. You'll notice in the code example above that the image's `alt` attribute is empty â\u0080\u0094 this is to make screen readers recognize the image, but not attempt to describe the image (instead they'd just say \"image\", or similar).\n\nThe reason to use an empty `alt` instead of not including it is because many screen readers announce the whole image URL if no `alt` is provided. In the above example, the image is acting as a visual decoration to the heading it's associated with. In cases like this, and in cases where an image is only decoration and has no content value, you should include an empty `alt` in your `img` elements. Another alternative is to use the aria [`role`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles) attribute [`role=\"presentation\"`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/presentation_role) as this also stops screen readers from reading out alternative text.\n\n**Note:**\nIf possible you should use CSS to display images that are only decorative.\n\n## [More on links](#more_on_links)\n\nLinks (the [`<a>`](/en-US/docs/Web/HTML/Reference/Elements/a) element with an `href` attribute), depending on how they are used, can help or harm accessibility. By default, links are accessible in appearance. They can improve accessibility by helping a user quickly navigate to different sections of a document. They can also harm accessibility if their accessible styling is removed or if JavaScript causes them to behave in unexpected ways.\n\n### [Link styling](#link_styling)\n\nBy default, links are visually different from other text in both color and [text-decoration](/en-US/docs/Web/CSS/Reference/Properties/text-decoration), with links being blue and underlined by default, purple and underlined if visited, and with a [focus-ring](/en-US/docs/Web/CSS/Reference/Selectors/:focus) when they receive keyboard focus.\n\nColor should not be used as the sole method of distinguishing links from non-linking content. Link text color, like all text, has to be significantly different from the background color ([a 4.5:1 contrast](/en-US/docs/Web/Accessibility/Guides/Understanding_WCAG/Perceivable/Color_contrast)). In addition, links should visually be significantly different from non-linking text, with a minimum contrast requirement of 3:1 between link text and surrounding text and between default, visited, and focus/active states and a 4.5:1 contrast between all those state colors and the background color.\n\n### [`onclick` events](#onclick_events)\n\nAnchor tags are often abused with the `onclick` event to create pseudo-buttons by setting **href** to `\"#\"` or `\"javascript:void(0)\"` to prevent the page from refreshing.\n\nThese values cause unexpected behavior when copying or dragging links, opening links in a new tab or window, bookmarking, and when JavaScript is still downloading, errors out, or is disabled. This also conveys incorrect semantics to assistive technologies (e.g., screen readers). In these cases, it is recommended to use a [`<button>`](/en-US/docs/Web/HTML/Reference/Elements/button) instead. In general you should only use an anchor for navigation using a proper URL.\n\n### [External links and linking to non-HTML resources](#external_links_and_linking_to_non-html_resources)\n\nLinks that open in a new tab or window via the `target=\"_blank\"` declaration and links to whose `href` value points to a file resource should include an indicator about the behavior that will occur when the link is activated.\n\nPeople experiencing low vision conditions, who are navigating with the aid of screen reading technology, or who have cognitive concerns may become confused when the new tab, window, or application is opened unexpectedly. Older versions of screen reading software may not even announce the behavior.\n\n#### Link that opens a new tab or window\n\nhtml\n\n```\n<a target=\"_blank\" href=\"https://www.wikipedia.org/\"\n  >Wikipedia (opens in a new window)</a\n>\n```\n\n#### Link to a non-HTML resource\n\nhtml\n\n```\n<a target=\"_blank\" href=\"2017-annual-report.ppt\"\n  >2017 Annual Report (PowerPoint)</a\n>\n```\n\nIf an icon is used in place of text to signify this kind of links behavior, make sure it includes an [alternate description](/en-US/docs/Web/HTML/Reference/Elements/img#alt).\n\n- [WebAIM: Links and Hypertext - Hypertext Links](https://webaim.org/techniques/hypertext/hypertext_links)\n- [MDN Understanding WCAG, Guideline 3.2 explanations](/en-US/docs/Web/Accessibility/Guides/Understanding_WCAG/Understandable#guideline_3.2_â\u0080\u0094_predictable_make_web_pages_appear_and_operate_in_predictable_ways)\n- [G200: Opening new windows and tabs from a link only when necessary | W3C Techniques for WCAG 2.0](https://www.w3.org/TR/WCAG20-TECHS/G200.html)\n- [G201: Giving users advanced warning when opening a new window | W3C Techniques for WCAG 2.0](https://www.w3.org/TR/WCAG20-TECHS/G201.html)\n\n### [Skip links](#skip_links)\n\nA skip link, also known as skipnav, is an `a` element placed as close as possible to the opening [`<body>`](/en-US/docs/Web/HTML/Reference/Elements/body) element that links to the beginning of the page's main content. This link allows people to bypass content repeated throughout multiple pages on a website, such as a website's header and primary navigation.\n\nSkip links are especially useful for people who navigate with the aid of assistive technology such as switch control, voice command, or mouth sticks/head wands, where the act of moving through repetitive links can be a laborious task.\n\n- [WebAIM: \"Skip Navigation\" Links](https://webaim.org/techniques/skipnav/)\n- [Howâ\u0080\u0093to: Use Skip Navigation links - The A11Y Project](https://www.a11yproject.com/posts/skip-nav-links/)\n- [MDN Understanding WCAG, Guideline 2.4 explanations](/en-US/docs/Web/Accessibility/Guides/Understanding_WCAG/Operable#guideline_2.4_%e2%80%94_navigable_provide_ways_to_help_users_navigate_find_content_and_determine_where_they_are)\n- [Understanding Success Criterion 2.4.1 | W3C Understanding WCAG 2.0](https://www.w3.org/TR/UNDERSTANDING-WCAG20/navigation-mechanisms-skip.html)\n\n### [Proximity](#proximity)\n\nLarge amounts of interactive contentâ\u0080\u0094including anchorsâ\u0080\u0094placed in close visual proximity to each other should have space inserted to separate them. This spacing is beneficial for people who suffer from fine motor control issues and may accidentally activate the wrong interactive content while navigating.\n\nSpacing may be created using CSS properties such as [`margin`](/en-US/docs/Web/CSS/Reference/Properties/margin).\n\n- [Hand tremors and the giant-button-problem - Axess Lab](https://axesslab.com/hand-tremors/)\n\n## [Summary](#summary)\n\nYou should now be well-versed in writing accessible HTML for most occasions. In the next article, we'll give you some tests that you can use to check how well you've understood and retained all this information.\n\n- [Previous](/en-US/docs/Learn_web_development/Core/Accessibility/Tooling)\n- [Overview: Accessibility on the web](/en-US/docs/Learn_web_development/Core/Accessibility)\n- [Next](/en-US/docs/Learn_web_development/Core/Accessibility/Test_your_skills/HTML)\n\n## Help improve MDN\n\nWas this page helpful to you?\n\nYes\n\nNo\n\n[Learn how to contribute](/en-US/docs/MDN/Community/Getting_started)\n\nThis page was last modified on Nov 4, 2025 by [MDN contributors](/en-US/docs/Learn_web_development/Core/Accessibility/HTML/contributors.txt).\n\n[View this page on GitHub](https://github.com/mdn/content/blob/main/files/en-us/learn_web_development/core/accessibility/html/index.md?plain=1 \"Folder: en-us/learn_web_development/core/accessibility/html (Opens in a new tab)\") â\u0080¢ [Report a problem with this content](https://github.com/mdn/content/issues/new?template=page-report.yml&mdn-url=https%3A%2F%2Fdeveloper.mozilla.org%2Fen-US%2Fdocs%2FLearn_web_development%2FCore%2FAccessibility%2FHTML&metadata=%3C%21--+Do+not+make+changes+below+this+line+--%3E%0A%3Cdetails%3E%0A%3Csummary%3EPage+report+details%3C%2Fsummary%3E%0A%0A*+Folder%3A+%60en-us%2Flearn_web_development%2Fcore%2Faccessibility%2Fhtml%60%0A*+MDN+URL%3A+https%3A%2F%2Fdeveloper.mozilla.org%2Fen-US%2Fdocs%2FLearn_web_development%2FCore%2FAccessibility%2FHTML%0A*+GitHub+URL%3A+https%3A%2F%2Fgithub.com%2Fmdn%2Fcontent%2Fblob%2Fmain%2Ffiles%2Fen-us%2Flearn_web_development%2Fcore%2Faccessibility%2Fhtml%2Findex.md%0A*+Last+commit%3A+https%3A%2F%2Fgithub.com%2Fmdn%2Fcontent%2Fcommit%2F4cb9d89a204a9532370693b982e8a3b274a874b1%0A*+Document+last+modified%3A+2025-11-04T01%3A20%3A56.000Z%0A%0A%3C%2Fdetails%3E \"This will take you to GitHub to file a new issue.\")",
  "tags": [
    "mdn",
    "aria",
    "reference",
    "mozilla"
  ],
  "extracted_at": "2026-02-03T14:44:15.455416+00:00",
  "content_length": 30209,
  "content_hash": "021ea69c63cdc308"
}