{
  "id": "mdn-aria__en-US_docs_Web_Accessibility_ARIA_Roles",
  "source_id": "mdn-aria",
  "source_name": "MDN ARIA Documentation",
  "category": "accessibility",
  "url": "https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA/Roles",
  "title": "WAI-ARIA Roles",
  "content": "WAI-ARIA Roles\nARIA roles provide semantic meaning to content, allowing screen readers and other tools to present and support interaction with an object in a way that is consistent with user expectations of that type of object.\nARIA\nroles can be used to describe elements that don't natively exist in HTML or exist but don't yet have full browser support.\nBy default, many semantic elements in HTML have a role; for example,\n<input type=\"radio\">\nhas the \"radio\" role. Non-semantic elements in HTML do not have a role;\n<div>\nand\n<span>\nwithout added semantics return\nnull\n. The\nrole\nattribute can provide semantics.\nARIA roles are added to HTML elements using\nrole=\"role type\"\n, where\nrole type\nis the name of a role in the ARIA specification. Some roles require the inclusion of associated ARIA states or properties; others are only valid in association with other roles.\nFor example,\n<ul role=\"tabpanel\">\nwill be announced as a 'tab panel' by screen readers. However, if the tab panel doesn't have nested tabs, the element with the tabpanel role is not in fact a tab panel and accessibility has actually been negatively impacted.\nThe\nARIA states and properties\nassociated with each role are included in the role's pages, with each attribute also having a dedicated page.\nARIA role types\nThere are 6 categories of ARIA roles:\n1. Document structure roles\nDocument Structure roles are used to provide a structural description for a section of content. Most of these roles should no longer be used as browsers now support semantic HTML elements with the same meaning. The roles without HTML equivalents, such as presentation, toolbar and tooltip roles, provide information on the document structure to assistive technologies such as screen readers as equivalent native HTML tags are not available.\ntoolbar\ntooltip\nfeed\nmath\npresentation\n/\nnone\nnote\nFor most document structure roles, semantic HTML equivalent elements are available and supported. Avoid using:\napplication\narticle\n(use\n<article>\n)\ncell\n(use\n<td>\n)\ncolumnheader\n(use\n<th scope=\"col\">\n)\ndefinition\n(use\n<dfn>\n)\ndirectory\ndocument\nfigure\n(use\n<figure>\ninstead)\ngroup\nheading\n(use\nh1\nthrough\nh6\n)\nimg\n(use\n<img>\nor\n<picture>\ninstead)\nlist\n(use either\n<ul>\nor\n<ol>\ninstead)\nlistitem\n(use\n<li>\ninstead)\nmeter\n(use\n<meter>\ninstead)\nrow\n(use the\n<tr>\nwith\n<table>\n)\nrowgroup\n(use\n<thead>\n,\n<tfoot>\nand\n<tbody>\n)\nrowheader\n(use\n<th scope=\"row\">\n)\nseparator\n(use\n<hr>\nif it doesn't have focus)\ntable\n(use\n<table>\n)\nterm\n(use\n<dfn>\n)\nThese are included for completeness, but in most cases are rarely, if ever, useful:\nassociationlist\nassociationlistitemkey\nassociationlistitemvalue\nblockquote\ncaption\ncode\ndeletion\nemphasis\ninsertion\nparagraph\nstrong\nsubscript\nsuperscript\ntime\n2. Widget roles\nWidget roles are used to define common interactive patterns. Like document structure roles, some widget roles have the same semantics as well-supported native HTML elements, and therefore should be avoided. The key difference is that widget roles typically require JavaScript for interaction, while document structure roles often do not.\nscrollbar\nsearchbox\nseparator\n(when focusable)\nslider\nspinbutton\nswitch\ntab\ntabpanel\ntreeitem\nAvoid using\nbutton\n,\ncheckbox\n,\ngridcell\n,\nlink\n,\nmenuitem\n,\nmenuitemcheckbox\n,\nmenuitemradio\n,\noption\n,\nprogressbar\n,\nradio\n, and\ntextbox\n, which we've included for completeness. For most, semantic equivalents with accessible interactivity are available and supported. See the individual role documentation for more information.\nComposite widget roles\ncombobox\nmenu\nmenubar\ntablist\ntree\ntreegrid\nAvoid using\ngrid\n,\nlistbox\n, and\nradiogroup\n, which we've included for completeness. See the individual role documentation for more information.\nNote that there is also a widget role (\nrole=\"widget\"\n), which is an abstract role and not in the widget role category.\n3. Landmark roles\nLandmark roles provide a way to identify the organization and structure of a web page. By classifying and labeling sections of a page, structural information conveyed visually through layout is represented programmatically. Screen readers use landmark roles to provide keyboard navigation to important sections of a page. Use these sparingly. Too many landmark roles create \"noise\" in screen readers, making it difficult to understand the overall layout of the page.\nbanner\n(document\n<header>\n)\ncomplementary\n(\n<aside>\n)\ncontentinfo\n(document\n<footer>\n)\nform\n(\n<form>\n)\nmain\n(\n<main>\n)\nnavigation\n(\n<nav>\n)\nregion\n(\n<section>\n)\nsearch\n(\n<search>\n)\n4. Live region roles\nLive Region roles are used to define elements with content that will be dynamically changed. Sighted users can see dynamic changes when they are visually noticeable. These roles help low vision and blind users know if content has been updated. Assistive technologies, like screen readers, can be made to announce dynamic content changes:\nalert\nlog\nmarquee\nstatus\ntimer\n5. Window roles\nWindow roles define sub-windows to the main document window, within the same window, such as pop up modal dialogs:\nalertdialog\ndialog\n6. Abstract roles\nAbstract roles are only intended for use by browsers to help organize and streamline a document. They should not be used by developers writing HTML markup. Doing so will not result in any meaningful information being conveyed to assistive technologies or to users.\nAvoid using\ncommand\n,\ncomposite\n,\ninput\n,\nlandmark\n,\nrange\n,\nroletype\n,\nsection\n,\nsectionhead\n,\nselect\n,\nstructure\n,\nwidget\n, and\nwindow\n.\nNote:\nDon't use abstract roles in your sites and applications. They are for use by browsers. They are included for reference only.\nWarning:\n\"Abstract roles are used for the ontology. Authors\nMUST NOT\nuse abstract roles in content.\" - The\nWAI-ARIA\nspecification\nRoles defined on MDN\nThe following are the reference pages covering the WAI-ARIA roles discussed on\nMDN\n.\nARIA: alert role\nThe\nalert\nrole is for important, and usually time-sensitive, information. The\nalert\nis a type of\nstatus\nprocessed as an atomic live region.\nARIA: alertdialog role\nThe\nalertdialog\nrole is to be used on modal alert dialogs that interrupt a user's workflow to communicate an important message and require a response.\nARIA: application role\nThe\napplication\nrole indicates to assistive technologies that an element\nand all of its children\nshould be treated similar to a desktop application, and no traditional HTML interpretation techniques should be used. This role should only be used to define very dynamic and desktop-like web applications. Most mobile and desktop web apps\nare not\nconsidered applications for this purpose.\nARIA: article role\nThe\narticle\nrole indicates a section of a page that could easily stand on its own on a page, in a document, or on a website. It is usually set on related content items such as comments, forum posts, newspaper articles or other items grouped together on one page.\nARIA: banner role\nThe\nbanner\nrole is for defining a global site header, which usually includes a logo, company name, search feature, and possibly the global navigation or a slogan. It is generally located at the top of the page.\nARIA: button role\nThe\nbutton\nrole is for clickable elements that trigger a response when activated by the user. Adding\nrole=\"button\"\ntells the screen reader the element is a button, but provides no button functionality. Use\nbutton\nor\ninput\nwith\ntype=\"button\"\ninstead.\nARIA: cell role\nThe\ncell\nvalue of the ARIA\nrole\nattribute identifies an element as being a cell in a tabular container that does not contain column or row header information. To be supported, the cell must be nested in an element with the role of\nrow\n.\nARIA: checkbox role\nThe\ncheckbox\nrole is for checkable interactive controls. Elements containing\nrole=\"checkbox\"\nmust also include the\naria-checked\nattribute to expose the checkbox's state to assistive technology.\nARIA: columnheader role\nThe\ncolumnheader\nvalue of the ARIA role attribute identifies an element as being a cell in a row contains header information for a column, similar to the native\nth\nelement with column scope.\nARIA: combobox role\nThe\ncombobox\nrole identifies an element as either an\ninput\nor a\nbutton\nthat controls another element, such as a\nlistbox\nor\ngrid\n, that can dynamically pop up to help the user set the value. A combobox can be either editable (allowing text input) or select-only (only allowing selection from the popup).\nARIA: command role\nThe\ncommand\nrole defines a widget that performs an action but does not receive input data.\nARIA: comment role\nThe\ncomment\nrole semantically denotes a comment/reaction to some content on the page, or to a previous comment.\nARIA: complementary role\nThe\ncomplementary\nlandmark role\nis used to designate a supporting section that relates to the main content, yet can stand alone when separated. These sections are frequently presented as sidebars or call-out boxes. If possible, use the\nHTML <aside> element\ninstead.\nARIA: composite role\nThe\ncomposite\nabstract role\nindicates a widget that may contain navigable descendants or owned children.\nARIA: contentinfo role\nThe\ncontentinfo\nrole defines a footer, containing identifying information such as copyright information, navigation links, and privacy statements, found on every document within a site. This section is commonly called a footer.\nARIA: definition role\nThe\ndefinition\nARIA role indicates the element is a definition of a term or concept.\nARIA: dialog role\nThe\ndialog\nrole is used to mark up an HTML based application dialog or window that separates content or UI from the rest of the web application or page. Dialogs are generally placed on top of the rest of the page content using an overlay. Dialogs can be either non-modal (it's still possible to interact with content outside of the dialog) or modal (only the content in the dialog can be interacted with).\nARIA: directory role\nThe\ndirectory\nrole was for a list of references to members of a group, such as a static table of contents.\nARIA: document role\nThe\ndocument\nrole is for focusable content within complex composite\nwidgets\nor\napplications\nfor which assistive technologies can switch reading context back to a reading mode.\nARIA: document structural roles\nARIA document-structure roles are used to provide a structural description for a section of content.\nARIA: feed role\nA\nfeed\nis a dynamic scrollable\nlist\nof\narticles\nin which articles are added to or removed from either end of the list as the user scrolls. A\nfeed\nenables screen readers to use the browse mode reading cursor to both read and scroll through a stream of rich content that may continue scrolling infinitely by loading more content as the user reads.\nARIA: figure role\nThe ARIA\nfigure\nrole can be used to identify a figure inside page content where appropriate semantics do not already exist. A figure is generally considered to be one or more images, code snippets, or other content that puts across information in a different way to a regular flow of text.\nARIA: form role\nThe\nform\nrole can be used to identify a group of elements on a page that provide equivalent functionality to an HTML form. The form is not exposed as a landmark region unless it has an\naccessible name\n.\nARIA: generic role\nThe\ngeneric\nrole creates a nameless container element which has no semantic meaning on its own.\nARIA: grid role\nThe grid role is for a widget that contains one or more rows of cells. The position of each cell is significant and can be focused using keyboard input.\nARIA: gridcell role\nThe\ngridcell\nrole is used to make a cell in a\ngrid\nor\ntreegrid\n. It is intended to mimic the functionality of the HTML\ntd\nelement for table-style grouping of information.\nARIA: group role\nThe\ngroup\nrole identifies a set of user interface objects that is not intended to be included in a page summary or table of contents by assistive technologies.\nARIA: heading role\nThe\nheading\nrole defines this element as a heading to a page or section, with the\naria-level\nattribute providing for more structure.\nARIA: img role\nThe ARIA\nimg\nrole can be used to identify multiple elements inside page content that should be considered as a single image. These elements could be images, code snippets, text, emojis, or other content that can be combined to deliver information in a visual manner.\nARIA: input role\nThe\ninput\nabstract role is a generic type of widget that allows user input.\nARIA: landmark role\nA landmark is an important subsection of a page. The\nlandmark\nrole is an abstract superclass for the aria role values for sections of content that are important enough that users will likely want to be able to navigate directly to them.\nARIA: link role\nA\nlink\nwidget provides an interactive reference to a resource. The target resource can be either external or local; i.e., either outside or within the current page or application.\nARIA: list role\nThe ARIA\nlist\nrole can be used to identify a list of items. It is normally used in conjunction with the\nlistitem\nrole, which is used to identify a list item contained inside the list.\nARIA: listbox role\nThe\nlistbox\nrole is used for lists from which a user may select one or more items which are static and, unlike HTML\nselect\nelements, may contain images.\nARIA: listitem role\nThe ARIA\nlistitem\nrole can be used to identify an item inside a list of items. It is normally used in conjunction with the\nlist\nrole, which is used to identify a list container.\nARIA: log role\nThe\nlog\nrole is used to identify an element that creates a\nlive region\nwhere new information is added in a meaningful order and old information may disappear.\nARIA: main role\nThe\nmain\nlandmark role is used to indicate the primary content of a document. The main content area consists of content that is directly related to or expands upon the central topic of a document, or the main function of an application.\nARIA: mark role\nThe\nmark\nrole denotes content which is marked or highlighted for reference or notation purposes, due to the content's relevance in the enclosing context.\nARIA: marquee role\nA\nmarquee\nis a type of\nlive region\ncontaining non-essential information which changes frequently.\nARIA: math role\nThe\nmath\nrole indicates that the content represents a mathematical expression.\nARIA: menu role\nThe\nmenu\nrole is a type of composite widget that offers a list of choices to the user.\nARIA: menubar role\nA\nmenubar\nis a presentation of\nmenu\nthat usually remains visible and is usually presented horizontally.\nARIA: menuitem role\nThe\nmenuitem\nrole indicates the element is an option in a set of choices contained by a\nmenu\nor\nmenubar\n.\nARIA: menuitemcheckbox role\nA\nmenuitemcheckbox\nis a\nmenuitem\nwith a checkable state whose possible values are\ntrue\n,\nfalse\n, or\nmixed\n.\nARIA: menuitemradio role\nA\nmenuitemradio\nis checkable menuitem in a set of elements with the same role, only one of which can be checked at a time.\nARIA: meter role\nThe\nmeter\nrole is used to identify an element being used as a meter.\nARIA: navigation role\nThe\nnavigation\nrole is used to identify major groups of links used for navigating through a website or page content.\nARIA: none role\nThe\nnone\nrole is a synonym for the\npresentation\nrole; they both remove an element's implicit ARIA semantics from being exposed to the accessibility tree.\nARIA: note role\nA\nnote\nrole suggests a section whose content is parenthetic or ancillary to the main content.\nARIA: option role\nThe\noption\nrole is used for selectable items in a\nlistbox\n.\nARIA: presentation role\nThe\npresentation\nrole and its synonym\nnone\nremove an element's implicit ARIA semantics from being exposed to the accessibility tree.\nARIA: progressbar role\nThe\nprogressbar\nrole defines an element that displays the progress status for tasks that take a long time.\nARIA: radio role\nThe\nradio\nrole is one of a group of checkable radio buttons, in a\nradiogroup\n, where no more than a single radio button can be checked at a time.\nARIA: radiogroup role\nThe\nradiogroup\nrole is a group of\nradio\nbuttons.\nARIA: range role\nThe\nrange\nabstract role is a generic type of structure role representing a range of values.\nARIA: region role\nThe\nregion\nrole is used to identify document areas the author deems significant. It is a generic landmark available to aid in navigation when none of the other landmark roles are appropriate.\nARIA: roletype role\nThe\nroletype\nrole, an\nabstract role\n, is the base role from which all other ARIA roles inherit.\nARIA: row role\nAn element with\nrole=\"row\"\nis a row of cells within a tabular structure. A row contains one or more cells, grid cells or column headers, and possibly a row header, within a\ngrid\n,\ntable\nor\ntreegrid\n, and optionally within a\nrowgroup\n.\nARIA: rowgroup role\nAn element with\nrole=\"rowgroup\"\nis a group of\nrows\nwithin a tabular structure. A\nrowgroup\ncontains one or more rows of\ncells\n,\ngrid cells\n,\ncolumn headers\n, or\nrow headers\nwithin a\ngrid\n,\ntable\nor\ntreegrid\n.\nARIA: rowheader role\nAn element with\nrole=\"rowheader\"\nis a\ncell\ncontaining header information for a\nrow\nwithin a tabular structure of a\ngrid\n,\ntable\nor\ntreegrid\n.\nARIA: scrollbar role\nA\nscrollbar\nis a graphical object that controls the scrolling of content within a viewing area.\nARIA: search role\nThe\nsearch\nrole is used to identify the search functionality; the section of the page used to search the page, site, or collection of sites.\nARIA: searchbox role\nThe\nsearchbox\nrole indicates an element is a type of\ntextbox\nintended for specifying search criteria.\nARIA: section role\nThe\nsection\nrole\n, an abstract role, is a superclass role for renderable structural containment components.\nARIA: sectionhead role\nThe\nsectionhead\nrole\n, an abstract role, is superclass role for labels or summaries of the topic of its related section.\nARIA: select role\nThe\nselect\nrole\n, an abstract role, is superclass role for form widgets that allows the user to make selections from a set of choices.\nARIA: separator role\nThe\nseparator\nrole indicates the element is a divider that separates and distinguishes sections of content or groups of menuitems. The implicit ARIA role of the native thematic break\nhr\nelement is\nseparator\n.\nARIA: slider role\nThe\nslider\nrole defines an input where the user selects a value from within a given range.\nARIA: spinbutton role\nThe\nspinbutton\nrole defines a type of range that expects the user to select a value from among discrete choices.\nARIA: status role\nThe\nstatus\nrole defines a\nlive region\ncontaining advisory information for the user that is not important enough to be an\nalert\n.\nARIA: structure role\nThe\nstructure\nrole is for document structural elements.\nARIA: suggestion role\nThe\nsuggestion\nrole semantically denotes a single proposed change to an editable document. This should be used on an element that wraps an element with an\ninsertion\nrole, and one with a\ndeletion\nrole.\nARIA: switch role\nThe ARIA\nswitch\nrole is functionally identical to the\ncheckbox\nrole, except that instead of representing \"checked\" and \"unchecked\" states, which are fairly generic in meaning, the\nswitch\nrole represents the states \"on\" and \"off.\"\nARIA: tab role\nThe ARIA\ntab\nrole indicates an interactive element inside a\ntablist\nthat, when activated, displays its associated\ntabpanel\n.\nARIA: table role\nThe\ntable\nvalue of the ARIA\nrole\nattribute identifies the element containing the role as having a non-interactive table structure containing data arranged in rows and columns, similar to the native\ntable\nHTML element.\nARIA: tablist role\nThe\ntablist\nrole identifies the element that serves as the container for a set of\ntabs\n. The tab content are referred to as\ntabpanel\nelements.\nARIA: tabpanel role\nThe ARIA\ntabpanel\nis a container for the resources of layered content associated with a\ntab\n.\nARIA: term role\nThe\nterm\nrole can be used for a word or phrase with an optional corresponding\ndefinition\n.\nARIA: textbox role\nThe\ntextbox\nrole is used to identify an element that allows the input of free-form text. Whenever possible, rather than using this role, use an\ninput\nelement with\ntype=\"text\"\n, for single-line input, or a\ntextarea\nelement for multi-line input.\nARIA: timer role\nThe\ntimer\nrole indicates to assistive technologies that an element is a numerical counter listing the amount of elapsed time from a starting point or the remaining time until an end point. Assistive technologies will not announce updates to a timer as it has an implicit\naria-live\nvalue of\noff\n.\nARIA: toolbar role\nThe\ntoolbar\nrole defines the containing element as a collection of commonly used function buttons or controls represented in a compact visual form.\nARIA: tooltip role\nA\ntooltip\nis a contextual text bubble that displays a description for an element that appears on pointer hover or keyboard focus.\nARIA: tree role\nA\ntree\nis a widget that allows the user to select one or more items from a hierarchically organized collection.\nARIA: treegrid role\nThe\ntreegrid\nrole identifies an element as being grid whose rows can be expanded and collapsed in the same manner as for a\ntree\n.\nARIA: treeitem role\nA\ntreeitem\nis an item in a\ntree\n.\nARIA: widget role\nThe\nwidget\nrole, an\nabstract role\n, is an interactive component of a graphical user interface (GUI).\nARIA: window role\nThe\nwindow\nrole defines a browser or app window.\nSee also\nUsing ARIA: Roles, States, and Properties\nARIA states and properties\nHelp improve MDN\nLearn how to contribute\nThis page was last modified on\nAug 14, 2025\nby\nMDN contributors\n.\nView this page on GitHub\nâ\u0080¢\nReport a problem with this content",
  "content_markdown": "# WAI-ARIA Roles\n\nARIA roles provide semantic meaning to content, allowing screen readers and other tools to present and support interaction with an object in a way that is consistent with user expectations of that type of object. ARIA roles can be used to describe elements that don't natively exist in HTML or exist but don't yet have full browser support.\n\nBy default, many semantic elements in HTML have a role; for example, `<input type=\"radio\">` has the \"radio\" role. Non-semantic elements in HTML do not have a role; `<div>` and `<span>` without added semantics return `null`. The `role` attribute can provide semantics.\n\nARIA roles are added to HTML elements using `role=\"role type\"`, where *role type* is the name of a role in the ARIA specification. Some roles require the inclusion of associated ARIA states or properties; others are only valid in association with other roles.\n\nFor example, `<ul role=\"tabpanel\">` will be announced as a 'tab panel' by screen readers. However, if the tab panel doesn't have nested tabs, the element with the tabpanel role is not in fact a tab panel and accessibility has actually been negatively impacted.\n\nThe [ARIA states and properties](/en-US/docs/Web/Accessibility/ARIA/Reference/Attributes) associated with each role are included in the role's pages, with each attribute also having a dedicated page.\n\n## [ARIA role types](#aria_role_types)\n\nThere are 6 categories of ARIA roles:\n\n### [1. Document structure roles](#1._document_structure_roles)\n\nDocument Structure roles are used to provide a structural description for a section of content. Most of these roles should no longer be used as browsers now support semantic HTML elements with the same meaning. The roles without HTML equivalents, such as presentation, toolbar and tooltip roles, provide information on the document structure to assistive technologies such as screen readers as equivalent native HTML tags are not available.\n\n- [`toolbar`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/toolbar_role)\n- [`tooltip`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/tooltip_role)\n- [`feed`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/feed_role)\n- [`math`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/math_role)\n- [`presentation`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/presentation_role) / [`none`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/none_role)\n- [`note`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/note_role)\n\nFor most document structure roles, semantic HTML equivalent elements are available and supported. Avoid using:\n\n- [`application`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/application_role)\n- [`article`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/article_role) (use [`<article>`](/en-US/docs/Web/HTML/Reference/Elements/article))\n- [`cell`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/cell_role) (use [`<td>`](/en-US/docs/Web/HTML/Reference/Elements/td))\n- [`columnheader`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/columnheader_role) (use `<th scope=\"col\">`)\n- [`definition`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/definition_role) (use [`<dfn>`](/en-US/docs/Web/HTML/Reference/Elements/dfn))\n- [`directory`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/directory_role)\n- [`document`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/document_role)\n- [`figure`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/figure_role) (use [`<figure>`](/en-US/docs/Web/HTML/Reference/Elements/figure) instead)\n- [`group`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/group_role)\n- [`heading`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/heading_role) (use [h1](/en-US/docs/Web/HTML/Reference/Elements/Heading_Elements) through [h6](/en-US/docs/Web/HTML/Reference/Elements/Heading_Elements))\n- [`img`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/img_role) (use [`<img>`](/en-US/docs/Web/HTML/Reference/Elements/img) or [`<picture>`](/en-US/docs/Web/HTML/Reference/Elements/picture) instead)\n- [`list`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/list_role) (use either [`<ul>`](/en-US/docs/Web/HTML/Reference/Elements/ul) or [`<ol>`](/en-US/docs/Web/HTML/Reference/Elements/ol) instead)\n- [`listitem`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/listitem_role) (use [`<li>`](/en-US/docs/Web/HTML/Reference/Elements/li) instead)\n- [`meter`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/meter_role) (use [`<meter>`](/en-US/docs/Web/HTML/Reference/Elements/meter) instead)\n- [`row`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/row_role) (use the [`<tr>`](/en-US/docs/Web/HTML/Reference/Elements/tr) with [`<table>`](/en-US/docs/Web/HTML/Reference/Elements/table))\n- [`rowgroup`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/rowgroup_role) (use [`<thead>`](/en-US/docs/Web/HTML/Reference/Elements/thead), [`<tfoot>`](/en-US/docs/Web/HTML/Reference/Elements/tfoot) and [`<tbody>`](/en-US/docs/Web/HTML/Reference/Elements/tbody))\n- [`rowheader`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/rowheader_role) (use `<th scope=\"row\">`)\n- [`separator`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/separator_role) (use [`<hr>`](/en-US/docs/Web/HTML/Reference/Elements/hr) if it doesn't have focus)\n- [`table`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/table_role) (use [`<table>`](/en-US/docs/Web/HTML/Reference/Elements/table))\n- [`term`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/term_role) (use [`<dfn>`](/en-US/docs/Web/HTML/Reference/Elements/dfn))\n\nThese are included for completeness, but in most cases are rarely, if ever, useful:\n\n- [`associationlist`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`associationlistitemkey`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`associationlistitemvalue`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`blockquote`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`caption`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`code`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`deletion`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`emphasis`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`insertion`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`paragraph`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`strong`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`subscript`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`superscript`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n- [`time`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n\n### [2. Widget roles](#2._widget_roles)\n\nWidget roles are used to define common interactive patterns. Like document structure roles, some widget roles have the same semantics as well-supported native HTML elements, and therefore should be avoided. The key difference is that widget roles typically require JavaScript for interaction, while document structure roles often do not.\n\n- [`scrollbar`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/scrollbar_role)\n- [`searchbox`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/searchbox_role)\n- [`separator`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/separator_role) (when focusable)\n- [`slider`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/slider_role)\n- [`spinbutton`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/spinbutton_role)\n- [`switch`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/switch_role)\n- [`tab`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/tab_role)\n- [`tabpanel`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/tabpanel_role)\n- [`treeitem`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/treeitem_role)\n\nAvoid using [`button`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/button_role), [`checkbox`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/checkbox_role), [`gridcell`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/gridcell_role), [`link`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/link_role), [`menuitem`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/menuitem_role), [`menuitemcheckbox`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/menuitemcheckbox_role), [`menuitemradio`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/menuitemradio_role), [`option`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/option_role), [`progressbar`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/progressbar_role), [`radio`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/radio_role), and [`textbox`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/textbox_role), which we've included for completeness. For most, semantic equivalents with accessible interactivity are available and supported. See the individual role documentation for more information.\n\n#### Composite widget roles\n\n- [`combobox`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/combobox_role)\n- [`menu`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/menu_role)\n- [`menubar`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/menubar_role)\n- [`tablist`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/tablist_role)\n- [`tree`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/tree_role)\n- [`treegrid`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/treegrid_role)\n\nAvoid using [`grid`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/grid_role), [`listbox`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/listbox_role), and [`radiogroup`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/radio_role), which we've included for completeness. See the individual role documentation for more information.\n\nNote that there is also a widget role (`role=\"widget\"`), which is an abstract role and not in the widget role category.\n\n### [3. Landmark roles](#3._landmark_roles)\n\nLandmark roles provide a way to identify the organization and structure of a web page. By classifying and labeling sections of a page, structural information conveyed visually through layout is represented programmatically. Screen readers use landmark roles to provide keyboard navigation to important sections of a page. Use these sparingly. Too many landmark roles create \"noise\" in screen readers, making it difficult to understand the overall layout of the page.\n\n- [`banner`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/banner_role) (document [`<header>`](/en-US/docs/Web/HTML/Reference/Elements/header))\n- [`complementary`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/complementary_role) ([`<aside>`](/en-US/docs/Web/HTML/Reference/Elements/aside))\n- [`contentinfo`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/contentinfo_role) (document [`<footer>`](/en-US/docs/Web/HTML/Reference/Elements/footer))\n- [`form`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/form_role) ([`<form>`](/en-US/docs/Web/HTML/Reference/Elements/form))\n- [`main`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/main_role) ([`<main>`](/en-US/docs/Web/HTML/Reference/Elements/main))\n- [`navigation`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/navigation_role) ([`<nav>`](/en-US/docs/Web/HTML/Reference/Elements/nav))\n- [`region`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/region_role) ([`<section>`](/en-US/docs/Web/HTML/Reference/Elements/section))\n- [`search`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/search_role) ([`<search>`](/en-US/docs/Web/HTML/Reference/Elements/search))\n\n### [4. Live region roles](#4._live_region_roles)\n\nLive Region roles are used to define elements with content that will be dynamically changed. Sighted users can see dynamic changes when they are visually noticeable. These roles help low vision and blind users know if content has been updated. Assistive technologies, like screen readers, can be made to announce dynamic content changes:\n\n- [`alert`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/alert_role)\n- [`log`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/log_role)\n- [`marquee`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/marquee_role)\n- [`status`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/status_role)\n- [`timer`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/timer_role)\n\n### [5. Window roles](#5._window_roles)\n\nWindow roles define sub-windows to the main document window, within the same window, such as pop up modal dialogs:\n\n- [`alertdialog`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/alertdialog_role)\n- [`dialog`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/dialog_role)\n\n### [6. Abstract roles](#6._abstract_roles)\n\nAbstract roles are only intended for use by browsers to help organize and streamline a document. They should not be used by developers writing HTML markup. Doing so will not result in any meaningful information being conveyed to assistive technologies or to users.\n\nAvoid using [`command`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/command_role), [`composite`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/composite_role), [`input`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/input_role), [`landmark`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/landmark_role), [`range`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/range_role), [`roletype`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/roletype_role), [`section`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/section_role), [`sectionhead`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/sectionhead_role), [`select`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/select_role), [`structure`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structure_role), [`widget`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/widget_role), and [`window`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/window_role).\n\n**Note:**\nDon't use abstract roles in your sites and applications. They are for use by browsers. They are included for reference only.\n\n**Warning:**\n\"Abstract roles are used for the ontology. Authors **MUST NOT** use abstract roles in content.\" - The WAI-ARIA specification\n\n## [Roles defined on MDN](#roles_defined_on_mdn)\n\nThe following are the reference pages covering the WAI-ARIA roles discussed on MDN.\n\n[ARIA: alert role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/alert_role)\n:   The `alert` role is for important, and usually time-sensitive, information. The `alert` is a type of [`status`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/status_role) processed as an atomic live region.\n\n[ARIA: alertdialog role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/alertdialog_role)\n:   The **alertdialog** role is to be used on modal alert dialogs that interrupt a user's workflow to communicate an important message and require a response.\n\n[ARIA: application role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/application_role)\n:   The `application` role indicates to assistive technologies that an element *and all of its children* should be treated similar to a desktop application, and no traditional HTML interpretation techniques should be used. This role should only be used to define very dynamic and desktop-like web applications. Most mobile and desktop web apps *are not* considered applications for this purpose.\n\n[ARIA: article role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/article_role)\n:   The `article` role indicates a section of a page that could easily stand on its own on a page, in a document, or on a website. It is usually set on related content items such as comments, forum posts, newspaper articles or other items grouped together on one page.\n\n[ARIA: banner role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/banner_role)\n:   The `banner` role is for defining a global site header, which usually includes a logo, company name, search feature, and possibly the global navigation or a slogan. It is generally located at the top of the page.\n\n[ARIA: button role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/button_role)\n:   The `button` role is for clickable elements that trigger a response when activated by the user. Adding `role=\"button\"` tells the screen reader the element is a button, but provides no button functionality. Use `button` or `input` with `type=\"button\"` instead.\n\n[ARIA: cell role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/cell_role)\n:   The `cell` value of the ARIA *role* attribute identifies an element as being a cell in a tabular container that does not contain column or row header information. To be supported, the cell must be nested in an element with the role of `row`.\n\n[ARIA: checkbox role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/checkbox_role)\n:   The `checkbox` role is for checkable interactive controls. Elements containing `role=\"checkbox\"` must also include the [`aria-checked`](/en-US/docs/Web/Accessibility/ARIA/Reference/Attributes/aria-checked) attribute to expose the checkbox's state to assistive technology.\n\n[ARIA: columnheader role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/columnheader_role)\n:   The `columnheader` value of the ARIA role attribute identifies an element as being a cell in a row contains header information for a column, similar to the native `th` element with column scope.\n\n[ARIA: combobox role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/combobox_role)\n:   The `combobox` role identifies an element as either an `input` or a `button` that controls another element, such as a `listbox` or `grid`, that can dynamically pop up to help the user set the value. A combobox can be either editable (allowing text input) or select-only (only allowing selection from the popup).\n\n[ARIA: command role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/command_role)\n:   The `command` role defines a widget that performs an action but does not receive input data.\n\n[ARIA: comment role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/comment_role)\n:   The `comment` role semantically denotes a comment/reaction to some content on the page, or to a previous comment.\n\n[ARIA: complementary role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/complementary_role)\n:   The `complementary` [landmark role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles#3._landmark_roles) is used to designate a supporting section that relates to the main content, yet can stand alone when separated. These sections are frequently presented as sidebars or call-out boxes. If possible, use the [HTML <aside> element](/en-US/docs/Web/HTML/Reference/Elements/aside) instead.\n\n[ARIA: composite role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/composite_role)\n:   The `composite` [abstract role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles#6._abstract_roles) indicates a widget that may contain navigable descendants or owned children.\n\n[ARIA: contentinfo role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/contentinfo_role)\n:   The `contentinfo` role defines a footer, containing identifying information such as copyright information, navigation links, and privacy statements, found on every document within a site. This section is commonly called a footer.\n\n[ARIA: definition role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/definition_role)\n:   The `definition` ARIA role indicates the element is a definition of a term or concept.\n\n[ARIA: dialog role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/dialog_role)\n:   The `dialog` role is used to mark up an HTML based application dialog or window that separates content or UI from the rest of the web application or page. Dialogs are generally placed on top of the rest of the page content using an overlay. Dialogs can be either non-modal (it's still possible to interact with content outside of the dialog) or modal (only the content in the dialog can be interacted with).\n\n[ARIA: directory role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/directory_role)\n:   The `directory` role was for a list of references to members of a group, such as a static table of contents.\n\n[ARIA: document role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/document_role)\n:   The `document` role is for focusable content within complex composite [widgets](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/widget_role) or [applications](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/application_role) for which assistive technologies can switch reading context back to a reading mode.\n\n[ARIA: document structural roles](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structural_roles)\n:   ARIA document-structure roles are used to provide a structural description for a section of content.\n\n[ARIA: feed role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/feed_role)\n:   A `feed` is a dynamic scrollable `list` of `articles` in which articles are added to or removed from either end of the list as the user scrolls. A `feed` enables screen readers to use the browse mode reading cursor to both read and scroll through a stream of rich content that may continue scrolling infinitely by loading more content as the user reads.\n\n[ARIA: figure role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/figure_role)\n:   The ARIA `figure` role can be used to identify a figure inside page content where appropriate semantics do not already exist. A figure is generally considered to be one or more images, code snippets, or other content that puts across information in a different way to a regular flow of text.\n\n[ARIA: form role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/form_role)\n:   The `form` role can be used to identify a group of elements on a page that provide equivalent functionality to an HTML form. The form is not exposed as a landmark region unless it has an [accessible name](/en-US/docs/Glossary/Accessible_name).\n\n[ARIA: generic role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/generic_role)\n:   The `generic` role creates a nameless container element which has no semantic meaning on its own.\n\n[ARIA: grid role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/grid_role)\n:   The grid role is for a widget that contains one or more rows of cells. The position of each cell is significant and can be focused using keyboard input.\n\n[ARIA: gridcell role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/gridcell_role)\n:   The `gridcell` role is used to make a cell in a [grid](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/grid_role) or [treegrid](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/treegrid_role). It is intended to mimic the functionality of the HTML `td` element for table-style grouping of information.\n\n[ARIA: group role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/group_role)\n:   The `group` role identifies a set of user interface objects that is not intended to be included in a page summary or table of contents by assistive technologies.\n\n[ARIA: heading role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/heading_role)\n:   The `heading` role defines this element as a heading to a page or section, with the [`aria-level`](/en-US/docs/Web/Accessibility/ARIA/Reference/Attributes/aria-level) attribute providing for more structure.\n\n[ARIA: img role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/img_role)\n:   The ARIA `img` role can be used to identify multiple elements inside page content that should be considered as a single image. These elements could be images, code snippets, text, emojis, or other content that can be combined to deliver information in a visual manner.\n\n[ARIA: input role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/input_role)\n:   The `input` abstract role is a generic type of widget that allows user input.\n\n[ARIA: landmark role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/landmark_role)\n:   A landmark is an important subsection of a page. The `landmark` role is an abstract superclass for the aria role values for sections of content that are important enough that users will likely want to be able to navigate directly to them.\n\n[ARIA: link role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/link_role)\n:   A `link` widget provides an interactive reference to a resource. The target resource can be either external or local; i.e., either outside or within the current page or application.\n\n[ARIA: list role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/list_role)\n:   The ARIA `list` role can be used to identify a list of items. It is normally used in conjunction with the `listitem` role, which is used to identify a list item contained inside the list.\n\n[ARIA: listbox role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/listbox_role)\n:   The `listbox` role is used for lists from which a user may select one or more items which are static and, unlike HTML `select` elements, may contain images.\n\n[ARIA: listitem role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/listitem_role)\n:   The ARIA `listitem` role can be used to identify an item inside a list of items. It is normally used in conjunction with the [`list`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/list_role) role, which is used to identify a list container.\n\n[ARIA: log role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/log_role)\n:   The `log` role is used to identify an element that creates a [live region](/en-US/docs/Web/Accessibility/ARIA/Guides/Live_regions) where new information is added in a meaningful order and old information may disappear.\n\n[ARIA: main role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/main_role)\n:   The `main` landmark role is used to indicate the primary content of a document. The main content area consists of content that is directly related to or expands upon the central topic of a document, or the main function of an application.\n\n[ARIA: mark role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/mark_role)\n:   The `mark` role denotes content which is marked or highlighted for reference or notation purposes, due to the content's relevance in the enclosing context.\n\n[ARIA: marquee role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/marquee_role)\n:   A `marquee` is a type of [live region](/en-US/docs/Web/Accessibility/ARIA/Guides/Live_regions) containing non-essential information which changes frequently.\n\n[ARIA: math role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/math_role)\n:   The `math` role indicates that the content represents a mathematical expression.\n\n[ARIA: menu role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/menu_role)\n:   The `menu` role is a type of composite widget that offers a list of choices to the user.\n\n[ARIA: menubar role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/menubar_role)\n:   A `menubar` is a presentation of `menu` that usually remains visible and is usually presented horizontally.\n\n[ARIA: menuitem role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/menuitem_role)\n:   The `menuitem` role indicates the element is an option in a set of choices contained by a `menu` or `menubar`.\n\n[ARIA: menuitemcheckbox role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/menuitemcheckbox_role)\n:   A `menuitemcheckbox` is a `menuitem` with a checkable state whose possible values are `true`, `false`, or `mixed`.\n\n[ARIA: menuitemradio role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/menuitemradio_role)\n:   A `menuitemradio` is checkable menuitem in a set of elements with the same role, only one of which can be checked at a time.\n\n[ARIA: meter role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/meter_role)\n:   The `meter` role is used to identify an element being used as a meter.\n\n[ARIA: navigation role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/navigation_role)\n:   The `navigation` role is used to identify major groups of links used for navigating through a website or page content.\n\n[ARIA: none role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/none_role)\n:   The `none` role is a synonym for the [`presentation`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/presentation_role) role; they both remove an element's implicit ARIA semantics from being exposed to the accessibility tree.\n\n[ARIA: note role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/note_role)\n:   A `note` role suggests a section whose content is parenthetic or ancillary to the main content.\n\n[ARIA: option role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/option_role)\n:   The `option` role is used for selectable items in a `listbox`.\n\n[ARIA: presentation role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/presentation_role)\n:   The `presentation` role and its synonym `none` remove an element's implicit ARIA semantics from being exposed to the accessibility tree.\n\n[ARIA: progressbar role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/progressbar_role)\n:   The `progressbar` role defines an element that displays the progress status for tasks that take a long time.\n\n[ARIA: radio role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/radio_role)\n:   The `radio` role is one of a group of checkable radio buttons, in a `radiogroup`, where no more than a single radio button can be checked at a time.\n\n[ARIA: radiogroup role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/radiogroup_role)\n:   The `radiogroup` role is a group of `radio` buttons.\n\n[ARIA: range role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/range_role)\n:   The `range` abstract role is a generic type of structure role representing a range of values.\n\n[ARIA: region role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/region_role)\n:   The **`region`** role is used to identify document areas the author deems significant. It is a generic landmark available to aid in navigation when none of the other landmark roles are appropriate.\n\n[ARIA: roletype role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/roletype_role)\n:   The **`roletype`** role, an [abstract role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles#6._abstract_roles), is the base role from which all other ARIA roles inherit.\n\n[ARIA: row role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/row_role)\n:   An element with `role=\"row\"` is a row of cells within a tabular structure. A row contains one or more cells, grid cells or column headers, and possibly a row header, within a [`grid`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/grid_role), [`table`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/table_role) or [`treegrid`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/treegrid_role), and optionally within a [`rowgroup`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/rowgroup_role).\n\n[ARIA: rowgroup role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/rowgroup_role)\n:   An element with `role=\"rowgroup\"` is a group of [rows](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/row_role) within a tabular structure. A `rowgroup` contains one or more rows of [cells](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/cell_role), [grid cells](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/gridcell_role), [column headers](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/columnheader_role), or [row headers](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/rowheader_role) within a [`grid`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/grid_role), [`table`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/table_role) or [`treegrid`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/treegrid_role).\n\n[ARIA: rowheader role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/rowheader_role)\n:   An element with `role=\"rowheader\"` is a [cell](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/cell_role) containing header information for a [row](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/row_role) within a tabular structure of a [`grid`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/grid_role), [`table`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/table_role) or [`treegrid`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/treegrid_role).\n\n[ARIA: scrollbar role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/scrollbar_role)\n:   A `scrollbar` is a graphical object that controls the scrolling of content within a viewing area.\n\n[ARIA: search role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/search_role)\n:   The `search` role is used to identify the search functionality; the section of the page used to search the page, site, or collection of sites.\n\n[ARIA: searchbox role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/searchbox_role)\n:   The `searchbox` role indicates an element is a type of `textbox` intended for specifying search criteria.\n\n[ARIA: section role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/section_role)\n:   The **`section` role**, an abstract role, is a superclass role for renderable structural containment components.\n\n[ARIA: sectionhead role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/sectionhead_role)\n:   The **`sectionhead` role**, an abstract role, is superclass role for labels or summaries of the topic of its related section.\n\n[ARIA: select role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/select_role)\n:   The **`select` role**, an abstract role, is superclass role for form widgets that allows the user to make selections from a set of choices.\n\n[ARIA: separator role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/separator_role)\n:   The `separator` role indicates the element is a divider that separates and distinguishes sections of content or groups of menuitems. The implicit ARIA role of the native thematic break `hr` element is `separator`.\n\n[ARIA: slider role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/slider_role)\n:   The `slider` role defines an input where the user selects a value from within a given range.\n\n[ARIA: spinbutton role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/spinbutton_role)\n:   The `spinbutton` role defines a type of range that expects the user to select a value from among discrete choices.\n\n[ARIA: status role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/status_role)\n:   The `status` role defines a [live region](/en-US/docs/Web/Accessibility/ARIA/Guides/Live_regions) containing advisory information for the user that is not important enough to be an [`alert`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/alert_role).\n\n[ARIA: structure role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/structure_role)\n:   The `structure` role is for document structural elements.\n\n[ARIA: suggestion role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/suggestion_role)\n:   The `suggestion` role semantically denotes a single proposed change to an editable document. This should be used on an element that wraps an element with an `insertion` role, and one with a `deletion` role.\n\n[ARIA: switch role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/switch_role)\n:   The ARIA **`switch`** role is functionally identical to the [checkbox](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/checkbox_role) role, except that instead of representing \"checked\" and \"unchecked\" states, which are fairly generic in meaning, the `switch` role represents the states \"on\" and \"off.\"\n\n[ARIA: tab role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/tab_role)\n:   The ARIA `tab` role indicates an interactive element inside a `tablist` that, when activated, displays its associated `tabpanel`.\n\n[ARIA: table role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/table_role)\n:   The `table` value of the ARIA `role` attribute identifies the element containing the role as having a non-interactive table structure containing data arranged in rows and columns, similar to the native `table` HTML element.\n\n[ARIA: tablist role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/tablist_role)\n:   The `tablist` role identifies the element that serves as the container for a set of `tabs`. The tab content are referred to as `tabpanel` elements.\n\n[ARIA: tabpanel role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/tabpanel_role)\n:   The ARIA `tabpanel` is a container for the resources of layered content associated with a `tab`.\n\n[ARIA: term role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/term_role)\n:   The `term` role can be used for a word or phrase with an optional corresponding [`definition`](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/definition_role).\n\n[ARIA: textbox role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/textbox_role)\n:   The `textbox` role is used to identify an element that allows the input of free-form text. Whenever possible, rather than using this role, use an `input` element with [type=\"text\"](/en-US/docs/Web/HTML/Reference/Elements/input/text), for single-line input, or a `textarea` element for multi-line input.\n\n[ARIA: timer role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/timer_role)\n:   The **`timer`** role indicates to assistive technologies that an element is a numerical counter listing the amount of elapsed time from a starting point or the remaining time until an end point. Assistive technologies will not announce updates to a timer as it has an implicit [`aria-live`](/en-US/docs/Web/Accessibility/ARIA/Reference/Attributes/aria-live) value of `off`.\n\n[ARIA: toolbar role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/toolbar_role)\n:   The `toolbar` role defines the containing element as a collection of commonly used function buttons or controls represented in a compact visual form.\n\n[ARIA: tooltip role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/tooltip_role)\n:   A `tooltip` is a contextual text bubble that displays a description for an element that appears on pointer hover or keyboard focus.\n\n[ARIA: tree role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/tree_role)\n:   A `tree` is a widget that allows the user to select one or more items from a hierarchically organized collection.\n\n[ARIA: treegrid role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/treegrid_role)\n:   The `treegrid` role identifies an element as being grid whose rows can be expanded and collapsed in the same manner as for a `tree`.\n\n[ARIA: treeitem role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/treeitem_role)\n:   A `treeitem` is an item in a `tree`.\n\n[ARIA: widget role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/widget_role)\n:   The **`widget`** role, an [abstract role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles#6._abstract_roles), is an interactive component of a graphical user interface (GUI).\n\n[ARIA: window role](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/window_role)\n:   The `window` role defines a browser or app window.\n\n## [See also](#see_also)\n\n- [Using ARIA: Roles, States, and Properties](/en-US/docs/Web/Accessibility/ARIA/Guides/Techniques)\n- [ARIA states and properties](/en-US/docs/Web/Accessibility/ARIA/Reference/Attributes)\n\n## Help improve MDN\n\nWas this page helpful to you?\n\nYes\n\nNo\n\n[Learn how to contribute](/en-US/docs/MDN/Community/Getting_started)\n\nThis page was last modified on Aug 14, 2025 by [MDN contributors](/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/contributors.txt).\n\n[View this page on GitHub](https://github.com/mdn/content/blob/main/files/en-us/web/accessibility/aria/reference/roles/index.md?plain=1 \"Folder: en-us/web/accessibility/aria/reference/roles (Opens in a new tab)\") â\u0080¢ [Report a problem with this content](https://github.com/mdn/content/issues/new?template=page-report.yml&mdn-url=https%3A%2F%2Fdeveloper.mozilla.org%2Fen-US%2Fdocs%2FWeb%2FAccessibility%2FARIA%2FReference%2FRoles&metadata=%3C%21--+Do+not+make+changes+below+this+line+--%3E%0A%3Cdetails%3E%0A%3Csummary%3EPage+report+details%3C%2Fsummary%3E%0A%0A*+Folder%3A+%60en-us%2Fweb%2Faccessibility%2Faria%2Freference%2Froles%60%0A*+MDN+URL%3A+https%3A%2F%2Fdeveloper.mozilla.org%2Fen-US%2Fdocs%2FWeb%2FAccessibility%2FARIA%2FReference%2FRoles%0A*+GitHub+URL%3A+https%3A%2F%2Fgithub.com%2Fmdn%2Fcontent%2Fblob%2Fmain%2Ffiles%2Fen-us%2Fweb%2Faccessibility%2Faria%2Freference%2Froles%2Findex.md%0A*+Last+commit%3A+https%3A%2F%2Fgithub.com%2Fmdn%2Fcontent%2Fcommit%2F4a39dedf2c57c6947339a63a8de0e18a7abe8e2c%0A*+Document+last+modified%3A+2025-08-14T02%3A34%3A04.000Z%0A%0A%3C%2Fdetails%3E \"This will take you to GitHub to file a new issue.\")",
  "tags": [
    "mdn",
    "aria",
    "reference",
    "mozilla"
  ],
  "extracted_at": "2026-02-03T12:33:30.394847+00:00",
  "content_length": 21380,
  "content_hash": "6e1aa3d6756f5bec"
}